; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/color/interface/matcoloring.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/color/interface/matcoloring.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._n_PetscFunctionList = type opaque
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!339 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!340 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!341 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!342 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!343 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!344 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!345 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!346 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!347 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!348 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!349 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!350 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!351 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!352 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!353 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!354 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!355 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!356 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!357 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!358 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!359 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!360 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!361 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!362 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!363 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!364 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!365 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!366 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!367 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!368 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!369 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!370 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!371 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!372 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!373 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!374 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!375 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!376 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 327, baseType: !7, size: 32, elements: !377)
!377 = !{!378, !379, !380}
!378 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!379 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!380 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!381 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !382, line: 624, baseType: !7, size: 32, elements: !383)
!382 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!383 = !{!384, !385, !386, !387}
!384 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!385 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!386 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!387 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!388 = !{!389, !392, !393, !398, !401, !564, !598, !599, !600, !601, !602, !480, !74}
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !382, line: 330, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !382, line: 330, flags: DIFlagFwdDecl)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !394, line: 1451, baseType: !395)
!394 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{null}
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !400)
!400 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !404, line: 73, size: 4480, elements: !405)
!404 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!405 = !{!406, !408, !451, !452, !454, !457, !458, !459, !460, !468, !469, !471, !475, !479, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !492, !493, !494, !496, !497, !499, !501, !502, !503, !504, !505, !508, !510, !511, !512, !513, !514, !517, !519, !520, !521, !531, !533, !534, !538, !539, !588, !593, !595, !596, !597}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !403, file: !404, line: 74, baseType: !407, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !74)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !403, file: !404, line: 75, baseType: !409, size: 448, offset: 64)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 448, elements: !449)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !404, line: 53, baseType: !411)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !404, line: 45, size: 448, elements: !412)
!412 = !{!413, !419, !427, !432, !436, !440, !444}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !411, file: !404, line: 46, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!417, !401, !418}
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !74)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !411, file: !404, line: 47, baseType: !420, size: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!417, !401, !423}
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !424, line: 16, baseType: !425)
!424 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !424, line: 16, flags: DIFlagFwdDecl)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !411, file: !404, line: 48, baseType: !428, size: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!417, !431}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !411, file: !404, line: 49, baseType: !433, size: 64, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!417, !401, !398, !401}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !411, file: !404, line: 50, baseType: !437, size: 64, offset: 256)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!417, !401, !398, !431}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !411, file: !404, line: 51, baseType: !441, size: 64, offset: 320)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!417, !401, !398, !395}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !411, file: !404, line: 52, baseType: !445, size: 64, offset: 384)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!417, !401, !398, !448}
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!449 = !{!450}
!450 = !DISubrange(count: 1)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !403, file: !404, line: 76, baseType: !389, size: 64, offset: 512)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !403, file: !404, line: 77, baseType: !453, size: 32, offset: 576)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !74)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !403, file: !404, line: 78, baseType: !455, size: 64, offset: 640)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !456)
!456 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !403, file: !404, line: 78, baseType: !455, size: 64, offset: 704)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !403, file: !404, line: 78, baseType: !455, size: 64, offset: 768)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !403, file: !404, line: 78, baseType: !455, size: 64, offset: 832)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !403, file: !404, line: 79, baseType: !461, size: 64, offset: 896)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !462)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !464, line: 27, baseType: !465)
!464 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !466, line: 43, baseType: !467)
!466 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!467 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !403, file: !404, line: 80, baseType: !453, size: 32, offset: 960)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !403, file: !404, line: 81, baseType: !470, size: 32, offset: 992)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !74)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !403, file: !404, line: 82, baseType: !472, size: 64, offset: 1024)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !473)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !403, file: !404, line: 83, baseType: !476, size: 64, offset: 1088)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !477)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !403, file: !404, line: 84, baseType: !480, size: 64, offset: 1152)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !403, file: !404, line: 85, baseType: !480, size: 64, offset: 1216)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !403, file: !404, line: 86, baseType: !480, size: 64, offset: 1280)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !403, file: !404, line: 87, baseType: !480, size: 64, offset: 1344)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !403, file: !404, line: 88, baseType: !401, size: 64, offset: 1408)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !403, file: !404, line: 89, baseType: !461, size: 64, offset: 1472)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !403, file: !404, line: 90, baseType: !480, size: 64, offset: 1536)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !403, file: !404, line: 91, baseType: !480, size: 64, offset: 1600)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !403, file: !404, line: 92, baseType: !453, size: 32, offset: 1664)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !403, file: !404, line: 93, baseType: !392, size: 64, offset: 1728)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !403, file: !404, line: 94, baseType: !491, size: 64, offset: 1792)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !462)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !403, file: !404, line: 95, baseType: !453, size: 32, offset: 1856)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !403, file: !404, line: 95, baseType: !453, size: 32, offset: 1888)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !403, file: !404, line: 96, baseType: !495, size: 64, offset: 1920)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !403, file: !404, line: 96, baseType: !495, size: 64, offset: 1984)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !403, file: !404, line: 97, baseType: !498, size: 64, offset: 2048)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !403, file: !404, line: 97, baseType: !500, size: 64, offset: 2112)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !403, file: !404, line: 98, baseType: !453, size: 32, offset: 2176)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !403, file: !404, line: 98, baseType: !453, size: 32, offset: 2208)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !403, file: !404, line: 99, baseType: !495, size: 64, offset: 2240)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !403, file: !404, line: 99, baseType: !495, size: 64, offset: 2304)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !403, file: !404, line: 100, baseType: !506, size: 64, offset: 2368)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !456)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !403, file: !404, line: 100, baseType: !509, size: 64, offset: 2432)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !403, file: !404, line: 101, baseType: !453, size: 32, offset: 2496)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !403, file: !404, line: 101, baseType: !453, size: 32, offset: 2528)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !403, file: !404, line: 102, baseType: !495, size: 64, offset: 2560)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !403, file: !404, line: 102, baseType: !495, size: 64, offset: 2624)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !403, file: !404, line: 103, baseType: !515, size: 64, offset: 2688)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !507)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !403, file: !404, line: 103, baseType: !518, size: 64, offset: 2752)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !403, file: !404, line: 104, baseType: !448, size: 64, offset: 2816)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !403, file: !404, line: 105, baseType: !453, size: 32, offset: 2880)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !403, file: !404, line: 106, baseType: !522, size: 128, offset: 2944)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !523, size: 128, elements: !529)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !404, line: 64, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !404, line: 61, size: 128, elements: !526)
!526 = !{!527, !528}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !525, file: !404, line: 62, baseType: !395, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !525, file: !404, line: 63, baseType: !392, size: 64, offset: 64)
!529 = !{!530}
!530 = !DISubrange(count: 2)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !403, file: !404, line: 107, baseType: !532, size: 64, offset: 3072)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !453, size: 64, elements: !529)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !403, file: !404, line: 108, baseType: !392, size: 64, offset: 3136)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !403, file: !404, line: 109, baseType: !535, size: 64, offset: 3200)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!417, !392}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !403, file: !404, line: 111, baseType: !453, size: 32, offset: 3264)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !403, file: !404, line: 112, baseType: !540, size: 320, offset: 3328)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !541, size: 320, elements: !586)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!417, !544, !401, !392}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !547)
!547 = !{!548, !549, !574, !575, !576, !577, !578, !579, !580, !581, !582}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !546, file: !12, line: 100, baseType: !453, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !546, file: !12, line: 101, baseType: !550, size: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !551)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !553)
!553 = !{!554, !555, !556, !557, !558, !561, !562, !563, !567, !569, !571, !572, !573}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !552, file: !12, line: 84, baseType: !480, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !552, file: !12, line: 85, baseType: !480, size: 64, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !552, file: !12, line: 86, baseType: !392, size: 64, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !552, file: !12, line: 87, baseType: !472, size: 64, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !552, file: !12, line: 88, baseType: !559, size: 64, offset: 256)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !398)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !552, file: !12, line: 89, baseType: !400, size: 8, offset: 320)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !552, file: !12, line: 90, baseType: !480, size: 64, offset: 384)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !552, file: !12, line: 91, baseType: !564, size: 64, offset: 448)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !565, line: 46, baseType: !566)
!565 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!566 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !552, file: !12, line: 92, baseType: !568, size: 32, offset: 512)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !552, file: !12, line: 93, baseType: !570, size: 32, offset: 544)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !552, file: !12, line: 94, baseType: !550, size: 64, offset: 576)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !552, file: !12, line: 95, baseType: !480, size: 64, offset: 640)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !552, file: !12, line: 96, baseType: !392, size: 64, offset: 704)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !546, file: !12, line: 102, baseType: !480, size: 64, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !546, file: !12, line: 102, baseType: !480, size: 64, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !546, file: !12, line: 103, baseType: !480, size: 64, offset: 256)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !546, file: !12, line: 104, baseType: !389, size: 64, offset: 320)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !546, file: !12, line: 105, baseType: !568, size: 32, offset: 384)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !546, file: !12, line: 105, baseType: !568, size: 32, offset: 416)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !546, file: !12, line: 105, baseType: !568, size: 32, offset: 448)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !546, file: !12, line: 106, baseType: !401, size: 64, offset: 512)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !546, file: !12, line: 107, baseType: !583, size: 64, offset: 576)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !584)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!586 = !{!587}
!587 = !DISubrange(count: 5)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !403, file: !404, line: 113, baseType: !589, size: 320, offset: 3648)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 320, elements: !586)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!417, !401, !392}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !403, file: !404, line: 114, baseType: !594, size: 320, offset: 3968)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 320, elements: !586)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !403, file: !404, line: 115, baseType: !568, size: 32, offset: 4288)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !403, file: !404, line: 120, baseType: !583, size: 64, offset: 4352)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !403, file: !404, line: 121, baseType: !568, size: 32, offset: 4416)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectDestroyFunction", file: !404, line: 130, baseType: !428)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectViewFunction", file: !404, line: 131, baseType: !420)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEnum", file: !6, line: 58, baseType: !328)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!603 = !{!0, !604, !607}
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "MatColoringRegisterAllCalled", scope: !2, file: !606, line: 4, type: !568, isLocal: false, isDefinition: true)
!606 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/color/interface/matcoloring.c", directory: "/home/users/ndemeye/xSDK")
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "MatColoringWeightTypes", scope: !2, file: !606, line: 5, type: !609, isLocal: false, isDefinition: true)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !560, size: 448, elements: !610)
!610 = !{!611}
!611 = !DISubrange(count: 7)
!612 = !{i32 7, !"Dwarf Version", i32 4}
!613 = !{i32 2, !"Debug Info Version", i32 3}
!614 = !{i32 1, !"wchar_size", i32 4}
!615 = !{i32 7, !"PIC Level", i32 2}
!616 = !{i32 7, !"uwtable", i32 1}
!617 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!618 = distinct !DISubprogram(name: "MatColoringRegister", scope: !606, file: !606, line: 30, type: !619, scopeLine: 31, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1429)
!619 = !DISubroutineType(types: !620)
!620 = !{!417, !398, !621}
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!417, !624}
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatColoring", file: !38, line: 1312, baseType: !625)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatColoring", file: !627, line: 647, size: 5248, elements: !628)
!627 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!628 = !{!629, !631, !657, !1420, !1421, !1422, !1423, !1424, !1426, !1427, !1428}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !626, file: !627, line: 648, baseType: !630, size: 4480)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !404, line: 122, baseType: !403)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !626, file: !627, line: 648, baseType: !632, size: 320, offset: 4480)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !633, size: 320, elements: !449)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatColoringOps", file: !627, line: 639, size: 320, elements: !634)
!634 = !{!635, !636, !640, !644, !653}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !633, file: !627, line: 640, baseType: !621, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !633, file: !627, line: 641, baseType: !637, size: 64, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{!417, !544, !624}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !633, file: !627, line: 642, baseType: !641, size: 64, offset: 128)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!417, !624, !423}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !633, file: !627, line: 643, baseType: !645, size: 64, offset: 192)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{!417, !624, !648}
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !650, line: 51, baseType: !651)
!650 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !650, line: 51, flags: DIFlagFwdDecl)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "weights", scope: !633, file: !627, line: 644, baseType: !654, size: 64, offset: 256)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!417, !624, !509, !500}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !626, file: !627, line: 649, baseType: !658, size: 64, offset: 4800)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !38, line: 16, baseType: !659)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !627, line: 436, size: 23424, elements: !661)
!661 = !{!662, !663, !1165, !1185, !1186, !1187, !1189, !1190, !1191, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1316, !1317, !1333, !1334, !1335, !1336, !1337, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1372, !1392, !1393, !1395, !1396, !1397, !1398, !1399, !1400, !1418, !1419}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !660, file: !627, line: 437, baseType: !630, size: 4480)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !660, file: !627, line: 437, baseType: !664, size: 9472, offset: 4480)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !665, size: 9472, elements: !449)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !627, line: 32, size: 9472, elements: !666)
!666 = !{!667, !676, !680, !681, !688, !692, !693, !694, !695, !696, !697, !698, !721, !725, !730, !736, !755, !760, !764, !765, !770, !775, !776, !781, !785, !789, !793, !797, !801, !802, !803, !804, !805, !809, !810, !815, !816, !817, !818, !819, !824, !831, !836, !840, !844, !848, !852, !853, !857, !858, !865, !870, !871, !872, !873, !932, !939, !940, !944, !945, !949, !950, !954, !959, !960, !964, !968, !975, !976, !977, !978, !979, !980, !985, !986, !990, !994, !998, !999, !1000, !1004, !1014, !1015, !1019, !1020, !1024, !1025, !1029, !1030, !1035, !1036, !1040, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1054, !1055, !1056, !1057, !1058, !1059, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1074, !1078, !1079, !1080, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1094, !1095, !1096, !1101, !1105, !1106, !1110, !1111, !1112, !1113, !1139, !1143, !1144, !1145, !1146, !1147, !1151, !1152, !1153, !1154, !1155, !1159, !1163, !1164}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !665, file: !627, line: 34, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!417, !658, !453, !671, !453, !671, !673, !675}
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !453)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !26)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !665, file: !627, line: 35, baseType: !677, size: 64, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!417, !658, !453, !498, !500, !518}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !665, file: !627, line: 36, baseType: !677, size: 64, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !665, file: !627, line: 37, baseType: !682, size: 64, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!417, !658, !685, !685}
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !62, line: 21, baseType: !686)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !62, line: 21, flags: DIFlagFwdDecl)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !665, file: !627, line: 38, baseType: !689, size: 64, offset: 256)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!417, !658, !685, !685, !685}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !665, file: !627, line: 40, baseType: !682, size: 64, offset: 320)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !665, file: !627, line: 41, baseType: !689, size: 64, offset: 384)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !665, file: !627, line: 42, baseType: !682, size: 64, offset: 448)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !665, file: !627, line: 43, baseType: !689, size: 64, offset: 512)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !665, file: !627, line: 44, baseType: !682, size: 64, offset: 576)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !665, file: !627, line: 46, baseType: !689, size: 64, offset: 640)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !665, file: !627, line: 47, baseType: !699, size: 64, offset: 704)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DISubroutineType(types: !701)
!701 = !{!417, !658, !702, !702, !705}
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !650, line: 11, baseType: !703)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !650, line: 11, flags: DIFlagFwdDecl)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !707)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !38, line: 1239, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 1226, size: 704, elements: !709)
!709 = !{!710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !708, file: !38, line: 1227, baseType: !507, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !708, file: !38, line: 1228, baseType: !507, size: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !708, file: !38, line: 1229, baseType: !507, size: 64, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !708, file: !38, line: 1230, baseType: !507, size: 64, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !708, file: !38, line: 1231, baseType: !507, size: 64, offset: 256)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !708, file: !38, line: 1232, baseType: !507, size: 64, offset: 320)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !708, file: !38, line: 1233, baseType: !507, size: 64, offset: 384)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !708, file: !38, line: 1234, baseType: !507, size: 64, offset: 448)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !708, file: !38, line: 1236, baseType: !507, size: 64, offset: 512)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !708, file: !38, line: 1237, baseType: !507, size: 64, offset: 576)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !708, file: !38, line: 1238, baseType: !507, size: 64, offset: 640)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !665, file: !627, line: 48, baseType: !722, size: 64, offset: 768)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!417, !658, !702, !705}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !665, file: !627, line: 49, baseType: !726, size: 64, offset: 832)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!417, !658, !685, !507, !729, !507, !453, !453, !685}
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !38, line: 1291, baseType: !37)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !665, file: !627, line: 50, baseType: !731, size: 64, offset: 896)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!417, !658, !734, !735}
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !38, line: 238, baseType: !50)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !665, file: !627, line: 52, baseType: !737, size: 64, offset: 960)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!417, !658, !740, !741}
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !38, line: 612, baseType: !56)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !38, line: 600, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 592, size: 640, elements: !744)
!744 = !{!745, !746, !747, !748, !749, !750, !751, !752, !753, !754}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !743, file: !38, line: 593, baseType: !455, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !743, file: !38, line: 594, baseType: !455, size: 64, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !743, file: !38, line: 594, baseType: !455, size: 64, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !743, file: !38, line: 594, baseType: !455, size: 64, offset: 192)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !743, file: !38, line: 595, baseType: !455, size: 64, offset: 256)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !743, file: !38, line: 596, baseType: !455, size: 64, offset: 320)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !743, file: !38, line: 597, baseType: !455, size: 64, offset: 384)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !743, file: !38, line: 598, baseType: !455, size: 64, offset: 448)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !743, file: !38, line: 598, baseType: !455, size: 64, offset: 512)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !743, file: !38, line: 599, baseType: !455, size: 64, offset: 576)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !665, file: !627, line: 53, baseType: !756, size: 64, offset: 1024)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!417, !658, !658, !759}
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !665, file: !627, line: 54, baseType: !761, size: 64, offset: 1088)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!417, !658, !685}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !665, file: !627, line: 55, baseType: !682, size: 64, offset: 1152)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !665, file: !627, line: 56, baseType: !766, size: 64, offset: 1216)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{!417, !658, !769, !506}
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !62, line: 155, baseType: !61)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !665, file: !627, line: 58, baseType: !771, size: 64, offset: 1280)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{!417, !658, !774}
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !38, line: 424, baseType: !69)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !665, file: !627, line: 59, baseType: !771, size: 64, offset: 1344)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !665, file: !627, line: 60, baseType: !777, size: 64, offset: 1408)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!417, !658, !780, !568}
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !38, line: 469, baseType: !73)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !665, file: !627, line: 61, baseType: !782, size: 64, offset: 1472)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{!417, !658}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !665, file: !627, line: 63, baseType: !786, size: 64, offset: 1536)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!417, !658, !453, !671, !516, !685, !685}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !665, file: !627, line: 64, baseType: !790, size: 64, offset: 1600)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{!417, !658, !658, !702, !702, !705}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !665, file: !627, line: 65, baseType: !794, size: 64, offset: 1664)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{!417, !658, !658, !705}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !665, file: !627, line: 66, baseType: !798, size: 64, offset: 1728)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{!417, !658, !658, !702, !705}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !665, file: !627, line: 67, baseType: !794, size: 64, offset: 1792)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !665, file: !627, line: 69, baseType: !782, size: 64, offset: 1856)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !665, file: !627, line: 70, baseType: !790, size: 64, offset: 1920)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !665, file: !627, line: 71, baseType: !798, size: 64, offset: 1984)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !665, file: !627, line: 72, baseType: !806, size: 64, offset: 2048)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{!417, !658, !735}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !665, file: !627, line: 73, baseType: !782, size: 64, offset: 2112)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !665, file: !627, line: 75, baseType: !811, size: 64, offset: 2176)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DISubroutineType(types: !813)
!813 = !{!417, !658, !814, !735}
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !38, line: 563, baseType: !104)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !665, file: !627, line: 76, baseType: !682, size: 64, offset: 2240)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !665, file: !627, line: 77, baseType: !682, size: 64, offset: 2304)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !665, file: !627, line: 78, baseType: !699, size: 64, offset: 2368)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !665, file: !627, line: 79, baseType: !722, size: 64, offset: 2432)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !665, file: !627, line: 81, baseType: !820, size: 64, offset: 2496)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{!417, !658, !516, !658, !823}
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !38, line: 285, baseType: !109)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !665, file: !627, line: 82, baseType: !825, size: 64, offset: 2560)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{!417, !658, !453, !828, !828, !734, !830}
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !702)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !665, file: !627, line: 83, baseType: !832, size: 64, offset: 2624)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DISubroutineType(types: !834)
!834 = !{!417, !658, !453, !835, !453}
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !665, file: !627, line: 84, baseType: !837, size: 64, offset: 2688)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{!417, !658, !453, !671, !453, !671, !515}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !665, file: !627, line: 85, baseType: !841, size: 64, offset: 2752)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DISubroutineType(types: !843)
!843 = !{!417, !658, !658, !823}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !665, file: !627, line: 87, baseType: !845, size: 64, offset: 2816)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{!417, !658, !685, !498}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !665, file: !627, line: 88, baseType: !849, size: 64, offset: 2880)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DISubroutineType(types: !851)
!851 = !{!417, !658, !516}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !665, file: !627, line: 89, baseType: !849, size: 64, offset: 2944)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !665, file: !627, line: 90, baseType: !854, size: 64, offset: 3008)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{!417, !658, !685, !675}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !665, file: !627, line: 91, baseType: !786, size: 64, offset: 3072)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !665, file: !627, line: 93, baseType: !859, size: 64, offset: 3136)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!417, !658, !862}
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !863)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !665, file: !627, line: 94, baseType: !866, size: 64, offset: 3200)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DISubroutineType(types: !868)
!868 = !{!417, !658, !453, !568, !568, !498, !869, !869, !759}
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !665, file: !627, line: 95, baseType: !866, size: 64, offset: 3264)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !665, file: !627, line: 96, baseType: !866, size: 64, offset: 3328)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !665, file: !627, line: 97, baseType: !866, size: 64, offset: 3392)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !665, file: !627, line: 99, baseType: !874, size: 64, offset: 3456)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{!417, !658, !649, !877}
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !38, line: 1378, baseType: !878)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !627, line: 609, size: 6208, elements: !880)
!880 = !{!881, !882, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !901, !908, !909, !910, !911, !912, !913, !914, !915, !919, !920, !921, !922, !923, !925, !926, !927, !928, !929, !930, !931}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !879, file: !627, line: 610, baseType: !630, size: 4480)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !879, file: !627, line: 610, baseType: !883, size: 32, offset: 4480)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 32, elements: !449)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !879, file: !627, line: 611, baseType: !453, size: 32, offset: 4512)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !879, file: !627, line: 611, baseType: !453, size: 32, offset: 4544)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !879, file: !627, line: 611, baseType: !453, size: 32, offset: 4576)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !879, file: !627, line: 612, baseType: !453, size: 32, offset: 4608)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !879, file: !627, line: 613, baseType: !453, size: 32, offset: 4640)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !879, file: !627, line: 614, baseType: !498, size: 64, offset: 4672)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !879, file: !627, line: 615, baseType: !500, size: 64, offset: 4736)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !879, file: !627, line: 616, baseType: !835, size: 64, offset: 4800)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !879, file: !627, line: 617, baseType: !498, size: 64, offset: 4864)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !879, file: !627, line: 618, baseType: !894, size: 64, offset: 4928)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !627, line: 602, baseType: !896)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !627, line: 598, size: 128, elements: !897)
!897 = !{!898, !899, !900}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !896, file: !627, line: 599, baseType: !453, size: 32)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !896, file: !627, line: 600, baseType: !453, size: 32, offset: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !896, file: !627, line: 601, baseType: !515, size: 64, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !879, file: !627, line: 619, baseType: !902, size: 64, offset: 4992)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !627, line: 607, baseType: !904)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !627, line: 604, size: 128, elements: !905)
!905 = !{!906, !907}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !904, file: !627, line: 605, baseType: !453, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !904, file: !627, line: 606, baseType: !515, size: 64, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !879, file: !627, line: 620, baseType: !515, size: 64, offset: 5056)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !879, file: !627, line: 621, baseType: !507, size: 64, offset: 5120)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !879, file: !627, line: 622, baseType: !507, size: 64, offset: 5184)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !879, file: !627, line: 623, baseType: !685, size: 64, offset: 5248)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !879, file: !627, line: 623, baseType: !685, size: 64, offset: 5312)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !879, file: !627, line: 623, baseType: !685, size: 64, offset: 5376)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !879, file: !627, line: 624, baseType: !568, size: 32, offset: 5440)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !879, file: !627, line: 625, baseType: !916, size: 64, offset: 5504)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!417}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !879, file: !627, line: 626, baseType: !392, size: 64, offset: 5568)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !879, file: !627, line: 627, baseType: !685, size: 64, offset: 5632)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !879, file: !627, line: 628, baseType: !453, size: 32, offset: 5696)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !879, file: !627, line: 629, baseType: !398, size: 64, offset: 5760)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !879, file: !627, line: 630, baseType: !924, size: 32, offset: 5824)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !116, line: 213, baseType: !115)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !879, file: !627, line: 631, baseType: !453, size: 32, offset: 5856)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !879, file: !627, line: 631, baseType: !453, size: 32, offset: 5888)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !879, file: !627, line: 632, baseType: !568, size: 32, offset: 5920)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !879, file: !627, line: 633, baseType: !568, size: 32, offset: 5952)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !879, file: !627, line: 634, baseType: !395, size: 64, offset: 6016)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !879, file: !627, line: 634, baseType: !392, size: 64, offset: 6080)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !879, file: !627, line: 635, baseType: !461, size: 64, offset: 6144)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !665, file: !627, line: 100, baseType: !933, size: 64, offset: 3520)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{!417, !658, !453, !453, !936, !648}
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !116, line: 215, baseType: !938)
!938 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !665, file: !627, line: 101, baseType: !782, size: 64, offset: 3584)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !665, file: !627, line: 102, baseType: !941, size: 64, offset: 3648)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{!417, !658, !702, !702, !735}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !665, file: !627, line: 103, baseType: !668, size: 64, offset: 3712)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !665, file: !627, line: 105, baseType: !946, size: 64, offset: 3776)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{!417, !658, !702, !702, !734, !735}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !665, file: !627, line: 106, baseType: !782, size: 64, offset: 3840)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !665, file: !627, line: 107, baseType: !951, size: 64, offset: 3904)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{!417, !658, !423}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !665, file: !627, line: 108, baseType: !955, size: 64, offset: 3968)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!417, !658, !958, !734, !735}
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !38, line: 25, baseType: !398)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !665, file: !627, line: 109, baseType: !916, size: 64, offset: 4032)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !665, file: !627, line: 111, baseType: !961, size: 64, offset: 4096)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!417, !658, !658, !658, !507, !658}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !665, file: !627, line: 112, baseType: !965, size: 64, offset: 4160)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!417, !658, !658, !658, !658}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !665, file: !627, line: 113, baseType: !969, size: 64, offset: 4224)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!417, !658, !972, !972}
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !650, line: 30, baseType: !973)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !650, line: 30, flags: DIFlagFwdDecl)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !665, file: !627, line: 114, baseType: !668, size: 64, offset: 4288)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !665, file: !627, line: 115, baseType: !786, size: 64, offset: 4352)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !665, file: !627, line: 117, baseType: !845, size: 64, offset: 4416)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !665, file: !627, line: 118, baseType: !845, size: 64, offset: 4480)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !665, file: !627, line: 119, baseType: !955, size: 64, offset: 4544)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !665, file: !627, line: 120, baseType: !981, size: 64, offset: 4608)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!417, !658, !984, !759}
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !38, line: 1675, baseType: !120)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !665, file: !627, line: 121, baseType: !916, size: 64, offset: 4672)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !665, file: !627, line: 123, baseType: !987, size: 64, offset: 4736)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!417, !658, !453, !392}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !665, file: !627, line: 124, baseType: !991, size: 64, offset: 4800)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!417, !658, !877, !685, !392}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !665, file: !627, line: 125, baseType: !995, size: 64, offset: 4864)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!417, !544, !658}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !665, file: !627, line: 126, baseType: !682, size: 64, offset: 4928)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !665, file: !627, line: 127, baseType: !682, size: 64, offset: 4992)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !665, file: !627, line: 129, baseType: !1001, size: 64, offset: 5056)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!417, !658, !835}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !665, file: !627, line: 130, baseType: !1005, size: 64, offset: 5120)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!417, !658, !1008, !1008}
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !62, line: 654, baseType: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !62, line: 653, size: 128, elements: !1011)
!1011 = !{!1012, !1013}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1010, file: !62, line: 653, baseType: !453, size: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1010, file: !62, line: 653, baseType: !685, size: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !665, file: !627, line: 131, baseType: !1005, size: 64, offset: 5184)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !665, file: !627, line: 132, baseType: !1016, size: 64, offset: 5248)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!417, !658, !498, !498, !498}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !665, file: !627, line: 133, baseType: !951, size: 64, offset: 5312)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !665, file: !627, line: 135, baseType: !1021, size: 64, offset: 5376)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!417, !658, !507, !759}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !665, file: !627, line: 136, baseType: !1021, size: 64, offset: 5440)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !665, file: !627, line: 137, baseType: !1026, size: 64, offset: 5504)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!417, !658, !759}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !665, file: !627, line: 138, baseType: !668, size: 64, offset: 5568)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !665, file: !627, line: 139, baseType: !1031, size: 64, offset: 5632)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!417, !658, !1034, !1034}
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !665, file: !627, line: 141, baseType: !916, size: 64, offset: 5696)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !665, file: !627, line: 142, baseType: !1037, size: 64, offset: 5760)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!417, !658, !658, !507, !658}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !665, file: !627, line: 143, baseType: !1041, size: 64, offset: 5824)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!417, !658, !658, !658}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !665, file: !627, line: 144, baseType: !916, size: 64, offset: 5888)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !665, file: !627, line: 145, baseType: !1037, size: 64, offset: 5952)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !665, file: !627, line: 147, baseType: !1041, size: 64, offset: 6016)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !665, file: !627, line: 148, baseType: !916, size: 64, offset: 6080)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !665, file: !627, line: 149, baseType: !1037, size: 64, offset: 6144)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !665, file: !627, line: 150, baseType: !1041, size: 64, offset: 6208)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !665, file: !627, line: 151, baseType: !1051, size: 64, offset: 6272)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!417, !658, !568}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !665, file: !627, line: 153, baseType: !782, size: 64, offset: 6336)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !665, file: !627, line: 154, baseType: !782, size: 64, offset: 6400)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !665, file: !627, line: 155, baseType: !782, size: 64, offset: 6464)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !665, file: !627, line: 156, baseType: !782, size: 64, offset: 6528)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !665, file: !627, line: 157, baseType: !951, size: 64, offset: 6592)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !665, file: !627, line: 159, baseType: !1060, size: 64, offset: 6656)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!417, !658, !453, !673}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !665, file: !627, line: 160, baseType: !782, size: 64, offset: 6720)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !665, file: !627, line: 161, baseType: !782, size: 64, offset: 6784)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !665, file: !627, line: 162, baseType: !782, size: 64, offset: 6848)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !665, file: !627, line: 163, baseType: !782, size: 64, offset: 6912)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !665, file: !627, line: 165, baseType: !1041, size: 64, offset: 6976)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !665, file: !627, line: 166, baseType: !1041, size: 64, offset: 7040)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !665, file: !627, line: 167, baseType: !845, size: 64, offset: 7104)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !665, file: !627, line: 168, baseType: !1071, size: 64, offset: 7168)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!417, !658, !685, !453}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !665, file: !627, line: 169, baseType: !1075, size: 64, offset: 7232)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!417, !658, !759, !498}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !665, file: !627, line: 171, baseType: !806, size: 64, offset: 7296)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !665, file: !627, line: 172, baseType: !782, size: 64, offset: 7360)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !665, file: !627, line: 173, baseType: !1081, size: 64, offset: 7424)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!417, !658, !498, !869}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !665, file: !627, line: 174, baseType: !941, size: 64, offset: 7488)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !665, file: !627, line: 175, baseType: !941, size: 64, offset: 7552)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !665, file: !627, line: 177, baseType: !682, size: 64, offset: 7616)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !665, file: !627, line: 178, baseType: !731, size: 64, offset: 7680)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !665, file: !627, line: 179, baseType: !682, size: 64, offset: 7744)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !665, file: !627, line: 180, baseType: !689, size: 64, offset: 7808)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !665, file: !627, line: 181, baseType: !1091, size: 64, offset: 7872)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!417, !658, !389, !734, !735}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !665, file: !627, line: 183, baseType: !1001, size: 64, offset: 7936)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !665, file: !627, line: 184, baseType: !766, size: 64, offset: 8000)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !665, file: !627, line: 185, baseType: !1097, size: 64, offset: 8064)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!417, !658, !1100}
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !665, file: !627, line: 186, baseType: !1102, size: 64, offset: 8128)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!417, !658, !453, !671, !515}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !665, file: !627, line: 187, baseType: !825, size: 64, offset: 8192)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !665, file: !627, line: 189, baseType: !1107, size: 64, offset: 8256)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{!417, !658, !453, !453, !498, !673}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !665, file: !627, line: 190, baseType: !916, size: 64, offset: 8320)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !665, file: !627, line: 191, baseType: !1037, size: 64, offset: 8384)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !665, file: !627, line: 192, baseType: !1041, size: 64, offset: 8448)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !665, file: !627, line: 193, baseType: !1114, size: 64, offset: 8512)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!417, !658, !649, !1117}
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !38, line: 1401, baseType: !1118)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !627, line: 660, size: 5312, elements: !1120)
!1120 = !{!1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1119, file: !627, line: 661, baseType: !630, size: 4480)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1119, file: !627, line: 661, baseType: !883, size: 32, offset: 4480)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1119, file: !627, line: 662, baseType: !453, size: 32, offset: 4512)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1119, file: !627, line: 662, baseType: !453, size: 32, offset: 4544)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1119, file: !627, line: 662, baseType: !453, size: 32, offset: 4576)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1119, file: !627, line: 663, baseType: !453, size: 32, offset: 4608)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1119, file: !627, line: 664, baseType: !453, size: 32, offset: 4640)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1119, file: !627, line: 665, baseType: !498, size: 64, offset: 4672)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1119, file: !627, line: 666, baseType: !498, size: 64, offset: 4736)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1119, file: !627, line: 667, baseType: !453, size: 32, offset: 4800)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1119, file: !627, line: 668, baseType: !924, size: 32, offset: 4832)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1119, file: !627, line: 670, baseType: !498, size: 64, offset: 4864)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1119, file: !627, line: 670, baseType: !498, size: 64, offset: 4928)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1119, file: !627, line: 671, baseType: !498, size: 64, offset: 4992)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1119, file: !627, line: 672, baseType: !498, size: 64, offset: 5056)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1119, file: !627, line: 673, baseType: !498, size: 64, offset: 5120)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1119, file: !627, line: 674, baseType: !453, size: 32, offset: 5184)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1119, file: !627, line: 675, baseType: !498, size: 64, offset: 5248)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !665, file: !627, line: 195, baseType: !1140, size: 64, offset: 8576)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!417, !1117, !658, !658}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !665, file: !627, line: 196, baseType: !1140, size: 64, offset: 8640)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !665, file: !627, line: 197, baseType: !916, size: 64, offset: 8704)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !665, file: !627, line: 198, baseType: !1037, size: 64, offset: 8768)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !665, file: !627, line: 199, baseType: !1041, size: 64, offset: 8832)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !665, file: !627, line: 201, baseType: !1148, size: 64, offset: 8896)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!417, !658, !453, !453}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !665, file: !627, line: 202, baseType: !820, size: 64, offset: 8960)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !665, file: !627, line: 203, baseType: !689, size: 64, offset: 9024)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !665, file: !627, line: 204, baseType: !874, size: 64, offset: 9088)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !665, file: !627, line: 205, baseType: !1001, size: 64, offset: 9152)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !665, file: !627, line: 206, baseType: !1156, size: 64, offset: 9216)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!417, !389, !658, !453, !734, !735}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !665, file: !627, line: 208, baseType: !1160, size: 64, offset: 9280)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = !DISubroutineType(types: !1162)
!1162 = !{!417, !453, !830}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !665, file: !627, line: 209, baseType: !1041, size: 64, offset: 9344)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !665, file: !627, line: 210, baseType: !837, size: 64, offset: 9408)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !660, file: !627, line: 438, baseType: !1166, size: 64, offset: 13952)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !650, line: 60, baseType: !1167)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !116, line: 240, size: 640, elements: !1169)
!1169 = !{!1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1168, file: !116, line: 241, baseType: !389, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1168, file: !116, line: 242, baseType: !470, size: 32, offset: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1168, file: !116, line: 243, baseType: !453, size: 32, offset: 96)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1168, file: !116, line: 243, baseType: !453, size: 32, offset: 128)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1168, file: !116, line: 244, baseType: !453, size: 32, offset: 160)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1168, file: !116, line: 244, baseType: !453, size: 32, offset: 192)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1168, file: !116, line: 245, baseType: !498, size: 64, offset: 256)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1168, file: !116, line: 246, baseType: !568, size: 32, offset: 320)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1168, file: !116, line: 247, baseType: !453, size: 32, offset: 352)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1168, file: !116, line: 251, baseType: !453, size: 32, offset: 384)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1168, file: !116, line: 252, baseType: !972, size: 64, offset: 448)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1168, file: !116, line: 253, baseType: !568, size: 32, offset: 512)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1168, file: !116, line: 254, baseType: !453, size: 32, offset: 544)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1168, file: !116, line: 254, baseType: !453, size: 32, offset: 576)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1168, file: !116, line: 255, baseType: !453, size: 32, offset: 608)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !660, file: !627, line: 438, baseType: !1166, size: 64, offset: 14016)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !660, file: !627, line: 439, baseType: !392, size: 64, offset: 14080)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !660, file: !627, line: 440, baseType: !1188, size: 32, offset: 14144)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !38, line: 161, baseType: !265)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !660, file: !627, line: 441, baseType: !568, size: 32, offset: 14176)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !660, file: !627, line: 442, baseType: !568, size: 32, offset: 14208)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !660, file: !627, line: 443, baseType: !1192, size: 448, offset: 14272)
!1192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1193, size: 448, elements: !610)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !38, line: 1159, baseType: !398)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !660, file: !627, line: 444, baseType: !568, size: 32, offset: 14720)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !660, file: !627, line: 445, baseType: !568, size: 32, offset: 14752)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !660, file: !627, line: 446, baseType: !453, size: 32, offset: 14784)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !660, file: !627, line: 447, baseType: !491, size: 64, offset: 14848)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !660, file: !627, line: 448, baseType: !491, size: 64, offset: 14912)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !660, file: !627, line: 449, baseType: !742, size: 640, offset: 14976)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !660, file: !627, line: 450, baseType: !675, size: 32, offset: 15616)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !660, file: !627, line: 451, baseType: !1202, size: 2880, offset: 15680)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !627, line: 318, baseType: !1203)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !627, line: 319, size: 2880, elements: !1204)
!1204 = !{!1205, !1206, !1207, !1208, !1209, !1210, !1211, !1224, !1225, !1230, !1235, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1250, !1251, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1283, !1284, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1307, !1308, !1309, !1313, !1314}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1203, file: !627, line: 320, baseType: !453, size: 32)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1203, file: !627, line: 321, baseType: !453, size: 32, offset: 32)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1203, file: !627, line: 322, baseType: !453, size: 32, offset: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1203, file: !627, line: 323, baseType: !453, size: 32, offset: 96)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1203, file: !627, line: 324, baseType: !453, size: 32, offset: 128)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1203, file: !627, line: 325, baseType: !453, size: 32, offset: 160)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1203, file: !627, line: 326, baseType: !1212, size: 64, offset: 192)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !627, line: 293, baseType: !1213)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !627, line: 295, size: 448, elements: !1215)
!1215 = !{!1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1214, file: !627, line: 296, baseType: !1212, size: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1214, file: !627, line: 297, baseType: !515, size: 64, offset: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1214, file: !627, line: 297, baseType: !515, size: 64, offset: 128)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1214, file: !627, line: 298, baseType: !498, size: 64, offset: 192)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1214, file: !627, line: 298, baseType: !498, size: 64, offset: 256)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1214, file: !627, line: 299, baseType: !453, size: 32, offset: 320)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1214, file: !627, line: 300, baseType: !453, size: 32, offset: 352)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1214, file: !627, line: 301, baseType: !453, size: 32, offset: 384)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1203, file: !627, line: 326, baseType: !1212, size: 64, offset: 256)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1203, file: !627, line: 328, baseType: !1226, size: 64, offset: 320)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64)
!1227 = !DISubroutineType(types: !1228)
!1228 = !{!417, !658, !1229, !498}
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1203, file: !627, line: 329, baseType: !1231, size: 64, offset: 384)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64)
!1232 = !DISubroutineType(types: !1233)
!1233 = !{!417, !1229, !1234, !500, !500, !518, !498}
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1203, file: !627, line: 330, baseType: !1236, size: 64, offset: 448)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1237 = !DISubroutineType(types: !1238)
!1238 = !{!417, !1229}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1203, file: !627, line: 331, baseType: !1236, size: 64, offset: 512)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1203, file: !627, line: 334, baseType: !389, size: 64, offset: 576)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1203, file: !627, line: 335, baseType: !470, size: 32, offset: 640)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1203, file: !627, line: 335, baseType: !470, size: 32, offset: 672)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1203, file: !627, line: 336, baseType: !470, size: 32, offset: 704)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1203, file: !627, line: 336, baseType: !470, size: 32, offset: 736)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1203, file: !627, line: 337, baseType: !1246, size: 64, offset: 768)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !382, line: 339, baseType: !1248)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64)
!1249 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !382, line: 339, flags: DIFlagFwdDecl)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1203, file: !627, line: 338, baseType: !1246, size: 64, offset: 832)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1203, file: !627, line: 339, baseType: !1252, size: 64, offset: 896)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !382, line: 341, baseType: !1254)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !382, line: 351, size: 192, elements: !1255)
!1255 = !{!1256, !1257, !1258, !1259, !1260}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1254, file: !382, line: 354, baseType: !74, size: 32)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1254, file: !382, line: 355, baseType: !74, size: 32, offset: 32)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1254, file: !382, line: 356, baseType: !74, size: 32, offset: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1254, file: !382, line: 361, baseType: !74, size: 32, offset: 96)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1254, file: !382, line: 362, baseType: !564, size: 64, offset: 128)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1203, file: !627, line: 340, baseType: !453, size: 32, offset: 960)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1203, file: !627, line: 340, baseType: !453, size: 32, offset: 992)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1203, file: !627, line: 341, baseType: !515, size: 64, offset: 1024)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1203, file: !627, line: 342, baseType: !498, size: 64, offset: 1088)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1203, file: !627, line: 343, baseType: !518, size: 64, offset: 1152)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1203, file: !627, line: 344, baseType: !500, size: 64, offset: 1216)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1203, file: !627, line: 345, baseType: !453, size: 32, offset: 1280)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1203, file: !627, line: 346, baseType: !1234, size: 64, offset: 1344)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1203, file: !627, line: 347, baseType: !568, size: 32, offset: 1408)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1203, file: !627, line: 348, baseType: !453, size: 32, offset: 1440)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1203, file: !627, line: 351, baseType: !568, size: 32, offset: 1472)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1203, file: !627, line: 352, baseType: !568, size: 32, offset: 1504)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1203, file: !627, line: 353, baseType: !470, size: 32, offset: 1536)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1203, file: !627, line: 354, baseType: !470, size: 32, offset: 1568)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1203, file: !627, line: 355, baseType: !1234, size: 64, offset: 1600)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1203, file: !627, line: 356, baseType: !1234, size: 64, offset: 1664)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1203, file: !627, line: 357, baseType: !1278, size: 64, offset: 1728)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64)
!1279 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !627, line: 310, baseType: !1280)
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !627, line: 308, size: 32, elements: !1281)
!1281 = !{!1282}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1280, file: !627, line: 309, baseType: !453, size: 32)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1203, file: !627, line: 357, baseType: !1278, size: 64, offset: 1792)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1203, file: !627, line: 358, baseType: !1285, size: 64, offset: 1856)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !627, line: 316, baseType: !1287)
!1287 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !627, line: 312, size: 128, elements: !1288)
!1288 = !{!1289, !1290, !1291}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1287, file: !627, line: 313, baseType: !392, size: 64)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1287, file: !627, line: 314, baseType: !453, size: 32, offset: 64)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1287, file: !627, line: 315, baseType: !400, size: 8, offset: 96)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1203, file: !627, line: 359, baseType: !1285, size: 64, offset: 1920)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1203, file: !627, line: 360, baseType: !1285, size: 64, offset: 1984)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1203, file: !627, line: 361, baseType: !453, size: 32, offset: 2048)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1203, file: !627, line: 362, baseType: !470, size: 32, offset: 2080)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1203, file: !627, line: 363, baseType: !453, size: 32, offset: 2112)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1203, file: !627, line: 364, baseType: !1234, size: 64, offset: 2176)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1203, file: !627, line: 365, baseType: !1252, size: 64, offset: 2240)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1203, file: !627, line: 366, baseType: !470, size: 32, offset: 2304)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1203, file: !627, line: 367, baseType: !470, size: 32, offset: 2336)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1203, file: !627, line: 368, baseType: !1246, size: 64, offset: 2368)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1203, file: !627, line: 369, baseType: !1246, size: 64, offset: 2432)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1203, file: !627, line: 370, baseType: !1304, size: 64, offset: 2496)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !6, line: 678, baseType: !1305)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64)
!1306 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !6, line: 678, flags: DIFlagFwdDecl)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1203, file: !627, line: 371, baseType: !1304, size: 64, offset: 2560)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1203, file: !627, line: 372, baseType: !1304, size: 64, offset: 2624)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1203, file: !627, line: 373, baseType: !1310, size: 64, offset: 2688)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !382, line: 331, baseType: !1311)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64)
!1312 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !382, line: 331, flags: DIFlagFwdDecl)
