; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/sf/utils/sfutils.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/sf/utils/sfutils.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!35 = !DIEnumerator(name: "PETSC_MEMTYPE_NVSHMEM", value: 17, isUnsigned: true)
!36 = !DIEnumerator(name: "PETSC_MEMTYPE_HIP", value: 3, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 35, baseType: !5, size: 32, elements: !38)
!38 = !{!39, !40, !41, !42}
!39 = !DIEnumerator(name: "PETSCSF_PATTERN_GENERAL", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "PETSCSF_PATTERN_ALLGATHER", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "PETSCSF_PATTERN_GATHER", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "PETSCSF_PATTERN_ALLTOALL", value: 3, isUnsigned: true)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 37, baseType: !5, size: 32, elements: !45)
!44 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sfimpl.h", directory: "/home/users/ndemeye/xSDK")
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "PETSCSF_BACKEND_INVALID", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "PETSCSF_BACKEND_CUDA", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "PETSCSF_BACKEND_HIP", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "PETSCSF_BACKEND_KOKKOS", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !51)
!51 = !{!52, !53, !54}
!52 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!54 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !56, line: 663, baseType: !5, size: 32, elements: !57)
!56 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!57 = !{!58, !59, !60}
!58 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!60 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!61 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !62)
!62 = !{!63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80}
!63 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!64 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!65 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!66 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!67 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!68 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!69 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!70 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!72 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !82, line: 624, baseType: !5, size: 32, elements: !83)
!82 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!83 = !{!84, !85, !86, !87}
!84 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!85 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!86 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!87 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!88 = !{!89, !92, !93, !96, !99, !182, !106, !267, !172, !297, !300, !200, !5}
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !82, line: 330, baseType: !90)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !82, line: 330, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !94, line: 46, baseType: !95)
!94 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!95 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!98 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !102, line: 73, size: 4480, elements: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!103 = !{!104, !107, !153, !154, !156, !159, !160, !161, !162, !170, !171, !173, !177, !181, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !194, !195, !196, !198, !199, !201, !203, !204, !205, !206, !207, !210, !212, !213, !214, !215, !216, !219, !221, !222, !223, !233, !235, !236, !240, !241, !287, !292, !294, !295, !296}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !101, file: !102, line: 74, baseType: !105, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !106)
!106 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !101, file: !102, line: 75, baseType: !108, size: 448, offset: 64)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 448, elements: !151)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !102, line: 53, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !102, line: 45, size: 448, elements: !111)
!111 = !{!112, !118, !126, !131, !135, !139, !146}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !110, file: !102, line: 46, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!116, !99, !117}
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !106)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !110, file: !102, line: 47, baseType: !119, size: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!116, !99, !122}
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !123, line: 16, baseType: !124)
!123 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !123, line: 16, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !110, file: !102, line: 48, baseType: !127, size: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!116, !130}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !110, file: !102, line: 49, baseType: !132, size: 64, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!116, !99, !96, !99}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !110, file: !102, line: 50, baseType: !136, size: 64, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!116, !99, !96, !130}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !110, file: !102, line: 51, baseType: !140, size: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!116, !99, !96, !143}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{null}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !110, file: !102, line: 52, baseType: !147, size: 64, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!116, !99, !96, !150}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!151 = !{!152}
!152 = !DISubrange(count: 1)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !101, file: !102, line: 76, baseType: !89, size: 64, offset: 512)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !101, file: !102, line: 77, baseType: !155, size: 32, offset: 576)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !106)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !101, file: !102, line: 78, baseType: !157, size: 64, offset: 640)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !158)
!158 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !101, file: !102, line: 78, baseType: !157, size: 64, offset: 704)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !101, file: !102, line: 78, baseType: !157, size: 64, offset: 768)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !101, file: !102, line: 78, baseType: !157, size: 64, offset: 832)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !101, file: !102, line: 79, baseType: !163, size: 64, offset: 896)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !166, line: 27, baseType: !167)
!166 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !168, line: 43, baseType: !169)
!168 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!169 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !101, file: !102, line: 80, baseType: !155, size: 32, offset: 960)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !101, file: !102, line: 81, baseType: !172, size: 32, offset: 992)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !106)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !101, file: !102, line: 82, baseType: !174, size: 64, offset: 1024)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !101, file: !102, line: 83, baseType: !178, size: 64, offset: 1088)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !101, file: !102, line: 84, baseType: !182, size: 64, offset: 1152)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !101, file: !102, line: 85, baseType: !182, size: 64, offset: 1216)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !101, file: !102, line: 86, baseType: !182, size: 64, offset: 1280)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !101, file: !102, line: 87, baseType: !182, size: 64, offset: 1344)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !101, file: !102, line: 88, baseType: !99, size: 64, offset: 1408)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !101, file: !102, line: 89, baseType: !163, size: 64, offset: 1472)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !101, file: !102, line: 90, baseType: !182, size: 64, offset: 1536)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !101, file: !102, line: 91, baseType: !182, size: 64, offset: 1600)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !101, file: !102, line: 92, baseType: !155, size: 32, offset: 1664)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !101, file: !102, line: 93, baseType: !92, size: 64, offset: 1728)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !101, file: !102, line: 94, baseType: !193, size: 64, offset: 1792)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !164)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !101, file: !102, line: 95, baseType: !155, size: 32, offset: 1856)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !101, file: !102, line: 95, baseType: !155, size: 32, offset: 1888)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !101, file: !102, line: 96, baseType: !197, size: 64, offset: 1920)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !101, file: !102, line: 96, baseType: !197, size: 64, offset: 1984)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !101, file: !102, line: 97, baseType: !200, size: 64, offset: 2048)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !101, file: !102, line: 97, baseType: !202, size: 64, offset: 2112)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !101, file: !102, line: 98, baseType: !155, size: 32, offset: 2176)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !101, file: !102, line: 98, baseType: !155, size: 32, offset: 2208)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !101, file: !102, line: 99, baseType: !197, size: 64, offset: 2240)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !101, file: !102, line: 99, baseType: !197, size: 64, offset: 2304)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !101, file: !102, line: 100, baseType: !208, size: 64, offset: 2368)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !158)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !101, file: !102, line: 100, baseType: !211, size: 64, offset: 2432)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !101, file: !102, line: 101, baseType: !155, size: 32, offset: 2496)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !101, file: !102, line: 101, baseType: !155, size: 32, offset: 2528)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !101, file: !102, line: 102, baseType: !197, size: 64, offset: 2560)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !101, file: !102, line: 102, baseType: !197, size: 64, offset: 2624)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !101, file: !102, line: 103, baseType: !217, size: 64, offset: 2688)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !209)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !101, file: !102, line: 103, baseType: !220, size: 64, offset: 2752)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !101, file: !102, line: 104, baseType: !150, size: 64, offset: 2816)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !101, file: !102, line: 105, baseType: !155, size: 32, offset: 2880)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !101, file: !102, line: 106, baseType: !224, size: 128, offset: 2944)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 128, elements: !231)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !102, line: 64, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !102, line: 61, size: 128, elements: !228)
!228 = !{!229, !230}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !227, file: !102, line: 62, baseType: !143, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !227, file: !102, line: 63, baseType: !92, size: 64, offset: 64)
!231 = !{!232}
!232 = !DISubrange(count: 2)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !101, file: !102, line: 107, baseType: !234, size: 64, offset: 3072)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 64, elements: !231)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !101, file: !102, line: 108, baseType: !92, size: 64, offset: 3136)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !101, file: !102, line: 109, baseType: !237, size: 64, offset: 3200)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!116, !92}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !101, file: !102, line: 111, baseType: !155, size: 32, offset: 3264)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !101, file: !102, line: 112, baseType: !242, size: 320, offset: 3328)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 320, elements: !285)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!116, !246, !99, !92}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !249)
!249 = !{!250, !251, !273, !274, !275, !276, !277, !278, !279, !280, !281}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !248, file: !10, line: 100, baseType: !155, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !248, file: !10, line: 101, baseType: !252, size: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !263, !264, !265, !266, !268, !270, !271, !272}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !254, file: !10, line: 84, baseType: !182, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !254, file: !10, line: 85, baseType: !182, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !254, file: !10, line: 86, baseType: !92, size: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !254, file: !10, line: 87, baseType: !174, size: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !254, file: !10, line: 88, baseType: !261, size: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !254, file: !10, line: 89, baseType: !98, size: 8, offset: 320)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !254, file: !10, line: 90, baseType: !182, size: 64, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !254, file: !10, line: 91, baseType: !93, size: 64, offset: 448)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !254, file: !10, line: 92, baseType: !267, size: 32, offset: 512)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !254, file: !10, line: 93, baseType: !269, size: 32, offset: 544)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !254, file: !10, line: 94, baseType: !252, size: 64, offset: 576)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !254, file: !10, line: 95, baseType: !182, size: 64, offset: 640)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !254, file: !10, line: 96, baseType: !92, size: 64, offset: 704)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !248, file: !10, line: 102, baseType: !182, size: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !248, file: !10, line: 102, baseType: !182, size: 64, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !248, file: !10, line: 103, baseType: !182, size: 64, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !248, file: !10, line: 104, baseType: !89, size: 64, offset: 320)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !248, file: !10, line: 105, baseType: !267, size: 32, offset: 384)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !248, file: !10, line: 105, baseType: !267, size: 32, offset: 416)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !248, file: !10, line: 105, baseType: !267, size: 32, offset: 448)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !248, file: !10, line: 106, baseType: !99, size: 64, offset: 512)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !248, file: !10, line: 107, baseType: !282, size: 64, offset: 576)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!285 = !{!286}
!286 = !DISubrange(count: 5)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !101, file: !102, line: 113, baseType: !288, size: 320, offset: 3648)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 320, elements: !285)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!116, !99, !92}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !101, file: !102, line: 114, baseType: !293, size: 320, offset: 3968)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 320, elements: !285)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !101, file: !102, line: 115, baseType: !267, size: 32, offset: 4288)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !101, file: !102, line: 120, baseType: !282, size: 64, offset: 4352)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !101, file: !102, line: 121, baseType: !267, size: 32, offset: 4416)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !82, line: 331, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !82, line: 331, flags: DIFlagFwdDecl)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !82, line: 338, baseType: !301)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !82, line: 338, flags: DIFlagFwdDecl)
!303 = !{i32 7, !"Dwarf Version", i32 4}
!304 = !{i32 2, !"Debug Info Version", i32 3}
!305 = !{i32 1, !"wchar_size", i32 4}
!306 = !{i32 7, !"PIC Level", i32 2}
!307 = !{i32 7, !"uwtable", i32 1}
!308 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!309 = distinct !DISubprogram(name: "PetscSFSetGraphLayout", scope: !310, file: !310, line: 25, type: !311, scopeLine: 26, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !506)
!310 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/is/sf/utils/sfutils.c", directory: "/home/users/ndemeye/xSDK")
!311 = !DISubroutineType(types: !312)
!312 = !{!116, !313, !474, !155, !376, !505, !376}
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !314, line: 15, baseType: !315)
!314 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !44, line: 66, size: 8640, elements: !317)
!317 = !{!318, !320, !413, !428, !429, !430, !431, !432, !433, !434, !436, !437, !438, !439, !441, !442, !443, !445, !446, !448, !449, !454, !455, !456, !457, !458, !459, !460, !461, !462, !466, !467, !468, !469, !470, !472, !473, !498, !499, !500, !501, !502, !504}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !316, file: !44, line: 67, baseType: !319, size: 4480)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !102, line: 122, baseType: !101)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !316, file: !44, line: 67, baseType: !321, size: 1344, offset: 4480)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 1344, elements: !151)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSFOps", file: !44, line: 39, size: 1344, elements: !323)
!323 = !{!324, !328, !329, !330, !334, !338, !343, !350, !354, !355, !356, !360, !364, !368, !378, !382, !387, !399, !403, !404, !409}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !322, file: !44, line: 40, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!116, !313}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy", scope: !322, file: !44, line: 41, baseType: !325, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "SetUp", scope: !322, file: !44, line: 42, baseType: !325, size: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "SetFromOptions", scope: !322, file: !44, line: 43, baseType: !331, size: 64, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!116, !246, !313}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "View", scope: !322, file: !44, line: 44, baseType: !335, size: 64, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!116, !313, !122}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "Duplicate", scope: !322, file: !44, line: 45, baseType: !339, size: 64, offset: 320)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!116, !313, !342, !313}
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFDuplicateOption", file: !25, line: 77, baseType: !24)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "BcastBegin", scope: !322, file: !44, line: 46, baseType: !344, size: 64, offset: 384)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!116, !313, !297, !347, !348, !347, !92, !300}
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !30)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "BcastEnd", scope: !322, file: !44, line: 47, baseType: !351, size: 64, offset: 448)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!116, !313, !297, !348, !92, !300}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ReduceBegin", scope: !322, file: !44, line: 48, baseType: !344, size: 64, offset: 512)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ReduceEnd", scope: !322, file: !44, line: 49, baseType: !351, size: 64, offset: 576)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "FetchAndOpBegin", scope: !322, file: !44, line: 50, baseType: !357, size: 64, offset: 640)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!116, !313, !297, !347, !92, !347, !348, !92, !300}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "FetchAndOpEnd", scope: !322, file: !44, line: 51, baseType: !361, size: 64, offset: 704)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!116, !313, !297, !92, !348, !92, !300}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "BcastToZero", scope: !322, file: !44, line: 52, baseType: !365, size: 64, offset: 768)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!116, !313, !297, !347, !348, !347, !92}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "GetRootRanks", scope: !322, file: !44, line: 53, baseType: !369, size: 64, offset: 832)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!116, !313, !200, !372, !375, !375, !375}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !172)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "GetLeafRanks", scope: !322, file: !44, line: 54, baseType: !379, size: 64, offset: 896)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!116, !313, !200, !372, !375, !375}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "CreateLocalSF", scope: !322, file: !44, line: 55, baseType: !383, size: 64, offset: 960)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!116, !313, !386}
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "GetGraph", scope: !322, file: !44, line: 56, baseType: !388, size: 64, offset: 1024)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!116, !313, !200, !200, !375, !391}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFNode", file: !314, line: 49, baseType: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !314, line: 46, size: 64, elements: !396)
!396 = !{!397, !398}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !395, file: !314, line: 47, baseType: !155, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !395, file: !314, line: 48, baseType: !155, size: 32, offset: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEmbeddedRootSF", scope: !322, file: !44, line: 57, baseType: !400, size: 64, offset: 1088)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!116, !313, !155, !376, !386}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEmbeddedLeafSF", scope: !322, file: !44, line: 58, baseType: !400, size: 64, offset: 1152)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "Malloc", scope: !322, file: !44, line: 60, baseType: !405, size: 64, offset: 1216)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!116, !347, !93, !408}
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "Free", scope: !322, file: !44, line: 61, baseType: !410, size: 64, offset: 1280)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!116, !347, !92}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "vscat", scope: !316, file: !44, line: 78, baseType: !414, size: 512, offset: 5824)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !316, file: !44, line: 68, size: 512, elements: !415)
!415 = !{!416, !417, !418, !419, !420, !423, !424, !425, !426, !427}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "from_n", scope: !414, file: !44, line: 69, baseType: !155, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "to_n", scope: !414, file: !44, line: 69, baseType: !155, size: 32, offset: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "beginandendtogether", scope: !414, file: !44, line: 70, baseType: !267, size: 32, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "packongpu", scope: !414, file: !44, line: 71, baseType: !267, size: 32, offset: 96)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "xdata", scope: !414, file: !44, line: 72, baseType: !421, size: 64, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !218)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ydata", scope: !414, file: !44, line: 73, baseType: !217, size: 64, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "lsf", scope: !414, file: !44, line: 74, baseType: !313, size: 64, offset: 256)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !414, file: !44, line: 75, baseType: !155, size: 32, offset: 320)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !414, file: !44, line: 76, baseType: !297, size: 64, offset: 384)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "logging", scope: !414, file: !44, line: 77, baseType: !267, size: 32, offset: 448)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "nroots", scope: !316, file: !44, line: 81, baseType: !155, size: 32, offset: 6336)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "nleaves", scope: !316, file: !44, line: 82, baseType: !155, size: 32, offset: 6368)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "mine", scope: !316, file: !44, line: 83, baseType: !200, size: 64, offset: 6400)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "mine_alloc", scope: !316, file: !44, line: 84, baseType: !200, size: 64, offset: 6464)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "minleaf", scope: !316, file: !44, line: 85, baseType: !155, size: 32, offset: 6528)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "maxleaf", scope: !316, file: !44, line: 85, baseType: !155, size: 32, offset: 6560)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "remote", scope: !316, file: !44, line: 86, baseType: !435, size: 64, offset: 6592)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "remote_alloc", scope: !316, file: !44, line: 87, baseType: !435, size: 64, offset: 6656)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "nranks", scope: !316, file: !44, line: 88, baseType: !155, size: 32, offset: 6720)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ndranks", scope: !316, file: !44, line: 89, baseType: !155, size: 32, offset: 6752)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ranks", scope: !316, file: !44, line: 90, baseType: !440, size: 64, offset: 6784)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "roffset", scope: !316, file: !44, line: 91, baseType: !200, size: 64, offset: 6848)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "rmine", scope: !316, file: !44, line: 92, baseType: !200, size: 64, offset: 6912)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "rmine_d", scope: !316, file: !44, line: 93, baseType: !444, size: 128, offset: 6976)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 128, elements: !231)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "leafbuflen", scope: !316, file: !44, line: 96, baseType: !234, size: 64, offset: 7104)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "leafcontig", scope: !316, file: !44, line: 97, baseType: !447, size: 64, offset: 7168)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 64, elements: !231)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "leafstart", scope: !316, file: !44, line: 98, baseType: !234, size: 64, offset: 7232)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "leafpackopt", scope: !316, file: !44, line: 99, baseType: !450, size: 128, offset: 7296)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !451, size: 128, elements: !231)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFPackOpt", file: !44, line: 64, baseType: !452)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSFPackOpt", file: !44, line: 64, flags: DIFlagFwdDecl)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "leafpackopt_d", scope: !316, file: !44, line: 100, baseType: !450, size: 128, offset: 7424)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "leafdups", scope: !316, file: !44, line: 101, baseType: !447, size: 64, offset: 7552)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "nleafreqs", scope: !316, file: !44, line: 103, baseType: !155, size: 32, offset: 7616)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "rremote", scope: !316, file: !44, line: 104, baseType: !200, size: 64, offset: 7680)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "degreeknown", scope: !316, file: !44, line: 105, baseType: !267, size: 32, offset: 7744)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "degree", scope: !316, file: !44, line: 106, baseType: !200, size: 64, offset: 7808)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "degreetmp", scope: !316, file: !44, line: 107, baseType: !200, size: 64, offset: 7872)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "rankorder", scope: !316, file: !44, line: 108, baseType: !267, size: 32, offset: 7936)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ingroup", scope: !316, file: !44, line: 109, baseType: !463, size: 64, offset: 8000)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Group", file: !82, line: 336, baseType: !464)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_group_t", file: !82, line: 336, flags: DIFlagFwdDecl)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "outgroup", scope: !316, file: !44, line: 110, baseType: !463, size: 64, offset: 8064)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "multi", scope: !316, file: !44, line: 111, baseType: !313, size: 64, offset: 8128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "graphset", scope: !316, file: !44, line: 112, baseType: !267, size: 32, offset: 8192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !316, file: !44, line: 113, baseType: !267, size: 32, offset: 8224)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !316, file: !44, line: 114, baseType: !471, size: 32, offset: 8256)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFPattern", file: !25, line: 35, baseType: !37)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "persistent", scope: !316, file: !44, line: 115, baseType: !267, size: 32, offset: 8288)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !316, file: !44, line: 116, baseType: !474, size: 64, offset: 8320)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !475, line: 60, baseType: !476)
!475 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !478, line: 240, size: 640, elements: !479)
!478 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!479 = !{!480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !494, !495, !496, !497}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !477, file: !478, line: 241, baseType: !89, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !477, file: !478, line: 242, baseType: !172, size: 32, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !477, file: !478, line: 243, baseType: !155, size: 32, offset: 96)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !477, file: !478, line: 243, baseType: !155, size: 32, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !477, file: !478, line: 244, baseType: !155, size: 32, offset: 160)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !477, file: !478, line: 244, baseType: !155, size: 32, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !477, file: !478, line: 245, baseType: !200, size: 64, offset: 256)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !477, file: !478, line: 246, baseType: !267, size: 32, offset: 320)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !477, file: !478, line: 247, baseType: !155, size: 32, offset: 352)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !477, file: !478, line: 251, baseType: !155, size: 32, offset: 384)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !477, file: !478, line: 252, baseType: !491, size: 64, offset: 448)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !475, line: 30, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !475, line: 30, flags: DIFlagFwdDecl)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !477, file: !478, line: 253, baseType: !267, size: 32, offset: 512)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !477, file: !478, line: 254, baseType: !155, size: 32, offset: 544)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !477, file: !478, line: 254, baseType: !155, size: 32, offset: 576)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !477, file: !478, line: 255, baseType: !155, size: 32, offset: 608)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_input_stream", scope: !316, file: !44, line: 117, baseType: !267, size: 32, offset: 8384)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "use_gpu_aware_mpi", scope: !316, file: !44, line: 118, baseType: !267, size: 32, offset: 8416)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "use_stream_aware_mpi", scope: !316, file: !44, line: 119, baseType: !267, size: 32, offset: 8448)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "maxResidentThreadsPerGPU", scope: !316, file: !44, line: 120, baseType: !155, size: 32, offset: 8480)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "backend", scope: !316, file: !44, line: 121, baseType: !503, size: 32, offset: 8512)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFBackend", file: !44, line: 37, baseType: !43)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !316, file: !44, line: 122, baseType: !92, size: 64, offset: 8576)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscCopyMode", file: !4, line: 327, baseType: !50)
!506 = !{!507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !523, !525, !527, !531, !535}
!507 = !DILocalVariable(name: "sf", arg: 1, scope: !309, file: !310, line: 25, type: !313)
!508 = !DILocalVariable(name: "layout", arg: 2, scope: !309, file: !310, line: 25, type: !474)
!509 = !DILocalVariable(name: "nleaves", arg: 3, scope: !309, file: !310, line: 25, type: !155)
!510 = !DILocalVariable(name: "ilocal", arg: 4, scope: !309, file: !310, line: 25, type: !376)
!511 = !DILocalVariable(name: "localmode", arg: 5, scope: !309, file: !310, line: 25, type: !505)
!512 = !DILocalVariable(name: "iremote", arg: 6, scope: !309, file: !310, line: 25, type: !376)
!513 = !DILocalVariable(name: "ierr", scope: !309, file: !310, line: 27, type: !116)
!514 = !DILocalVariable(name: "range", scope: !309, file: !310, line: 28, type: !376)
!515 = !DILocalVariable(name: "i", scope: !309, file: !310, line: 29, type: !155)
!516 = !DILocalVariable(name: "nroots", scope: !309, file: !310, line: 29, type: !155)
!517 = !DILocalVariable(name: "ls", scope: !309, file: !310, line: 29, type: !155)
!518 = !DILocalVariable(name: "ln", scope: !309, file: !310, line: 29, type: !155)
!519 = !DILocalVariable(name: "lr", scope: !309, file: !310, line: 30, type: !172)
!520 = !DILocalVariable(name: "remote", scope: !309, file: !310, line: 31, type: !435)
!521 = !DILocalVariable(name: "ierr__", scope: !522, file: !310, line: 34, type: !116)
!522 = distinct !DILexicalBlock(scope: !309, file: !310, line: 34, column: 50)
!523 = !DILocalVariable(name: "ierr__", scope: !524, file: !310, line: 35, type: !116)
!524 = distinct !DILexicalBlock(scope: !309, file: !310, line: 35, column: 46)
!525 = !DILocalVariable(name: "ierr__", scope: !526, file: !310, line: 36, type: !116)
!526 = distinct !DILexicalBlock(scope: !309, file: !310, line: 36, column: 40)
!527 = !DILocalVariable(name: "idx", scope: !528, file: !310, line: 39, type: !377)
!528 = distinct !DILexicalBlock(scope: !529, file: !310, line: 38, column: 29)
!529 = distinct !DILexicalBlock(scope: !530, file: !310, line: 38, column: 3)
!530 = distinct !DILexicalBlock(scope: !309, file: !310, line: 38, column: 3)
!531 = !DILocalVariable(name: "ierr__", scope: !532, file: !310, line: 41, type: !116)
!532 = distinct !DILexicalBlock(scope: !533, file: !310, line: 41, column: 80)
!533 = distinct !DILexicalBlock(scope: !534, file: !310, line: 40, column: 31)
!534 = distinct !DILexicalBlock(scope: !528, file: !310, line: 40, column: 9)
!535 = !DILocalVariable(name: "ierr__", scope: !536, file: !310, line: 50, type: !116)
!536 = distinct !DILexicalBlock(scope: !309, file: !310, line: 50, column: 87)
!537 = !DILocation(line: 0, scope: !309)
!538 = !DILocation(line: 28, column: 3, scope: !309)
!539 = !DILocation(line: 29, column: 3, scope: !309)
!540 = !DILocation(line: 31, column: 3, scope: !309)
!541 = !DILocation(line: 33, column: 3, scope: !542)
!542 = distinct !DILexicalBlock(scope: !543, file: !310, line: 33, column: 3)
!543 = distinct !DILexicalBlock(scope: !544, file: !310, line: 33, column: 3)
!544 = distinct !DILexicalBlock(scope: !309, file: !310, line: 33, column: 3)
!545 = !{!546, !546, i64 0}
!546 = !{!"any pointer", !547, i64 0}
!547 = !{!"omnipotent char", !548, i64 0}
!548 = !{!"Simple C/C++ TBAA"}
!549 = !DILocation(line: 33, column: 3, scope: !543)
!550 = !DILocation(line: 33, column: 3, scope: !551)
!551 = distinct !DILexicalBlock(scope: !552, file: !310, line: 33, column: 3)
!552 = distinct !DILexicalBlock(scope: !542, file: !310, line: 33, column: 3)
!553 = !{!554, !555, i64 1536}
!554 = !{!"", !547, i64 0, !547, i64 512, !547, i64 1024, !547, i64 1280, !555, i64 1536, !555, i64 1540, !547, i64 1544}
!555 = !{!"int", !547, i64 0}
!556 = !DILocation(line: 33, column: 3, scope: !552)
!557 = !DILocation(line: 33, column: 3, scope: !558)
!558 = distinct !DILexicalBlock(scope: !551, file: !310, line: 33, column: 3)
!559 = !{!555, !555, i64 0}
!560 = !{!554, !555, i64 1540}
!561 = !DILocation(line: 34, column: 10, scope: !309)
!562 = !DILocation(line: 0, scope: !522)
!563 = !DILocation(line: 34, column: 50, scope: !564)
!564 = distinct !DILexicalBlock(scope: !522, file: !310, line: 34, column: 50)
!565 = !DILocation(line: 34, column: 50, scope: !522)
!566 = !{!"branch_weights", i32 2000, i32 1}
!567 = !DILocation(line: 35, column: 10, scope: !309)
!568 = !DILocation(line: 0, scope: !524)
!569 = !DILocation(line: 35, column: 46, scope: !570)
!570 = distinct !DILexicalBlock(scope: !524, file: !310, line: 35, column: 46)
!571 = !DILocation(line: 35, column: 46, scope: !524)
!572 = !DILocation(line: 36, column: 10, scope: !309)
!573 = !DILocation(line: 0, scope: !526)
!574 = !DILocation(line: 36, column: 40, scope: !575)
!575 = distinct !DILexicalBlock(scope: !526, file: !310, line: 36, column: 40)
!576 = !DILocation(line: 36, column: 40, scope: !526)
!577 = !DILocation(line: 37, column: 7, scope: !578)
!578 = distinct !DILexicalBlock(scope: !309, file: !310, line: 37, column: 7)
!579 = !DILocation(line: 37, column: 7, scope: !309)
!580 = !DILocation(line: 38, column: 14, scope: !529)
!581 = !DILocation(line: 38, column: 3, scope: !530)
!582 = !DILocation(line: 50, column: 61, scope: !309)
!583 = !DILocation(line: 37, column: 23, scope: !584)
!584 = distinct !DILexicalBlock(scope: !578, file: !310, line: 37, column: 16)
!585 = !DILocation(line: 37, column: 34, scope: !584)
!586 = !DILocation(line: 39, column: 26, scope: !528)
!587 = !DILocation(line: 39, column: 37, scope: !528)
!588 = !DILocation(line: 0, scope: !528)
!589 = !DILocation(line: 40, column: 13, scope: !534)
!590 = !DILocation(line: 40, column: 17, scope: !534)
!591 = !DILocation(line: 0, scope: !534)
!592 = !DILocation(line: 41, column: 73, scope: !533)
!593 = !DILocalVariable(name: "map", arg: 1, scope: !594, file: !478, line: 315, type: !474)
!594 = distinct !DISubprogram(name: "PetscLayoutFindOwnerIndex", scope: !478, file: !478, line: 315, type: !595, scopeLine: 316, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !597)
!595 = !DISubroutineType(types: !596)
!596 = !{!116, !474, !155, !440, !200}
!597 = !{!593, !598, !599, !600, !601, !602, !603}
!598 = !DILocalVariable(name: "idx", arg: 2, scope: !594, file: !478, line: 315, type: !155)
!599 = !DILocalVariable(name: "owner", arg: 3, scope: !594, file: !478, line: 315, type: !440)
!600 = !DILocalVariable(name: "lidx", arg: 4, scope: !594, file: !478, line: 315, type: !200)
!601 = !DILocalVariable(name: "lo", scope: !594, file: !478, line: 317, type: !172)
!602 = !DILocalVariable(name: "hi", scope: !594, file: !478, line: 317, type: !172)
!603 = !DILocalVariable(name: "t", scope: !594, file: !478, line: 317, type: !172)
!604 = !DILocation(line: 0, scope: !594, inlinedAt: !605)
!605 = distinct !DILocation(line: 41, column: 14, scope: !533)
!606 = !DILocation(line: 319, column: 3, scope: !607, inlinedAt: !605)
!607 = distinct !DILexicalBlock(scope: !608, file: !478, line: 319, column: 3)
!608 = distinct !DILexicalBlock(scope: !609, file: !478, line: 319, column: 3)
!609 = distinct !DILexicalBlock(scope: !594, file: !478, line: 319, column: 3)
!610 = !DILocation(line: 319, column: 3, scope: !608, inlinedAt: !605)
!611 = !DILocation(line: 319, column: 3, scope: !612, inlinedAt: !605)
!612 = distinct !DILexicalBlock(scope: !613, file: !478, line: 319, column: 3)
!613 = distinct !DILexicalBlock(scope: !607, file: !478, line: 319, column: 3)
!614 = !DILocation(line: 319, column: 3, scope: !613, inlinedAt: !605)
!615 = !DILocation(line: 319, column: 3, scope: !616, inlinedAt: !605)
!616 = distinct !DILexicalBlock(scope: !612, file: !478, line: 319, column: 3)
!617 = !DILocation(line: 321, column: 15, scope: !618, inlinedAt: !605)
!618 = distinct !DILexicalBlock(scope: !594, file: !478, line: 321, column: 7)
!619 = !{!620, !555, i64 12}
!620 = !{!"_n_PetscLayout", !546, i64 0, !555, i64 8, !555, i64 12, !555, i64 16, !555, i64 20, !555, i64 24, !546, i64 32, !547, i64 40, !555, i64 44, !555, i64 48, !546, i64 56, !547, i64 64, !555, i64 68, !555, i64 72, !555, i64 76}
!621 = !DILocation(line: 321, column: 17, scope: !618, inlinedAt: !605)
!622 = !DILocation(line: 321, column: 23, scope: !618, inlinedAt: !605)
!623 = !DILocation(line: 321, column: 32, scope: !618, inlinedAt: !605)
!624 = !{!620, !555, i64 16}
!625 = !DILocation(line: 321, column: 34, scope: !618, inlinedAt: !605)
!626 = !DILocation(line: 321, column: 40, scope: !618, inlinedAt: !605)
!627 = !DILocation(line: 321, column: 49, scope: !618, inlinedAt: !605)
!628 = !{!620, !546, i64 32}
!629 = !DILocation(line: 321, column: 43, scope: !618, inlinedAt: !605)
!630 = !DILocation(line: 321, column: 7, scope: !594, inlinedAt: !605)
!631 = !DILocation(line: 321, column: 58, scope: !618, inlinedAt: !605)
!632 = !DILocation(line: 322, column: 11, scope: !633, inlinedAt: !605)
!633 = distinct !DILexicalBlock(scope: !594, file: !478, line: 322, column: 7)
!634 = !DILocation(line: 322, column: 15, scope: !633, inlinedAt: !605)
!635 = !DILocation(line: 322, column: 32, scope: !633, inlinedAt: !605)
!636 = !DILocation(line: 324, column: 13, scope: !594, inlinedAt: !605)
!637 = !{!620, !555, i64 8}
!638 = !DILocation(line: 325, column: 18, scope: !594, inlinedAt: !605)
!639 = !DILocation(line: 325, column: 3, scope: !594, inlinedAt: !605)
!640 = !DILocation(line: 326, column: 24, scope: !641, inlinedAt: !605)
!641 = distinct !DILexicalBlock(scope: !594, file: !478, line: 325, column: 23)
!642 = !DILocation(line: 326, column: 12, scope: !641, inlinedAt: !605)
!643 = !DILocation(line: 327, column: 15, scope: !644, inlinedAt: !605)
!644 = distinct !DILexicalBlock(scope: !641, file: !478, line: 327, column: 9)
!645 = !DILocation(line: 327, column: 13, scope: !644, inlinedAt: !605)
!646 = !DILocation(line: 325, column: 13, scope: !594, inlinedAt: !605)
!647 = distinct !{!647, !639, !648, !649}
!648 = !DILocation(line: 329, column: 3, scope: !594, inlinedAt: !605)
!649 = !{!"llvm.loop.mustprogress"}
!650 = !DILocation(line: 317, column: 15, scope: !594, inlinedAt: !605)
!651 = !DILocation(line: 331, column: 28, scope: !652, inlinedAt: !605)
!652 = distinct !DILexicalBlock(scope: !594, file: !478, line: 331, column: 7)
!653 = !DILocation(line: 331, column: 26, scope: !652, inlinedAt: !605)
!654 = !DILocation(line: 331, column: 20, scope: !652, inlinedAt: !605)
!655 = !DILocation(line: 332, column: 3, scope: !656, inlinedAt: !605)
!656 = distinct !DILexicalBlock(scope: !657, file: !478, line: 332, column: 3)
!657 = distinct !DILexicalBlock(scope: !658, file: !478, line: 332, column: 3)
!658 = distinct !DILexicalBlock(scope: !594, file: !478, line: 332, column: 3)
!659 = !DILocation(line: 332, column: 3, scope: !657, inlinedAt: !605)
!660 = !DILocation(line: 332, column: 3, scope: !661, inlinedAt: !605)
!661 = distinct !DILexicalBlock(scope: !662, file: !478, line: 332, column: 3)
!662 = distinct !DILexicalBlock(scope: !656, file: !478, line: 332, column: 3)
!663 = !DILocation(line: 332, column: 3, scope: !662, inlinedAt: !605)
!664 = !DILocation(line: 332, column: 3, scope: !665, inlinedAt: !605)
!665 = distinct !DILexicalBlock(scope: !666, file: !478, line: 332, column: 3)
!666 = distinct !DILexicalBlock(scope: !661, file: !478, line: 332, column: 3)
!667 = !{!554, !547, i64 1544}
!668 = !DILocation(line: 332, column: 3, scope: !666, inlinedAt: !605)
!669 = !DILocation(line: 332, column: 3, scope: !670, inlinedAt: !605)
!670 = distinct !DILexicalBlock(scope: !665, file: !478, line: 332, column: 3)
!671 = !DILocation(line: 332, column: 3, scope: !672, inlinedAt: !605)
!672 = distinct !DILexicalBlock(scope: !661, file: !478, line: 332, column: 3)
!673 = !DILocation(line: 332, column: 3, scope: !674, inlinedAt: !605)
!674 = distinct !DILexicalBlock(scope: !672, file: !478, line: 332, column: 3)
!675 = !DILocation(line: 332, column: 3, scope: !676, inlinedAt: !605)
!676 = distinct !DILexicalBlock(scope: !677, file: !478, line: 332, column: 3)
!677 = distinct !DILexicalBlock(scope: !674, file: !478, line: 332, column: 3)
!678 = !DILocation(line: 332, column: 3, scope: !677, inlinedAt: !605)
!679 = !DILocation(line: 332, column: 3, scope: !680, inlinedAt: !605)
!680 = distinct !DILexicalBlock(scope: !676, file: !478, line: 332, column: 3)
!681 = !DILocation(line: 0, scope: !532)
!682 = !DILocation(line: 41, column: 80, scope: !683)
!683 = distinct !DILexicalBlock(scope: !532, file: !310, line: 41, column: 80)
!684 = !DILocation(line: 41, column: 80, scope: !532)
!685 = !DILocation(line: 43, column: 12, scope: !533)
!686 = !DILocation(line: 42, column: 7, scope: !533)
!687 = !DILocation(line: 42, column: 17, scope: !533)
!688 = !DILocation(line: 42, column: 22, scope: !533)
!689 = !{!690, !555, i64 0}
!690 = !{!"", !555, i64 0, !555, i64 4}
!691 = !DILocation(line: 44, column: 20, scope: !533)
!692 = !DILocation(line: 44, column: 12, scope: !533)
!693 = !DILocation(line: 44, column: 24, scope: !533)
!694 = !DILocation(line: 45, column: 5, scope: !533)
!695 = !DILocation(line: 46, column: 17, scope: !696)
!696 = distinct !DILexicalBlock(scope: !534, file: !310, line: 45, column: 12)
!697 = !DILocation(line: 46, column: 23, scope: !696)
!698 = !DILocation(line: 47, column: 17, scope: !696)
!699 = !DILocation(line: 47, column: 23, scope: !696)
!700 = !{!690, !555, i64 4}
!701 = !DILocation(line: 38, column: 25, scope: !529)
!702 = distinct !{!702, !581, !703, !649}
!703 = !DILocation(line: 49, column: 3, scope: !530)
!704 = !DILocation(line: 50, column: 29, scope: !309)
!705 = !DILocation(line: 50, column: 10, scope: !309)
!706 = !DILocation(line: 0, scope: !536)
!707 = !DILocation(line: 50, column: 87, scope: !708)
!708 = distinct !DILexicalBlock(scope: !536, file: !310, line: 50, column: 87)
!709 = !DILocation(line: 50, column: 87, scope: !536)
!710 = !DILocation(line: 51, column: 3, scope: !711)
!711 = distinct !DILexicalBlock(scope: !712, file: !310, line: 51, column: 3)
!712 = distinct !DILexicalBlock(scope: !713, file: !310, line: 51, column: 3)
!713 = distinct !DILexicalBlock(scope: !309, file: !310, line: 51, column: 3)
!714 = !DILocation(line: 51, column: 3, scope: !712)
!715 = !DILocation(line: 51, column: 3, scope: !716)
!716 = distinct !DILexicalBlock(scope: !717, file: !310, line: 51, column: 3)
!717 = distinct !DILexicalBlock(scope: !711, file: !310, line: 51, column: 3)
!718 = !DILocation(line: 51, column: 3, scope: !717)
!719 = !DILocation(line: 51, column: 3, scope: !720)
!720 = distinct !DILexicalBlock(scope: !721, file: !310, line: 51, column: 3)
!721 = distinct !DILexicalBlock(scope: !716, file: !310, line: 51, column: 3)
!722 = !DILocation(line: 51, column: 3, scope: !721)
!723 = !DILocation(line: 51, column: 3, scope: !724)
!724 = distinct !DILexicalBlock(scope: !720, file: !310, line: 51, column: 3)
!725 = !DILocation(line: 51, column: 3, scope: !726)
!726 = distinct !DILexicalBlock(scope: !716, file: !310, line: 51, column: 3)
!727 = !DILocation(line: 51, column: 3, scope: !728)
!728 = distinct !DILexicalBlock(scope: !726, file: !310, line: 51, column: 3)
!729 = !DILocation(line: 51, column: 3, scope: !730)
!730 = distinct !DILexicalBlock(scope: !731, file: !310, line: 51, column: 3)
!731 = distinct !DILexicalBlock(scope: !728, file: !310, line: 51, column: 3)
!732 = !DILocation(line: 51, column: 3, scope: !731)
!733 = !DILocation(line: 51, column: 3, scope: !734)
!734 = distinct !DILexicalBlock(scope: !730, file: !310, line: 51, column: 3)
!735 = !DILocation(line: 52, column: 1, scope: !309)
!736 = !DISubprogram(name: "PetscLayoutGetLocalSize", scope: !478, file: !478, line: 343, type: !737, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!737 = !DISubroutineType(types: !738)
!738 = !{!106, !476, !739}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!740 = !{}
!741 = !DISubprogram(name: "PetscError", scope: !56, file: !56, line: 668, type: !742, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!742 = !DISubroutineType(types: !743)
!743 = !{!116, !90, !106, !96, !96, !106, !55, !96, null}
!744 = !DISubprogram(name: "PetscLayoutGetRanges", scope: !478, file: !478, line: 349, type: !745, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!745 = !DISubroutineType(types: !746)
!746 = !{!106, !476, !747}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!750 = !DISubprogram(name: "PetscMallocA", scope: !751, file: !751, line: 1288, type: !752, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!751 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!752 = !DISubroutineType(types: !753)
!753 = !{!116, !106, !3, !106, !96, !96, !95, !92, null}
!754 = !DISubprogram(name: "PetscSFSetGraph", scope: !25, file: !25, line: 101, type: !755, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!755 = !DISubroutineType(types: !756)
!756 = !{!106, !315, !106, !106, !748, !50, !757, !50}
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !395)
!759 = distinct !DISubprogram(name: "PetscSFSetGraphSection", scope: !310, file: !310, line: 67, type: !760, scopeLine: 68, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !860)
!760 = !DISubroutineType(types: !761)
!761 = !{!116, !313, !762, !762}
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !763, line: 18, baseType: !764)
!763 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !766, line: 29, size: 5760, elements: !767)
!766 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sectionimpl.h", directory: "/home/users/ndemeye/xSDK")
!767 = !{!768, !769, !771, !772, !773, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !788, !789, !791, !792, !794, !795, !824, !825, !826}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !765, file: !766, line: 30, baseType: !319, size: 4480)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !765, file: !766, line: 30, baseType: !770, size: 32, offset: 4480)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 32, elements: !151)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "pStart", scope: !765, file: !766, line: 31, baseType: !155, size: 32, offset: 4512)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "pEnd", scope: !765, file: !766, line: 31, baseType: !155, size: 32, offset: 4544)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !765, file: !766, line: 32, baseType: !774, size: 64, offset: 4608)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !475, line: 11, baseType: !775)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !475, line: 11, flags: DIFlagFwdDecl)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "pointMajor", scope: !765, file: !766, line: 33, baseType: !267, size: 32, offset: 4672)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "includesConstraints", scope: !765, file: !766, line: 34, baseType: !267, size: 32, offset: 4704)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "atlasDof", scope: !765, file: !766, line: 35, baseType: !200, size: 64, offset: 4736)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "atlasOff", scope: !765, file: !766, line: 36, baseType: !200, size: 64, offset: 4800)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "maxDof", scope: !765, file: !766, line: 37, baseType: !155, size: 32, offset: 4864)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !765, file: !766, line: 38, baseType: !762, size: 64, offset: 4928)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "bcIndices", scope: !765, file: !766, line: 39, baseType: !200, size: 64, offset: 4992)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !765, file: !766, line: 40, baseType: !267, size: 32, offset: 5056)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "numFields", scope: !765, file: !766, line: 42, baseType: !155, size: 32, offset: 5088)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "fieldNames", scope: !765, file: !766, line: 43, baseType: !787, size: 64, offset: 5120)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "numFieldComponents", scope: !765, file: !766, line: 44, baseType: !200, size: 64, offset: 5184)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !765, file: !766, line: 45, baseType: !790, size: 64, offset: 5248)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "useFieldOff", scope: !765, file: !766, line: 46, baseType: !267, size: 32, offset: 5312)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "compNames", scope: !765, file: !766, line: 47, baseType: !793, size: 64, offset: 5376)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "clObj", scope: !765, file: !766, line: 49, baseType: !99, size: 64, offset: 5440)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "clHash", scope: !765, file: !766, line: 50, baseType: !796, size: 64, offset: 5504)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClPerm", file: !766, line: 27, baseType: !797)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_ClPerm_t", file: !766, line: 27, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_ClPerm_s", file: !766, line: 27, size: 320, elements: !800)
!800 = !{!801, !805, !806, !807, !808, !810, !817}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !799, file: !766, line: 27, baseType: !802, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !803, line: 166, baseType: !804)
!803 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/khash/khash.h", directory: "/home/users/ndemeye/xSDK")
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !803, line: 139, baseType: !5)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !799, file: !766, line: 27, baseType: !802, size: 32, offset: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !799, file: !766, line: 27, baseType: !802, size: 32, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !799, file: !766, line: 27, baseType: !802, size: 32, offset: 96)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !799, file: !766, line: 27, baseType: !809, size: 64, offset: 128)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !799, file: !766, line: 27, baseType: !811, size: 64, offset: 192)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermKey", file: !766, line: 10, baseType: !813)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PetscSectionClosurePermKey", file: !766, line: 8, size: 64, elements: !814)
!814 = !{!815, !816}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !813, file: !766, line: 9, baseType: !155, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !813, file: !766, line: 9, baseType: !155, size: 32, offset: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !799, file: !766, line: 27, baseType: !818, size: 64, offset: 256)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermVal", file: !766, line: 14, baseType: !820)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !766, line: 12, size: 128, elements: !821)
!821 = !{!822, !823}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !820, file: !766, line: 13, baseType: !200, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "invPerm", scope: !820, file: !766, line: 13, baseType: !200, size: 64, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "clSection", scope: !765, file: !766, line: 51, baseType: !762, size: 64, offset: 5568)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "clPoints", scope: !765, file: !766, line: 52, baseType: !774, size: 64, offset: 5632)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !765, file: !766, line: 53, baseType: !827, size: 64, offset: 5696)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionSym", file: !763, line: 33, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSectionSym", file: !766, line: 72, size: 4864, elements: !830)
!830 = !{!831, !832, !849, !850, !859}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !829, file: !766, line: 73, baseType: !319, size: 4480)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !829, file: !766, line: 73, baseType: !833, size: 192, offset: 4480)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !834, size: 192, elements: !151)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSectionSymOps", file: !766, line: 56, size: 192, elements: !835)
!835 = !{!836, !841, !845}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "getpoints", scope: !834, file: !766, line: 57, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{!116, !827, !762, !155, !376, !375, !840}
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !834, file: !766, line: 58, baseType: !842, size: 64, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!116, !827}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !834, file: !766, line: 59, baseType: !846, size: 64, offset: 128)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!116, !827, !122}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !829, file: !766, line: 74, baseType: !92, size: 64, offset: 4672)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !829, file: !766, line: 75, baseType: !851, size: 64, offset: 4736)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "SymWorkLink", file: !766, line: 62, baseType: !852)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_SymWorkLink", file: !766, line: 64, size: 256, elements: !854)
!854 = !{!855, !856, !857, !858}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !853, file: !766, line: 66, baseType: !851, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "perms", scope: !853, file: !766, line: 67, baseType: !375, size: 64, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "rots", scope: !853, file: !766, line: 68, baseType: !840, size: 64, offset: 128)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "numPoints", scope: !853, file: !766, line: 69, baseType: !155, size: 32, offset: 192)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !829, file: !766, line: 76, baseType: !851, size: 64, offset: 4800)
!860 = !{!861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !880, !882, !888, !889, !891, !894, !895, !897, !899, !901, !903, !905, !907, !909, !913, !914, !916, !918, !920, !922, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !937, !939, !941, !943, !945, !947, !949, !955, !956, !958, !960}
!861 = !DILocalVariable(name: "sf", arg: 1, scope: !759, file: !310, line: 67, type: !313)
!862 = !DILocalVariable(name: "localSection", arg: 2, scope: !759, file: !310, line: 67, type: !762)
!863 = !DILocalVariable(name: "globalSection", arg: 3, scope: !759, file: !310, line: 67, type: !762)
!864 = !DILocalVariable(name: "comm", scope: !759, file: !310, line: 69, type: !89)
!865 = !DILocalVariable(name: "layout", scope: !759, file: !310, line: 70, type: !474)
!866 = !DILocalVariable(name: "ranges", scope: !759, file: !310, line: 71, type: !376)
!867 = !DILocalVariable(name: "local", scope: !759, file: !310, line: 72, type: !200)
!868 = !DILocalVariable(name: "remote", scope: !759, file: !310, line: 73, type: !435)
!869 = !DILocalVariable(name: "pStart", scope: !759, file: !310, line: 74, type: !155)
!870 = !DILocalVariable(name: "pEnd", scope: !759, file: !310, line: 74, type: !155)
!871 = !DILocalVariable(name: "p", scope: !759, file: !310, line: 74, type: !155)
!872 = !DILocalVariable(name: "nroots", scope: !759, file: !310, line: 74, type: !155)
!873 = !DILocalVariable(name: "nleaves", scope: !759, file: !310, line: 74, type: !155)
!874 = !DILocalVariable(name: "l", scope: !759, file: !310, line: 74, type: !155)
!875 = !DILocalVariable(name: "size", scope: !759, file: !310, line: 75, type: !172)
!876 = !DILocalVariable(name: "rank", scope: !759, file: !310, line: 75, type: !172)
!877 = !DILocalVariable(name: "ierr", scope: !759, file: !310, line: 76, type: !116)
!878 = !DILocalVariable(name: "ierr__", scope: !879, file: !310, line: 83, type: !116)
!879 = distinct !DILexicalBlock(scope: !759, file: !310, line: 83, column: 52)
!880 = !DILocalVariable(name: "_7_errorcode", scope: !881, file: !310, line: 84, type: !116)
!881 = distinct !DILexicalBlock(scope: !759, file: !310, line: 84, column: 37)
!882 = !DILocalVariable(name: "_7_errorstring", scope: !883, file: !310, line: 84, type: !885)
!883 = distinct !DILexicalBlock(scope: !884, file: !310, line: 84, column: 37)
!884 = distinct !DILexicalBlock(scope: !881, file: !310, line: 84, column: 37)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 2048, elements: !886)
!886 = !{!887}
!887 = !DISubrange(count: 256)
!888 = !DILocalVariable(name: "_7_resultlen", scope: !883, file: !310, line: 84, type: !172)
!889 = !DILocalVariable(name: "_7_errorcode", scope: !890, file: !310, line: 85, type: !116)
!890 = distinct !DILexicalBlock(scope: !759, file: !310, line: 85, column: 37)
!891 = !DILocalVariable(name: "_7_errorstring", scope: !892, file: !310, line: 85, type: !885)
!892 = distinct !DILexicalBlock(scope: !893, file: !310, line: 85, column: 37)
!893 = distinct !DILexicalBlock(scope: !890, file: !310, line: 85, column: 37)
!894 = !DILocalVariable(name: "_7_resultlen", scope: !892, file: !310, line: 85, type: !172)
!895 = !DILocalVariable(name: "ierr__", scope: !896, file: !310, line: 86, type: !116)
!896 = distinct !DILexicalBlock(scope: !759, file: !310, line: 86, column: 62)
!897 = !DILocalVariable(name: "ierr__", scope: !898, file: !310, line: 87, type: !116)
!898 = distinct !DILexicalBlock(scope: !759, file: !310, line: 87, column: 72)
!899 = !DILocalVariable(name: "ierr__", scope: !900, file: !310, line: 88, type: !116)
!900 = distinct !DILexicalBlock(scope: !759, file: !310, line: 88, column: 43)
!901 = !DILocalVariable(name: "ierr__", scope: !902, file: !310, line: 89, type: !116)
!902 = distinct !DILexicalBlock(scope: !759, file: !310, line: 89, column: 45)
