; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/sf/impls/basic/gather/sfgather.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/sf/impls/basic/gather/sfgather.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct._p_PetscSF = type { %struct._p_PetscObject, [1 x %struct._PetscSFOps], %struct.anon, i32, i32, i32*, i32*, i32, i32, %struct.PetscSFNode*, %struct.PetscSFNode*, i32, i32, i32*, i32*, i32*, [2 x i32*], [2 x i32], [2 x i32], [2 x i32], [2 x %struct._n_PetscSFPackOpt*], [2 x %struct._n_PetscSFPackOpt*], [2 x i32], i32, i32*, i32, i32*, i32*, i32, %struct.ompi_group_t*, %struct.ompi_group_t*, %struct._p_PetscSF*, i32, i32, i32, i32, %struct._n_PetscLayout*, i32, i32, i32, i32, i32, i8* }

!12 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 77, baseType: !5, size: 32, elements: !26)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsf.h", directory: "/home/users/ndemeye/xSDK")
!26 = !{!27, !28, !29}
!27 = !DIEnumerator(name: "PETSCSF_DUPLICATE_CONFONLY", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "PETSCSF_DUPLICATE_RANKS", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "PETSCSF_DUPLICATE_GRAPH", value: 2, isUnsigned: true)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 701, baseType: !5, size: 32, elements: !31)
!31 = !{!32, !33, !34, !35, !36}
!32 = !DIEnumerator(name: "PETSC_MEMTYPE_HOST", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "PETSC_MEMTYPE_DEVICE", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "PETSC_MEMTYPE_CUDA", value: 1, isUnsigned: true)
!35 = !DIEnumerator(name: "PETSC_MEMTYPE_NVSHMEM", value: 17, isUnsigned: true)
!36 = !DIEnumerator(name: "PETSC_MEMTYPE_HIP", value: 3, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 35, baseType: !5, size: 32, elements: !38)
!38 = !{!39, !40, !41, !42}
!39 = !DIEnumerator(name: "PETSCSF_PATTERN_GENERAL", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "PETSCSF_PATTERN_ALLGATHER", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "PETSCSF_PATTERN_GATHER", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "PETSCSF_PATTERN_ALLTOALL", value: 3, isUnsigned: true)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 37, baseType: !5, size: 32, elements: !45)
!44 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sfimpl.h", directory: "/home/users/ndemeye/xSDK")
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "PETSCSF_BACKEND_INVALID", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "PETSCSF_BACKEND_CUDA", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "PETSCSF_BACKEND_HIP", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "PETSCSF_BACKEND_KOKKOS", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 34, baseType: !5, size: 32, elements: !51)
!51 = !{!52, !53}
!52 = !DIEnumerator(name: "PETSCSF_ROOT2LEAF", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSCSF_LEAF2ROOT", value: 1, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 35, baseType: !5, size: 32, elements: !55)
!55 = !{!56, !57, !58}
!56 = !DIEnumerator(name: "PETSCSF_BCAST", value: 0, isUnsigned: true)
!57 = !DIEnumerator(name: "PETSCSF_REDUCE", value: 1, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSCSF_FETCH", value: 2, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 663, baseType: !5, size: 32, elements: !61)
!60 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!61 = !{!62, !63, !64}
!62 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!63 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !66, line: 24, baseType: !5, size: 32, elements: !67)
!66 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/vec/is/sf/impls/basic/sfpack.h", directory: "/home/users/ndemeye/xSDK")
!67 = !{!68, !69}
!68 = !DIEnumerator(name: "PETSCSF_LOCAL", value: 0, isUnsigned: true)
!69 = !DIEnumerator(name: "PETSCSF_REMOTE", value: 1, isUnsigned: true)
!70 = !{!71, !72, !76, !162, !83, !112, !280, !246, !152, !369, !137}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !73, line: 330, baseType: !74)
!73 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !73, line: 330, flags: DIFlagFwdDecl)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !79, line: 73, size: 4480, elements: !80)
!79 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!80 = !{!81, !84, !133, !134, !136, !139, !140, !141, !142, !150, !151, !153, !157, !161, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !174, !175, !176, !178, !179, !181, !183, !184, !185, !186, !187, !190, !192, !193, !194, !195, !196, !199, !201, !202, !203, !213, !215, !216, !220, !221, !270, !275, !277, !278, !279}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !78, file: !79, line: 74, baseType: !82, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !83)
!83 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !78, file: !79, line: 75, baseType: !85, size: 448, offset: 64)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 448, elements: !131)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !79, line: 53, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 45, size: 448, elements: !88)
!88 = !{!89, !95, !103, !108, !115, !119, !126}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !87, file: !79, line: 46, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!93, !76, !94}
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !83)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !87, file: !79, line: 47, baseType: !96, size: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!93, !76, !99}
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !100, line: 16, baseType: !101)
!100 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !100, line: 16, flags: DIFlagFwdDecl)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !87, file: !79, line: 48, baseType: !104, size: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!93, !107}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !87, file: !79, line: 49, baseType: !109, size: 64, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!93, !76, !112, !76}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!114 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !87, file: !79, line: 50, baseType: !116, size: 64, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!93, !76, !112, !107}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !87, file: !79, line: 51, baseType: !120, size: 64, offset: 320)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!93, !76, !112, !123}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{null}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !87, file: !79, line: 52, baseType: !127, size: 64, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!93, !76, !112, !130}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!131 = !{!132}
!132 = !DISubrange(count: 1)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !78, file: !79, line: 76, baseType: !72, size: 64, offset: 512)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !78, file: !79, line: 77, baseType: !135, size: 32, offset: 576)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !83)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !78, file: !79, line: 78, baseType: !137, size: 64, offset: 640)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !138)
!138 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !78, file: !79, line: 78, baseType: !137, size: 64, offset: 704)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !78, file: !79, line: 78, baseType: !137, size: 64, offset: 768)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !78, file: !79, line: 78, baseType: !137, size: 64, offset: 832)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !78, file: !79, line: 79, baseType: !143, size: 64, offset: 896)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !146, line: 27, baseType: !147)
!146 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !148, line: 43, baseType: !149)
!148 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!149 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !78, file: !79, line: 80, baseType: !135, size: 32, offset: 960)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !78, file: !79, line: 81, baseType: !152, size: 32, offset: 992)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !83)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !78, file: !79, line: 82, baseType: !154, size: 64, offset: 1024)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !78, file: !79, line: 83, baseType: !158, size: 64, offset: 1088)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !78, file: !79, line: 84, baseType: !162, size: 64, offset: 1152)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !78, file: !79, line: 85, baseType: !162, size: 64, offset: 1216)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !78, file: !79, line: 86, baseType: !162, size: 64, offset: 1280)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !78, file: !79, line: 87, baseType: !162, size: 64, offset: 1344)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !78, file: !79, line: 88, baseType: !76, size: 64, offset: 1408)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !78, file: !79, line: 89, baseType: !143, size: 64, offset: 1472)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !78, file: !79, line: 90, baseType: !162, size: 64, offset: 1536)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !78, file: !79, line: 91, baseType: !162, size: 64, offset: 1600)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !78, file: !79, line: 92, baseType: !135, size: 32, offset: 1664)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !78, file: !79, line: 93, baseType: !71, size: 64, offset: 1728)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !78, file: !79, line: 94, baseType: !173, size: 64, offset: 1792)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !144)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !78, file: !79, line: 95, baseType: !135, size: 32, offset: 1856)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !78, file: !79, line: 95, baseType: !135, size: 32, offset: 1888)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !78, file: !79, line: 96, baseType: !177, size: 64, offset: 1920)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !78, file: !79, line: 96, baseType: !177, size: 64, offset: 1984)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !78, file: !79, line: 97, baseType: !180, size: 64, offset: 2048)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !78, file: !79, line: 97, baseType: !182, size: 64, offset: 2112)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !78, file: !79, line: 98, baseType: !135, size: 32, offset: 2176)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !78, file: !79, line: 98, baseType: !135, size: 32, offset: 2208)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !78, file: !79, line: 99, baseType: !177, size: 64, offset: 2240)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !78, file: !79, line: 99, baseType: !177, size: 64, offset: 2304)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !78, file: !79, line: 100, baseType: !188, size: 64, offset: 2368)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !138)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !78, file: !79, line: 100, baseType: !191, size: 64, offset: 2432)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !78, file: !79, line: 101, baseType: !135, size: 32, offset: 2496)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !78, file: !79, line: 101, baseType: !135, size: 32, offset: 2528)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !78, file: !79, line: 102, baseType: !177, size: 64, offset: 2560)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !78, file: !79, line: 102, baseType: !177, size: 64, offset: 2624)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !78, file: !79, line: 103, baseType: !197, size: 64, offset: 2688)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !189)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !78, file: !79, line: 103, baseType: !200, size: 64, offset: 2752)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !78, file: !79, line: 104, baseType: !130, size: 64, offset: 2816)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !78, file: !79, line: 105, baseType: !135, size: 32, offset: 2880)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !78, file: !79, line: 106, baseType: !204, size: 128, offset: 2944)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 128, elements: !211)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !79, line: 64, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 61, size: 128, elements: !208)
!208 = !{!209, !210}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !207, file: !79, line: 62, baseType: !123, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !207, file: !79, line: 63, baseType: !71, size: 64, offset: 64)
!211 = !{!212}
!212 = !DISubrange(count: 2)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !78, file: !79, line: 107, baseType: !214, size: 64, offset: 3072)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 64, elements: !211)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !78, file: !79, line: 108, baseType: !71, size: 64, offset: 3136)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !78, file: !79, line: 109, baseType: !217, size: 64, offset: 3200)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!93, !71}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !78, file: !79, line: 111, baseType: !135, size: 32, offset: 3264)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !78, file: !79, line: 112, baseType: !222, size: 320, offset: 3328)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 320, elements: !268)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!93, !226, !76, !71}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !229)
!229 = !{!230, !231, !256, !257, !258, !259, !260, !261, !262, !263, !264}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !228, file: !10, line: 100, baseType: !135, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !228, file: !10, line: 101, baseType: !232, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !235)
!235 = !{!236, !237, !238, !239, !240, !243, !244, !245, !249, !251, !253, !254, !255}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !234, file: !10, line: 84, baseType: !162, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !234, file: !10, line: 85, baseType: !162, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !234, file: !10, line: 86, baseType: !71, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !234, file: !10, line: 87, baseType: !154, size: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !234, file: !10, line: 88, baseType: !241, size: 64, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !234, file: !10, line: 89, baseType: !114, size: 8, offset: 320)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !234, file: !10, line: 90, baseType: !162, size: 64, offset: 384)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !234, file: !10, line: 91, baseType: !246, size: 64, offset: 448)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !247, line: 46, baseType: !248)
!247 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!248 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !234, file: !10, line: 92, baseType: !250, size: 32, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !234, file: !10, line: 93, baseType: !252, size: 32, offset: 544)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !234, file: !10, line: 94, baseType: !232, size: 64, offset: 576)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !234, file: !10, line: 95, baseType: !162, size: 64, offset: 640)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !234, file: !10, line: 96, baseType: !71, size: 64, offset: 704)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !228, file: !10, line: 102, baseType: !162, size: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !228, file: !10, line: 102, baseType: !162, size: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !228, file: !10, line: 103, baseType: !162, size: 64, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !228, file: !10, line: 104, baseType: !72, size: 64, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !228, file: !10, line: 105, baseType: !250, size: 32, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !228, file: !10, line: 105, baseType: !250, size: 32, offset: 416)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !228, file: !10, line: 105, baseType: !250, size: 32, offset: 448)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !228, file: !10, line: 106, baseType: !76, size: 64, offset: 512)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !228, file: !10, line: 107, baseType: !265, size: 64, offset: 576)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!268 = !{!269}
!269 = !DISubrange(count: 5)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !78, file: !79, line: 113, baseType: !271, size: 320, offset: 3648)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 320, elements: !268)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!93, !76, !71}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !78, file: !79, line: 114, baseType: !276, size: 320, offset: 3968)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 320, elements: !268)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !78, file: !79, line: 115, baseType: !250, size: 32, offset: 4288)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !78, file: !79, line: 120, baseType: !265, size: 64, offset: 4352)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !78, file: !79, line: 121, baseType: !250, size: 32, offset: 4416)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF_Gather", file: !282, line: 5, baseType: !283)
!282 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/is/sf/impls/basic/gather/sfgather.c", directory: "/home/users/ndemeye/xSDK")
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF_Allgatherv", file: !284, line: 11, baseType: !285)
!284 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/vec/is/sf/impls/basic/allgatherv/sfallgatherv.h", directory: "/home/users/ndemeye/xSDK")
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !284, line: 8, size: 1280, elements: !286)
!286 = !{!287, !288, !289, !291, !292, !293, !294, !296, !297, !299, !300, !315, !316, !317, !318, !622, !623, !624}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "niranks", scope: !285, file: !284, line: 9, baseType: !152, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ndiranks", scope: !285, file: !284, line: 9, baseType: !152, size: 32, offset: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "iranks", scope: !285, file: !284, line: 9, baseType: !290, size: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "itotal", scope: !285, file: !284, line: 9, baseType: !135, size: 32, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ioffset", scope: !285, file: !284, line: 9, baseType: !180, size: 64, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "irootloc", scope: !285, file: !284, line: 9, baseType: !180, size: 64, offset: 256)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "irootloc_d", scope: !285, file: !284, line: 9, baseType: !295, size: 128, offset: 320)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 128, elements: !211)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "rootbuflen", scope: !285, file: !284, line: 9, baseType: !214, size: 64, offset: 448)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "rootcontig", scope: !285, file: !284, line: 9, baseType: !298, size: 64, offset: 512)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 64, elements: !211)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "rootstart", scope: !285, file: !284, line: 9, baseType: !214, size: 64, offset: 576)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "rootpackopt", scope: !285, file: !284, line: 9, baseType: !301, size: 128, offset: 640)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 128, elements: !211)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFPackOpt", file: !44, line: 64, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSFPackOpt", file: !66, line: 41, size: 576, elements: !305)
!305 = !{!306, !307, !308, !309, !310, !311, !312, !313, !314}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !304, file: !66, line: 42, baseType: !180, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !304, file: !66, line: 43, baseType: !135, size: 32, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !304, file: !66, line: 44, baseType: !180, size: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !304, file: !66, line: 45, baseType: !180, size: 64, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "dx", scope: !304, file: !66, line: 46, baseType: !180, size: 64, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !304, file: !66, line: 46, baseType: !180, size: 64, offset: 320)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "dz", scope: !304, file: !66, line: 46, baseType: !180, size: 64, offset: 384)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !304, file: !66, line: 47, baseType: !180, size: 64, offset: 448)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "Y", scope: !304, file: !66, line: 47, baseType: !180, size: 64, offset: 512)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "rootpackopt_d", scope: !285, file: !284, line: 9, baseType: !301, size: 128, offset: 768)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "rootdups", scope: !285, file: !284, line: 9, baseType: !298, size: 64, offset: 896)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "nrootreqs", scope: !285, file: !284, line: 9, baseType: !135, size: 32, offset: 960)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "avail", scope: !285, file: !284, line: 9, baseType: !319, size: 64, offset: 1024)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFLink", file: !320, line: 6, baseType: !321)
!320 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/vec/is/sf/impls/basic/sfbasic.h", directory: "/home/users/ndemeye/xSDK")
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSFLink", file: !66, line: 52, size: 6592, elements: !323)
!323 = !{!324, !331, !524, !525, !526, !527, !531, !532, !536, !537, !538, !542, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !562, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !602, !603, !605, !606, !607, !608, !615, !616, !618, !619, !620, !621}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "Memcpy", scope: !322, file: !66, line: 53, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!93, !319, !328, !71, !328, !329, !246}
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !30)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "PrePack", scope: !322, file: !66, line: 54, baseType: !332, size: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!93, !335, !319, !523}
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !336, line: 15, baseType: !337)
!336 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !44, line: 66, size: 8640, elements: !339)
!339 = !{!340, !342, !438, !453, !454, !455, !456, !457, !458, !459, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !484, !485, !486, !487, !488, !490, !491, !516, !517, !518, !519, !520, !522}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !338, file: !44, line: 67, baseType: !341, size: 4480)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !79, line: 122, baseType: !78)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !338, file: !44, line: 67, baseType: !343, size: 1344, offset: 4480)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 1344, elements: !131)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSFOps", file: !44, line: 39, size: 1344, elements: !345)
!345 = !{!346, !350, !351, !352, !356, !360, !365, !375, !379, !380, !381, !385, !389, !393, !403, !407, !412, !424, !428, !429, !434}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !344, file: !44, line: 40, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!93, !335}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy", scope: !344, file: !44, line: 41, baseType: !347, size: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "SetUp", scope: !344, file: !44, line: 42, baseType: !347, size: 64, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "SetFromOptions", scope: !344, file: !44, line: 43, baseType: !353, size: 64, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!93, !226, !335}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "View", scope: !344, file: !44, line: 44, baseType: !357, size: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!93, !335, !99}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "Duplicate", scope: !344, file: !44, line: 45, baseType: !361, size: 64, offset: 320)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!93, !335, !364, !335}
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFDuplicateOption", file: !25, line: 77, baseType: !24)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "BcastBegin", scope: !344, file: !44, line: 46, baseType: !366, size: 64, offset: 384)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!93, !335, !369, !328, !329, !328, !71, !372}
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !73, line: 331, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !73, line: 331, flags: DIFlagFwdDecl)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !73, line: 338, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !73, line: 338, flags: DIFlagFwdDecl)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "BcastEnd", scope: !344, file: !44, line: 47, baseType: !376, size: 64, offset: 448)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!93, !335, !369, !329, !71, !372}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ReduceBegin", scope: !344, file: !44, line: 48, baseType: !366, size: 64, offset: 512)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ReduceEnd", scope: !344, file: !44, line: 49, baseType: !376, size: 64, offset: 576)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "FetchAndOpBegin", scope: !344, file: !44, line: 50, baseType: !382, size: 64, offset: 640)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!93, !335, !369, !328, !71, !328, !329, !71, !372}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "FetchAndOpEnd", scope: !344, file: !44, line: 51, baseType: !386, size: 64, offset: 704)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!93, !335, !369, !71, !329, !71, !372}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "BcastToZero", scope: !344, file: !44, line: 52, baseType: !390, size: 64, offset: 768)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!93, !335, !369, !328, !329, !328, !71}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "GetRootRanks", scope: !344, file: !44, line: 53, baseType: !394, size: 64, offset: 832)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!93, !335, !180, !397, !400, !400, !400}
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "GetLeafRanks", scope: !344, file: !44, line: 54, baseType: !404, size: 64, offset: 896)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!93, !335, !180, !397, !400, !400}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "CreateLocalSF", scope: !344, file: !44, line: 55, baseType: !408, size: 64, offset: 960)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!93, !335, !411}
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "GetGraph", scope: !344, file: !44, line: 56, baseType: !413, size: 64, offset: 1024)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!93, !335, !180, !180, !400, !416}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFNode", file: !336, line: 49, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !336, line: 46, size: 64, elements: !421)
!421 = !{!422, !423}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !420, file: !336, line: 47, baseType: !135, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !420, file: !336, line: 48, baseType: !135, size: 32, offset: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEmbeddedRootSF", scope: !344, file: !44, line: 57, baseType: !425, size: 64, offset: 1088)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!93, !335, !135, !401, !411}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEmbeddedLeafSF", scope: !344, file: !44, line: 58, baseType: !425, size: 64, offset: 1152)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "Malloc", scope: !344, file: !44, line: 60, baseType: !430, size: 64, offset: 1216)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!93, !328, !246, !433}
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "Free", scope: !344, file: !44, line: 61, baseType: !435, size: 64, offset: 1280)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!93, !328, !71}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "vscat", scope: !338, file: !44, line: 78, baseType: !439, size: 512, offset: 5824)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !338, file: !44, line: 68, size: 512, elements: !440)
!440 = !{!441, !442, !443, !444, !445, !448, !449, !450, !451, !452}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "from_n", scope: !439, file: !44, line: 69, baseType: !135, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "to_n", scope: !439, file: !44, line: 69, baseType: !135, size: 32, offset: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "beginandendtogether", scope: !439, file: !44, line: 70, baseType: !250, size: 32, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "packongpu", scope: !439, file: !44, line: 71, baseType: !250, size: 32, offset: 96)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "xdata", scope: !439, file: !44, line: 72, baseType: !446, size: 64, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ydata", scope: !439, file: !44, line: 73, baseType: !197, size: 64, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "lsf", scope: !439, file: !44, line: 74, baseType: !335, size: 64, offset: 256)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !439, file: !44, line: 75, baseType: !135, size: 32, offset: 320)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !439, file: !44, line: 76, baseType: !369, size: 64, offset: 384)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "logging", scope: !439, file: !44, line: 77, baseType: !250, size: 32, offset: 448)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "nroots", scope: !338, file: !44, line: 81, baseType: !135, size: 32, offset: 6336)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "nleaves", scope: !338, file: !44, line: 82, baseType: !135, size: 32, offset: 6368)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "mine", scope: !338, file: !44, line: 83, baseType: !180, size: 64, offset: 6400)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "mine_alloc", scope: !338, file: !44, line: 84, baseType: !180, size: 64, offset: 6464)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "minleaf", scope: !338, file: !44, line: 85, baseType: !135, size: 32, offset: 6528)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "maxleaf", scope: !338, file: !44, line: 85, baseType: !135, size: 32, offset: 6560)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "remote", scope: !338, file: !44, line: 86, baseType: !460, size: 64, offset: 6592)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "remote_alloc", scope: !338, file: !44, line: 87, baseType: !460, size: 64, offset: 6656)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "nranks", scope: !338, file: !44, line: 88, baseType: !135, size: 32, offset: 6720)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "ndranks", scope: !338, file: !44, line: 89, baseType: !135, size: 32, offset: 6752)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ranks", scope: !338, file: !44, line: 90, baseType: !290, size: 64, offset: 6784)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "roffset", scope: !338, file: !44, line: 91, baseType: !180, size: 64, offset: 6848)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "rmine", scope: !338, file: !44, line: 92, baseType: !180, size: 64, offset: 6912)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "rmine_d", scope: !338, file: !44, line: 93, baseType: !295, size: 128, offset: 6976)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "leafbuflen", scope: !338, file: !44, line: 96, baseType: !214, size: 64, offset: 7104)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "leafcontig", scope: !338, file: !44, line: 97, baseType: !298, size: 64, offset: 7168)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "leafstart", scope: !338, file: !44, line: 98, baseType: !214, size: 64, offset: 7232)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "leafpackopt", scope: !338, file: !44, line: 99, baseType: !301, size: 128, offset: 7296)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "leafpackopt_d", scope: !338, file: !44, line: 100, baseType: !301, size: 128, offset: 7424)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "leafdups", scope: !338, file: !44, line: 101, baseType: !298, size: 64, offset: 7552)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "nleafreqs", scope: !338, file: !44, line: 103, baseType: !135, size: 32, offset: 7616)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "rremote", scope: !338, file: !44, line: 104, baseType: !180, size: 64, offset: 7680)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "degreeknown", scope: !338, file: !44, line: 105, baseType: !250, size: 32, offset: 7744)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "degree", scope: !338, file: !44, line: 106, baseType: !180, size: 64, offset: 7808)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "degreetmp", scope: !338, file: !44, line: 107, baseType: !180, size: 64, offset: 7872)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "rankorder", scope: !338, file: !44, line: 108, baseType: !250, size: 32, offset: 7936)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ingroup", scope: !338, file: !44, line: 109, baseType: !481, size: 64, offset: 8000)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Group", file: !73, line: 336, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_group_t", file: !73, line: 336, flags: DIFlagFwdDecl)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "outgroup", scope: !338, file: !44, line: 110, baseType: !481, size: 64, offset: 8064)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "multi", scope: !338, file: !44, line: 111, baseType: !335, size: 64, offset: 8128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "graphset", scope: !338, file: !44, line: 112, baseType: !250, size: 32, offset: 8192)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !338, file: !44, line: 113, baseType: !250, size: 32, offset: 8224)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !338, file: !44, line: 114, baseType: !489, size: 32, offset: 8256)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFPattern", file: !25, line: 35, baseType: !37)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "persistent", scope: !338, file: !44, line: 115, baseType: !250, size: 32, offset: 8288)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !338, file: !44, line: 116, baseType: !492, size: 64, offset: 8320)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !493, line: 60, baseType: !494)
!493 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !496, line: 240, size: 640, elements: !497)
!496 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!497 = !{!498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !512, !513, !514, !515}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !495, file: !496, line: 241, baseType: !72, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !495, file: !496, line: 242, baseType: !152, size: 32, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !495, file: !496, line: 243, baseType: !135, size: 32, offset: 96)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !495, file: !496, line: 243, baseType: !135, size: 32, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !495, file: !496, line: 244, baseType: !135, size: 32, offset: 160)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !495, file: !496, line: 244, baseType: !135, size: 32, offset: 192)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !495, file: !496, line: 245, baseType: !180, size: 64, offset: 256)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !495, file: !496, line: 246, baseType: !250, size: 32, offset: 320)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !495, file: !496, line: 247, baseType: !135, size: 32, offset: 352)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !495, file: !496, line: 251, baseType: !135, size: 32, offset: 384)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !495, file: !496, line: 252, baseType: !509, size: 64, offset: 448)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !493, line: 30, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !493, line: 30, flags: DIFlagFwdDecl)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !495, file: !496, line: 253, baseType: !250, size: 32, offset: 512)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !495, file: !496, line: 254, baseType: !135, size: 32, offset: 544)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !495, file: !496, line: 254, baseType: !135, size: 32, offset: 576)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !495, file: !496, line: 255, baseType: !135, size: 32, offset: 608)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_input_stream", scope: !338, file: !44, line: 117, baseType: !250, size: 32, offset: 8384)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "use_gpu_aware_mpi", scope: !338, file: !44, line: 118, baseType: !250, size: 32, offset: 8416)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "use_stream_aware_mpi", scope: !338, file: !44, line: 119, baseType: !250, size: 32, offset: 8448)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "maxResidentThreadsPerGPU", scope: !338, file: !44, line: 120, baseType: !135, size: 32, offset: 8480)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "backend", scope: !338, file: !44, line: 121, baseType: !521, size: 32, offset: 8512)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFBackend", file: !44, line: 37, baseType: !43)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !338, file: !44, line: 122, baseType: !71, size: 64, offset: 8576)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFDirection", file: !44, line: 34, baseType: !50)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "PostUnpack", scope: !322, file: !66, line: 55, baseType: !332, size: 64, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "StartCommunication", scope: !322, file: !66, line: 56, baseType: !332, size: 64, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "FinishCommunication", scope: !322, file: !66, line: 57, baseType: !332, size: 64, offset: 256)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "SyncDevice", scope: !322, file: !66, line: 58, baseType: !528, size: 64, offset: 320)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!93, !319}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "SyncStream", scope: !322, file: !66, line: 59, baseType: !528, size: 64, offset: 384)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy", scope: !322, file: !66, line: 60, baseType: !533, size: 64, offset: 448)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!93, !335, !319}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "BuildDependenceBegin", scope: !322, file: !66, line: 62, baseType: !332, size: 64, offset: 512)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "BuildDependenceEnd", scope: !322, file: !66, line: 63, baseType: !332, size: 64, offset: 576)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "h_Pack", scope: !322, file: !66, line: 65, baseType: !539, size: 64, offset: 640)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!93, !319, !135, !135, !302, !401, !329, !71}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndInsert", scope: !322, file: !66, line: 66, baseType: !543, size: 64, offset: 704)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!93, !319, !135, !135, !302, !401, !71, !329}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndAdd", scope: !322, file: !66, line: 67, baseType: !543, size: 64, offset: 768)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMin", scope: !322, file: !66, line: 68, baseType: !543, size: 64, offset: 832)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMax", scope: !322, file: !66, line: 69, baseType: !543, size: 64, offset: 896)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMinloc", scope: !322, file: !66, line: 70, baseType: !543, size: 64, offset: 960)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMaxloc", scope: !322, file: !66, line: 71, baseType: !543, size: 64, offset: 1024)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndMult", scope: !322, file: !66, line: 72, baseType: !543, size: 64, offset: 1088)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndLAND", scope: !322, file: !66, line: 73, baseType: !543, size: 64, offset: 1152)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndBAND", scope: !322, file: !66, line: 74, baseType: !543, size: 64, offset: 1216)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndLOR", scope: !322, file: !66, line: 75, baseType: !543, size: 64, offset: 1280)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndBOR", scope: !322, file: !66, line: 76, baseType: !543, size: 64, offset: 1344)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndLXOR", scope: !322, file: !66, line: 77, baseType: !543, size: 64, offset: 1408)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "h_UnpackAndBXOR", scope: !322, file: !66, line: 78, baseType: !543, size: 64, offset: 1472)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "h_FetchAndAdd", scope: !322, file: !66, line: 79, baseType: !559, size: 64, offset: 1536)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{!93, !319, !135, !135, !302, !401, !71, !71}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndInsert", scope: !322, file: !66, line: 81, baseType: !563, size: 64, offset: 1600)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{!93, !319, !135, !135, !302, !401, !329, !135, !302, !401, !71}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndAdd", scope: !322, file: !66, line: 82, baseType: !563, size: 64, offset: 1664)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMin", scope: !322, file: !66, line: 83, baseType: !563, size: 64, offset: 1728)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMax", scope: !322, file: !66, line: 84, baseType: !563, size: 64, offset: 1792)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMinloc", scope: !322, file: !66, line: 85, baseType: !563, size: 64, offset: 1856)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMaxloc", scope: !322, file: !66, line: 86, baseType: !563, size: 64, offset: 1920)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndMult", scope: !322, file: !66, line: 87, baseType: !563, size: 64, offset: 1984)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndLAND", scope: !322, file: !66, line: 88, baseType: !563, size: 64, offset: 2048)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndBAND", scope: !322, file: !66, line: 89, baseType: !563, size: 64, offset: 2112)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndLOR", scope: !322, file: !66, line: 90, baseType: !563, size: 64, offset: 2176)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndBOR", scope: !322, file: !66, line: 91, baseType: !563, size: 64, offset: 2240)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndLXOR", scope: !322, file: !66, line: 92, baseType: !563, size: 64, offset: 2304)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "h_ScatterAndBXOR", scope: !322, file: !66, line: 93, baseType: !563, size: 64, offset: 2368)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "h_FetchAndAddLocal", scope: !322, file: !66, line: 95, baseType: !579, size: 64, offset: 2432)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!93, !319, !135, !135, !302, !401, !71, !135, !302, !401, !329, !71}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "deviceinited", scope: !322, file: !66, line: 97, baseType: !250, size: 32, offset: 2496)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !322, file: !66, line: 168, baseType: !152, size: 32, offset: 2528)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !322, file: !66, line: 169, baseType: !369, size: 64, offset: 2560)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "basicunit", scope: !322, file: !66, line: 170, baseType: !369, size: 64, offset: 2624)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "isbuiltin", scope: !322, file: !66, line: 171, baseType: !250, size: 32, offset: 2688)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "unitbytes", scope: !322, file: !66, line: 172, baseType: !246, size: 64, offset: 2752)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !322, file: !66, line: 173, baseType: !135, size: 32, offset: 2816)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "rootdata", scope: !322, file: !66, line: 174, baseType: !329, size: 64, offset: 2880)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "leafdata", scope: !322, file: !66, line: 174, baseType: !329, size: 64, offset: 2944)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "rootmtype", scope: !322, file: !66, line: 175, baseType: !328, size: 32, offset: 3008)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "leafmtype", scope: !322, file: !66, line: 175, baseType: !328, size: 32, offset: 3040)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "rootmtype_mpi", scope: !322, file: !66, line: 178, baseType: !328, size: 32, offset: 3072)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "leafmtype_mpi", scope: !322, file: !66, line: 178, baseType: !328, size: 32, offset: 3104)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "rootdirect", scope: !322, file: !66, line: 179, baseType: !298, size: 64, offset: 3136)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "leafdirect", scope: !322, file: !66, line: 179, baseType: !298, size: 64, offset: 3200)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "rootdirect_mpi", scope: !322, file: !66, line: 180, baseType: !135, size: 32, offset: 3264)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "leafdirect_mpi", scope: !322, file: !66, line: 180, baseType: !135, size: 32, offset: 3296)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "rootdatadirect", scope: !322, file: !66, line: 181, baseType: !600, size: 256, offset: 3328)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 256, elements: !601)
!601 = !{!212, !212}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "leafdatadirect", scope: !322, file: !66, line: 182, baseType: !600, size: 256, offset: 3584)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "rootbuf", scope: !322, file: !66, line: 183, baseType: !604, size: 256, offset: 3840)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 256, elements: !601)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "rootbuf_alloc", scope: !322, file: !66, line: 185, baseType: !604, size: 256, offset: 4096)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "leafbuf", scope: !322, file: !66, line: 186, baseType: !604, size: 256, offset: 4352)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "leafbuf_alloc", scope: !322, file: !66, line: 187, baseType: !604, size: 256, offset: 4608)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "rootreqs", scope: !322, file: !66, line: 188, baseType: !609, size: 512, offset: 4864)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !610, size: 512, elements: !614)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !73, line: 339, baseType: !612)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !73, line: 339, flags: DIFlagFwdDecl)
!614 = !{!212, !212, !212}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "leafreqs", scope: !322, file: !66, line: 189, baseType: !609, size: 512, offset: 5376)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "rootreqsinited", scope: !322, file: !66, line: 190, baseType: !617, size: 256, offset: 5888)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 256, elements: !614)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "leafreqsinited", scope: !322, file: !66, line: 191, baseType: !617, size: 256, offset: 6144)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !322, file: !66, line: 192, baseType: !610, size: 64, offset: 6400)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !322, file: !66, line: 193, baseType: !319, size: 64, offset: 6464)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "use_nvshmem", scope: !322, file: !66, line: 195, baseType: !250, size: 32, offset: 6528)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !285, file: !284, line: 9, baseType: !319, size: 64, offset: 1088)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "displs", scope: !285, file: !284, line: 10, baseType: !290, size: 64, offset: 1152)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "recvcounts", scope: !285, file: !284, line: 10, baseType: !290, size: 64, offset: 1216)
!625 = !{i32 7, !"Dwarf Version", i32 4}
!626 = !{i32 2, !"Debug Info Version", i32 3}
!627 = !{i32 1, !"wchar_size", i32 4}
!628 = !{i32 7, !"PIC Level", i32 2}
!629 = !{i32 7, !"uwtable", i32 1}
!630 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!631 = distinct !DISubprogram(name: "PetscSFBcastBegin_Gather", scope: !282, file: !282, line: 7, type: !367, scopeLine: 8, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !632)
!632 = !{!633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !649, !651, !653, !655, !657, !659, !661, !663, !669}
!633 = !DILocalVariable(name: "sf", arg: 1, scope: !631, file: !282, line: 7, type: !335)
!634 = !DILocalVariable(name: "unit", arg: 2, scope: !631, file: !282, line: 7, type: !369)
!635 = !DILocalVariable(name: "rootmtype", arg: 3, scope: !631, file: !282, line: 7, type: !328)
!636 = !DILocalVariable(name: "rootdata", arg: 4, scope: !631, file: !282, line: 7, type: !329)
!637 = !DILocalVariable(name: "leafmtype", arg: 5, scope: !631, file: !282, line: 7, type: !328)
!638 = !DILocalVariable(name: "leafdata", arg: 6, scope: !631, file: !282, line: 7, type: !71)
!639 = !DILocalVariable(name: "op", arg: 7, scope: !631, file: !282, line: 7, type: !372)
!640 = !DILocalVariable(name: "ierr", scope: !631, file: !282, line: 9, type: !93)
!641 = !DILocalVariable(name: "link", scope: !631, file: !282, line: 10, type: !319)
!642 = !DILocalVariable(name: "sendcount", scope: !631, file: !282, line: 11, type: !152)
!643 = !DILocalVariable(name: "comm", scope: !631, file: !282, line: 12, type: !72)
!644 = !DILocalVariable(name: "rootbuf", scope: !631, file: !282, line: 13, type: !71)
!645 = !DILocalVariable(name: "leafbuf", scope: !631, file: !282, line: 13, type: !71)
!646 = !DILocalVariable(name: "req", scope: !631, file: !282, line: 14, type: !610)
!647 = !DILocalVariable(name: "ierr__", scope: !648, file: !282, line: 17, type: !93)
!648 = distinct !DILexicalBlock(scope: !631, file: !282, line: 17, column: 98)
!649 = !DILocalVariable(name: "ierr__", scope: !650, file: !282, line: 18, type: !93)
!650 = distinct !DILexicalBlock(scope: !631, file: !282, line: 18, column: 67)
!651 = !DILocalVariable(name: "ierr__", scope: !652, file: !282, line: 19, type: !93)
!652 = distinct !DILexicalBlock(scope: !631, file: !282, line: 19, column: 111)
!653 = !DILocalVariable(name: "ierr__", scope: !654, file: !282, line: 20, type: !93)
!654 = distinct !DILexicalBlock(scope: !631, file: !282, line: 20, column: 52)
!655 = !DILocalVariable(name: "ierr__", scope: !656, file: !282, line: 21, type: !93)
!656 = distinct !DILexicalBlock(scope: !631, file: !282, line: 21, column: 49)
!657 = !DILocalVariable(name: "ierr__", scope: !658, file: !282, line: 22, type: !93)
!658 = distinct !DILexicalBlock(scope: !631, file: !282, line: 22, column: 101)
!659 = !DILocalVariable(name: "ierr__", scope: !660, file: !282, line: 23, type: !93)
!660 = distinct !DILexicalBlock(scope: !631, file: !282, line: 23, column: 72)
!661 = !DILocalVariable(name: "_7_errorcode", scope: !662, file: !282, line: 24, type: !93)
!662 = distinct !DILexicalBlock(scope: !631, file: !282, line: 24, column: 91)
!663 = !DILocalVariable(name: "_7_errorstring", scope: !664, file: !282, line: 24, type: !666)
!664 = distinct !DILexicalBlock(scope: !665, file: !282, line: 24, column: 91)
!665 = distinct !DILexicalBlock(scope: !662, file: !282, line: 24, column: 91)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 2048, elements: !667)
!667 = !{!668}
!668 = !DISubrange(count: 256)
!669 = !DILocalVariable(name: "_7_resultlen", scope: !664, file: !282, line: 24, type: !152)
!670 = !DILocation(line: 0, scope: !631)
!671 = !DILocation(line: 10, column: 3, scope: !631)
