; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/utils/lgc.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/utils/lgc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.__jmp_buf_tag = type { [8 x i64], i32, %struct.__sigset_t }
%struct.__sigset_t = type { [16 x i64] }
%struct.ompi_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!4 = !{!5, !11, !26, !32, !52, !59}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 170, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 81, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!14 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!24 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!25 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 663, baseType: !7, size: 32, elements: !28)
!27 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!28 = !{!29, !30, !31}
!29 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!31 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !33)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51}
!34 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!35 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!37 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!38 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!39 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!40 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!41 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!42 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!43 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!44 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!45 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!46 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!47 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!48 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!49 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!50 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!51 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !53, line: 141, baseType: !7, size: 32, elements: !54)
!53 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdraw.h", directory: "/home/users/ndemeye/xSDK")
!54 = !{!55, !56, !57, !58}
!55 = !DIEnumerator(name: "PETSC_DRAW_MARKER_CROSS", value: 0, isUnsigned: true)
!56 = !DIEnumerator(name: "PETSC_DRAW_MARKER_POINT", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "PETSC_DRAW_MARKER_PLUS", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_DRAW_MARKER_CIRCLE", value: 3, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 58, baseType: !7, size: 32, elements: !60)
!60 = !{!61}
!61 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!62 = !{!63, !67, !68, !104, !272, !154, !75, !313, !144, !316, !238, !319, !320, !130, !321, !7}
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !64, line: 330, baseType: !65)
!64 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !64, line: 330, flags: DIFlagFwdDecl)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !71, line: 73, size: 4480, elements: !72)
!71 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!72 = !{!73, !76, !125, !126, !128, !131, !132, !133, !134, !142, !143, !145, !149, !153, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !166, !167, !168, !170, !171, !173, !175, !176, !177, !178, !179, !182, !184, !185, !186, !187, !188, !191, !193, !194, !195, !205, !207, !208, !212, !213, !262, !267, !269, !270, !271}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !70, file: !71, line: 74, baseType: !74, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !75)
!75 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !70, file: !71, line: 75, baseType: !77, size: 448, offset: 64)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 448, elements: !123)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !71, line: 53, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !71, line: 45, size: 448, elements: !80)
!80 = !{!81, !87, !95, !100, !107, !111, !118}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !79, file: !71, line: 46, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!85, !68, !86}
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !75)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !79, file: !71, line: 47, baseType: !88, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!85, !68, !91}
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !92, line: 16, baseType: !93)
!92 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !92, line: 16, flags: DIFlagFwdDecl)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !79, file: !71, line: 48, baseType: !96, size: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!85, !99}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !79, file: !71, line: 49, baseType: !101, size: 64, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!85, !68, !104, !68}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!106 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !79, file: !71, line: 50, baseType: !108, size: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!85, !68, !104, !99}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !79, file: !71, line: 51, baseType: !112, size: 64, offset: 320)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!85, !68, !104, !115}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{null}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !79, file: !71, line: 52, baseType: !119, size: 64, offset: 384)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!85, !68, !104, !122}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!123 = !{!124}
!124 = !DISubrange(count: 1)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !70, file: !71, line: 76, baseType: !63, size: 64, offset: 512)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !70, file: !71, line: 77, baseType: !127, size: 32, offset: 576)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !75)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !70, file: !71, line: 78, baseType: !129, size: 64, offset: 640)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !130)
!130 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !70, file: !71, line: 78, baseType: !129, size: 64, offset: 704)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !70, file: !71, line: 78, baseType: !129, size: 64, offset: 768)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !70, file: !71, line: 78, baseType: !129, size: 64, offset: 832)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !70, file: !71, line: 79, baseType: !135, size: 64, offset: 896)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !138, line: 27, baseType: !139)
!138 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !140, line: 43, baseType: !141)
!140 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!141 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !70, file: !71, line: 80, baseType: !127, size: 32, offset: 960)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !70, file: !71, line: 81, baseType: !144, size: 32, offset: 992)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !75)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !70, file: !71, line: 82, baseType: !146, size: 64, offset: 1024)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !70, file: !71, line: 83, baseType: !150, size: 64, offset: 1088)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !70, file: !71, line: 84, baseType: !154, size: 64, offset: 1152)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !70, file: !71, line: 85, baseType: !154, size: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !70, file: !71, line: 86, baseType: !154, size: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !70, file: !71, line: 87, baseType: !154, size: 64, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !70, file: !71, line: 88, baseType: !68, size: 64, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !70, file: !71, line: 89, baseType: !135, size: 64, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !70, file: !71, line: 90, baseType: !154, size: 64, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !70, file: !71, line: 91, baseType: !154, size: 64, offset: 1600)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !70, file: !71, line: 92, baseType: !127, size: 32, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !70, file: !71, line: 93, baseType: !67, size: 64, offset: 1728)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !70, file: !71, line: 94, baseType: !165, size: 64, offset: 1792)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !136)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !70, file: !71, line: 95, baseType: !127, size: 32, offset: 1856)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !70, file: !71, line: 95, baseType: !127, size: 32, offset: 1888)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !70, file: !71, line: 96, baseType: !169, size: 64, offset: 1920)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !70, file: !71, line: 96, baseType: !169, size: 64, offset: 1984)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !70, file: !71, line: 97, baseType: !172, size: 64, offset: 2048)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !70, file: !71, line: 97, baseType: !174, size: 64, offset: 2112)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !70, file: !71, line: 98, baseType: !127, size: 32, offset: 2176)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !70, file: !71, line: 98, baseType: !127, size: 32, offset: 2208)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !70, file: !71, line: 99, baseType: !169, size: 64, offset: 2240)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !70, file: !71, line: 99, baseType: !169, size: 64, offset: 2304)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !70, file: !71, line: 100, baseType: !180, size: 64, offset: 2368)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !130)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !70, file: !71, line: 100, baseType: !183, size: 64, offset: 2432)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !70, file: !71, line: 101, baseType: !127, size: 32, offset: 2496)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !70, file: !71, line: 101, baseType: !127, size: 32, offset: 2528)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !70, file: !71, line: 102, baseType: !169, size: 64, offset: 2560)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !70, file: !71, line: 102, baseType: !169, size: 64, offset: 2624)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !70, file: !71, line: 103, baseType: !189, size: 64, offset: 2688)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !181)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !70, file: !71, line: 103, baseType: !192, size: 64, offset: 2752)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !70, file: !71, line: 104, baseType: !122, size: 64, offset: 2816)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !70, file: !71, line: 105, baseType: !127, size: 32, offset: 2880)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !70, file: !71, line: 106, baseType: !196, size: 128, offset: 2944)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 128, elements: !203)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !71, line: 64, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !71, line: 61, size: 128, elements: !200)
!200 = !{!201, !202}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !199, file: !71, line: 62, baseType: !115, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !199, file: !71, line: 63, baseType: !67, size: 64, offset: 64)
!203 = !{!204}
!204 = !DISubrange(count: 2)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !70, file: !71, line: 107, baseType: !206, size: 64, offset: 3072)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 64, elements: !203)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !70, file: !71, line: 108, baseType: !67, size: 64, offset: 3136)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !70, file: !71, line: 109, baseType: !209, size: 64, offset: 3200)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!85, !67}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !70, file: !71, line: 111, baseType: !127, size: 32, offset: 3264)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !70, file: !71, line: 112, baseType: !214, size: 320, offset: 3328)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 320, elements: !260)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!85, !218, !68, !67}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !221)
!221 = !{!222, !223, !248, !249, !250, !251, !252, !253, !254, !255, !256}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !220, file: !12, line: 100, baseType: !127, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !220, file: !12, line: 101, baseType: !224, size: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !227)
!227 = !{!228, !229, !230, !231, !232, !235, !236, !237, !241, !243, !245, !246, !247}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !226, file: !12, line: 84, baseType: !154, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !226, file: !12, line: 85, baseType: !154, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !226, file: !12, line: 86, baseType: !67, size: 64, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !226, file: !12, line: 87, baseType: !146, size: 64, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !226, file: !12, line: 88, baseType: !233, size: 64, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !226, file: !12, line: 89, baseType: !106, size: 8, offset: 320)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !226, file: !12, line: 90, baseType: !154, size: 64, offset: 384)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !226, file: !12, line: 91, baseType: !238, size: 64, offset: 448)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !239, line: 46, baseType: !240)
!239 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!240 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !226, file: !12, line: 92, baseType: !242, size: 32, offset: 512)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !226, file: !12, line: 93, baseType: !244, size: 32, offset: 544)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !226, file: !12, line: 94, baseType: !224, size: 64, offset: 576)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !226, file: !12, line: 95, baseType: !154, size: 64, offset: 640)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !226, file: !12, line: 96, baseType: !67, size: 64, offset: 704)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !220, file: !12, line: 102, baseType: !154, size: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !220, file: !12, line: 102, baseType: !154, size: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !220, file: !12, line: 103, baseType: !154, size: 64, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !220, file: !12, line: 104, baseType: !63, size: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !220, file: !12, line: 105, baseType: !242, size: 32, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !220, file: !12, line: 105, baseType: !242, size: 32, offset: 416)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !220, file: !12, line: 105, baseType: !242, size: 32, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !220, file: !12, line: 106, baseType: !68, size: 64, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !220, file: !12, line: 107, baseType: !257, size: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!260 = !{!261}
!261 = !DISubrange(count: 5)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !70, file: !71, line: 113, baseType: !263, size: 320, offset: 3648)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 320, elements: !260)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!85, !68, !67}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !70, file: !71, line: 114, baseType: !268, size: 320, offset: 3968)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 320, elements: !260)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !70, file: !71, line: 115, baseType: !242, size: 32, offset: 4288)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !70, file: !71, line: 120, baseType: !257, size: 64, offset: 4352)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !70, file: !71, line: 121, baseType: !242, size: 32, offset: 4416)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawLG", file: !273, line: 43, baseType: !274)
!273 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdrawtypes.h", directory: "/home/users/ndemeye/xSDK")
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDrawLG", file: !276, line: 12, size: 5504, elements: !277)
!276 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/sys/classes/draw/utils/lgimpl.h", directory: "/home/users/ndemeye/xSDK")
!277 = !{!278, !280, !282, !286, !290, !291, !292, !296, !300, !301, !302, !303, !304, !305, !306, !307, !308, !310, !311}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !275, file: !276, line: 13, baseType: !279, size: 4480)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !71, line: 122, baseType: !70)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !275, file: !276, line: 13, baseType: !281, size: 32, offset: 4480)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 32, elements: !123)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !275, file: !276, line: 14, baseType: !283, size: 64, offset: 4544)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!85, !272}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !275, file: !276, line: 15, baseType: !287, size: 64, offset: 4608)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!85, !272, !91}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !275, file: !276, line: 16, baseType: !75, size: 32, offset: 4672)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !275, file: !276, line: 16, baseType: !75, size: 32, offset: 4704)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !275, file: !276, line: 17, baseType: !293, size: 64, offset: 4736)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDraw", file: !273, line: 25, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDraw", file: !273, line: 25, flags: DIFlagFwdDecl)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "axis", scope: !275, file: !276, line: 18, baseType: !297, size: 64, offset: 4800)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawAxis", file: !273, line: 34, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDrawAxis", file: !273, line: 34, flags: DIFlagFwdDecl)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !275, file: !276, line: 19, baseType: !181, size: 64, offset: 4864)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !275, file: !276, line: 19, baseType: !181, size: 64, offset: 4928)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !275, file: !276, line: 19, baseType: !181, size: 64, offset: 4992)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !275, file: !276, line: 19, baseType: !181, size: 64, offset: 5056)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !275, file: !276, line: 19, baseType: !180, size: 64, offset: 5120)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !275, file: !276, line: 19, baseType: !180, size: 64, offset: 5184)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "nopts", scope: !275, file: !276, line: 20, baseType: !75, size: 32, offset: 5248)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !275, file: !276, line: 20, baseType: !75, size: 32, offset: 5280)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !275, file: !276, line: 20, baseType: !309, size: 64, offset: 5312)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "use_markers", scope: !275, file: !276, line: 21, baseType: !242, size: 32, offset: 5376)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "legend", scope: !275, file: !276, line: 22, baseType: !312, size: 64, offset: 5440)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !64, line: 338, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !64, line: 338, flags: DIFlagFwdDecl)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !64, line: 331, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !64, line: 331, flags: DIFlagFwdDecl)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectDestroyFunction", file: !71, line: 130, baseType: !96)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectViewFunction", file: !71, line: 131, baseType: !88)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEnum", file: !6, line: 58, baseType: !59)
!323 = !{!0}
!324 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/utils/lgc.c", directory: "/home/users/ndemeye/xSDK")
!325 = !{i32 7, !"Dwarf Version", i32 4}
!326 = !{i32 2, !"Debug Info Version", i32 3}
!327 = !{i32 1, !"wchar_size", i32 4}
!328 = !{i32 7, !"PIC Level", i32 2}
!329 = !{i32 7, !"uwtable", i32 1}
!330 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!331 = distinct !DISubprogram(name: "PetscDrawLGGetAxis", scope: !324, file: !324, line: 25, type: !332, scopeLine: 26, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !335)
!332 = !DISubroutineType(types: !333)
!333 = !{!85, !272, !334}
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!335 = !{!336, !337}
!336 = !DILocalVariable(name: "lg", arg: 1, scope: !331, file: !324, line: 25, type: !272)
!337 = !DILocalVariable(name: "axis", arg: 2, scope: !331, file: !324, line: 25, type: !334)
!338 = !DILocation(line: 0, scope: !331)
!339 = !DILocation(line: 27, column: 3, scope: !340)
!340 = distinct !DILexicalBlock(scope: !341, file: !324, line: 27, column: 3)
!341 = distinct !DILexicalBlock(scope: !342, file: !324, line: 27, column: 3)
!342 = distinct !DILexicalBlock(scope: !331, file: !324, line: 27, column: 3)
!343 = !{!344, !344, i64 0}
!344 = !{!"any pointer", !345, i64 0}
!345 = !{!"omnipotent char", !346, i64 0}
!346 = !{!"Simple C/C++ TBAA"}
!347 = !DILocation(line: 27, column: 3, scope: !341)
!348 = !DILocation(line: 27, column: 3, scope: !349)
!349 = distinct !DILexicalBlock(scope: !350, file: !324, line: 27, column: 3)
!350 = distinct !DILexicalBlock(scope: !340, file: !324, line: 27, column: 3)
!351 = !{!352, !353, i64 1536}
!352 = !{!"", !345, i64 0, !345, i64 512, !345, i64 1024, !345, i64 1280, !353, i64 1536, !353, i64 1540, !345, i64 1544}
!353 = !{!"int", !345, i64 0}
!354 = !DILocation(line: 27, column: 3, scope: !350)
!355 = !DILocation(line: 27, column: 3, scope: !356)
!356 = distinct !DILexicalBlock(scope: !349, file: !324, line: 27, column: 3)
!357 = !{!353, !353, i64 0}
!358 = !{!352, !353, i64 1540}
!359 = !DILocation(line: 28, column: 3, scope: !360)
!360 = distinct !DILexicalBlock(scope: !361, file: !324, line: 28, column: 3)
!361 = distinct !DILexicalBlock(scope: !331, file: !324, line: 28, column: 3)
!362 = !DILocation(line: 28, column: 3, scope: !361)
!363 = !DILocation(line: 28, column: 3, scope: !364)
!364 = distinct !DILexicalBlock(scope: !361, file: !324, line: 28, column: 3)
!365 = !DILocation(line: 28, column: 3, scope: !366)
!366 = distinct !DILexicalBlock(scope: !361, file: !324, line: 28, column: 3)
!367 = !{!368, !353, i64 0}
!368 = !{!"_p_PetscObject", !353, i64 0, !345, i64 8, !344, i64 64, !353, i64 72, !369, i64 80, !369, i64 88, !369, i64 96, !369, i64 104, !370, i64 112, !353, i64 120, !353, i64 124, !344, i64 128, !344, i64 136, !344, i64 144, !344, i64 152, !344, i64 160, !344, i64 168, !344, i64 176, !370, i64 184, !344, i64 192, !344, i64 200, !353, i64 208, !344, i64 216, !370, i64 224, !353, i64 232, !353, i64 236, !344, i64 240, !344, i64 248, !344, i64 256, !344, i64 264, !353, i64 272, !353, i64 276, !344, i64 280, !344, i64 288, !344, i64 296, !344, i64 304, !353, i64 312, !353, i64 316, !344, i64 320, !344, i64 328, !344, i64 336, !344, i64 344, !344, i64 352, !353, i64 360, !345, i64 368, !345, i64 384, !344, i64 392, !344, i64 400, !353, i64 408, !345, i64 416, !345, i64 456, !345, i64 496, !345, i64 536, !344, i64 544, !345, i64 552}
!369 = !{!"double", !345, i64 0}
!370 = !{!"long", !345, i64 0}
!371 = !DILocation(line: 28, column: 3, scope: !372)
!372 = distinct !DILexicalBlock(scope: !373, file: !324, line: 28, column: 3)
!373 = distinct !DILexicalBlock(scope: !366, file: !324, line: 28, column: 3)
!374 = !DILocation(line: 28, column: 3, scope: !373)
!375 = !DILocation(line: 29, column: 3, scope: !376)
!376 = distinct !DILexicalBlock(scope: !377, file: !324, line: 29, column: 3)
!377 = distinct !DILexicalBlock(scope: !331, file: !324, line: 29, column: 3)
!378 = !DILocation(line: 29, column: 3, scope: !377)
!379 = !DILocation(line: 29, column: 3, scope: !380)
!380 = distinct !DILexicalBlock(scope: !377, file: !324, line: 29, column: 3)
!381 = !DILocation(line: 30, column: 15, scope: !331)
!382 = !{!383, !344, i64 600}
!383 = !{!"_p_PetscDrawLG", !368, i64 0, !345, i64 560, !344, i64 568, !344, i64 576, !353, i64 584, !353, i64 588, !344, i64 592, !344, i64 600, !369, i64 608, !369, i64 616, !369, i64 624, !369, i64 632, !344, i64 640, !344, i64 648, !353, i64 656, !353, i64 660, !344, i64 664, !345, i64 672, !344, i64 680}
!384 = !DILocation(line: 30, column: 9, scope: !331)
!385 = !DILocation(line: 31, column: 3, scope: !386)
!386 = distinct !DILexicalBlock(scope: !387, file: !324, line: 31, column: 3)
!387 = distinct !DILexicalBlock(scope: !388, file: !324, line: 31, column: 3)
!388 = distinct !DILexicalBlock(scope: !331, file: !324, line: 31, column: 3)
!389 = !DILocation(line: 31, column: 3, scope: !387)
!390 = !DILocation(line: 31, column: 3, scope: !391)
!391 = distinct !DILexicalBlock(scope: !392, file: !324, line: 31, column: 3)
!392 = distinct !DILexicalBlock(scope: !386, file: !324, line: 31, column: 3)
!393 = !DILocation(line: 31, column: 3, scope: !392)
!394 = !DILocation(line: 31, column: 3, scope: !395)
!395 = distinct !DILexicalBlock(scope: !396, file: !324, line: 31, column: 3)
!396 = distinct !DILexicalBlock(scope: !391, file: !324, line: 31, column: 3)
!397 = !{!352, !345, i64 1544}
!398 = !DILocation(line: 31, column: 3, scope: !396)
!399 = !DILocation(line: 31, column: 3, scope: !400)
!400 = distinct !DILexicalBlock(scope: !395, file: !324, line: 31, column: 3)
!401 = !DILocation(line: 31, column: 3, scope: !402)
!402 = distinct !DILexicalBlock(scope: !391, file: !324, line: 31, column: 3)
!403 = !DILocation(line: 31, column: 3, scope: !404)
!404 = distinct !DILexicalBlock(scope: !402, file: !324, line: 31, column: 3)
!405 = !DILocation(line: 31, column: 3, scope: !406)
!406 = distinct !DILexicalBlock(scope: !407, file: !324, line: 31, column: 3)
!407 = distinct !DILexicalBlock(scope: !404, file: !324, line: 31, column: 3)
!408 = !DILocation(line: 31, column: 3, scope: !407)
!409 = !DILocation(line: 31, column: 3, scope: !410)
!410 = distinct !DILexicalBlock(scope: !406, file: !324, line: 31, column: 3)
!411 = !DILocation(line: 32, column: 1, scope: !331)
!412 = !DISubprogram(name: "PetscError", scope: !27, file: !27, line: 668, type: !413, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !415)
!413 = !DISubroutineType(types: !414)
!414 = !{!85, !65, !75, !104, !104, !75, !26, !104, null}
!415 = !{}
!416 = !DISubprogram(name: "PetscCheckPointer", scope: !71, file: !71, line: 183, type: !417, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !415)
!417 = !DISubroutineType(types: !418)
!418 = !{!5, !419, !32}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!421 = distinct !DISubprogram(name: "PetscDrawLGGetDraw", scope: !324, file: !324, line: 49, type: !422, scopeLine: 50, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !425)
!422 = !DISubroutineType(types: !423)
!423 = !{!85, !272, !424}
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!425 = !{!426, !427}
!426 = !DILocalVariable(name: "lg", arg: 1, scope: !421, file: !324, line: 49, type: !272)
!427 = !DILocalVariable(name: "draw", arg: 2, scope: !421, file: !324, line: 49, type: !424)
!428 = !DILocation(line: 0, scope: !421)
!429 = !DILocation(line: 51, column: 3, scope: !430)
!430 = distinct !DILexicalBlock(scope: !431, file: !324, line: 51, column: 3)
!431 = distinct !DILexicalBlock(scope: !432, file: !324, line: 51, column: 3)
!432 = distinct !DILexicalBlock(scope: !421, file: !324, line: 51, column: 3)
!433 = !DILocation(line: 51, column: 3, scope: !431)
!434 = !DILocation(line: 51, column: 3, scope: !435)
!435 = distinct !DILexicalBlock(scope: !436, file: !324, line: 51, column: 3)
!436 = distinct !DILexicalBlock(scope: !430, file: !324, line: 51, column: 3)
!437 = !DILocation(line: 51, column: 3, scope: !436)
!438 = !DILocation(line: 51, column: 3, scope: !439)
!439 = distinct !DILexicalBlock(scope: !435, file: !324, line: 51, column: 3)
!440 = !DILocation(line: 52, column: 3, scope: !441)
!441 = distinct !DILexicalBlock(scope: !442, file: !324, line: 52, column: 3)
!442 = distinct !DILexicalBlock(scope: !421, file: !324, line: 52, column: 3)
!443 = !DILocation(line: 52, column: 3, scope: !442)
!444 = !DILocation(line: 52, column: 3, scope: !445)
!445 = distinct !DILexicalBlock(scope: !442, file: !324, line: 52, column: 3)
!446 = !DILocation(line: 52, column: 3, scope: !447)
!447 = distinct !DILexicalBlock(scope: !442, file: !324, line: 52, column: 3)
!448 = !DILocation(line: 52, column: 3, scope: !449)
!449 = distinct !DILexicalBlock(scope: !450, file: !324, line: 52, column: 3)
!450 = distinct !DILexicalBlock(scope: !447, file: !324, line: 52, column: 3)
!451 = !DILocation(line: 52, column: 3, scope: !450)
!452 = !DILocation(line: 53, column: 3, scope: !453)
!453 = distinct !DILexicalBlock(scope: !454, file: !324, line: 53, column: 3)
!454 = distinct !DILexicalBlock(scope: !421, file: !324, line: 53, column: 3)
!455 = !DILocation(line: 53, column: 3, scope: !454)
!456 = !DILocation(line: 53, column: 3, scope: !457)
!457 = distinct !DILexicalBlock(scope: !454, file: !324, line: 53, column: 3)
!458 = !DILocation(line: 54, column: 15, scope: !421)
!459 = !{!383, !344, i64 592}
!460 = !DILocation(line: 54, column: 9, scope: !421)
!461 = !DILocation(line: 55, column: 3, scope: !462)
!462 = distinct !DILexicalBlock(scope: !463, file: !324, line: 55, column: 3)
!463 = distinct !DILexicalBlock(scope: !464, file: !324, line: 55, column: 3)
!464 = distinct !DILexicalBlock(scope: !421, file: !324, line: 55, column: 3)
!465 = !DILocation(line: 55, column: 3, scope: !463)
!466 = !DILocation(line: 55, column: 3, scope: !467)
!467 = distinct !DILexicalBlock(scope: !468, file: !324, line: 55, column: 3)
!468 = distinct !DILexicalBlock(scope: !462, file: !324, line: 55, column: 3)
!469 = !DILocation(line: 55, column: 3, scope: !468)
!470 = !DILocation(line: 55, column: 3, scope: !471)
!471 = distinct !DILexicalBlock(scope: !472, file: !324, line: 55, column: 3)
!472 = distinct !DILexicalBlock(scope: !467, file: !324, line: 55, column: 3)
!473 = !DILocation(line: 55, column: 3, scope: !472)
!474 = !DILocation(line: 55, column: 3, scope: !475)
!475 = distinct !DILexicalBlock(scope: !471, file: !324, line: 55, column: 3)
!476 = !DILocation(line: 55, column: 3, scope: !477)
!477 = distinct !DILexicalBlock(scope: !467, file: !324, line: 55, column: 3)
!478 = !DILocation(line: 55, column: 3, scope: !479)
!479 = distinct !DILexicalBlock(scope: !477, file: !324, line: 55, column: 3)
!480 = !DILocation(line: 55, column: 3, scope: !481)
!481 = distinct !DILexicalBlock(scope: !482, file: !324, line: 55, column: 3)
!482 = distinct !DILexicalBlock(scope: !479, file: !324, line: 55, column: 3)
!483 = !DILocation(line: 55, column: 3, scope: !482)
!484 = !DILocation(line: 55, column: 3, scope: !485)
!485 = distinct !DILexicalBlock(scope: !481, file: !324, line: 55, column: 3)
!486 = !DILocation(line: 56, column: 1, scope: !421)
!487 = distinct !DISubprogram(name: "PetscDrawLGSPDraw", scope: !324, file: !324, line: 74, type: !488, scopeLine: 75, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !493)
!488 = !DISubroutineType(types: !489)
!489 = !{!85, !272, !490}
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawSP", file: !273, line: 52, baseType: !491)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDrawSP", file: !273, line: 52, flags: DIFlagFwdDecl)
!493 = !{!494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !507, !509, !515, !516, !518, !520, !522, !524, !526, !548, !554, !555, !556, !557, !559, !563, !570, !572, !575, !576, !580, !582, !584, !587, !588, !589, !590, !598, !602, !610, !614, !616, !619, !620, !624, !626, !628}
!494 = !DILocalVariable(name: "lg", arg: 1, scope: !487, file: !324, line: 74, type: !272)
!495 = !DILocalVariable(name: "spin", arg: 2, scope: !487, file: !324, line: 74, type: !490)
!496 = !DILocalVariable(name: "sp", scope: !487, file: !324, line: 76, type: !272)
!497 = !DILocalVariable(name: "xmin", scope: !487, file: !324, line: 77, type: !181)
!498 = !DILocalVariable(name: "xmax", scope: !487, file: !324, line: 77, type: !181)
!499 = !DILocalVariable(name: "ymin", scope: !487, file: !324, line: 77, type: !181)
!500 = !DILocalVariable(name: "ymax", scope: !487, file: !324, line: 77, type: !181)
!501 = !DILocalVariable(name: "ierr", scope: !487, file: !324, line: 78, type: !85)
!502 = !DILocalVariable(name: "isnull", scope: !487, file: !324, line: 79, type: !242)
!503 = !DILocalVariable(name: "rank", scope: !487, file: !324, line: 80, type: !144)
!504 = !DILocalVariable(name: "draw", scope: !487, file: !324, line: 81, type: !293)
!505 = !DILocalVariable(name: "ierr__", scope: !506, file: !324, line: 86, type: !85)
!506 = distinct !DILexicalBlock(scope: !487, file: !324, line: 86, column: 43)
!507 = !DILocalVariable(name: "_7_errorcode", scope: !508, file: !324, line: 88, type: !85)
!508 = distinct !DILexicalBlock(scope: !487, file: !324, line: 88, column: 64)
!509 = !DILocalVariable(name: "_7_errorstring", scope: !510, file: !324, line: 88, type: !512)
!510 = distinct !DILexicalBlock(scope: !511, file: !324, line: 88, column: 64)
!511 = distinct !DILexicalBlock(scope: !508, file: !324, line: 88, column: 64)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 2048, elements: !513)
!513 = !{!514}
!514 = !DISubrange(count: 256)
!515 = !DILocalVariable(name: "_7_resultlen", scope: !510, file: !324, line: 88, type: !144)
!516 = !DILocalVariable(name: "ierr__", scope: !517, file: !324, line: 91, type: !85)
!517 = distinct !DILexicalBlock(scope: !487, file: !324, line: 91, column: 44)
!518 = !DILocalVariable(name: "ierr__", scope: !519, file: !324, line: 92, type: !85)
!519 = distinct !DILexicalBlock(scope: !487, file: !324, line: 92, column: 31)
!520 = !DILocalVariable(name: "ierr__", scope: !521, file: !324, line: 96, type: !85)
!521 = distinct !DILexicalBlock(scope: !487, file: !324, line: 96, column: 63)
!522 = !DILocalVariable(name: "ierr__", scope: !523, file: !324, line: 97, type: !85)
!523 = distinct !DILexicalBlock(scope: !487, file: !324, line: 97, column: 38)
!524 = !DILocalVariable(name: "_Petsc_ierr", scope: !525, file: !324, line: 99, type: !85)
!525 = distinct !DILexicalBlock(scope: !487, file: !324, line: 99, column: 10)
!526 = !DILocalVariable(name: "_Petsc_jmpbuf", scope: !525, file: !324, line: 99, type: !527)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !528, line: 45, baseType: !529)
!528 = !DIFile(filename: "/usr/include/setjmp.h", directory: "")
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !530, size: 1600, elements: !123)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__jmp_buf_tag", file: !528, line: 33, size: 1600, elements: !531)
!531 = !{!532, !538, !539}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "__jmpbuf", scope: !530, file: !528, line: 39, baseType: !533, size: 512)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "__jmp_buf", file: !534, line: 31, baseType: !535)
!534 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/setjmp.h", directory: "")
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 512, elements: !536)
!536 = !{!537}
!537 = !DISubrange(count: 8)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "__mask_was_saved", scope: !530, file: !528, line: 40, baseType: !75, size: 32, offset: 512)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "__saved_mask", scope: !530, file: !528, line: 41, baseType: !540, size: 1024, offset: 576)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !541, line: 8, baseType: !542)
!541 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__sigset_t.h", directory: "")
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !541, line: 5, size: 1024, elements: !543)
!543 = !{!544}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !542, file: !541, line: 7, baseType: !545, size: 1024)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 1024, elements: !546)
!546 = !{!547}
!547 = !DISubrange(count: 16)
!548 = !DILocalVariable(name: "_Petsc_xioerrhdl", scope: !525, file: !324, line: 99, type: !549)
!549 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !550)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscXIOErrorHandler", file: !53, line: 325, baseType: !551)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{null, !67}
!554 = !DILocalVariable(name: "_Petsc_isdrawx", scope: !525, file: !324, line: 99, type: !242)
!555 = !DILocalVariable(name: "_Petsc_xioerr", scope: !525, file: !324, line: 99, type: !242)
!556 = !DILocalVariable(name: "_Petsc_xioerr_local", scope: !525, file: !324, line: 99, type: !242)
!557 = !DILocalVariable(name: "ierr__", scope: !558, file: !324, line: 99, type: !85)
!558 = distinct !DILexicalBlock(scope: !525, file: !324, line: 99, column: 10)
!559 = !DILocalVariable(name: "ierr__", scope: !560, file: !324, line: 99, type: !85)
!560 = distinct !DILexicalBlock(scope: !561, file: !324, line: 99, column: 10)
!561 = distinct !DILexicalBlock(scope: !562, file: !324, line: 99, column: 10)
!562 = distinct !DILexicalBlock(scope: !525, file: !324, line: 99, column: 10)
!563 = !DILocalVariable(name: "ierr__", scope: !564, file: !324, line: 99, type: !85)
!564 = distinct !DILexicalBlock(scope: !565, file: !324, line: 99, column: 10)
!565 = distinct !DILexicalBlock(scope: !566, file: !324, line: 99, column: 10)
!566 = distinct !DILexicalBlock(scope: !567, file: !324, line: 99, column: 10)
!567 = distinct !DILexicalBlock(scope: !568, file: !324, line: 99, column: 10)
!568 = distinct !DILexicalBlock(scope: !569, file: !324, line: 99, column: 10)
!569 = distinct !DILexicalBlock(scope: !561, file: !324, line: 99, column: 10)
!570 = !DILocalVariable(name: "_7_errorcode", scope: !571, file: !324, line: 99, type: !85)
!571 = distinct !DILexicalBlock(scope: !565, file: !324, line: 99, column: 10)
!572 = !DILocalVariable(name: "_7_errorstring", scope: !573, file: !324, line: 99, type: !512)
!573 = distinct !DILexicalBlock(scope: !574, file: !324, line: 99, column: 10)
!574 = distinct !DILexicalBlock(scope: !571, file: !324, line: 99, column: 10)
!575 = !DILocalVariable(name: "_7_resultlen", scope: !573, file: !324, line: 99, type: !144)
!576 = !DILocalVariable(name: "ierr__", scope: !577, file: !324, line: 99, type: !85)
!577 = distinct !DILexicalBlock(scope: !578, file: !324, line: 99, column: 10)
!578 = distinct !DILexicalBlock(scope: !579, file: !324, line: 99, column: 10)
!579 = distinct !DILexicalBlock(scope: !565, file: !324, line: 99, column: 10)
!580 = !DILocalVariable(name: "ierr__", scope: !581, file: !324, line: 99, type: !85)
!581 = distinct !DILexicalBlock(scope: !568, file: !324, line: 99, column: 10)
!582 = !DILocalVariable(name: "ierr__", scope: !583, file: !324, line: 99, type: !85)
!583 = distinct !DILexicalBlock(scope: !525, file: !324, line: 99, column: 41)
!584 = !DILocalVariable(name: "i", scope: !585, file: !324, line: 101, type: !75)
!585 = distinct !DILexicalBlock(scope: !586, file: !324, line: 100, column: 14)
!586 = distinct !DILexicalBlock(scope: !525, file: !324, line: 100, column: 7)
!587 = !DILocalVariable(name: "j", scope: !585, file: !324, line: 101, type: !75)
