; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/aij/mpi/fdmpiaij.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/aij/mpi/fdmpiaij.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!292 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!293 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !52, line: 1203, baseType: !5, size: 32, elements: !294)
!294 = !{!295, !296, !297, !298, !299}
!295 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!296 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!297 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!298 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!299 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !52, line: 187, baseType: !5, size: 32, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !307, !308}
!302 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!305 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!306 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!307 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!308 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!309 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !310, line: 663, baseType: !5, size: 32, elements: !311)
!310 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!311 = !{!312, !313, !314}
!312 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!313 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!314 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!315 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !76, line: 30, baseType: !5, size: 32, elements: !316)
!316 = !{!317, !318, !319, !320, !321}
!317 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!318 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!319 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!320 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!321 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!322 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !323)
!323 = !{!324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341}
!324 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!325 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!326 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!327 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!328 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!329 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!330 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!331 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!332 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!333 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!334 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!335 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!336 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!337 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!338 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!339 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!340 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!341 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!342 = !{!343, !351, !347, !355, !389, !557, !1514, !523, !1595, !1622, !1665, !1693, !439, !88, !457, !1344, !412, !429, !525}
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!346, !347, !348, !348, !347}
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !88)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !76, line: 21, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !76, line: 21, flags: DIFlagFwdDecl)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !352, line: 330, baseType: !353)
!352 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !352, line: 330, flags: DIFlagFwdDecl)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !358, line: 73, size: 4480, elements: !359)
!358 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!359 = !{!360, !362, !410, !411, !413, !416, !417, !418, !419, !427, !428, !430, !434, !438, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !451, !452, !453, !455, !456, !458, !460, !461, !462, !463, !464, !467, !469, !470, !471, !472, !473, !476, !478, !479, !480, !490, !492, !493, !497, !498, !547, !552, !554, !555, !556}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !357, file: !358, line: 74, baseType: !361, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !88)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !357, file: !358, line: 75, baseType: !363, size: 448, offset: 64)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 448, elements: !408)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !358, line: 53, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !358, line: 45, size: 448, elements: !366)
!366 = !{!367, !372, !380, !385, !392, !396, !403}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !365, file: !358, line: 46, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!346, !355, !371}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !365, file: !358, line: 47, baseType: !373, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!346, !355, !376}
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !377, line: 16, baseType: !378)
!377 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !377, line: 16, flags: DIFlagFwdDecl)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !365, file: !358, line: 48, baseType: !381, size: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!346, !384}
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !365, file: !358, line: 49, baseType: !386, size: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!346, !355, !389, !355}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !391)
!391 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !365, file: !358, line: 50, baseType: !393, size: 64, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!346, !355, !389, !384}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !365, file: !358, line: 51, baseType: !397, size: 64, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!346, !355, !389, !400}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{null}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !365, file: !358, line: 52, baseType: !404, size: 64, offset: 384)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!346, !355, !389, !407}
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!408 = !{!409}
!409 = !DISubrange(count: 1)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !357, file: !358, line: 76, baseType: !351, size: 64, offset: 512)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !357, file: !358, line: 77, baseType: !412, size: 32, offset: 576)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !88)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !357, file: !358, line: 78, baseType: !414, size: 64, offset: 640)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !415)
!415 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !357, file: !358, line: 78, baseType: !414, size: 64, offset: 704)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !357, file: !358, line: 78, baseType: !414, size: 64, offset: 768)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !357, file: !358, line: 78, baseType: !414, size: 64, offset: 832)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !357, file: !358, line: 79, baseType: !420, size: 64, offset: 896)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !421)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !422)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !423, line: 27, baseType: !424)
!423 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !425, line: 43, baseType: !426)
!425 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!426 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !357, file: !358, line: 80, baseType: !412, size: 32, offset: 960)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !357, file: !358, line: 81, baseType: !429, size: 32, offset: 992)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !88)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !357, file: !358, line: 82, baseType: !431, size: 64, offset: 1024)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !357, file: !358, line: 83, baseType: !435, size: 64, offset: 1088)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !436)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !357, file: !358, line: 84, baseType: !439, size: 64, offset: 1152)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !357, file: !358, line: 85, baseType: !439, size: 64, offset: 1216)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !357, file: !358, line: 86, baseType: !439, size: 64, offset: 1280)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !357, file: !358, line: 87, baseType: !439, size: 64, offset: 1344)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !357, file: !358, line: 88, baseType: !355, size: 64, offset: 1408)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !357, file: !358, line: 89, baseType: !420, size: 64, offset: 1472)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !357, file: !358, line: 90, baseType: !439, size: 64, offset: 1536)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !357, file: !358, line: 91, baseType: !439, size: 64, offset: 1600)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !357, file: !358, line: 92, baseType: !412, size: 32, offset: 1664)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !357, file: !358, line: 93, baseType: !347, size: 64, offset: 1728)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !357, file: !358, line: 94, baseType: !450, size: 64, offset: 1792)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !421)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !357, file: !358, line: 95, baseType: !412, size: 32, offset: 1856)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !357, file: !358, line: 95, baseType: !412, size: 32, offset: 1888)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !357, file: !358, line: 96, baseType: !454, size: 64, offset: 1920)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !357, file: !358, line: 96, baseType: !454, size: 64, offset: 1984)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !357, file: !358, line: 97, baseType: !457, size: 64, offset: 2048)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !357, file: !358, line: 97, baseType: !459, size: 64, offset: 2112)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !357, file: !358, line: 98, baseType: !412, size: 32, offset: 2176)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !357, file: !358, line: 98, baseType: !412, size: 32, offset: 2208)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !357, file: !358, line: 99, baseType: !454, size: 64, offset: 2240)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !357, file: !358, line: 99, baseType: !454, size: 64, offset: 2304)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !357, file: !358, line: 100, baseType: !465, size: 64, offset: 2368)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !415)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !357, file: !358, line: 100, baseType: !468, size: 64, offset: 2432)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !357, file: !358, line: 101, baseType: !412, size: 32, offset: 2496)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !357, file: !358, line: 101, baseType: !412, size: 32, offset: 2528)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !357, file: !358, line: 102, baseType: !454, size: 64, offset: 2560)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !357, file: !358, line: 102, baseType: !454, size: 64, offset: 2624)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !357, file: !358, line: 103, baseType: !474, size: 64, offset: 2688)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !466)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !357, file: !358, line: 103, baseType: !477, size: 64, offset: 2752)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !357, file: !358, line: 104, baseType: !407, size: 64, offset: 2816)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !357, file: !358, line: 105, baseType: !412, size: 32, offset: 2880)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !357, file: !358, line: 106, baseType: !481, size: 128, offset: 2944)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !482, size: 128, elements: !488)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !358, line: 64, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !358, line: 61, size: 128, elements: !485)
!485 = !{!486, !487}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !484, file: !358, line: 62, baseType: !400, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !484, file: !358, line: 63, baseType: !347, size: 64, offset: 64)
!488 = !{!489}
!489 = !DISubrange(count: 2)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !357, file: !358, line: 107, baseType: !491, size: 64, offset: 3072)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 64, elements: !488)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !357, file: !358, line: 108, baseType: !347, size: 64, offset: 3136)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !357, file: !358, line: 109, baseType: !494, size: 64, offset: 3200)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{!346, !347}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !357, file: !358, line: 111, baseType: !412, size: 32, offset: 3264)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !357, file: !358, line: 112, baseType: !499, size: 320, offset: 3328)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 320, elements: !545)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!346, !503, !355, !347}
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !506)
!506 = !{!507, !508, !533, !534, !535, !536, !537, !538, !539, !540, !541}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !505, file: !10, line: 100, baseType: !412, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !505, file: !10, line: 101, baseType: !509, size: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !512)
!512 = !{!513, !514, !515, !516, !517, !520, !521, !522, !526, !528, !530, !531, !532}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !511, file: !10, line: 84, baseType: !439, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !511, file: !10, line: 85, baseType: !439, size: 64, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !511, file: !10, line: 86, baseType: !347, size: 64, offset: 128)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !511, file: !10, line: 87, baseType: !431, size: 64, offset: 192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !511, file: !10, line: 88, baseType: !518, size: 64, offset: 256)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !389)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !511, file: !10, line: 89, baseType: !391, size: 8, offset: 320)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !511, file: !10, line: 90, baseType: !439, size: 64, offset: 384)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !511, file: !10, line: 91, baseType: !523, size: 64, offset: 448)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !524, line: 46, baseType: !525)
!524 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!525 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !511, file: !10, line: 92, baseType: !527, size: 32, offset: 512)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !511, file: !10, line: 93, baseType: !529, size: 32, offset: 544)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !511, file: !10, line: 94, baseType: !509, size: 64, offset: 576)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !511, file: !10, line: 95, baseType: !439, size: 64, offset: 640)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !511, file: !10, line: 96, baseType: !347, size: 64, offset: 704)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !505, file: !10, line: 102, baseType: !439, size: 64, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !505, file: !10, line: 102, baseType: !439, size: 64, offset: 192)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !505, file: !10, line: 103, baseType: !439, size: 64, offset: 256)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !505, file: !10, line: 104, baseType: !351, size: 64, offset: 320)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !505, file: !10, line: 105, baseType: !527, size: 32, offset: 384)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !505, file: !10, line: 105, baseType: !527, size: 32, offset: 416)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !505, file: !10, line: 105, baseType: !527, size: 32, offset: 448)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !505, file: !10, line: 106, baseType: !355, size: 64, offset: 512)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !505, file: !10, line: 107, baseType: !542, size: 64, offset: 576)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!545 = !{!546}
!546 = !DISubrange(count: 5)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !357, file: !358, line: 113, baseType: !548, size: 320, offset: 3648)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !549, size: 320, elements: !545)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!346, !355, !347}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !357, file: !358, line: 114, baseType: !553, size: 320, offset: 3968)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 320, elements: !545)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !357, file: !358, line: 115, baseType: !527, size: 32, offset: 4288)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !357, file: !358, line: 120, baseType: !542, size: 64, offset: 4352)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !357, file: !358, line: 121, baseType: !527, size: 32, offset: 4416)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_MPIBAIJ", file: !559, line: 69, baseType: !560)
!559 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/baij/mpi/mpibaij.h", directory: "/home/users/ndemeye/xSDK")
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !559, line: 67, size: 2240, elements: !561)
!561 = !{!562, !563, !564, !565, !566, !567, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1472, !1473, !1474, !1486, !1487, !1488, !1489, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "rangebs", scope: !560, file: !559, line: 68, baseType: !457, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "rstartbs", scope: !560, file: !559, line: 68, baseType: !412, size: 32, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "rendbs", scope: !560, file: !559, line: 68, baseType: !412, size: 32, offset: 96)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "cstartbs", scope: !560, file: !559, line: 68, baseType: !412, size: 32, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "cendbs", scope: !560, file: !559, line: 68, baseType: !412, size: 32, offset: 160)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !560, file: !559, line: 68, baseType: !568, size: 64, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !52, line: 16, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !571, line: 436, size: 23424, elements: !572)
!571 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!572 = !{!573, !575, !1216, !1217, !1218, !1219, !1221, !1222, !1223, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1350, !1351, !1367, !1368, !1369, !1370, !1371, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1406, !1426, !1427, !1429, !1430, !1431, !1432, !1433, !1434, !1452, !1453}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !570, file: !571, line: 437, baseType: !574, size: 4480)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !358, line: 122, baseType: !357)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !570, file: !571, line: 437, baseType: !576, size: 9472, offset: 4480)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !577, size: 9472, elements: !408)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !571, line: 32, size: 9472, elements: !578)
!578 = !{!579, !588, !592, !593, !597, !601, !602, !603, !604, !605, !606, !607, !765, !769, !774, !780, !799, !803, !807, !808, !813, !818, !819, !824, !828, !832, !836, !840, !844, !845, !846, !847, !848, !852, !853, !858, !859, !860, !861, !862, !867, !874, !878, !882, !886, !890, !894, !895, !899, !900, !907, !911, !912, !913, !914, !988, !993, !994, !998, !999, !1003, !1004, !1008, !1013, !1014, !1018, !1022, !1026, !1027, !1028, !1029, !1030, !1031, !1036, !1037, !1041, !1045, !1049, !1050, !1051, !1055, !1065, !1066, !1070, !1071, !1075, !1076, !1080, !1081, !1086, !1087, !1091, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1105, !1106, !1107, !1108, !1109, !1110, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1125, !1129, !1130, !1131, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1145, !1146, !1147, !1152, !1156, !1157, !1161, !1162, !1163, !1164, !1190, !1194, !1195, !1196, !1197, !1198, !1202, !1203, !1204, !1205, !1206, !1210, !1214, !1215}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !577, file: !571, line: 34, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{!346, !568, !412, !583, !412, !583, !585, !587}
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !412)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !475)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !577, file: !571, line: 35, baseType: !589, size: 64, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{!346, !568, !412, !457, !459, !477}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !577, file: !571, line: 36, baseType: !589, size: 64, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !577, file: !571, line: 37, baseType: !594, size: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!346, !568, !348, !348}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !577, file: !571, line: 38, baseType: !598, size: 64, offset: 256)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{!346, !568, !348, !348, !348}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !577, file: !571, line: 40, baseType: !594, size: 64, offset: 320)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !577, file: !571, line: 41, baseType: !598, size: 64, offset: 384)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !577, file: !571, line: 42, baseType: !594, size: 64, offset: 448)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !577, file: !571, line: 43, baseType: !598, size: 64, offset: 512)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !577, file: !571, line: 44, baseType: !594, size: 64, offset: 576)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !577, file: !571, line: 46, baseType: !598, size: 64, offset: 640)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !577, file: !571, line: 47, baseType: !608, size: 64, offset: 704)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!346, !568, !611, !611, !749}
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !612, line: 11, baseType: !613)
!612 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !46, line: 50, size: 7104, elements: !615)
!615 = !{!616, !617, !682, !736, !737, !738, !739, !740, !741, !742, !743, !746}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !614, file: !46, line: 51, baseType: !574, size: 4480)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !614, file: !46, line: 51, baseType: !618, size: 1536, offset: 4480)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !619, size: 1536, elements: !408)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ISOps", file: !46, line: 21, size: 1536, elements: !620)
!620 = !{!621, !626, !627, !632, !636, !637, !642, !646, !647, !651, !652, !656, !657, !662, !666, !670, !674, !675, !676, !677, !678, !679, !680, !681}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "getindices", scope: !619, file: !46, line: 22, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!346, !611, !625}
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "restoreindices", scope: !619, file: !46, line: 23, baseType: !622, size: 64, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "invertpermutation", scope: !619, file: !46, line: 24, baseType: !628, size: 64, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!346, !611, !412, !631}
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "sort", scope: !619, file: !46, line: 25, baseType: !633, size: 64, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{!346, !611}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "sortremovedups", scope: !619, file: !46, line: 26, baseType: !633, size: 64, offset: 256)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "sorted", scope: !619, file: !46, line: 27, baseType: !638, size: 64, offset: 320)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!346, !611, !641}
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !619, file: !46, line: 28, baseType: !643, size: 64, offset: 384)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!346, !611, !631}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !619, file: !46, line: 29, baseType: !633, size: 64, offset: 448)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !619, file: !46, line: 30, baseType: !648, size: 64, offset: 512)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!346, !611, !376}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !619, file: !46, line: 31, baseType: !648, size: 64, offset: 576)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !619, file: !46, line: 32, baseType: !653, size: 64, offset: 640)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{!346, !611, !611}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "togeneral", scope: !619, file: !46, line: 33, baseType: !633, size: 64, offset: 704)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "oncomm", scope: !619, file: !46, line: 34, baseType: !658, size: 64, offset: 768)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!346, !611, !351, !661, !631}
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscCopyMode", file: !4, line: 327, baseType: !35)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksize", scope: !619, file: !46, line: 35, baseType: !663, size: 64, offset: 832)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!346, !611, !412}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "contiguous", scope: !619, file: !46, line: 36, baseType: !667, size: 64, offset: 896)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!346, !611, !412, !412, !457, !641}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "locate", scope: !619, file: !46, line: 37, baseType: !671, size: 64, offset: 960)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!346, !611, !412, !457}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "sortedlocal", scope: !619, file: !46, line: 38, baseType: !638, size: 64, offset: 1024)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "sortedglobal", scope: !619, file: !46, line: 39, baseType: !638, size: 64, offset: 1088)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "uniquelocal", scope: !619, file: !46, line: 40, baseType: !638, size: 64, offset: 1152)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "uniqueglobal", scope: !619, file: !46, line: 41, baseType: !638, size: 64, offset: 1216)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "permlocal", scope: !619, file: !46, line: 42, baseType: !638, size: 64, offset: 1280)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "permglobal", scope: !619, file: !46, line: 43, baseType: !638, size: 64, offset: 1344)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "intervallocal", scope: !619, file: !46, line: 44, baseType: !638, size: 64, offset: 1408)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "intervalglobal", scope: !619, file: !46, line: 45, baseType: !638, size: 64, offset: 1472)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !614, file: !46, line: 52, baseType: !683, size: 64, offset: 6016)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !612, line: 60, baseType: !684)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !41, line: 240, size: 640, elements: !686)
!686 = !{!687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !732, !733, !734, !735}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !685, file: !41, line: 241, baseType: !351, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !685, file: !41, line: 242, baseType: !429, size: 32, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !685, file: !41, line: 243, baseType: !412, size: 32, offset: 96)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !685, file: !41, line: 243, baseType: !412, size: 32, offset: 128)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !685, file: !41, line: 244, baseType: !412, size: 32, offset: 160)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !685, file: !41, line: 244, baseType: !412, size: 32, offset: 192)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !685, file: !41, line: 245, baseType: !457, size: 64, offset: 256)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !685, file: !41, line: 246, baseType: !527, size: 32, offset: 320)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !685, file: !41, line: 247, baseType: !412, size: 32, offset: 352)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !685, file: !41, line: 251, baseType: !412, size: 32, offset: 384)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !685, file: !41, line: 252, baseType: !698, size: 64, offset: 448)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !612, line: 30, baseType: !699)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !46, line: 73, size: 5440, elements: !701)
!701 = !{!702, !703, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !700, file: !46, line: 74, baseType: !574, size: 4480)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !700, file: !46, line: 74, baseType: !704, size: 256, offset: 4480)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !705, size: 256, elements: !408)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ISLocalToGlobalMappingOps", file: !46, line: 66, size: 256, elements: !706)
!706 = !{!707, !711, !716, !717}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingsetup", scope: !705, file: !46, line: 67, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!346, !698}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingapply", scope: !705, file: !46, line: 68, baseType: !712, size: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!346, !698, !715, !412, !583, !457, !457}
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISGlobalToLocalMappingMode", file: !41, line: 149, baseType: !40)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingapplyblock", scope: !705, file: !46, line: 69, baseType: !712, size: 64, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !705, file: !46, line: 70, baseType: !708, size: 64, offset: 192)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !700, file: !46, line: 75, baseType: !412, size: 32, offset: 4736)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !700, file: !46, line: 76, baseType: !412, size: 32, offset: 4768)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "indices", scope: !700, file: !46, line: 77, baseType: !457, size: 64, offset: 4800)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "globalstart", scope: !700, file: !46, line: 78, baseType: !412, size: 32, offset: 4864)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "globalend", scope: !700, file: !46, line: 79, baseType: !412, size: 32, offset: 4896)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "info_cached", scope: !700, file: !46, line: 80, baseType: !527, size: 32, offset: 4928)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "info_free", scope: !700, file: !46, line: 81, baseType: !527, size: 32, offset: 4960)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "info_nproc", scope: !700, file: !46, line: 82, baseType: !412, size: 32, offset: 4992)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "info_procs", scope: !700, file: !46, line: 83, baseType: !457, size: 64, offset: 5056)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "info_numprocs", scope: !700, file: !46, line: 84, baseType: !457, size: 64, offset: 5120)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "info_indices", scope: !700, file: !46, line: 85, baseType: !459, size: 64, offset: 5184)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "info_nodec", scope: !700, file: !46, line: 86, baseType: !457, size: 64, offset: 5248)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "info_nodei", scope: !700, file: !46, line: 87, baseType: !459, size: 64, offset: 5312)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !700, file: !46, line: 88, baseType: !347, size: 64, offset: 5376)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !685, file: !41, line: 253, baseType: !527, size: 32, offset: 512)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !685, file: !41, line: 254, baseType: !412, size: 32, offset: 544)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !685, file: !41, line: 254, baseType: !412, size: 32, offset: 576)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !685, file: !41, line: 255, baseType: !412, size: 32, offset: 608)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !614, file: !46, line: 53, baseType: !412, size: 32, offset: 6080)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !614, file: !46, line: 53, baseType: !412, size: 32, offset: 6112)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !614, file: !46, line: 54, baseType: !347, size: 64, offset: 6144)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !614, file: !46, line: 55, baseType: !457, size: 64, offset: 6208)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !614, file: !46, line: 55, baseType: !457, size: 64, offset: 6272)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "local_offset", scope: !614, file: !46, line: 56, baseType: !412, size: 32, offset: 6336)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "complement", scope: !614, file: !46, line: 57, baseType: !611, size: 64, offset: 6400)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "info_permanent", scope: !614, file: !46, line: 58, baseType: !744, size: 320, offset: 6464)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !527, size: 320, elements: !745)
!745 = !{!489, !546}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !614, file: !46, line: 59, baseType: !747, size: 320, offset: 6784)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !748, size: 320, elements: !745)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISInfoBool", file: !46, line: 48, baseType: !45)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !751)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !52, line: 1239, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 1226, size: 704, elements: !753)
!753 = !{!754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !752, file: !52, line: 1227, baseType: !466, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !752, file: !52, line: 1228, baseType: !466, size: 64, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !752, file: !52, line: 1229, baseType: !466, size: 64, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !752, file: !52, line: 1230, baseType: !466, size: 64, offset: 192)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !752, file: !52, line: 1231, baseType: !466, size: 64, offset: 256)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !752, file: !52, line: 1232, baseType: !466, size: 64, offset: 320)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !752, file: !52, line: 1233, baseType: !466, size: 64, offset: 384)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !752, file: !52, line: 1234, baseType: !466, size: 64, offset: 448)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !752, file: !52, line: 1236, baseType: !466, size: 64, offset: 512)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !752, file: !52, line: 1237, baseType: !466, size: 64, offset: 576)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !752, file: !52, line: 1238, baseType: !466, size: 64, offset: 640)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !577, file: !571, line: 48, baseType: !766, size: 64, offset: 768)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{!346, !568, !611, !749}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !577, file: !571, line: 49, baseType: !770, size: 64, offset: 832)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{!346, !568, !348, !466, !773, !466, !412, !412, !348}
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !52, line: 1291, baseType: !51)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !577, file: !571, line: 50, baseType: !775, size: 64, offset: 896)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{!346, !568, !778, !779}
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !52, line: 238, baseType: !64)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !577, file: !571, line: 52, baseType: !781, size: 64, offset: 960)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DISubroutineType(types: !783)
!783 = !{!346, !568, !784, !785}
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !52, line: 612, baseType: !70)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !52, line: 600, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 592, size: 640, elements: !788)
!788 = !{!789, !790, !791, !792, !793, !794, !795, !796, !797, !798}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !787, file: !52, line: 593, baseType: !414, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !787, file: !52, line: 594, baseType: !414, size: 64, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !787, file: !52, line: 594, baseType: !414, size: 64, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !787, file: !52, line: 594, baseType: !414, size: 64, offset: 192)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !787, file: !52, line: 595, baseType: !414, size: 64, offset: 256)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !787, file: !52, line: 596, baseType: !414, size: 64, offset: 320)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !787, file: !52, line: 597, baseType: !414, size: 64, offset: 384)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !787, file: !52, line: 598, baseType: !414, size: 64, offset: 448)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !787, file: !52, line: 598, baseType: !414, size: 64, offset: 512)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !787, file: !52, line: 599, baseType: !414, size: 64, offset: 576)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !577, file: !571, line: 53, baseType: !800, size: 64, offset: 1024)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DISubroutineType(types: !802)
!802 = !{!346, !568, !568, !641}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !577, file: !571, line: 54, baseType: !804, size: 64, offset: 1088)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!346, !568, !348}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !577, file: !571, line: 55, baseType: !594, size: 64, offset: 1152)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !577, file: !571, line: 56, baseType: !809, size: 64, offset: 1216)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!346, !568, !812, !465}
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !76, line: 155, baseType: !75)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !577, file: !571, line: 58, baseType: !814, size: 64, offset: 1280)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{!346, !568, !817}
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !52, line: 424, baseType: !83)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !577, file: !571, line: 59, baseType: !814, size: 64, offset: 1344)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !577, file: !571, line: 60, baseType: !820, size: 64, offset: 1408)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{!346, !568, !823, !527}
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !52, line: 469, baseType: !87)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !577, file: !571, line: 61, baseType: !825, size: 64, offset: 1472)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{!346, !568}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !577, file: !571, line: 63, baseType: !829, size: 64, offset: 1536)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{!346, !568, !412, !583, !475, !348, !348}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !577, file: !571, line: 64, baseType: !833, size: 64, offset: 1600)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{!346, !568, !568, !611, !611, !749}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !577, file: !571, line: 65, baseType: !837, size: 64, offset: 1664)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{!346, !568, !568, !749}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !577, file: !571, line: 66, baseType: !841, size: 64, offset: 1728)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DISubroutineType(types: !843)
!843 = !{!346, !568, !568, !611, !749}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !577, file: !571, line: 67, baseType: !837, size: 64, offset: 1792)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !577, file: !571, line: 69, baseType: !825, size: 64, offset: 1856)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !577, file: !571, line: 70, baseType: !833, size: 64, offset: 1920)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !577, file: !571, line: 71, baseType: !841, size: 64, offset: 1984)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !577, file: !571, line: 72, baseType: !849, size: 64, offset: 2048)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DISubroutineType(types: !851)
!851 = !{!346, !568, !779}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !577, file: !571, line: 73, baseType: !825, size: 64, offset: 2112)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !577, file: !571, line: 75, baseType: !854, size: 64, offset: 2176)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{!346, !568, !857, !779}
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !52, line: 563, baseType: !118)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !577, file: !571, line: 76, baseType: !594, size: 64, offset: 2240)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !577, file: !571, line: 77, baseType: !594, size: 64, offset: 2304)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !577, file: !571, line: 78, baseType: !608, size: 64, offset: 2368)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !577, file: !571, line: 79, baseType: !766, size: 64, offset: 2432)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !577, file: !571, line: 81, baseType: !863, size: 64, offset: 2496)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{!346, !568, !475, !568, !866}
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !52, line: 285, baseType: !123)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !577, file: !571, line: 82, baseType: !868, size: 64, offset: 2560)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!346, !568, !412, !871, !871, !778, !873}
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !611)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !577, file: !571, line: 83, baseType: !875, size: 64, offset: 2624)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!346, !568, !412, !631, !412}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !577, file: !571, line: 84, baseType: !879, size: 64, offset: 2688)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{!346, !568, !412, !583, !412, !583, !474}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !577, file: !571, line: 85, baseType: !883, size: 64, offset: 2752)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DISubroutineType(types: !885)
!885 = !{!346, !568, !568, !866}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !577, file: !571, line: 87, baseType: !887, size: 64, offset: 2816)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{!346, !568, !348, !457}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !577, file: !571, line: 88, baseType: !891, size: 64, offset: 2880)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!346, !568, !475}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !577, file: !571, line: 89, baseType: !891, size: 64, offset: 2944)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !577, file: !571, line: 90, baseType: !896, size: 64, offset: 3008)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DISubroutineType(types: !898)
!898 = !{!346, !568, !348, !587}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !577, file: !571, line: 91, baseType: !829, size: 64, offset: 3072)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !577, file: !571, line: 93, baseType: !901, size: 64, offset: 3136)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{!346, !568, !904}
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !905)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !577, file: !571, line: 94, baseType: !908, size: 64, offset: 3200)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!346, !568, !412, !527, !527, !457, !625, !625, !641}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !577, file: !571, line: 95, baseType: !908, size: 64, offset: 3264)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !577, file: !571, line: 96, baseType: !908, size: 64, offset: 3328)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !577, file: !571, line: 97, baseType: !908, size: 64, offset: 3392)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !577, file: !571, line: 99, baseType: !915, size: 64, offset: 3456)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!346, !568, !918, !934}
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !612, line: 51, baseType: !919)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !46, line: 91, size: 384, elements: !921)
!921 = !{!922, !923, !924, !925, !926, !930, !931, !933}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !920, file: !46, line: 92, baseType: !412, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !920, file: !46, line: 93, baseType: !412, size: 32, offset: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "is", scope: !920, file: !46, line: 94, baseType: !631, size: 64, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !920, file: !46, line: 95, baseType: !351, size: 64, offset: 128)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !920, file: !46, line: 96, baseType: !927, size: 64, offset: 192)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !41, line: 215, baseType: !929)
!929 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !920, file: !46, line: 97, baseType: !412, size: 32, offset: 256)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !920, file: !46, line: 98, baseType: !932, size: 32, offset: 288)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !41, line: 213, baseType: !129)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !920, file: !46, line: 99, baseType: !527, size: 32, offset: 320)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !52, line: 1378, baseType: !935)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !571, line: 609, size: 6208, elements: !937)
!937 = !{!938, !939, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !958, !965, !966, !967, !968, !969, !970, !971, !972, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !936, file: !571, line: 610, baseType: !574, size: 4480)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !936, file: !571, line: 610, baseType: !940, size: 32, offset: 4480)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 32, elements: !408)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !936, file: !571, line: 611, baseType: !412, size: 32, offset: 4512)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !936, file: !571, line: 611, baseType: !412, size: 32, offset: 4544)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !936, file: !571, line: 611, baseType: !412, size: 32, offset: 4576)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !936, file: !571, line: 612, baseType: !412, size: 32, offset: 4608)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !936, file: !571, line: 613, baseType: !412, size: 32, offset: 4640)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !936, file: !571, line: 614, baseType: !457, size: 64, offset: 4672)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !936, file: !571, line: 615, baseType: !459, size: 64, offset: 4736)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !936, file: !571, line: 616, baseType: !631, size: 64, offset: 4800)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !936, file: !571, line: 617, baseType: !457, size: 64, offset: 4864)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !936, file: !571, line: 618, baseType: !951, size: 64, offset: 4928)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !571, line: 602, baseType: !953)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !571, line: 598, size: 128, elements: !954)
!954 = !{!955, !956, !957}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !953, file: !571, line: 599, baseType: !412, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !953, file: !571, line: 600, baseType: !412, size: 32, offset: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !953, file: !571, line: 601, baseType: !474, size: 64, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !936, file: !571, line: 619, baseType: !959, size: 64, offset: 4992)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !571, line: 607, baseType: !961)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !571, line: 604, size: 128, elements: !962)
!962 = !{!963, !964}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !961, file: !571, line: 605, baseType: !412, size: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !961, file: !571, line: 606, baseType: !474, size: 64, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !936, file: !571, line: 620, baseType: !474, size: 64, offset: 5056)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !936, file: !571, line: 621, baseType: !466, size: 64, offset: 5120)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !936, file: !571, line: 622, baseType: !466, size: 64, offset: 5184)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !936, file: !571, line: 623, baseType: !348, size: 64, offset: 5248)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !936, file: !571, line: 623, baseType: !348, size: 64, offset: 5312)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !936, file: !571, line: 623, baseType: !348, size: 64, offset: 5376)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !936, file: !571, line: 624, baseType: !527, size: 32, offset: 5440)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !936, file: !571, line: 625, baseType: !973, size: 64, offset: 5504)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!346}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !936, file: !571, line: 626, baseType: !347, size: 64, offset: 5568)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !936, file: !571, line: 627, baseType: !348, size: 64, offset: 5632)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !936, file: !571, line: 628, baseType: !412, size: 32, offset: 5696)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !936, file: !571, line: 629, baseType: !389, size: 64, offset: 5760)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !936, file: !571, line: 630, baseType: !932, size: 32, offset: 5824)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !936, file: !571, line: 631, baseType: !412, size: 32, offset: 5856)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !936, file: !571, line: 631, baseType: !412, size: 32, offset: 5888)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !936, file: !571, line: 632, baseType: !527, size: 32, offset: 5920)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !936, file: !571, line: 633, baseType: !527, size: 32, offset: 5952)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !936, file: !571, line: 634, baseType: !400, size: 64, offset: 6016)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !936, file: !571, line: 634, baseType: !347, size: 64, offset: 6080)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !936, file: !571, line: 635, baseType: !420, size: 64, offset: 6144)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !577, file: !571, line: 100, baseType: !989, size: 64, offset: 3520)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!346, !568, !412, !412, !927, !992}
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !577, file: !571, line: 101, baseType: !825, size: 64, offset: 3584)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !577, file: !571, line: 102, baseType: !995, size: 64, offset: 3648)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!346, !568, !611, !611, !779}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !577, file: !571, line: 103, baseType: !580, size: 64, offset: 3712)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !577, file: !571, line: 105, baseType: !1000, size: 64, offset: 3776)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!346, !568, !611, !611, !778, !779}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !577, file: !571, line: 106, baseType: !825, size: 64, offset: 3840)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !577, file: !571, line: 107, baseType: !1005, size: 64, offset: 3904)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!346, !568, !376}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !577, file: !571, line: 108, baseType: !1009, size: 64, offset: 3968)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!346, !568, !1012, !778, !779}
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !52, line: 25, baseType: !389)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !577, file: !571, line: 109, baseType: !973, size: 64, offset: 4032)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !577, file: !571, line: 111, baseType: !1015, size: 64, offset: 4096)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!346, !568, !568, !568, !466, !568}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !577, file: !571, line: 112, baseType: !1019, size: 64, offset: 4160)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!346, !568, !568, !568, !568}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !577, file: !571, line: 113, baseType: !1023, size: 64, offset: 4224)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!346, !568, !698, !698}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !577, file: !571, line: 114, baseType: !580, size: 64, offset: 4288)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !577, file: !571, line: 115, baseType: !829, size: 64, offset: 4352)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !577, file: !571, line: 117, baseType: !887, size: 64, offset: 4416)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !577, file: !571, line: 118, baseType: !887, size: 64, offset: 4480)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !577, file: !571, line: 119, baseType: !1009, size: 64, offset: 4544)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !577, file: !571, line: 120, baseType: !1032, size: 64, offset: 4608)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!346, !568, !1035, !641}
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !52, line: 1675, baseType: !133)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !577, file: !571, line: 121, baseType: !973, size: 64, offset: 4672)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !577, file: !571, line: 123, baseType: !1038, size: 64, offset: 4736)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!346, !568, !412, !347}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !577, file: !571, line: 124, baseType: !1042, size: 64, offset: 4800)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!346, !568, !934, !348, !347}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !577, file: !571, line: 125, baseType: !1046, size: 64, offset: 4864)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!346, !503, !568}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !577, file: !571, line: 126, baseType: !594, size: 64, offset: 4928)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !577, file: !571, line: 127, baseType: !594, size: 64, offset: 4992)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !577, file: !571, line: 129, baseType: !1052, size: 64, offset: 5056)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!346, !568, !631}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !577, file: !571, line: 130, baseType: !1056, size: 64, offset: 5120)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!346, !568, !1059, !1059}
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !76, line: 654, baseType: !1060)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !76, line: 653, size: 128, elements: !1062)
!1062 = !{!1063, !1064}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1061, file: !76, line: 653, baseType: !412, size: 32)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1061, file: !76, line: 653, baseType: !348, size: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !577, file: !571, line: 131, baseType: !1056, size: 64, offset: 5184)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !577, file: !571, line: 132, baseType: !1067, size: 64, offset: 5248)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!346, !568, !457, !457, !457}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !577, file: !571, line: 133, baseType: !1005, size: 64, offset: 5312)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !577, file: !571, line: 135, baseType: !1072, size: 64, offset: 5376)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!346, !568, !466, !641}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !577, file: !571, line: 136, baseType: !1072, size: 64, offset: 5440)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !577, file: !571, line: 137, baseType: !1077, size: 64, offset: 5504)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!346, !568, !641}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !577, file: !571, line: 138, baseType: !580, size: 64, offset: 5568)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !577, file: !571, line: 139, baseType: !1082, size: 64, offset: 5632)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!346, !568, !1085, !1085}
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !577, file: !571, line: 141, baseType: !973, size: 64, offset: 5696)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !577, file: !571, line: 142, baseType: !1088, size: 64, offset: 5760)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!346, !568, !568, !466, !568}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !577, file: !571, line: 143, baseType: !1092, size: 64, offset: 5824)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!346, !568, !568, !568}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !577, file: !571, line: 144, baseType: !973, size: 64, offset: 5888)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !577, file: !571, line: 145, baseType: !1088, size: 64, offset: 5952)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !577, file: !571, line: 147, baseType: !1092, size: 64, offset: 6016)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !577, file: !571, line: 148, baseType: !973, size: 64, offset: 6080)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !577, file: !571, line: 149, baseType: !1088, size: 64, offset: 6144)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !577, file: !571, line: 150, baseType: !1092, size: 64, offset: 6208)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !577, file: !571, line: 151, baseType: !1102, size: 64, offset: 6272)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!346, !568, !527}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !577, file: !571, line: 153, baseType: !825, size: 64, offset: 6336)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !577, file: !571, line: 154, baseType: !825, size: 64, offset: 6400)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !577, file: !571, line: 155, baseType: !825, size: 64, offset: 6464)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !577, file: !571, line: 156, baseType: !825, size: 64, offset: 6528)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !577, file: !571, line: 157, baseType: !1005, size: 64, offset: 6592)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !577, file: !571, line: 159, baseType: !1111, size: 64, offset: 6656)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!346, !568, !412, !585}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !577, file: !571, line: 160, baseType: !825, size: 64, offset: 6720)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !577, file: !571, line: 161, baseType: !825, size: 64, offset: 6784)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !577, file: !571, line: 162, baseType: !825, size: 64, offset: 6848)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !577, file: !571, line: 163, baseType: !825, size: 64, offset: 6912)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !577, file: !571, line: 165, baseType: !1092, size: 64, offset: 6976)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !577, file: !571, line: 166, baseType: !1092, size: 64, offset: 7040)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !577, file: !571, line: 167, baseType: !887, size: 64, offset: 7104)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !577, file: !571, line: 168, baseType: !1122, size: 64, offset: 7168)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!346, !568, !348, !412}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !577, file: !571, line: 169, baseType: !1126, size: 64, offset: 7232)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!346, !568, !641, !457}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !577, file: !571, line: 171, baseType: !849, size: 64, offset: 7296)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !577, file: !571, line: 172, baseType: !825, size: 64, offset: 7360)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !577, file: !571, line: 173, baseType: !1132, size: 64, offset: 7424)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!346, !568, !457, !625}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !577, file: !571, line: 174, baseType: !995, size: 64, offset: 7488)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !577, file: !571, line: 175, baseType: !995, size: 64, offset: 7552)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !577, file: !571, line: 177, baseType: !594, size: 64, offset: 7616)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !577, file: !571, line: 178, baseType: !775, size: 64, offset: 7680)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !577, file: !571, line: 179, baseType: !594, size: 64, offset: 7744)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !577, file: !571, line: 180, baseType: !598, size: 64, offset: 7808)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !577, file: !571, line: 181, baseType: !1142, size: 64, offset: 7872)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{!346, !568, !351, !778, !779}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !577, file: !571, line: 183, baseType: !1052, size: 64, offset: 7936)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !577, file: !571, line: 184, baseType: !809, size: 64, offset: 8000)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !577, file: !571, line: 185, baseType: !1148, size: 64, offset: 8064)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!346, !568, !1151}
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !577, file: !571, line: 186, baseType: !1153, size: 64, offset: 8128)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!346, !568, !412, !583, !474}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !577, file: !571, line: 187, baseType: !868, size: 64, offset: 8192)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !577, file: !571, line: 189, baseType: !1158, size: 64, offset: 8256)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{!346, !568, !412, !412, !457, !585}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !577, file: !571, line: 190, baseType: !973, size: 64, offset: 8320)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !577, file: !571, line: 191, baseType: !1088, size: 64, offset: 8384)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !577, file: !571, line: 192, baseType: !1092, size: 64, offset: 8448)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !577, file: !571, line: 193, baseType: !1165, size: 64, offset: 8512)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = !DISubroutineType(types: !1167)
!1167 = !{!346, !568, !918, !1168}
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !52, line: 1401, baseType: !1169)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !571, line: 660, size: 5312, elements: !1171)
!1171 = !{!1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1170, file: !571, line: 661, baseType: !574, size: 4480)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1170, file: !571, line: 661, baseType: !940, size: 32, offset: 4480)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1170, file: !571, line: 662, baseType: !412, size: 32, offset: 4512)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1170, file: !571, line: 662, baseType: !412, size: 32, offset: 4544)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1170, file: !571, line: 662, baseType: !412, size: 32, offset: 4576)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1170, file: !571, line: 663, baseType: !412, size: 32, offset: 4608)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1170, file: !571, line: 664, baseType: !412, size: 32, offset: 4640)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1170, file: !571, line: 665, baseType: !457, size: 64, offset: 4672)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1170, file: !571, line: 666, baseType: !457, size: 64, offset: 4736)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1170, file: !571, line: 667, baseType: !412, size: 32, offset: 4800)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1170, file: !571, line: 668, baseType: !932, size: 32, offset: 4832)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1170, file: !571, line: 670, baseType: !457, size: 64, offset: 4864)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1170, file: !571, line: 670, baseType: !457, size: 64, offset: 4928)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1170, file: !571, line: 671, baseType: !457, size: 64, offset: 4992)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1170, file: !571, line: 672, baseType: !457, size: 64, offset: 5056)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1170, file: !571, line: 673, baseType: !457, size: 64, offset: 5120)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1170, file: !571, line: 674, baseType: !412, size: 32, offset: 5184)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1170, file: !571, line: 675, baseType: !457, size: 64, offset: 5248)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !577, file: !571, line: 195, baseType: !1191, size: 64, offset: 8576)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DISubroutineType(types: !1193)
!1193 = !{!346, !1168, !568, !568}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !577, file: !571, line: 196, baseType: !1191, size: 64, offset: 8640)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !577, file: !571, line: 197, baseType: !973, size: 64, offset: 8704)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !577, file: !571, line: 198, baseType: !1088, size: 64, offset: 8768)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !577, file: !571, line: 199, baseType: !1092, size: 64, offset: 8832)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !577, file: !571, line: 201, baseType: !1199, size: 64, offset: 8896)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1200 = !DISubroutineType(types: !1201)
!1201 = !{!346, !568, !412, !412}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !577, file: !571, line: 202, baseType: !863, size: 64, offset: 8960)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !577, file: !571, line: 203, baseType: !598, size: 64, offset: 9024)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !577, file: !571, line: 204, baseType: !915, size: 64, offset: 9088)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !577, file: !571, line: 205, baseType: !1052, size: 64, offset: 9152)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !577, file: !571, line: 206, baseType: !1207, size: 64, offset: 9216)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = !DISubroutineType(types: !1209)
!1209 = !{!346, !351, !568, !412, !778, !779}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !577, file: !571, line: 208, baseType: !1211, size: 64, offset: 9280)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = !DISubroutineType(types: !1213)
!1213 = !{!346, !412, !873}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !577, file: !571, line: 209, baseType: !1092, size: 64, offset: 9344)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !577, file: !571, line: 210, baseType: !879, size: 64, offset: 9408)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !570, file: !571, line: 438, baseType: !683, size: 64, offset: 13952)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !570, file: !571, line: 438, baseType: !683, size: 64, offset: 14016)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !570, file: !571, line: 439, baseType: !347, size: 64, offset: 14080)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !570, file: !571, line: 440, baseType: !1220, size: 32, offset: 14144)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !52, line: 161, baseType: !278)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !570, file: !571, line: 441, baseType: !527, size: 32, offset: 14176)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !570, file: !571, line: 442, baseType: !527, size: 32, offset: 14208)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !570, file: !571, line: 443, baseType: !1224, size: 448, offset: 14272)
!1224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1225, size: 448, elements: !1226)
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !52, line: 1159, baseType: !389)
!1226 = !{!1227}
!1227 = !DISubrange(count: 7)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !570, file: !571, line: 444, baseType: !527, size: 32, offset: 14720)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !570, file: !571, line: 445, baseType: !527, size: 32, offset: 14752)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !570, file: !571, line: 446, baseType: !412, size: 32, offset: 14784)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !570, file: !571, line: 447, baseType: !450, size: 64, offset: 14848)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !570, file: !571, line: 448, baseType: !450, size: 64, offset: 14912)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !570, file: !571, line: 449, baseType: !786, size: 640, offset: 14976)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !570, file: !571, line: 450, baseType: !587, size: 32, offset: 15616)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !570, file: !571, line: 451, baseType: !1236, size: 2880, offset: 15680)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !571, line: 318, baseType: !1237)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !571, line: 319, size: 2880, elements: !1238)
!1238 = !{!1239, !1240, !1241, !1242, !1243, !1244, !1245, !1258, !1259, !1264, !1269, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1284, !1285, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1317, !1318, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1341, !1342, !1343, !1347, !1348}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1237, file: !571, line: 320, baseType: !412, size: 32)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1237, file: !571, line: 321, baseType: !412, size: 32, offset: 32)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1237, file: !571, line: 322, baseType: !412, size: 32, offset: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1237, file: !571, line: 323, baseType: !412, size: 32, offset: 96)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1237, file: !571, line: 324, baseType: !412, size: 32, offset: 128)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1237, file: !571, line: 325, baseType: !412, size: 32, offset: 160)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1237, file: !571, line: 326, baseType: !1246, size: 64, offset: 192)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !571, line: 293, baseType: !1247)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64)
!1248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !571, line: 295, size: 448, elements: !1249)
!1249 = !{!1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1248, file: !571, line: 296, baseType: !1246, size: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1248, file: !571, line: 297, baseType: !474, size: 64, offset: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1248, file: !571, line: 297, baseType: !474, size: 64, offset: 128)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1248, file: !571, line: 298, baseType: !457, size: 64, offset: 192)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1248, file: !571, line: 298, baseType: !457, size: 64, offset: 256)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1248, file: !571, line: 299, baseType: !412, size: 32, offset: 320)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1248, file: !571, line: 300, baseType: !412, size: 32, offset: 352)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1248, file: !571, line: 301, baseType: !412, size: 32, offset: 384)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1237, file: !571, line: 326, baseType: !1246, size: 64, offset: 256)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1237, file: !571, line: 328, baseType: !1260, size: 64, offset: 320)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{!346, !568, !1263, !457}
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1237, file: !571, line: 329, baseType: !1265, size: 64, offset: 384)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64)
!1266 = !DISubroutineType(types: !1267)
!1267 = !{!346, !1263, !1268, !459, !459, !477, !457}
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1237, file: !571, line: 330, baseType: !1270, size: 64, offset: 448)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64)
!1271 = !DISubroutineType(types: !1272)
!1272 = !{!346, !1263}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1237, file: !571, line: 331, baseType: !1270, size: 64, offset: 512)
