; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/tfs/xyt.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/tfs/xyt.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.xyt_CDT = type { i32, i32, i32, %struct.xyt_solver_info*, %struct.matvec_info* }
%struct.xyt_solver_info = type { i32, i32, i32, i32, i32, i32, i32, i32*, i32*, i32*, i32, i32*, i32*, i32*, double**, double*, double*, double*, i32*, i32*, double**, double*, i32, double }
%struct.matvec_info = type { i32, i32, i32, i32, i32*, %struct.gather_scatter_id*, i32 (%struct.matvec_info*, double*, double*)*, i8* }
%struct.gather_scatter_id = type opaque
%struct._p_PetscObject = type opaque

@n_xyt_handles = internal unnamed_addr global i32 0, align 4, !dbg !0
@n_xyt = internal unnamed_addr global i32 0, align 4, !dbg !101
@PCTFS_i_log2_num_nodes = external hidden local_unnamed_addr global i32, align 4
@PCTFS_num_nodes = external hidden local_unnamed_addr global i32, align 4
@ompi_mpi_comm_self = external global %struct.ompi_predefined_communicator_t, align 1
@__func__.XYT_factor = private unnamed_addr constant [11 x i8] c"XYT_factor\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "n_xyt_handles", scope: !2, file: !22, line: 54, type: !25, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !17, globals: !100, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/tfs/xyt.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!4 = !{!5, !12}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 663, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 170, baseType: !7, size: 32, elements: !14)
!13 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!14 = !{!15, !16}
!15 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!17 = !{!18, !86, !85, !30, !90, !93, !42, !50, !51, !25, !96, !52, !53, !65, !99}
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "xyt_ADT", file: !19, line: 361, baseType: !20)
!19 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/pc/impls/tfs/tfs.h", directory: "/home/users/ndemeye/xSDK")
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xyt_CDT", file: !22, line: 45, size: 256, elements: !23)
!22 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/tfs/xyt.c", directory: "/home/users/ndemeye/xSDK")
!23 = !{!24, !27, !28, !29, !64}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !21, file: !22, line: 46, baseType: !25, size: 32)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !13, line: 102, baseType: !26)
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !21, file: !22, line: 47, baseType: !25, size: 32, offset: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !21, file: !22, line: 48, baseType: !25, size: 32, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !21, file: !22, line: 49, baseType: !30, size: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "xyt_info", file: !22, line: 35, baseType: !32)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xyt_solver_info", file: !22, line: 25, size: 1344, elements: !33)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !43, !44, !45, !46, !47, !48, !49, !55, !56, !57, !58, !59, !60, !61, !62, !63}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !32, file: !22, line: 26, baseType: !25, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !32, file: !22, line: 26, baseType: !25, size: 32, offset: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "n_global", scope: !32, file: !22, line: 26, baseType: !25, size: 32, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "m_global", scope: !32, file: !22, line: 26, baseType: !25, size: 32, offset: 96)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "nnz", scope: !32, file: !22, line: 27, baseType: !25, size: 32, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "max_nnz", scope: !32, file: !22, line: 27, baseType: !25, size: 32, offset: 160)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "msg_buf_sz", scope: !32, file: !22, line: 27, baseType: !25, size: 32, offset: 192)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "nsep", scope: !32, file: !22, line: 28, baseType: !42, size: 64, offset: 256)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "lnsep", scope: !32, file: !22, line: 28, baseType: !42, size: 64, offset: 320)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "fo", scope: !32, file: !22, line: 28, baseType: !42, size: 64, offset: 384)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "nfo", scope: !32, file: !22, line: 28, baseType: !25, size: 32, offset: 448)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "stages", scope: !32, file: !22, line: 28, baseType: !42, size: 64, offset: 512)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "xcol_sz", scope: !32, file: !22, line: 29, baseType: !42, size: 64, offset: 576)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "xcol_indices", scope: !32, file: !22, line: 29, baseType: !42, size: 64, offset: 640)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "xcol_vals", scope: !32, file: !22, line: 30, baseType: !50, size: 64, offset: 704)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !13, line: 305, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !13, line: 189, baseType: !54)
!54 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !32, file: !22, line: 30, baseType: !51, size: 64, offset: 768)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "solve_uu", scope: !32, file: !22, line: 30, baseType: !51, size: 64, offset: 832)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "solve_w", scope: !32, file: !22, line: 30, baseType: !51, size: 64, offset: 896)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ycol_sz", scope: !32, file: !22, line: 31, baseType: !42, size: 64, offset: 960)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "ycol_indices", scope: !32, file: !22, line: 31, baseType: !42, size: 64, offset: 1024)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "ycol_vals", scope: !32, file: !22, line: 32, baseType: !50, size: 64, offset: 1088)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !32, file: !22, line: 32, baseType: !51, size: 64, offset: 1152)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "nsolves", scope: !32, file: !22, line: 33, baseType: !25, size: 32, offset: 1216)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "tot_solve_time", scope: !32, file: !22, line: 34, baseType: !52, size: 64, offset: 1280)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "mvi", scope: !21, file: !22, line: 50, baseType: !65, size: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "mv_info", file: !22, line: 43, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "matvec_info", file: !22, line: 37, size: 384, elements: !68)
!68 = !{!69, !70, !71, !72, !73, !74, !78, !84}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !67, file: !22, line: 38, baseType: !25, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !67, file: !22, line: 38, baseType: !25, size: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "n_global", scope: !67, file: !22, line: 38, baseType: !25, size: 32, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "m_global", scope: !67, file: !22, line: 38, baseType: !25, size: 32, offset: 96)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "local2global", scope: !67, file: !22, line: 39, baseType: !42, size: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "PCTFS_gs_handle", scope: !67, file: !22, line: 40, baseType: !75, size: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCTFS_gs_ADT", file: !19, line: 226, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "gather_scatter_id", file: !19, line: 226, flags: DIFlagFwdDecl)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "matvec", scope: !67, file: !22, line: 41, baseType: !79, size: 64, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!82, !83, !51, !51}
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !13, line: 14, baseType: !26)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "grid_data", scope: !67, file: !22, line: 42, baseType: !85, size: 64, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !87, line: 330, baseType: !88)
!87 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !87, line: 330, flags: DIFlagFwdDecl)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!82, !65, !51, !51}
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !13, line: 430, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !13, line: 430, flags: DIFlagFwdDecl)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!98 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBLASInt", file: !13, line: 140, baseType: !26)
!100 = !{!0, !101}
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "n_xyt", scope: !2, file: !22, line: 53, type: !25, isLocal: true, isDefinition: true)
!103 = !{i32 7, !"Dwarf Version", i32 4}
!104 = !{i32 2, !"Debug Info Version", i32 3}
!105 = !{i32 1, !"wchar_size", i32 4}
!106 = !{i32 7, !"PIC Level", i32 2}
!107 = !{i32 7, !"uwtable", i32 1}
!108 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!109 = distinct !DISubprogram(name: "XYT_new", scope: !22, file: !22, line: 66, type: !110, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !112)
!110 = !DISubroutineType(types: !111)
!111 = !{!18}
!112 = !{!113}
!113 = !DILocalVariable(name: "xyt_handle", scope: !109, file: !22, line: 68, type: !18)
!114 = !DILocation(line: 71, column: 16, scope: !109)
!115 = !{!116, !116, i64 0}
!116 = !{!"int", !117, i64 0}
!117 = !{!"omnipotent char", !118, i64 0}
!118 = !{!"Simple C/C++ TBAA"}
!119 = !DILocation(line: 72, column: 31, scope: !109)
!120 = !DILocation(line: 72, column: 22, scope: !109)
!121 = !DILocation(line: 0, scope: !109)
!122 = !DILocation(line: 73, column: 22, scope: !109)
!123 = !DILocation(line: 73, column: 15, scope: !109)
!124 = !DILocation(line: 73, column: 20, scope: !109)
!125 = !{!126, !116, i64 0}
!126 = !{!"xyt_CDT", !116, i64 0, !116, i64 4, !116, i64 8, !127, i64 16, !127, i64 24}
!127 = !{!"any pointer", !117, i64 0}
!128 = !DILocation(line: 74, column: 15, scope: !109)
!129 = !DILocation(line: 77, column: 3, scope: !109)
!130 = !DILocation(line: 75, column: 20, scope: !109)
!131 = distinct !DISubprogram(name: "XYT_factor", scope: !22, file: !22, line: 81, type: !132, scopeLine: 87, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !137)
!132 = !DISubroutineType(types: !133)
!133 = !{!82, !18, !42, !25, !25, !134, !85}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!82, !85, !51, !51}
!137 = !{!138, !139, !140, !141, !142, !143}
!138 = !DILocalVariable(name: "xyt_handle", arg: 1, scope: !131, file: !22, line: 81, type: !18)
!139 = !DILocalVariable(name: "local2global", arg: 2, scope: !131, file: !22, line: 82, type: !42)
!140 = !DILocalVariable(name: "n", arg: 3, scope: !131, file: !22, line: 83, type: !25)
!141 = !DILocalVariable(name: "m", arg: 4, scope: !131, file: !22, line: 84, type: !25)
