; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/impls/null/drawnull.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/impls/null/drawnull.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscDraw = type { %struct._p_PetscObject, [1 x %struct._PetscDrawOps], double, double, double, double, double, double, double, double, double, [20 x double], [20 x double], double, double, double, double, i32, i32, i8*, i8*, %struct._p_PetscDraw*, i32, i32, i32, i32, i8*, i8*, i8*, i32, i32, i32, i8*, i32, i32, i8* }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!14 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!24 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!25 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 204, baseType: !7, size: 32, elements: !28)
!27 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdraw.h", directory: "/home/users/ndemeye/xSDK")
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36, !37}
!29 = !DIEnumerator(name: "PETSC_BUTTON_NONE", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "PETSC_BUTTON_LEFT", value: 1, isUnsigned: true)
!31 = !DIEnumerator(name: "PETSC_BUTTON_CENTER", value: 2, isUnsigned: true)
!32 = !DIEnumerator(name: "PETSC_BUTTON_RIGHT", value: 3, isUnsigned: true)
!33 = !DIEnumerator(name: "PETSC_BUTTON_WHEEL_UP", value: 4, isUnsigned: true)
!34 = !DIEnumerator(name: "PETSC_BUTTON_WHEEL_DOWN", value: 5, isUnsigned: true)
!35 = !DIEnumerator(name: "PETSC_BUTTON_LEFT_SHIFT", value: 6, isUnsigned: true)
!36 = !DIEnumerator(name: "PETSC_BUTTON_CENTER_SHIFT", value: 7, isUnsigned: true)
!37 = !DIEnumerator(name: "PETSC_BUTTON_RIGHT_SHIFT", value: 8, isUnsigned: true)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 141, baseType: !7, size: 32, elements: !39)
!39 = !{!40, !41, !42, !43}
!40 = !DIEnumerator(name: "PETSC_DRAW_MARKER_CROSS", value: 0, isUnsigned: true)
!41 = !DIEnumerator(name: "PETSC_DRAW_MARKER_POINT", value: 1, isUnsigned: true)
!42 = !DIEnumerator(name: "PETSC_DRAW_MARKER_PLUS", value: 2, isUnsigned: true)
!43 = !DIEnumerator(name: "PETSC_DRAW_MARKER_CIRCLE", value: 3, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 663, baseType: !7, size: 32, elements: !46)
!45 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!46 = !{!47, !48, !49}
!47 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!48 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!49 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !51)
!51 = !{!52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69}
!52 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!54 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!55 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!56 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!57 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!60 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!61 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!62 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!63 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!64 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!65 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!66 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!67 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!68 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!69 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!70 = !{!71, !75, !76, !79, !246, !162}
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !72, line: 330, baseType: !73)
!72 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !72, line: 330, flags: DIFlagFwdDecl)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!78 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !82, line: 73, size: 4480, elements: !83)
!82 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!83 = !{!84, !87, !133, !134, !136, !139, !140, !141, !142, !150, !151, !153, !157, !161, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !174, !175, !176, !178, !179, !181, !183, !184, !185, !186, !187, !190, !192, !193, !194, !195, !196, !199, !201, !202, !203, !213, !215, !216, !220, !221, !270, !275, !277, !278, !279}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !81, file: !82, line: 74, baseType: !85, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !86)
!86 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !81, file: !82, line: 75, baseType: !88, size: 448, offset: 64)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 448, elements: !131)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !82, line: 53, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !82, line: 45, size: 448, elements: !91)
!91 = !{!92, !98, !106, !111, !115, !119, !126}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !90, file: !82, line: 46, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!96, !79, !97}
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !86)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !90, file: !82, line: 47, baseType: !99, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!96, !79, !102}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !103, line: 16, baseType: !104)
!103 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !103, line: 16, flags: DIFlagFwdDecl)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !90, file: !82, line: 48, baseType: !107, size: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!96, !110}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !90, file: !82, line: 49, baseType: !112, size: 64, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!96, !79, !76, !79}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !90, file: !82, line: 50, baseType: !116, size: 64, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!96, !79, !76, !110}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !90, file: !82, line: 51, baseType: !120, size: 64, offset: 320)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!96, !79, !76, !123}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{null}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !90, file: !82, line: 52, baseType: !127, size: 64, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!96, !79, !76, !130}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!131 = !{!132}
!132 = !DISubrange(count: 1)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !81, file: !82, line: 76, baseType: !71, size: 64, offset: 512)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !81, file: !82, line: 77, baseType: !135, size: 32, offset: 576)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !86)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !81, file: !82, line: 78, baseType: !137, size: 64, offset: 640)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !138)
!138 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !81, file: !82, line: 78, baseType: !137, size: 64, offset: 704)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !81, file: !82, line: 78, baseType: !137, size: 64, offset: 768)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !81, file: !82, line: 78, baseType: !137, size: 64, offset: 832)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !81, file: !82, line: 79, baseType: !143, size: 64, offset: 896)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !146, line: 27, baseType: !147)
!146 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !148, line: 43, baseType: !149)
!148 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!149 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !81, file: !82, line: 80, baseType: !135, size: 32, offset: 960)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !81, file: !82, line: 81, baseType: !152, size: 32, offset: 992)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !86)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !81, file: !82, line: 82, baseType: !154, size: 64, offset: 1024)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !81, file: !82, line: 83, baseType: !158, size: 64, offset: 1088)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !81, file: !82, line: 84, baseType: !162, size: 64, offset: 1152)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !81, file: !82, line: 85, baseType: !162, size: 64, offset: 1216)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !81, file: !82, line: 86, baseType: !162, size: 64, offset: 1280)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !81, file: !82, line: 87, baseType: !162, size: 64, offset: 1344)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !81, file: !82, line: 88, baseType: !79, size: 64, offset: 1408)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !81, file: !82, line: 89, baseType: !143, size: 64, offset: 1472)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !81, file: !82, line: 90, baseType: !162, size: 64, offset: 1536)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !81, file: !82, line: 91, baseType: !162, size: 64, offset: 1600)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !81, file: !82, line: 92, baseType: !135, size: 32, offset: 1664)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !81, file: !82, line: 93, baseType: !75, size: 64, offset: 1728)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !81, file: !82, line: 94, baseType: !173, size: 64, offset: 1792)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !144)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !81, file: !82, line: 95, baseType: !135, size: 32, offset: 1856)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !81, file: !82, line: 95, baseType: !135, size: 32, offset: 1888)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !81, file: !82, line: 96, baseType: !177, size: 64, offset: 1920)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !81, file: !82, line: 96, baseType: !177, size: 64, offset: 1984)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !81, file: !82, line: 97, baseType: !180, size: 64, offset: 2048)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !81, file: !82, line: 97, baseType: !182, size: 64, offset: 2112)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !81, file: !82, line: 98, baseType: !135, size: 32, offset: 2176)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !81, file: !82, line: 98, baseType: !135, size: 32, offset: 2208)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !81, file: !82, line: 99, baseType: !177, size: 64, offset: 2240)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !81, file: !82, line: 99, baseType: !177, size: 64, offset: 2304)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !81, file: !82, line: 100, baseType: !188, size: 64, offset: 2368)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !138)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !81, file: !82, line: 100, baseType: !191, size: 64, offset: 2432)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !81, file: !82, line: 101, baseType: !135, size: 32, offset: 2496)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !81, file: !82, line: 101, baseType: !135, size: 32, offset: 2528)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !81, file: !82, line: 102, baseType: !177, size: 64, offset: 2560)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !81, file: !82, line: 102, baseType: !177, size: 64, offset: 2624)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !81, file: !82, line: 103, baseType: !197, size: 64, offset: 2688)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !189)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !81, file: !82, line: 103, baseType: !200, size: 64, offset: 2752)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !81, file: !82, line: 104, baseType: !130, size: 64, offset: 2816)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !81, file: !82, line: 105, baseType: !135, size: 32, offset: 2880)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !81, file: !82, line: 106, baseType: !204, size: 128, offset: 2944)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 128, elements: !211)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !82, line: 64, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !82, line: 61, size: 128, elements: !208)
!208 = !{!209, !210}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !207, file: !82, line: 62, baseType: !123, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !207, file: !82, line: 63, baseType: !75, size: 64, offset: 64)
!211 = !{!212}
!212 = !DISubrange(count: 2)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !81, file: !82, line: 107, baseType: !214, size: 64, offset: 3072)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 64, elements: !211)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !81, file: !82, line: 108, baseType: !75, size: 64, offset: 3136)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !81, file: !82, line: 109, baseType: !217, size: 64, offset: 3200)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!96, !75}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !81, file: !82, line: 111, baseType: !135, size: 32, offset: 3264)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !81, file: !82, line: 112, baseType: !222, size: 320, offset: 3328)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 320, elements: !268)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!96, !226, !79, !75}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !229)
!229 = !{!230, !231, !256, !257, !258, !259, !260, !261, !262, !263, !264}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !228, file: !12, line: 100, baseType: !135, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !228, file: !12, line: 101, baseType: !232, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !235)
!235 = !{!236, !237, !238, !239, !240, !243, !244, !245, !249, !251, !253, !254, !255}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !234, file: !12, line: 84, baseType: !162, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !234, file: !12, line: 85, baseType: !162, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !234, file: !12, line: 86, baseType: !75, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !234, file: !12, line: 87, baseType: !154, size: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !234, file: !12, line: 88, baseType: !241, size: 64, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !234, file: !12, line: 89, baseType: !78, size: 8, offset: 320)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !234, file: !12, line: 90, baseType: !162, size: 64, offset: 384)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !234, file: !12, line: 91, baseType: !246, size: 64, offset: 448)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !247, line: 46, baseType: !248)
!247 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!248 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !234, file: !12, line: 92, baseType: !250, size: 32, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !234, file: !12, line: 93, baseType: !252, size: 32, offset: 544)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !234, file: !12, line: 94, baseType: !232, size: 64, offset: 576)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !234, file: !12, line: 95, baseType: !162, size: 64, offset: 640)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !234, file: !12, line: 96, baseType: !75, size: 64, offset: 704)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !228, file: !12, line: 102, baseType: !162, size: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !228, file: !12, line: 102, baseType: !162, size: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !228, file: !12, line: 103, baseType: !162, size: 64, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !228, file: !12, line: 104, baseType: !71, size: 64, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !228, file: !12, line: 105, baseType: !250, size: 32, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !228, file: !12, line: 105, baseType: !250, size: 32, offset: 416)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !228, file: !12, line: 105, baseType: !250, size: 32, offset: 448)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !228, file: !12, line: 106, baseType: !79, size: 64, offset: 512)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !228, file: !12, line: 107, baseType: !265, size: 64, offset: 576)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!268 = !{!269}
!269 = !DISubrange(count: 5)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !81, file: !82, line: 113, baseType: !271, size: 320, offset: 3648)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 320, elements: !268)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!96, !79, !75}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !81, file: !82, line: 114, baseType: !276, size: 320, offset: 3968)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 320, elements: !268)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !81, file: !82, line: 115, baseType: !250, size: 32, offset: 4288)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !81, file: !82, line: 120, baseType: !265, size: 64, offset: 4352)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !81, file: !82, line: 121, baseType: !250, size: 32, offset: 4416)
!280 = !{!0}
!281 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/impls/null/drawnull.c", directory: "/home/users/ndemeye/xSDK")
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscDrawOps", file: !283, line: 14, size: 2304, elements: !284)
!283 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/drawimpl.h", directory: "/home/users/ndemeye/xSDK")
!284 = !{!285, !336, !337, !341, !345, !349, !353, !354, !358, !359, !363, !367, !371, !372, !376, !380, !381, !387, !388, !389, !390, !395, !399, !400, !404, !405, !409, !410, !411, !412, !424, !425, !426, !431, !435, !439}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "setdoublebuffer", scope: !282, file: !283, line: 15, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!96, !289}
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDraw", file: !290, line: 25, baseType: !291)
!290 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdrawtypes.h", directory: "/home/users/ndemeye/xSDK")
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDraw", file: !283, line: 53, size: 11072, elements: !293)
!293 = !{!294, !296, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !311, !312, !313, !314, !315, !316, !317, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !292, file: !283, line: 54, baseType: !295, size: 4480)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !82, line: 122, baseType: !81)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !292, file: !283, line: 54, baseType: !297, size: 2304, offset: 4480)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 2304, elements: !131)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !292, file: !283, line: 55, baseType: !189, size: 64, offset: 6784)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "port_xl", scope: !292, file: !283, line: 56, baseType: !189, size: 64, offset: 6848)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "port_yl", scope: !292, file: !283, line: 56, baseType: !189, size: 64, offset: 6912)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "port_xr", scope: !292, file: !283, line: 56, baseType: !189, size: 64, offset: 6976)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "port_yr", scope: !292, file: !283, line: 56, baseType: !189, size: 64, offset: 7040)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "coor_xl", scope: !292, file: !283, line: 57, baseType: !189, size: 64, offset: 7104)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "coor_yl", scope: !292, file: !283, line: 57, baseType: !189, size: 64, offset: 7168)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "coor_xr", scope: !292, file: !283, line: 57, baseType: !189, size: 64, offset: 7232)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "coor_yr", scope: !292, file: !283, line: 57, baseType: !189, size: 64, offset: 7296)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "currentpoint_x", scope: !292, file: !283, line: 58, baseType: !308, size: 1280, offset: 7360)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 1280, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 20)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "currentpoint_y", scope: !292, file: !283, line: 58, baseType: !308, size: 1280, offset: 8640)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_xl", scope: !292, file: !283, line: 59, baseType: !189, size: 64, offset: 9920)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_yl", scope: !292, file: !283, line: 59, baseType: !189, size: 64, offset: 9984)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_xr", scope: !292, file: !283, line: 59, baseType: !189, size: 64, offset: 10048)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_yr", scope: !292, file: !283, line: 59, baseType: !189, size: 64, offset: 10112)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "currentpoint", scope: !292, file: !283, line: 60, baseType: !135, size: 32, offset: 10176)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "markertype", scope: !292, file: !283, line: 61, baseType: !318, size: 32, offset: 10208)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawMarkerType", file: !27, line: 141, baseType: !38)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !292, file: !283, line: 62, baseType: !162, size: 64, offset: 10240)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !292, file: !283, line: 63, baseType: !162, size: 64, offset: 10304)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "popup", scope: !292, file: !283, line: 64, baseType: !289, size: 64, offset: 10368)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !292, file: !283, line: 65, baseType: !86, size: 32, offset: 10432)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !292, file: !283, line: 65, baseType: !86, size: 32, offset: 10464)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !292, file: !283, line: 65, baseType: !86, size: 32, offset: 10496)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !292, file: !283, line: 65, baseType: !86, size: 32, offset: 10528)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "savefilename", scope: !292, file: !283, line: 66, baseType: !162, size: 64, offset: 10560)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "saveimageext", scope: !292, file: !283, line: 67, baseType: !162, size: 64, offset: 10624)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "savemovieext", scope: !292, file: !283, line: 68, baseType: !162, size: 64, offset: 10688)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "savefilecount", scope: !292, file: !283, line: 69, baseType: !135, size: 32, offset: 10752)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "savesinglefile", scope: !292, file: !283, line: 70, baseType: !250, size: 32, offset: 10784)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "savemoviefps", scope: !292, file: !283, line: 71, baseType: !135, size: 32, offset: 10816)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "savefinalfilename", scope: !292, file: !283, line: 72, baseType: !162, size: 64, offset: 10880)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "saveonclear", scope: !292, file: !283, line: 73, baseType: !250, size: 32, offset: 10944)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "saveonflush", scope: !292, file: !283, line: 74, baseType: !250, size: 32, offset: 10976)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !292, file: !283, line: 75, baseType: !75, size: 64, offset: 11008)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !282, file: !283, line: 16, baseType: !286, size: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !282, file: !283, line: 17, baseType: !338, size: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!96, !289, !189, !189, !189, !189, !86}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "linesetwidth", scope: !282, file: !283, line: 18, baseType: !342, size: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!96, !289, !189}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "linegetwidth", scope: !282, file: !283, line: 19, baseType: !346, size: 64, offset: 256)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!96, !289, !188}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "point", scope: !282, file: !283, line: 20, baseType: !350, size: 64, offset: 320)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!96, !289, !189, !189, !86}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "pointsetsize", scope: !282, file: !283, line: 21, baseType: !342, size: 64, offset: 384)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !282, file: !283, line: 22, baseType: !355, size: 64, offset: 448)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!96, !289, !189, !189, !86, !76}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "stringvertical", scope: !282, file: !283, line: 23, baseType: !355, size: 64, offset: 512)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "stringsetsize", scope: !282, file: !283, line: 24, baseType: !360, size: 64, offset: 576)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!96, !289, !189, !189}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "stringgetsize", scope: !282, file: !283, line: 25, baseType: !364, size: 64, offset: 640)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!96, !289, !188, !188}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "setviewport", scope: !282, file: !283, line: 26, baseType: !368, size: 64, offset: 704)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!96, !289, !189, !189, !189, !189}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "clear", scope: !282, file: !283, line: 27, baseType: !286, size: 64, offset: 768)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "rectangle", scope: !282, file: !283, line: 28, baseType: !373, size: 64, offset: 832)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!96, !289, !189, !189, !189, !189, !86, !86, !86, !86}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "triangle", scope: !282, file: !283, line: 29, baseType: !377, size: 64, offset: 896)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!96, !289, !189, !189, !189, !189, !189, !189, !86, !86, !86}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ellipse", scope: !282, file: !283, line: 30, baseType: !338, size: 64, offset: 960)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "getmousebutton", scope: !282, file: !283, line: 31, baseType: !382, size: 64, offset: 1024)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!96, !289, !385, !188, !188, !188, !188}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawButton", file: !27, line: 207, baseType: !26)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !282, file: !283, line: 32, baseType: !286, size: 64, offset: 1088)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "beginpage", scope: !282, file: !283, line: 33, baseType: !286, size: 64, offset: 1152)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "endpage", scope: !282, file: !283, line: 34, baseType: !286, size: 64, offset: 1216)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "getpopup", scope: !282, file: !283, line: 35, baseType: !391, size: 64, offset: 1280)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!96, !289, !394}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "settitle", scope: !282, file: !283, line: 36, baseType: !396, size: 64, offset: 1344)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!96, !289, !76}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "checkresizedwindow", scope: !282, file: !283, line: 37, baseType: !286, size: 64, offset: 1408)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "resizewindow", scope: !282, file: !283, line: 38, baseType: !401, size: 64, offset: 1472)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!96, !289, !86, !86}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !282, file: !283, line: 39, baseType: !286, size: 64, offset: 1536)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !282, file: !283, line: 40, baseType: !406, size: 64, offset: 1600)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!96, !289, !102}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "getsingleton", scope: !282, file: !283, line: 41, baseType: !391, size: 64, offset: 1664)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "restoresingleton", scope: !282, file: !283, line: 42, baseType: !391, size: 64, offset: 1728)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "save", scope: !282, file: !283, line: 43, baseType: !286, size: 64, offset: 1792)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "getimage", scope: !282, file: !283, line: 44, baseType: !413, size: 64, offset: 1856)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!96, !289, !416, !421, !421, !422}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 24, elements: !419)
!418 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!419 = !{!420}
!420 = !DISubrange(count: 3)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "setcoordinates", scope: !282, file: !283, line: 45, baseType: !368, size: 64, offset: 1920)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "arrow", scope: !282, file: !283, line: 46, baseType: !338, size: 64, offset: 1984)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatetopixel", scope: !282, file: !283, line: 47, baseType: !427, size: 64, offset: 2048)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!96, !289, !189, !189, !430, !430}
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "pixeltocoordinate", scope: !282, file: !283, line: 48, baseType: !432, size: 64, offset: 2112)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!96, !289, !86, !86, !188, !188}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "pointpixel", scope: !282, file: !283, line: 49, baseType: !436, size: 64, offset: 2176)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!96, !289, !86, !86, !86}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "boxedstring", scope: !282, file: !283, line: 50, baseType: !440, size: 64, offset: 2240)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{!96, !289, !189, !189, !86, !86, !76, !188, !188}
!443 = !{i32 7, !"Dwarf Version", i32 4}
!444 = !{i32 2, !"Debug Info Version", i32 3}
!445 = !{i32 1, !"wchar_size", i32 4}
!446 = !{i32 7, !"PIC Level", i32 2}
!447 = !{i32 7, !"uwtable", i32 1}
!448 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!449 = distinct !DISubprogram(name: "PetscDrawCreate_Null", scope: !281, file: !281, line: 156, type: !287, scopeLine: 157, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !450)
!450 = !{!451, !452, !453, !455}
!451 = !DILocalVariable(name: "draw", arg: 1, scope: !449, file: !281, line: 156, type: !289)
!452 = !DILocalVariable(name: "ierr", scope: !449, file: !281, line: 158, type: !96)
!453 = !DILocalVariable(name: "ierr__", scope: !454, file: !281, line: 165, type: !96)
!454 = distinct !DILexicalBlock(scope: !449, file: !281, line: 165, column: 41)
!455 = !DILocalVariable(name: "ierr__", scope: !456, file: !281, line: 167, type: !96)
!456 = distinct !DILexicalBlock(scope: !449, file: !281, line: 167, column: 54)
!457 = !DILocation(line: 0, scope: !449)
!458 = !DILocation(line: 159, column: 3, scope: !459)
!459 = distinct !DILexicalBlock(scope: !460, file: !281, line: 159, column: 3)
!460 = distinct !DILexicalBlock(scope: !461, file: !281, line: 159, column: 3)
!461 = distinct !DILexicalBlock(scope: !449, file: !281, line: 159, column: 3)
!462 = !{!463, !463, i64 0}
!463 = !{!"any pointer", !464, i64 0}
!464 = !{!"omnipotent char", !465, i64 0}
!465 = !{!"Simple C/C++ TBAA"}
!466 = !DILocation(line: 159, column: 3, scope: !460)
!467 = !DILocation(line: 159, column: 3, scope: !468)
!468 = distinct !DILexicalBlock(scope: !469, file: !281, line: 159, column: 3)
!469 = distinct !DILexicalBlock(scope: !459, file: !281, line: 159, column: 3)
!470 = !{!471, !472, i64 1536}
!471 = !{!"", !464, i64 0, !464, i64 512, !464, i64 1024, !464, i64 1280, !472, i64 1536, !472, i64 1540, !464, i64 1544}
!472 = !{!"int", !464, i64 0}
!473 = !DILocation(line: 159, column: 3, scope: !469)
!474 = !DILocation(line: 159, column: 3, scope: !475)
!475 = distinct !DILexicalBlock(scope: !468, file: !281, line: 159, column: 3)
!476 = !{!472, !472, i64 0}
!477 = !{!471, !472, i64 1540}
!478 = !DILocation(line: 160, column: 9, scope: !449)
!479 = !DILocation(line: 162, column: 9, scope: !449)
!480 = !DILocation(line: 162, column: 17, scope: !449)
!481 = !{!482, !482, i64 0}
!482 = !{!"double", !464, i64 0}
!483 = !DILocation(line: 162, column: 28, scope: !449)
!484 = !DILocation(line: 162, column: 36, scope: !449)
!485 = !{!486, !482, i64 912}
!486 = !{!"_p_PetscDraw", !487, i64 0, !464, i64 560, !482, i64 848, !482, i64 856, !482, i64 864, !482, i64 872, !482, i64 880, !482, i64 888, !482, i64 896, !482, i64 904, !482, i64 912, !464, i64 920, !464, i64 1080, !482, i64 1240, !482, i64 1248, !482, i64 1256, !482, i64 1264, !472, i64 1272, !464, i64 1276, !463, i64 1280, !463, i64 1288, !463, i64 1296, !472, i64 1304, !472, i64 1308, !472, i64 1312, !472, i64 1316, !463, i64 1320, !463, i64 1328, !463, i64 1336, !472, i64 1344, !464, i64 1348, !472, i64 1352, !463, i64 1360, !464, i64 1368, !464, i64 1372, !463, i64 1376}
