; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/ao/impls/basic/aobasic.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/ao/impls/basic/aobasic.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct._p_AO = type { %struct._p_PetscObject, [1 x %struct._AOOps], i32, i32, %struct._p_IS*, %struct._p_IS*, i8* }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "AOOps_Basic", scope: !2, file: !40, line: 162, type: !258, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !37, globals: !257, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/ao/impls/basic/aobasic.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!4 = !{!5, !11, !26, !32}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 170, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 81, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!14 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!24 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!25 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 663, baseType: !7, size: 32, elements: !28)
!27 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!28 = !{!29, !30, !31}
!29 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!31 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 327, baseType: !7, size: 32, elements: !33)
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!35 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!37 = !{!38, !48, !136, !66, !146, !46, !87, !220, !254, !44, !126}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "AO_Basic", file: !40, line: 12, baseType: !41)
!40 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/is/ao/impls/basic/aobasic.c", directory: "/home/users/ndemeye/xSDK")
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !40, line: 9, size: 128, elements: !42)
!42 = !{!43, !47}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "app", scope: !41, file: !40, line: 10, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !46)
!46 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "petsc", scope: !41, file: !40, line: 11, baseType: !44, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !51, line: 73, size: 4480, elements: !52)
!51 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!52 = !{!53, !55, !108, !109, !110, !113, !114, !115, !116, !124, !125, !127, !131, !135, !137, !138, !139, !140, !141, !142, !143, !144, !145, !147, !149, !150, !151, !153, !154, !155, !157, !158, !159, !160, !161, !164, !166, !167, !168, !169, !170, !173, !175, !176, !177, !187, !189, !190, !194, !195, !244, !249, !251, !252, !253}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !50, file: !51, line: 74, baseType: !54, size: 32)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !46)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !50, file: !51, line: 75, baseType: !56, size: 448, offset: 64)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 448, elements: !106)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !51, line: 53, baseType: !58)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !51, line: 45, size: 448, elements: !59)
!59 = !{!60, !70, !78, !83, !90, !94, !101}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !58, file: !51, line: 46, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!64, !48, !65}
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !46)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !67, line: 330, baseType: !68)
!67 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !67, line: 330, flags: DIFlagFwdDecl)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !58, file: !51, line: 47, baseType: !71, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{!64, !48, !74}
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !75, line: 16, baseType: !76)
!75 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !75, line: 16, flags: DIFlagFwdDecl)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !58, file: !51, line: 48, baseType: !79, size: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!64, !82}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !58, file: !51, line: 49, baseType: !84, size: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{!64, !48, !87, !48}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!89 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !58, file: !51, line: 50, baseType: !91, size: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!64, !48, !87, !82}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !58, file: !51, line: 51, baseType: !95, size: 64, offset: 320)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!64, !48, !87, !98}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{null}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !58, file: !51, line: 52, baseType: !102, size: 64, offset: 384)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!64, !48, !87, !105}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!106 = !{!107}
!107 = !DISubrange(count: 1)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !50, file: !51, line: 76, baseType: !66, size: 64, offset: 512)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !50, file: !51, line: 77, baseType: !45, size: 32, offset: 576)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !50, file: !51, line: 78, baseType: !111, size: 64, offset: 640)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !112)
!112 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !50, file: !51, line: 78, baseType: !111, size: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !50, file: !51, line: 78, baseType: !111, size: 64, offset: 768)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !50, file: !51, line: 78, baseType: !111, size: 64, offset: 832)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !50, file: !51, line: 79, baseType: !117, size: 64, offset: 896)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !120, line: 27, baseType: !121)
!120 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !122, line: 43, baseType: !123)
!122 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!123 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !50, file: !51, line: 80, baseType: !45, size: 32, offset: 960)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !50, file: !51, line: 81, baseType: !126, size: 32, offset: 992)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !46)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !50, file: !51, line: 82, baseType: !128, size: 64, offset: 1024)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !50, file: !51, line: 83, baseType: !132, size: 64, offset: 1088)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !50, file: !51, line: 84, baseType: !136, size: 64, offset: 1152)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !50, file: !51, line: 85, baseType: !136, size: 64, offset: 1216)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !50, file: !51, line: 86, baseType: !136, size: 64, offset: 1280)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !50, file: !51, line: 87, baseType: !136, size: 64, offset: 1344)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !50, file: !51, line: 88, baseType: !48, size: 64, offset: 1408)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !50, file: !51, line: 89, baseType: !117, size: 64, offset: 1472)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !50, file: !51, line: 90, baseType: !136, size: 64, offset: 1536)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !50, file: !51, line: 91, baseType: !136, size: 64, offset: 1600)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !50, file: !51, line: 92, baseType: !45, size: 32, offset: 1664)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !50, file: !51, line: 93, baseType: !146, size: 64, offset: 1728)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !50, file: !51, line: 94, baseType: !148, size: 64, offset: 1792)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !118)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !50, file: !51, line: 95, baseType: !45, size: 32, offset: 1856)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !50, file: !51, line: 95, baseType: !45, size: 32, offset: 1888)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !50, file: !51, line: 96, baseType: !152, size: 64, offset: 1920)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !50, file: !51, line: 96, baseType: !152, size: 64, offset: 1984)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !50, file: !51, line: 97, baseType: !44, size: 64, offset: 2048)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !50, file: !51, line: 97, baseType: !156, size: 64, offset: 2112)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !50, file: !51, line: 98, baseType: !45, size: 32, offset: 2176)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !50, file: !51, line: 98, baseType: !45, size: 32, offset: 2208)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !50, file: !51, line: 99, baseType: !152, size: 64, offset: 2240)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !50, file: !51, line: 99, baseType: !152, size: 64, offset: 2304)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !50, file: !51, line: 100, baseType: !162, size: 64, offset: 2368)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !112)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !50, file: !51, line: 100, baseType: !165, size: 64, offset: 2432)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !50, file: !51, line: 101, baseType: !45, size: 32, offset: 2496)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !50, file: !51, line: 101, baseType: !45, size: 32, offset: 2528)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !50, file: !51, line: 102, baseType: !152, size: 64, offset: 2560)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !50, file: !51, line: 102, baseType: !152, size: 64, offset: 2624)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !50, file: !51, line: 103, baseType: !171, size: 64, offset: 2688)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !163)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !50, file: !51, line: 103, baseType: !174, size: 64, offset: 2752)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !50, file: !51, line: 104, baseType: !105, size: 64, offset: 2816)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !50, file: !51, line: 105, baseType: !45, size: 32, offset: 2880)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !50, file: !51, line: 106, baseType: !178, size: 128, offset: 2944)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 128, elements: !185)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !51, line: 64, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !51, line: 61, size: 128, elements: !182)
!182 = !{!183, !184}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !181, file: !51, line: 62, baseType: !98, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !181, file: !51, line: 63, baseType: !146, size: 64, offset: 64)
!185 = !{!186}
!186 = !DISubrange(count: 2)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !50, file: !51, line: 107, baseType: !188, size: 64, offset: 3072)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 64, elements: !185)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !50, file: !51, line: 108, baseType: !146, size: 64, offset: 3136)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !50, file: !51, line: 109, baseType: !191, size: 64, offset: 3200)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!64, !146}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !50, file: !51, line: 111, baseType: !45, size: 32, offset: 3264)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !50, file: !51, line: 112, baseType: !196, size: 320, offset: 3328)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 320, elements: !242)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!64, !200, !48, !146}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !203)
!203 = !{!204, !205, !230, !231, !232, !233, !234, !235, !236, !237, !238}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !202, file: !12, line: 100, baseType: !45, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !202, file: !12, line: 101, baseType: !206, size: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !209)
!209 = !{!210, !211, !212, !213, !214, !217, !218, !219, !223, !225, !227, !228, !229}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !208, file: !12, line: 84, baseType: !136, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !208, file: !12, line: 85, baseType: !136, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !208, file: !12, line: 86, baseType: !146, size: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !208, file: !12, line: 87, baseType: !128, size: 64, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !208, file: !12, line: 88, baseType: !215, size: 64, offset: 256)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !208, file: !12, line: 89, baseType: !89, size: 8, offset: 320)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !208, file: !12, line: 90, baseType: !136, size: 64, offset: 384)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !208, file: !12, line: 91, baseType: !220, size: 64, offset: 448)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !221, line: 46, baseType: !222)
!221 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!222 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !208, file: !12, line: 92, baseType: !224, size: 32, offset: 512)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !208, file: !12, line: 93, baseType: !226, size: 32, offset: 544)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !208, file: !12, line: 94, baseType: !206, size: 64, offset: 576)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !208, file: !12, line: 95, baseType: !136, size: 64, offset: 640)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !208, file: !12, line: 96, baseType: !146, size: 64, offset: 704)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !202, file: !12, line: 102, baseType: !136, size: 64, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !202, file: !12, line: 102, baseType: !136, size: 64, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !202, file: !12, line: 103, baseType: !136, size: 64, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !202, file: !12, line: 104, baseType: !66, size: 64, offset: 320)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !202, file: !12, line: 105, baseType: !224, size: 32, offset: 384)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !202, file: !12, line: 105, baseType: !224, size: 32, offset: 416)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !202, file: !12, line: 105, baseType: !224, size: 32, offset: 448)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !202, file: !12, line: 106, baseType: !48, size: 64, offset: 512)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !202, file: !12, line: 107, baseType: !239, size: 64, offset: 576)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!242 = !{!243}
!243 = !DISubrange(count: 5)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !50, file: !51, line: 113, baseType: !245, size: 320, offset: 3648)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 320, elements: !242)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!64, !48, !146}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !50, file: !51, line: 114, baseType: !250, size: 320, offset: 3968)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 320, elements: !242)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !50, file: !51, line: 115, baseType: !224, size: 32, offset: 4288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !50, file: !51, line: 120, baseType: !239, size: 64, offset: 4352)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !50, file: !51, line: 121, baseType: !224, size: 32, offset: 4416)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !67, line: 331, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !67, line: 331, flags: DIFlagFwdDecl)
!257 = !{!0}
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_AOOps", file: !259, line: 19, size: 512, elements: !260)
!259 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/vec/is/ao/aoimpl.h", directory: "/home/users/ndemeye/xSDK")
!260 = !{!261, !283, !287, !291, !292, !293, !294, !298}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !258, file: !259, line: 21, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!64, !265, !74}
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "AO", file: !266, line: 17, baseType: !267)
!266 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscao.h", directory: "/home/users/ndemeye/xSDK")
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_AO", file: !259, line: 32, size: 5248, elements: !269)
!269 = !{!270, !272, !274, !275, !276, !281, !282}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !268, file: !259, line: 33, baseType: !271, size: 4480)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !51, line: 122, baseType: !50)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !268, file: !259, line: 33, baseType: !273, size: 512, offset: 4480)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, size: 512, elements: !106)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !268, file: !259, line: 34, baseType: !45, size: 32, offset: 4992)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !268, file: !259, line: 34, baseType: !45, size: 32, offset: 5024)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "isapp", scope: !268, file: !259, line: 35, baseType: !277, size: 64, offset: 5056)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !278, line: 11, baseType: !279)
!278 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !278, line: 11, flags: DIFlagFwdDecl)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ispetsc", scope: !268, file: !259, line: 36, baseType: !277, size: 64, offset: 5120)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !268, file: !259, line: 37, baseType: !146, size: 64, offset: 5184)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !258, file: !259, line: 22, baseType: !284, size: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!64, !265}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "petsctoapplication", scope: !258, file: !259, line: 24, baseType: !288, size: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!64, !265, !45, !44}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "applicationtopetsc", scope: !258, file: !259, line: 25, baseType: !288, size: 64, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "petsctoapplicationpermuteint", scope: !258, file: !259, line: 26, baseType: !288, size: 64, offset: 256)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "applicationtopetscpermuteint", scope: !258, file: !259, line: 27, baseType: !288, size: 64, offset: 320)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "petsctoapplicationpermutereal", scope: !258, file: !259, line: 28, baseType: !295, size: 64, offset: 384)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!64, !265, !45, !162}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "applicationtopetscpermutereal", scope: !258, file: !259, line: 29, baseType: !295, size: 64, offset: 448)
!299 = !{i32 7, !"Dwarf Version", i32 4}
!300 = !{i32 2, !"Debug Info Version", i32 3}
!301 = !{i32 1, !"wchar_size", i32 4}
!302 = !{i32 7, !"PIC Level", i32 2}
!303 = !{i32 7, !"uwtable", i32 1}
!304 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!305 = distinct !DISubprogram(name: "AOView_Basic", scope: !40, file: !40, line: 17, type: !263, scopeLine: 18, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !306)
!306 = !{!307, !308, !309, !310, !311, !312, !313, !314, !316, !322, !323, !327, !331, !333, !338}
!307 = !DILocalVariable(name: "ao", arg: 1, scope: !305, file: !40, line: 17, type: !265)
!308 = !DILocalVariable(name: "viewer", arg: 2, scope: !305, file: !40, line: 17, type: !74)
!309 = !DILocalVariable(name: "ierr", scope: !305, file: !40, line: 19, type: !64)
!310 = !DILocalVariable(name: "rank", scope: !305, file: !40, line: 20, type: !126)
!311 = !DILocalVariable(name: "i", scope: !305, file: !40, line: 21, type: !45)
!312 = !DILocalVariable(name: "aobasic", scope: !305, file: !40, line: 22, type: !38)
!313 = !DILocalVariable(name: "iascii", scope: !305, file: !40, line: 23, type: !224)
!314 = !DILocalVariable(name: "_7_errorcode", scope: !315, file: !40, line: 26, type: !64)
!315 = distinct !DILexicalBlock(scope: !305, file: !40, line: 26, column: 64)
!316 = !DILocalVariable(name: "_7_errorstring", scope: !317, file: !40, line: 26, type: !319)
!317 = distinct !DILexicalBlock(scope: !318, file: !40, line: 26, column: 64)
!318 = distinct !DILexicalBlock(scope: !315, file: !40, line: 26, column: 64)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 2048, elements: !320)
!320 = !{!321}
!321 = !DISubrange(count: 256)
!322 = !DILocalVariable(name: "_7_resultlen", scope: !317, file: !40, line: 26, type: !126)
!323 = !DILocalVariable(name: "ierr__", scope: !324, file: !40, line: 28, type: !64)
!324 = distinct !DILexicalBlock(scope: !325, file: !40, line: 28, column: 81)
!325 = distinct !DILexicalBlock(scope: !326, file: !40, line: 27, column: 14)
!326 = distinct !DILexicalBlock(scope: !305, file: !40, line: 27, column: 7)
!327 = !DILocalVariable(name: "ierr__", scope: !328, file: !40, line: 30, type: !64)
!328 = distinct !DILexicalBlock(scope: !329, file: !40, line: 30, column: 89)
!329 = distinct !DILexicalBlock(scope: !330, file: !40, line: 29, column: 17)
!330 = distinct !DILexicalBlock(scope: !325, file: !40, line: 29, column: 9)
!331 = !DILocalVariable(name: "ierr__", scope: !332, file: !40, line: 31, type: !64)
!332 = distinct !DILexicalBlock(scope: !329, file: !40, line: 31, column: 74)
!333 = !DILocalVariable(name: "ierr__", scope: !334, file: !40, line: 33, type: !64)
!334 = distinct !DILexicalBlock(scope: !335, file: !40, line: 33, column: 110)
!335 = distinct !DILexicalBlock(scope: !336, file: !40, line: 32, column: 31)
!336 = distinct !DILexicalBlock(scope: !337, file: !40, line: 32, column: 7)
!337 = distinct !DILexicalBlock(scope: !329, file: !40, line: 32, column: 7)
!338 = !DILocalVariable(name: "ierr__", scope: !339, file: !40, line: 37, type: !64)
!339 = distinct !DILexicalBlock(scope: !305, file: !40, line: 37, column: 35)
!340 = !DILocation(line: 0, scope: !305)
!341 = !DILocation(line: 20, column: 3, scope: !305)
!342 = !DILocation(line: 22, column: 44, scope: !305)
!343 = !{!344, !349, i64 648}
!344 = !{!"_p_AO", !345, i64 0, !347, i64 560, !346, i64 624, !346, i64 628, !349, i64 632, !349, i64 640, !349, i64 648}
