; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/is/interface/ftn-auto/indexf.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/is/interface/ftn-auto/indexf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._p_IS = type opaque
%struct._n_PetscLayout = type { %struct.ompi_communicator_t*, i32, i32, i32, i32, i32, i32*, i32, i32, i32, %struct._p_ISLocalToGlobalMapping*, i32, i32, i32, i32 }
%struct.ompi_communicator_t = type opaque
%struct._p_ISLocalToGlobalMapping = type opaque
%struct._p_PetscViewer = type opaque

; Function Attrs: nounwind uwtable
define void @isrenumber_(%struct._p_IS* nocapture readonly %0, %struct._p_IS* nocapture readonly %1, i32* %2, %struct._p_IS** %3, i32* nocapture %4) local_unnamed_addr #0 !dbg !50 {
  call void @llvm.dbg.value(metadata %struct._p_IS* %0, metadata !59, metadata !DIExpression()), !dbg !64
  call void @llvm.dbg.value(metadata %struct._p_IS* %1, metadata !60, metadata !DIExpression()), !dbg !64
  call void @llvm.dbg.value(metadata i32* %2, metadata !61, metadata !DIExpression()), !dbg !64
  call void @llvm.dbg.value(metadata %struct._p_IS** %3, metadata !62, metadata !DIExpression()), !dbg !64
  call void @llvm.dbg.value(metadata i32* %4, metadata !63, metadata !DIExpression()), !dbg !64
  %6 = bitcast %struct._p_IS* %0 to i64*, !dbg !65

!229 = !DILocation(line: 216, column: 9, scope: !220)
!230 = !DILocation(line: 218, column: 1, scope: !220)
!231 = !DISubprogram(name: "ISPermutation", scope: !10, file: !10, line: 38, type: !182, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !82)
!232 = distinct !DISubprogram(name: "issetpermutation_", scope: !51, file: !51, line: 219, type: !185, scopeLine: 220, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !233)
!233 = !{!234, !235}
!234 = !DILocalVariable(name: "is", arg: 1, scope: !232, file: !51, line: 219, type: !30)
!235 = !DILocalVariable(name: "__ierr", arg: 2, scope: !232, file: !51, line: 219, type: !57)
!236 = !DILocation(line: 0, scope: !232)
!237 = !DILocation(line: 222, column: 6, scope: !232)
!238 = !DILocation(line: 222, column: 2, scope: !232)
!239 = !DILocation(line: 221, column: 11, scope: !232)
!240 = !DILocation(line: 221, column: 9, scope: !232)
!241 = !DILocation(line: 223, column: 1, scope: !232)
!242 = !DISubprogram(name: "ISSetPermutation", scope: !10, file: !10, line: 37, type: !197, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !82)
!243 = distinct !DISubprogram(name: "isinvertpermutation_", scope: !51, file: !51, line: 224, type: !244, scopeLine: 225, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !246)
!244 = !DISubroutineType(types: !245)
!245 = !{null, !30, !54, !56, !57}
!246 = !{!247, !248, !249, !250}
!247 = !DILocalVariable(name: "is", arg: 1, scope: !243, file: !51, line: 224, type: !30)
!248 = !DILocalVariable(name: "nlocal", arg: 2, scope: !243, file: !51, line: 224, type: !54)
!249 = !DILocalVariable(name: "isout", arg: 3, scope: !243, file: !51, line: 224, type: !56)
!250 = !DILocalVariable(name: "__ierr", arg: 4, scope: !243, file: !51, line: 224, type: !57)
!251 = !DILocation(line: 0, scope: !243)
!252 = !DILocation(line: 227, column: 6, scope: !243)
!253 = !DILocation(line: 227, column: 2, scope: !243)
!254 = !DILocation(line: 227, column: 28, scope: !243)
!255 = !DILocation(line: 226, column: 11, scope: !243)
!256 = !DILocation(line: 226, column: 9, scope: !243)
!257 = !DILocation(line: 228, column: 1, scope: !243)
!258 = !DISubprogram(name: "ISInvertPermutation", scope: !10, file: !10, line: 79, type: !259, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !82)
!259 = !DISubroutineType(types: !260)
!260 = !{!11, !32, !11, !81}
!261 = distinct !DISubprogram(name: "isgetsize_", scope: !51, file: !51, line: 229, type: !262, scopeLine: 230, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !264)
!262 = !DISubroutineType(types: !263)
!263 = !{null, !30, !54, !57}
!264 = !{!265, !266, !267}
!265 = !DILocalVariable(name: "is", arg: 1, scope: !261, file: !51, line: 229, type: !30)
!266 = !DILocalVariable(name: "size", arg: 2, scope: !261, file: !51, line: 229, type: !54)
!267 = !DILocalVariable(name: "__ierr", arg: 3, scope: !261, file: !51, line: 229, type: !57)
!268 = !DILocation(line: 0, scope: !261)
!269 = !DILocation(line: 232, column: 6, scope: !261)
!270 = !DILocation(line: 232, column: 2, scope: !261)
!271 = !DILocation(line: 231, column: 11, scope: !261)
!272 = !DILocation(line: 231, column: 9, scope: !261)
!273 = !DILocation(line: 233, column: 1, scope: !261)
!274 = !DISubprogram(name: "ISGetSize", scope: !10, file: !10, line: 77, type: !275, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !82)
!275 = !DISubroutineType(types: !276)
!276 = !{!11, !32, !57}
!277 = distinct !DISubprogram(name: "isgetlocalsize_", scope: !51, file: !51, line: 234, type: !262, scopeLine: 235, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !278)
!278 = !{!279, !280, !281}
!279 = !DILocalVariable(name: "is", arg: 1, scope: !277, file: !51, line: 234, type: !30)
!280 = !DILocalVariable(name: "size", arg: 2, scope: !277, file: !51, line: 234, type: !54)
!281 = !DILocalVariable(name: "__ierr", arg: 3, scope: !277, file: !51, line: 234, type: !57)
!282 = !DILocation(line: 0, scope: !277)
!283 = !DILocation(line: 237, column: 6, scope: !277)
!284 = !DILocation(line: 237, column: 2, scope: !277)
!285 = !DILocation(line: 236, column: 11, scope: !277)
!286 = !DILocation(line: 236, column: 9, scope: !277)
!287 = !DILocation(line: 238, column: 1, scope: !277)
!288 = !DISubprogram(name: "ISGetLocalSize", scope: !10, file: !10, line: 78, type: !275, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !82)
!289 = distinct !DISubprogram(name: "isgetlayout_", scope: !51, file: !51, line: 239, type: !290, scopeLine: 240, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !320)
!290 = !DISubroutineType(types: !291)
!291 = !{null, !30, !292, !57}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !31, line: 60, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !10, line: 240, size: 640, elements: !296)
!296 = !{!297, !302, !304, !305, !306, !307, !308, !309, !310, !311, !312, !316, !317, !318, !319}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !295, file: !10, line: 241, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !299, line: 330, baseType: !300)
!299 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !299, line: 330, flags: DIFlagFwdDecl)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !295, file: !10, line: 242, baseType: !303, size: 32, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !11)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !295, file: !10, line: 243, baseType: !55, size: 32, offset: 96)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !295, file: !10, line: 243, baseType: !55, size: 32, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !295, file: !10, line: 244, baseType: !55, size: 32, offset: 160)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !295, file: !10, line: 244, baseType: !55, size: 32, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !295, file: !10, line: 245, baseType: !54, size: 64, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !295, file: !10, line: 246, baseType: !106, size: 32, offset: 320)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !295, file: !10, line: 247, baseType: !55, size: 32, offset: 352)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !295, file: !10, line: 251, baseType: !55, size: 32, offset: 384)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !295, file: !10, line: 252, baseType: !313, size: 64, offset: 448)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !31, line: 30, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !31, line: 30, flags: DIFlagFwdDecl)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !295, file: !10, line: 253, baseType: !106, size: 32, offset: 512)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !295, file: !10, line: 254, baseType: !55, size: 32, offset: 544)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !295, file: !10, line: 254, baseType: !55, size: 32, offset: 576)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !295, file: !10, line: 255, baseType: !55, size: 32, offset: 608)
!320 = !{!321, !322, !323}
!321 = !DILocalVariable(name: "is", arg: 1, scope: !289, file: !51, line: 239, type: !30)
!322 = !DILocalVariable(name: "map", arg: 2, scope: !289, file: !51, line: 239, type: !292)
!323 = !DILocalVariable(name: "__ierr", arg: 3, scope: !289, file: !51, line: 239, type: !57)
!324 = !DILocation(line: 0, scope: !289)
!325 = !DILocation(line: 242, column: 6, scope: !289)
!326 = !DILocation(line: 242, column: 2, scope: !289)
!327 = !DILocation(line: 241, column: 11, scope: !289)
!328 = !DILocation(line: 241, column: 9, scope: !289)
!329 = !DILocation(line: 243, column: 1, scope: !289)
!330 = !DISubprogram(name: "ISGetLayout", scope: !10, file: !10, line: 356, type: !331, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !82)
!331 = !DISubroutineType(types: !332)
!332 = !{!11, !32, !333}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!334 = distinct !DISubprogram(name: "islocate_", scope: !51, file: !51, line: 244, type: !335, scopeLine: 245, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !337)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !30, !54, !54, !57}
!337 = !{!338, !339, !340, !341}
!338 = !DILocalVariable(name: "is", arg: 1, scope: !334, file: !51, line: 244, type: !30)
!339 = !DILocalVariable(name: "key", arg: 2, scope: !334, file: !51, line: 244, type: !54)
!340 = !DILocalVariable(name: "location", arg: 3, scope: !334, file: !51, line: 244, type: !54)
!341 = !DILocalVariable(name: "__ierr", arg: 4, scope: !334, file: !51, line: 244, type: !57)
!342 = !DILocation(line: 0, scope: !334)
!343 = !DILocation(line: 247, column: 6, scope: !334)
!344 = !DILocation(line: 247, column: 2, scope: !334)
!345 = !DILocation(line: 247, column: 28, scope: !334)
!346 = !DILocation(line: 246, column: 11, scope: !334)
!347 = !DILocation(line: 246, column: 9, scope: !334)
!348 = !DILocation(line: 248, column: 1, scope: !334)
!349 = !DISubprogram(name: "ISLocate", scope: !10, file: !10, line: 94, type: !350, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !82)
!350 = !DISubroutineType(types: !351)
!351 = !{!11, !32, !11, !57}
!352 = distinct !DISubprogram(name: "isgetnonlocalis_", scope: !51, file: !51, line: 249, type: !353, scopeLine: 250, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !355)
!353 = !DISubroutineType(types: !354)
!354 = !{null, !30, !56, !57}
!355 = !{!356, !357, !358}
!356 = !DILocalVariable(name: "is", arg: 1, scope: !352, file: !51, line: 249, type: !30)
!357 = !DILocalVariable(name: "complement", arg: 2, scope: !352, file: !51, line: 249, type: !56)
!358 = !DILocalVariable(name: "__ierr", arg: 3, scope: !352, file: !51, line: 249, type: !57)
!359 = !DILocation(line: 0, scope: !352)
!360 = !DILocation(line: 252, column: 6, scope: !352)
!361 = !DILocation(line: 252, column: 2, scope: !352)
!362 = !DILocation(line: 251, column: 11, scope: !352)
!363 = !DILocation(line: 251, column: 9, scope: !352)
!364 = !DILocation(line: 253, column: 1, scope: !352)
!365 = !DISubprogram(name: "ISGetNonlocalIS", scope: !10, file: !10, line: 75, type: !366, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !82)
!366 = !DISubroutineType(types: !367)
!367 = !{!11, !32, !81}
!368 = distinct !DISubprogram(name: "isrestorenonlocalis_", scope: !51, file: !51, line: 254, type: !353, scopeLine: 255, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !369)
!369 = !{!370, !371, !372}
!370 = !DILocalVariable(name: "is", arg: 1, scope: !368, file: !51, line: 254, type: !30)
!371 = !DILocalVariable(name: "complement", arg: 2, scope: !368, file: !51, line: 254, type: !56)
