; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/linesearch/impls/gpcglinesearch/gpcglinesearch.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/linesearch/impls/gpcglinesearch/gpcglinesearch.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_TaoLineSearch = type { %struct._p_PetscObject, [1 x %struct._TaoLineSearchOps], i8*, i8*, i8*, i8*, i32, %struct._p_PetscViewer*, i32, i32, i32, i32, i32, i32, i8*, %struct._p_Vec*, %struct._p_Vec*, i32, %struct._p_Vec*, %struct._p_Vec*, double, double, %struct._p_Vec*, %struct._p_Vec*, double, double, i32, i32, i32, i32, i32, double, double, double, double, double, %struct._p_Tao* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !46, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/linesearch/impls/gpcglinesearch/gpcglinesearch.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!2 = !{!3, !9, !24, !40}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 170, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 81, baseType: !5, size: 32, elements: !11)
!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!12 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 6, baseType: !26, size: 32, elements: !27)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctaolinesearch.h", directory: "/home/users/ndemeye/xSDK")
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39}
!28 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_INFORNAN", value: -1)
!29 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_BADPARAMETER", value: -2)
!30 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_ASCENT", value: -3)
!31 = !DIEnumerator(name: "TAOLINESEARCH_CONTINUE_ITERATING", value: 0)
!32 = !DIEnumerator(name: "TAOLINESEARCH_SUCCESS", value: 1)
!33 = !DIEnumerator(name: "TAOLINESEARCH_SUCCESS_USER", value: 2)
!34 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_OTHER", value: 3)
!35 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_MAXFCN", value: 4)
!36 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_UPPERBOUND", value: 5)
!37 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_LOWERBOUND", value: 6)
!38 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_RTOL", value: 7)
!39 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_USER", value: 8)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 663, baseType: !5, size: 32, elements: !42)
!41 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!42 = !{!43, !44, !45}
!43 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!44 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!45 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!46 = !{!47, !50, !68, !149, !89, !255, !115}
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !48, line: 46, baseType: !49)
!48 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!49 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !53, line: 73, size: 4480, elements: !54)
!53 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!54 = !{!55, !57, !110, !111, !113, !116, !117, !118, !119, !127, !128, !130, !134, !138, !140, !141, !142, !143, !144, !145, !146, !147, !148, !150, !152, !153, !154, !156, !157, !159, !161, !162, !163, !164, !165, !168, !170, !171, !172, !173, !174, !177, !179, !180, !181, !191, !193, !194, !198, !199, !245, !250, !252, !253, !254}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !52, file: !53, line: 74, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !52, file: !53, line: 75, baseType: !58, size: 448, offset: 64)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 448, elements: !108)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !53, line: 53, baseType: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !53, line: 45, size: 448, elements: !61)
!61 = !{!62, !72, !80, !85, !92, !96, !103}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !60, file: !53, line: 46, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{!66, !50, !67}
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !69, line: 330, baseType: !70)
!69 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !69, line: 330, flags: DIFlagFwdDecl)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !60, file: !53, line: 47, baseType: !73, size: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!66, !50, !76}
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !77, line: 16, baseType: !78)
!77 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !77, line: 16, flags: DIFlagFwdDecl)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !60, file: !53, line: 48, baseType: !81, size: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{!66, !84}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !60, file: !53, line: 49, baseType: !86, size: 64, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!66, !50, !89, !50}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!91 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !60, file: !53, line: 50, baseType: !93, size: 64, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!66, !50, !89, !84}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !60, file: !53, line: 51, baseType: !97, size: 64, offset: 320)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!66, !50, !89, !100}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{null}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !60, file: !53, line: 52, baseType: !104, size: 64, offset: 384)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!66, !50, !89, !107}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!108 = !{!109}
!109 = !DISubrange(count: 1)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !52, file: !53, line: 76, baseType: !68, size: 64, offset: 512)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !52, file: !53, line: 77, baseType: !112, size: 32, offset: 576)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !52, file: !53, line: 78, baseType: !114, size: 64, offset: 640)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !115)
!115 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !52, file: !53, line: 78, baseType: !114, size: 64, offset: 704)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !52, file: !53, line: 78, baseType: !114, size: 64, offset: 768)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !52, file: !53, line: 78, baseType: !114, size: 64, offset: 832)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !52, file: !53, line: 79, baseType: !120, size: 64, offset: 896)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !123, line: 27, baseType: !124)
!123 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !125, line: 43, baseType: !126)
!125 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!126 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !52, file: !53, line: 80, baseType: !112, size: 32, offset: 960)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !52, file: !53, line: 81, baseType: !129, size: 32, offset: 992)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !52, file: !53, line: 82, baseType: !131, size: 64, offset: 1024)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !52, file: !53, line: 83, baseType: !135, size: 64, offset: 1088)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !52, file: !53, line: 84, baseType: !139, size: 64, offset: 1152)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !52, file: !53, line: 85, baseType: !139, size: 64, offset: 1216)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !52, file: !53, line: 86, baseType: !139, size: 64, offset: 1280)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !52, file: !53, line: 87, baseType: !139, size: 64, offset: 1344)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !52, file: !53, line: 88, baseType: !50, size: 64, offset: 1408)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !52, file: !53, line: 89, baseType: !120, size: 64, offset: 1472)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !52, file: !53, line: 90, baseType: !139, size: 64, offset: 1536)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !52, file: !53, line: 91, baseType: !139, size: 64, offset: 1600)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !52, file: !53, line: 92, baseType: !112, size: 32, offset: 1664)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !52, file: !53, line: 93, baseType: !149, size: 64, offset: 1728)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !52, file: !53, line: 94, baseType: !151, size: 64, offset: 1792)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !121)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !52, file: !53, line: 95, baseType: !112, size: 32, offset: 1856)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !52, file: !53, line: 95, baseType: !112, size: 32, offset: 1888)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !52, file: !53, line: 96, baseType: !155, size: 64, offset: 1920)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !52, file: !53, line: 96, baseType: !155, size: 64, offset: 1984)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !52, file: !53, line: 97, baseType: !158, size: 64, offset: 2048)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !52, file: !53, line: 97, baseType: !160, size: 64, offset: 2112)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !52, file: !53, line: 98, baseType: !112, size: 32, offset: 2176)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !52, file: !53, line: 98, baseType: !112, size: 32, offset: 2208)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !52, file: !53, line: 99, baseType: !155, size: 64, offset: 2240)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !52, file: !53, line: 99, baseType: !155, size: 64, offset: 2304)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !52, file: !53, line: 100, baseType: !166, size: 64, offset: 2368)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !115)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !52, file: !53, line: 100, baseType: !169, size: 64, offset: 2432)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !52, file: !53, line: 101, baseType: !112, size: 32, offset: 2496)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !52, file: !53, line: 101, baseType: !112, size: 32, offset: 2528)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !52, file: !53, line: 102, baseType: !155, size: 64, offset: 2560)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !52, file: !53, line: 102, baseType: !155, size: 64, offset: 2624)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !52, file: !53, line: 103, baseType: !175, size: 64, offset: 2688)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !167)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !52, file: !53, line: 103, baseType: !178, size: 64, offset: 2752)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !52, file: !53, line: 104, baseType: !107, size: 64, offset: 2816)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !52, file: !53, line: 105, baseType: !112, size: 32, offset: 2880)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !52, file: !53, line: 106, baseType: !182, size: 128, offset: 2944)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 128, elements: !189)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !53, line: 64, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !53, line: 61, size: 128, elements: !186)
!186 = !{!187, !188}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !185, file: !53, line: 62, baseType: !100, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !185, file: !53, line: 63, baseType: !149, size: 64, offset: 64)
!189 = !{!190}
!190 = !DISubrange(count: 2)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !52, file: !53, line: 107, baseType: !192, size: 64, offset: 3072)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 64, elements: !189)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !52, file: !53, line: 108, baseType: !149, size: 64, offset: 3136)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !52, file: !53, line: 109, baseType: !195, size: 64, offset: 3200)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!66, !149}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !52, file: !53, line: 111, baseType: !112, size: 32, offset: 3264)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !52, file: !53, line: 112, baseType: !200, size: 320, offset: 3328)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 320, elements: !243)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!66, !204, !50, !149}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !207)
!207 = !{!208, !209, !231, !232, !233, !234, !235, !236, !237, !238, !239}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !206, file: !10, line: 100, baseType: !112, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !206, file: !10, line: 101, baseType: !210, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !213)
!213 = !{!214, !215, !216, !217, !218, !221, !222, !223, !224, !226, !228, !229, !230}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !212, file: !10, line: 84, baseType: !139, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !212, file: !10, line: 85, baseType: !139, size: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !212, file: !10, line: 86, baseType: !149, size: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !212, file: !10, line: 87, baseType: !131, size: 64, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !212, file: !10, line: 88, baseType: !219, size: 64, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !212, file: !10, line: 89, baseType: !91, size: 8, offset: 320)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !212, file: !10, line: 90, baseType: !139, size: 64, offset: 384)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !212, file: !10, line: 91, baseType: !47, size: 64, offset: 448)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !212, file: !10, line: 92, baseType: !225, size: 32, offset: 512)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !212, file: !10, line: 93, baseType: !227, size: 32, offset: 544)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !212, file: !10, line: 94, baseType: !210, size: 64, offset: 576)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !212, file: !10, line: 95, baseType: !139, size: 64, offset: 640)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !212, file: !10, line: 96, baseType: !149, size: 64, offset: 704)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !206, file: !10, line: 102, baseType: !139, size: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !206, file: !10, line: 102, baseType: !139, size: 64, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !206, file: !10, line: 103, baseType: !139, size: 64, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !206, file: !10, line: 104, baseType: !68, size: 64, offset: 320)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !206, file: !10, line: 105, baseType: !225, size: 32, offset: 384)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !206, file: !10, line: 105, baseType: !225, size: 32, offset: 416)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !206, file: !10, line: 105, baseType: !225, size: 32, offset: 448)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !206, file: !10, line: 106, baseType: !50, size: 64, offset: 512)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !206, file: !10, line: 107, baseType: !240, size: 64, offset: 576)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!243 = !{!244}
!244 = !DISubrange(count: 5)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !52, file: !53, line: 113, baseType: !246, size: 320, offset: 3648)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 320, elements: !243)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!66, !50, !149}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !52, file: !53, line: 114, baseType: !251, size: 320, offset: 3968)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 320, elements: !243)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !52, file: !53, line: 115, baseType: !225, size: 32, offset: 4288)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !52, file: !53, line: 120, baseType: !240, size: 64, offset: 4352)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !52, file: !53, line: 121, baseType: !225, size: 32, offset: 4416)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearch_GPCG", file: !257, line: 18, baseType: !258)
!257 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/tao/linesearch/impls/gpcglinesearch/gpcglinesearch.h", directory: "/home/users/ndemeye/xSDK")
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !257, line: 6, size: 384, elements: !259)
!259 = !{!260, !261, !262, !263, !268, !269, !270}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "maxstep", scope: !258, file: !257, line: 9, baseType: !167, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "bracket", scope: !258, file: !257, line: 10, baseType: !112, size: 32, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "infoc", scope: !258, file: !257, line: 11, baseType: !112, size: 32, offset: 96)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !258, file: !257, line: 13, baseType: !264, size: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !265, line: 21, baseType: !266)
!265 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !265, line: 21, flags: DIFlagFwdDecl)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "W1", scope: !258, file: !257, line: 14, baseType: !264, size: 64, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "W2", scope: !258, file: !257, line: 15, baseType: !264, size: 64, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "Gold", scope: !258, file: !257, line: 16, baseType: !264, size: 64, offset: 320)
!271 = !{i32 7, !"Dwarf Version", i32 4}
!272 = !{i32 2, !"Debug Info Version", i32 3}
!273 = !{i32 1, !"wchar_size", i32 4}
!274 = !{i32 7, !"PIC Level", i32 2}
!275 = !{i32 7, !"uwtable", i32 1}
!276 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!277 = distinct !DISubprogram(name: "TaoLineSearchCreate_GPCG", scope: !278, file: !278, line: 204, type: !279, scopeLine: 205, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !365)
!278 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/tao/linesearch/impls/gpcglinesearch/gpcglinesearch.c", directory: "/home/users/ndemeye/xSDK")
!279 = !DISubroutineType(types: !280)
!280 = !{!66, !281}
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearch", file: !25, line: 5, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TaoLineSearch", file: !284, line: 22, size: 7104, elements: !285)
!284 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/taolinesearchimpl.h", directory: "/home/users/ndemeye/xSDK")
!285 = !{!286, !288, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !355, !356, !357, !358, !359, !360}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !283, file: !284, line: 23, baseType: !287, size: 4480)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !53, line: 122, baseType: !52)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !283, file: !284, line: 23, baseType: !289, size: 704, offset: 4480)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 704, elements: !108)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TaoLineSearchOps", file: !284, line: 8, size: 704, elements: !291)
!291 = !{!292, !296, !300, !304, !308, !310, !314, !318, !322, !323, !324}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !290, file: !284, line: 9, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!66, !281, !264, !166, !149}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "computegradient", scope: !290, file: !284, line: 10, baseType: !297, size: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!66, !281, !264, !264, !149}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgradient", scope: !290, file: !284, line: 11, baseType: !301, size: 64, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!66, !281, !264, !166, !264, !149}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgts", scope: !290, file: !284, line: 12, baseType: !305, size: 64, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!66, !281, !264, !264, !166, !166, !149}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !290, file: !284, line: 13, baseType: !309, size: 64, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !290, file: !284, line: 14, baseType: !311, size: 64, offset: 320)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!66, !281, !264, !166, !264, !264}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !290, file: !284, line: 15, baseType: !315, size: 64, offset: 384)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!66, !281, !76}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !290, file: !284, line: 16, baseType: !319, size: 64, offset: 448)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!66, !204, !281}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !290, file: !284, line: 17, baseType: !309, size: 64, offset: 512)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !290, file: !284, line: 18, baseType: !309, size: 64, offset: 576)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !290, file: !284, line: 19, baseType: !309, size: 64, offset: 640)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "userctx_func", scope: !283, file: !284, line: 24, baseType: !149, size: 64, offset: 5184)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "userctx_grad", scope: !283, file: !284, line: 25, baseType: !149, size: 64, offset: 5248)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "userctx_funcgrad", scope: !283, file: !284, line: 26, baseType: !149, size: 64, offset: 5312)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "userctx_funcgts", scope: !283, file: !284, line: 27, baseType: !149, size: 64, offset: 5376)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "usemonitor", scope: !283, file: !284, line: 28, baseType: !225, size: 32, offset: 5440)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !283, file: !284, line: 29, baseType: !76, size: 64, offset: 5504)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !283, file: !284, line: 31, baseType: !225, size: 32, offset: 5568)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "usegts", scope: !283, file: !284, line: 32, baseType: !225, size: 32, offset: 5600)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "usetaoroutines", scope: !283, file: !284, line: 33, baseType: !225, size: 32, offset: 5632)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "hasobjective", scope: !283, file: !284, line: 34, baseType: !225, size: 32, offset: 5664)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "hasgradient", scope: !283, file: !284, line: 35, baseType: !225, size: 32, offset: 5696)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "hasobjectiveandgradient", scope: !283, file: !284, line: 36, baseType: !225, size: 32, offset: 5728)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !283, file: !284, line: 37, baseType: !149, size: 64, offset: 5760)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !283, file: !284, line: 40, baseType: !264, size: 64, offset: 5824)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !283, file: !284, line: 41, baseType: !264, size: 64, offset: 5888)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "bounded", scope: !283, file: !284, line: 42, baseType: !112, size: 32, offset: 5952)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "start_x", scope: !283, file: !284, line: 44, baseType: !264, size: 64, offset: 6016)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "stepdirection", scope: !283, file: !284, line: 45, baseType: !264, size: 64, offset: 6080)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "f_fullstep", scope: !283, file: !284, line: 46, baseType: !167, size: 64, offset: 6144)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "new_f", scope: !283, file: !284, line: 47, baseType: !167, size: 64, offset: 6208)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "new_x", scope: !283, file: !284, line: 48, baseType: !264, size: 64, offset: 6272)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "new_g", scope: !283, file: !284, line: 49, baseType: !264, size: 64, offset: 6336)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !283, file: !284, line: 51, baseType: !167, size: 64, offset: 6400)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "initstep", scope: !283, file: !284, line: 52, baseType: !167, size: 64, offset: 6464)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !283, file: !284, line: 54, baseType: !112, size: 32, offset: 6528)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "nfeval", scope: !283, file: !284, line: 55, baseType: !112, size: 32, offset: 6560)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ngeval", scope: !283, file: !284, line: 56, baseType: !112, size: 32, offset: 6592)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "nfgeval", scope: !283, file: !284, line: 57, baseType: !112, size: 32, offset: 6624)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !283, file: !284, line: 58, baseType: !354, size: 32, offset: 6656)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearchConvergedReason", file: !25, line: 19, baseType: !24)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !283, file: !284, line: 60, baseType: !167, size: 64, offset: 6720)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ftol", scope: !283, file: !284, line: 61, baseType: !167, size: 64, offset: 6784)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "gtol", scope: !283, file: !284, line: 62, baseType: !167, size: 64, offset: 6848)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "stepmin", scope: !283, file: !284, line: 63, baseType: !167, size: 64, offset: 6912)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "stepmax", scope: !283, file: !284, line: 64, baseType: !167, size: 64, offset: 6976)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tao", scope: !283, file: !284, line: 66, baseType: !361, size: 64, offset: 7040)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tao", file: !362, line: 118, baseType: !363)
!362 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctao.h", directory: "/home/users/ndemeye/xSDK")
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Tao", file: !362, line: 118, flags: DIFlagFwdDecl)
!365 = !{!366, !367, !368, !369}
!366 = !DILocalVariable(name: "ls", arg: 1, scope: !277, file: !278, line: 204, type: !281)
!367 = !DILocalVariable(name: "ierr", scope: !277, file: !278, line: 206, type: !66)
!368 = !DILocalVariable(name: "neP", scope: !277, file: !278, line: 207, type: !255)
!369 = !DILocalVariable(name: "ierr__", scope: !370, file: !278, line: 219, type: !66)
!370 = distinct !DILexicalBlock(scope: !277, file: !278, line: 219, column: 31)
!371 = !DILocation(line: 0, scope: !277)
!372 = !DILocation(line: 207, column: 3, scope: !277)
!373 = !DILocation(line: 209, column: 3, scope: !374)
!374 = distinct !DILexicalBlock(scope: !375, file: !278, line: 209, column: 3)
!375 = distinct !DILexicalBlock(scope: !376, file: !278, line: 209, column: 3)
!376 = distinct !DILexicalBlock(scope: !277, file: !278, line: 209, column: 3)
!377 = !{!378, !378, i64 0}
!378 = !{!"any pointer", !379, i64 0}
!379 = !{!"omnipotent char", !380, i64 0}
!380 = !{!"Simple C/C++ TBAA"}
!381 = !DILocation(line: 209, column: 3, scope: !375)
!382 = !DILocation(line: 209, column: 3, scope: !383)
!383 = distinct !DILexicalBlock(scope: !384, file: !278, line: 209, column: 3)
!384 = distinct !DILexicalBlock(scope: !374, file: !278, line: 209, column: 3)
!385 = !{!386, !387, i64 1536}
!386 = !{!"", !379, i64 0, !379, i64 512, !379, i64 1024, !379, i64 1280, !387, i64 1536, !387, i64 1540, !379, i64 1544}
!387 = !{!"int", !379, i64 0}
!388 = !DILocation(line: 209, column: 3, scope: !384)
!389 = !DILocation(line: 209, column: 3, scope: !390)
!390 = distinct !DILexicalBlock(scope: !383, file: !278, line: 209, column: 3)
!391 = !{!387, !387, i64 0}
!392 = !{!386, !387, i64 1540}
!393 = !DILocation(line: 211, column: 7, scope: !277)
!394 = !DILocation(line: 211, column: 27, scope: !277)
!395 = !{!396, !396, i64 0}
!396 = !{!"double", !379, i64 0}
!397 = !DILocation(line: 212, column: 7, scope: !277)
!398 = !DILocation(line: 212, column: 27, scope: !277)
!399 = !DILocation(line: 214, column: 7, scope: !277)
!400 = !DILocation(line: 214, column: 27, scope: !277)
!401 = !{!402, !396, i64 872}
!402 = !{!"_p_TaoLineSearch", !403, i64 0, !379, i64 560, !378, i64 648, !378, i64 656, !378, i64 664, !378, i64 672, !379, i64 680, !378, i64 688, !379, i64 696, !379, i64 700, !379, i64 704, !379, i64 708, !379, i64 712, !379, i64 716, !378, i64 720, !378, i64 728, !378, i64 736, !387, i64 744, !378, i64 752, !378, i64 760, !396, i64 768, !396, i64 776, !378, i64 784, !378, i64 792, !396, i64 800, !396, i64 808, !387, i64 816, !387, i64 820, !387, i64 824, !387, i64 828, !379, i64 832, !396, i64 840, !396, i64 848, !396, i64 856, !396, i64 864, !396, i64 872, !378, i64 880}
