; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/interface/matreg.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/interface/matreg.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._n_PetscFunctionList = type opaque
%struct._p_MatRootName = type { i8*, i8*, i8*, %struct._p_MatRootName* }
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!264 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!265 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !38, line: 161, baseType: !7, size: 32, elements: !266)
!266 = !{!267, !268, !269, !270, !271, !272, !273, !274}
!267 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!273 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!274 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!275 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !38, line: 1265, baseType: !7, size: 32, elements: !276)
!276 = !{!277, !278, !279}
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!278 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!279 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!280 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !38, line: 1203, baseType: !7, size: 32, elements: !281)
!281 = !{!282, !283, !284, !285, !286}
!282 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!285 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!286 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!287 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !38, line: 187, baseType: !7, size: 32, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294, !295}
!289 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!294 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!295 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!296 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !297, line: 663, baseType: !7, size: 32, elements: !298)
!297 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!298 = !{!299, !300, !301}
!299 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!300 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!301 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!302 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !303)
!303 = !{!304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321}
!304 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!305 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!306 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!307 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!308 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!309 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!310 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!311 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!312 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!313 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!314 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!315 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!316 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!317 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!318 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!319 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!320 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!321 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!322 = !{!323, !327, !328, !413, !74, !363, !531, !532, !497}
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !324, line: 330, baseType: !325)
!324 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !324, line: 330, flags: DIFlagFwdDecl)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !331, line: 73, size: 4480, elements: !332)
!331 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!332 = !{!333, !335, !384, !385, !387, !390, !391, !392, !393, !401, !402, !404, !408, !412, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !425, !426, !427, !429, !430, !432, !434, !435, !436, !437, !438, !441, !443, !444, !445, !446, !447, !450, !452, !453, !454, !464, !466, !467, !471, !472, !521, !526, !528, !529, !530}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !330, file: !331, line: 74, baseType: !334, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !74)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !330, file: !331, line: 75, baseType: !336, size: 448, offset: 64)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 448, elements: !382)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !331, line: 53, baseType: !338)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !331, line: 45, size: 448, elements: !339)
!339 = !{!340, !346, !354, !359, !366, !370, !377}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !338, file: !331, line: 46, baseType: !341, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!344, !328, !345}
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !74)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !338, file: !331, line: 47, baseType: !347, size: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!344, !328, !350}
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !351, line: 16, baseType: !352)
!351 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !351, line: 16, flags: DIFlagFwdDecl)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !338, file: !331, line: 48, baseType: !355, size: 64, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!344, !358}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !338, file: !331, line: 49, baseType: !360, size: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!344, !328, !363, !328}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !365)
!365 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !338, file: !331, line: 50, baseType: !367, size: 64, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{!344, !328, !363, !358}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !338, file: !331, line: 51, baseType: !371, size: 64, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!344, !328, !363, !374}
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{null}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !338, file: !331, line: 52, baseType: !378, size: 64, offset: 384)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!344, !328, !363, !381}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!382 = !{!383}
!383 = !DISubrange(count: 1)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !330, file: !331, line: 76, baseType: !323, size: 64, offset: 512)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !330, file: !331, line: 77, baseType: !386, size: 32, offset: 576)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !74)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !330, file: !331, line: 78, baseType: !388, size: 64, offset: 640)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !389)
!389 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !330, file: !331, line: 78, baseType: !388, size: 64, offset: 704)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !330, file: !331, line: 78, baseType: !388, size: 64, offset: 768)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !330, file: !331, line: 78, baseType: !388, size: 64, offset: 832)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !330, file: !331, line: 79, baseType: !394, size: 64, offset: 896)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !397, line: 27, baseType: !398)
!397 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !399, line: 43, baseType: !400)
!399 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!400 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !330, file: !331, line: 80, baseType: !386, size: 32, offset: 960)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !330, file: !331, line: 81, baseType: !403, size: 32, offset: 992)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !74)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !330, file: !331, line: 82, baseType: !405, size: 64, offset: 1024)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !330, file: !331, line: 83, baseType: !409, size: 64, offset: 1088)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !410)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !330, file: !331, line: 84, baseType: !413, size: 64, offset: 1152)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !330, file: !331, line: 85, baseType: !413, size: 64, offset: 1216)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !330, file: !331, line: 86, baseType: !413, size: 64, offset: 1280)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !330, file: !331, line: 87, baseType: !413, size: 64, offset: 1344)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !330, file: !331, line: 88, baseType: !328, size: 64, offset: 1408)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !330, file: !331, line: 89, baseType: !394, size: 64, offset: 1472)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !330, file: !331, line: 90, baseType: !413, size: 64, offset: 1536)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !330, file: !331, line: 91, baseType: !413, size: 64, offset: 1600)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !330, file: !331, line: 92, baseType: !386, size: 32, offset: 1664)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !330, file: !331, line: 93, baseType: !327, size: 64, offset: 1728)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !330, file: !331, line: 94, baseType: !424, size: 64, offset: 1792)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !395)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !330, file: !331, line: 95, baseType: !386, size: 32, offset: 1856)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !330, file: !331, line: 95, baseType: !386, size: 32, offset: 1888)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !330, file: !331, line: 96, baseType: !428, size: 64, offset: 1920)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !330, file: !331, line: 96, baseType: !428, size: 64, offset: 1984)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !330, file: !331, line: 97, baseType: !431, size: 64, offset: 2048)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !330, file: !331, line: 97, baseType: !433, size: 64, offset: 2112)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !330, file: !331, line: 98, baseType: !386, size: 32, offset: 2176)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !330, file: !331, line: 98, baseType: !386, size: 32, offset: 2208)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !330, file: !331, line: 99, baseType: !428, size: 64, offset: 2240)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !330, file: !331, line: 99, baseType: !428, size: 64, offset: 2304)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !330, file: !331, line: 100, baseType: !439, size: 64, offset: 2368)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !389)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !330, file: !331, line: 100, baseType: !442, size: 64, offset: 2432)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !330, file: !331, line: 101, baseType: !386, size: 32, offset: 2496)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !330, file: !331, line: 101, baseType: !386, size: 32, offset: 2528)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !330, file: !331, line: 102, baseType: !428, size: 64, offset: 2560)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !330, file: !331, line: 102, baseType: !428, size: 64, offset: 2624)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !330, file: !331, line: 103, baseType: !448, size: 64, offset: 2688)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !440)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !330, file: !331, line: 103, baseType: !451, size: 64, offset: 2752)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !330, file: !331, line: 104, baseType: !381, size: 64, offset: 2816)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !330, file: !331, line: 105, baseType: !386, size: 32, offset: 2880)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !330, file: !331, line: 106, baseType: !455, size: 128, offset: 2944)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 128, elements: !462)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !331, line: 64, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !331, line: 61, size: 128, elements: !459)
!459 = !{!460, !461}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !458, file: !331, line: 62, baseType: !374, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !458, file: !331, line: 63, baseType: !327, size: 64, offset: 64)
!462 = !{!463}
!463 = !DISubrange(count: 2)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !330, file: !331, line: 107, baseType: !465, size: 64, offset: 3072)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 64, elements: !462)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !330, file: !331, line: 108, baseType: !327, size: 64, offset: 3136)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !330, file: !331, line: 109, baseType: !468, size: 64, offset: 3200)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!344, !327}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !330, file: !331, line: 111, baseType: !386, size: 32, offset: 3264)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !330, file: !331, line: 112, baseType: !473, size: 320, offset: 3328)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !474, size: 320, elements: !519)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!344, !477, !328, !327}
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !480)
!480 = !{!481, !482, !507, !508, !509, !510, !511, !512, !513, !514, !515}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !479, file: !12, line: 100, baseType: !386, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !479, file: !12, line: 101, baseType: !483, size: 64, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !486)
!486 = !{!487, !488, !489, !490, !491, !494, !495, !496, !500, !502, !504, !505, !506}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !485, file: !12, line: 84, baseType: !413, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !485, file: !12, line: 85, baseType: !413, size: 64, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !485, file: !12, line: 86, baseType: !327, size: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !485, file: !12, line: 87, baseType: !405, size: 64, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !485, file: !12, line: 88, baseType: !492, size: 64, offset: 256)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !363)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !485, file: !12, line: 89, baseType: !365, size: 8, offset: 320)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !485, file: !12, line: 90, baseType: !413, size: 64, offset: 384)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !485, file: !12, line: 91, baseType: !497, size: 64, offset: 448)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !498, line: 46, baseType: !499)
!498 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!499 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !485, file: !12, line: 92, baseType: !501, size: 32, offset: 512)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !485, file: !12, line: 93, baseType: !503, size: 32, offset: 544)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !485, file: !12, line: 94, baseType: !483, size: 64, offset: 576)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !485, file: !12, line: 95, baseType: !413, size: 64, offset: 640)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !485, file: !12, line: 96, baseType: !327, size: 64, offset: 704)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !479, file: !12, line: 102, baseType: !413, size: 64, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !479, file: !12, line: 102, baseType: !413, size: 64, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !479, file: !12, line: 103, baseType: !413, size: 64, offset: 256)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !479, file: !12, line: 104, baseType: !323, size: 64, offset: 320)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !479, file: !12, line: 105, baseType: !501, size: 32, offset: 384)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !479, file: !12, line: 105, baseType: !501, size: 32, offset: 416)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !479, file: !12, line: 105, baseType: !501, size: 32, offset: 448)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !479, file: !12, line: 106, baseType: !328, size: 64, offset: 512)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !479, file: !12, line: 107, baseType: !516, size: 64, offset: 576)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !517)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!519 = !{!520}
!520 = !DISubrange(count: 5)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !330, file: !331, line: 113, baseType: !522, size: 320, offset: 3648)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !523, size: 320, elements: !519)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!344, !328, !327}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !330, file: !331, line: 114, baseType: !527, size: 320, offset: 3968)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 320, elements: !519)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !330, file: !331, line: 115, baseType: !501, size: 32, offset: 4288)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !330, file: !331, line: 120, baseType: !516, size: 64, offset: 4352)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !330, file: !331, line: 121, baseType: !501, size: 32, offset: 4416)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !533, line: 1451, baseType: !374)
!533 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!534 = !{!0, !535, !538}
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "MatList", scope: !2, file: !537, line: 12, type: !405, isLocal: false, isDefinition: true)
!537 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/interface/matreg.c", directory: "/home/users/ndemeye/xSDK")
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "MatRootNameList", scope: !2, file: !537, line: 208, type: !540, isLocal: false, isDefinition: true)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatRootName", file: !541, line: 221, baseType: !542)
!541 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatRootName", file: !541, line: 222, size: 256, elements: !544)
!544 = !{!545, !546, !547, !548}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "rname", scope: !543, file: !541, line: 223, baseType: !413, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "sname", scope: !543, file: !541, line: 223, baseType: !413, size: 64, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "mname", scope: !543, file: !541, line: 223, baseType: !413, size: 64, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !543, file: !541, line: 224, baseType: !540, size: 64, offset: 192)
!549 = !{i32 7, !"Dwarf Version", i32 4}
!550 = !{i32 2, !"Debug Info Version", i32 3}
!551 = !{i32 1, !"wchar_size", i32 4}
!552 = !{i32 7, !"PIC Level", i32 2}
!553 = !{i32 7, !"uwtable", i32 1}
!554 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!555 = distinct !DISubprogram(name: "MatSetType", scope: !537, file: !537, line: 34, type: !556, scopeLine: 35, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1328)
!556 = !DISubroutineType(types: !557)
!557 = !{!344, !558, !864}
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !38, line: 16, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !541, line: 436, size: 23424, elements: !561)
!561 = !{!562, !564, !1071, !1091, !1092, !1093, !1095, !1096, !1097, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1224, !1225, !1241, !1242, !1243, !1244, !1245, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1280, !1300, !1301, !1303, !1304, !1305, !1306, !1307, !1308, !1326, !1327}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !560, file: !541, line: 437, baseType: !563, size: 4480)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !331, line: 122, baseType: !330)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !560, file: !541, line: 437, baseType: !565, size: 9472, offset: 4480)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 9472, elements: !382)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !541, line: 32, size: 9472, elements: !567)
!567 = !{!568, !577, !581, !582, !589, !593, !594, !595, !596, !597, !598, !599, !623, !627, !632, !638, !657, !662, !666, !667, !672, !677, !678, !683, !687, !691, !695, !699, !703, !704, !705, !706, !707, !711, !712, !717, !718, !719, !720, !721, !726, !733, !738, !742, !746, !750, !754, !755, !759, !760, !767, !772, !773, !774, !775, !837, !845, !846, !850, !851, !855, !856, !860, !865, !866, !870, !874, !881, !882, !883, !884, !885, !886, !891, !892, !896, !900, !904, !905, !906, !910, !920, !921, !925, !926, !930, !931, !935, !936, !941, !942, !946, !950, !951, !952, !953, !954, !955, !956, !960, !961, !962, !963, !964, !965, !969, !970, !971, !972, !973, !974, !975, !976, !980, !984, !985, !986, !990, !991, !992, !993, !994, !995, !996, !1000, !1001, !1002, !1007, !1011, !1012, !1016, !1017, !1018, !1019, !1045, !1049, !1050, !1051, !1052, !1053, !1057, !1058, !1059, !1060, !1061, !1065, !1069, !1070}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !566, file: !541, line: 34, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{!344, !558, !386, !572, !386, !572, !574, !576}
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !386)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !449)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !26)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !566, file: !541, line: 35, baseType: !578, size: 64, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!344, !558, !386, !431, !433, !451}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !566, file: !541, line: 36, baseType: !578, size: 64, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !566, file: !541, line: 37, baseType: !583, size: 64, offset: 192)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!344, !558, !586, !586}
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !62, line: 21, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !62, line: 21, flags: DIFlagFwdDecl)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !566, file: !541, line: 38, baseType: !590, size: 64, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!344, !558, !586, !586, !586}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !566, file: !541, line: 40, baseType: !583, size: 64, offset: 320)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !566, file: !541, line: 41, baseType: !590, size: 64, offset: 384)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !566, file: !541, line: 42, baseType: !583, size: 64, offset: 448)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !566, file: !541, line: 43, baseType: !590, size: 64, offset: 512)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !566, file: !541, line: 44, baseType: !583, size: 64, offset: 576)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !566, file: !541, line: 46, baseType: !590, size: 64, offset: 640)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !566, file: !541, line: 47, baseType: !600, size: 64, offset: 704)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{!344, !558, !603, !603, !607}
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !604, line: 11, baseType: !605)
!604 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !604, line: 11, flags: DIFlagFwdDecl)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !609)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !38, line: 1239, baseType: !610)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 1226, size: 704, elements: !611)
!611 = !{!612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !610, file: !38, line: 1227, baseType: !440, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !610, file: !38, line: 1228, baseType: !440, size: 64, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !610, file: !38, line: 1229, baseType: !440, size: 64, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !610, file: !38, line: 1230, baseType: !440, size: 64, offset: 192)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !610, file: !38, line: 1231, baseType: !440, size: 64, offset: 256)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !610, file: !38, line: 1232, baseType: !440, size: 64, offset: 320)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !610, file: !38, line: 1233, baseType: !440, size: 64, offset: 384)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !610, file: !38, line: 1234, baseType: !440, size: 64, offset: 448)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !610, file: !38, line: 1236, baseType: !440, size: 64, offset: 512)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !610, file: !38, line: 1237, baseType: !440, size: 64, offset: 576)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !610, file: !38, line: 1238, baseType: !440, size: 64, offset: 640)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !566, file: !541, line: 48, baseType: !624, size: 64, offset: 768)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{!344, !558, !603, !607}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !566, file: !541, line: 49, baseType: !628, size: 64, offset: 832)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!344, !558, !586, !440, !631, !440, !386, !386, !586}
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !38, line: 1291, baseType: !37)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !566, file: !541, line: 50, baseType: !633, size: 64, offset: 896)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{!344, !558, !636, !637}
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !38, line: 238, baseType: !50)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !566, file: !541, line: 52, baseType: !639, size: 64, offset: 960)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!344, !558, !642, !643}
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !38, line: 612, baseType: !56)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !38, line: 600, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 592, size: 640, elements: !646)
!646 = !{!647, !648, !649, !650, !651, !652, !653, !654, !655, !656}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !645, file: !38, line: 593, baseType: !388, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !645, file: !38, line: 594, baseType: !388, size: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !645, file: !38, line: 594, baseType: !388, size: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !645, file: !38, line: 594, baseType: !388, size: 64, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !645, file: !38, line: 595, baseType: !388, size: 64, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !645, file: !38, line: 596, baseType: !388, size: 64, offset: 320)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !645, file: !38, line: 597, baseType: !388, size: 64, offset: 384)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !645, file: !38, line: 598, baseType: !388, size: 64, offset: 448)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !645, file: !38, line: 598, baseType: !388, size: 64, offset: 512)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !645, file: !38, line: 599, baseType: !388, size: 64, offset: 576)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !566, file: !541, line: 53, baseType: !658, size: 64, offset: 1024)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!344, !558, !558, !661}
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !566, file: !541, line: 54, baseType: !663, size: 64, offset: 1088)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!344, !558, !586}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !566, file: !541, line: 55, baseType: !583, size: 64, offset: 1152)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !566, file: !541, line: 56, baseType: !668, size: 64, offset: 1216)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!344, !558, !671, !439}
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !62, line: 155, baseType: !61)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !566, file: !541, line: 58, baseType: !673, size: 64, offset: 1280)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!344, !558, !676}
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !38, line: 424, baseType: !69)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !566, file: !541, line: 59, baseType: !673, size: 64, offset: 1344)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !566, file: !541, line: 60, baseType: !679, size: 64, offset: 1408)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!344, !558, !682, !501}
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !38, line: 469, baseType: !73)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !566, file: !541, line: 61, baseType: !684, size: 64, offset: 1472)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!344, !558}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !566, file: !541, line: 63, baseType: !688, size: 64, offset: 1536)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!344, !558, !386, !572, !449, !586, !586}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !566, file: !541, line: 64, baseType: !692, size: 64, offset: 1600)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!344, !558, !558, !603, !603, !607}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !566, file: !541, line: 65, baseType: !696, size: 64, offset: 1664)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!344, !558, !558, !607}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !566, file: !541, line: 66, baseType: !700, size: 64, offset: 1728)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!344, !558, !558, !603, !607}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !566, file: !541, line: 67, baseType: !696, size: 64, offset: 1792)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !566, file: !541, line: 69, baseType: !684, size: 64, offset: 1856)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !566, file: !541, line: 70, baseType: !692, size: 64, offset: 1920)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !566, file: !541, line: 71, baseType: !700, size: 64, offset: 1984)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !566, file: !541, line: 72, baseType: !708, size: 64, offset: 2048)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!344, !558, !637}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !566, file: !541, line: 73, baseType: !684, size: 64, offset: 2112)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !566, file: !541, line: 75, baseType: !713, size: 64, offset: 2176)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!344, !558, !716, !637}
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !38, line: 563, baseType: !104)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !566, file: !541, line: 76, baseType: !583, size: 64, offset: 2240)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !566, file: !541, line: 77, baseType: !583, size: 64, offset: 2304)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !566, file: !541, line: 78, baseType: !600, size: 64, offset: 2368)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !566, file: !541, line: 79, baseType: !624, size: 64, offset: 2432)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !566, file: !541, line: 81, baseType: !722, size: 64, offset: 2496)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!344, !558, !449, !558, !725}
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !38, line: 285, baseType: !109)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !566, file: !541, line: 82, baseType: !727, size: 64, offset: 2560)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{!344, !558, !386, !730, !730, !636, !732}
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !603)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !566, file: !541, line: 83, baseType: !734, size: 64, offset: 2624)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!344, !558, !386, !737, !386}
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !566, file: !541, line: 84, baseType: !739, size: 64, offset: 2688)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!344, !558, !386, !572, !386, !572, !448}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !566, file: !541, line: 85, baseType: !743, size: 64, offset: 2752)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!344, !558, !558, !725}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !566, file: !541, line: 87, baseType: !747, size: 64, offset: 2816)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!344, !558, !586, !431}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !566, file: !541, line: 88, baseType: !751, size: 64, offset: 2880)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!344, !558, !449}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !566, file: !541, line: 89, baseType: !751, size: 64, offset: 2944)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !566, file: !541, line: 90, baseType: !756, size: 64, offset: 3008)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!344, !558, !586, !576}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !566, file: !541, line: 91, baseType: !688, size: 64, offset: 3072)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !566, file: !541, line: 93, baseType: !761, size: 64, offset: 3136)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!344, !558, !764}
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !765)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !566, file: !541, line: 94, baseType: !768, size: 64, offset: 3200)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!344, !558, !386, !501, !501, !431, !771, !771, !661}
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !566, file: !541, line: 95, baseType: !768, size: 64, offset: 3264)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !566, file: !541, line: 96, baseType: !768, size: 64, offset: 3328)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !566, file: !541, line: 97, baseType: !768, size: 64, offset: 3392)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !566, file: !541, line: 99, baseType: !776, size: 64, offset: 3456)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{!344, !558, !779, !782}
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !604, line: 51, baseType: !780)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !604, line: 51, flags: DIFlagFwdDecl)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !38, line: 1378, baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !541, line: 609, size: 6208, elements: !785)
!785 = !{!786, !787, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !806, !813, !814, !815, !816, !817, !818, !819, !820, !824, !825, !826, !827, !828, !830, !831, !832, !833, !834, !835, !836}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !784, file: !541, line: 610, baseType: !563, size: 4480)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !784, file: !541, line: 610, baseType: !788, size: 32, offset: 4480)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 32, elements: !382)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !784, file: !541, line: 611, baseType: !386, size: 32, offset: 4512)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !784, file: !541, line: 611, baseType: !386, size: 32, offset: 4544)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !784, file: !541, line: 611, baseType: !386, size: 32, offset: 4576)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !784, file: !541, line: 612, baseType: !386, size: 32, offset: 4608)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !784, file: !541, line: 613, baseType: !386, size: 32, offset: 4640)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !784, file: !541, line: 614, baseType: !431, size: 64, offset: 4672)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !784, file: !541, line: 615, baseType: !433, size: 64, offset: 4736)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !784, file: !541, line: 616, baseType: !737, size: 64, offset: 4800)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !784, file: !541, line: 617, baseType: !431, size: 64, offset: 4864)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !784, file: !541, line: 618, baseType: !799, size: 64, offset: 4928)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !541, line: 602, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !541, line: 598, size: 128, elements: !802)
!802 = !{!803, !804, !805}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !801, file: !541, line: 599, baseType: !386, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !801, file: !541, line: 600, baseType: !386, size: 32, offset: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !801, file: !541, line: 601, baseType: !448, size: 64, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !784, file: !541, line: 619, baseType: !807, size: 64, offset: 4992)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !541, line: 607, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !541, line: 604, size: 128, elements: !810)
!810 = !{!811, !812}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !809, file: !541, line: 605, baseType: !386, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !809, file: !541, line: 606, baseType: !448, size: 64, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !784, file: !541, line: 620, baseType: !448, size: 64, offset: 5056)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !784, file: !541, line: 621, baseType: !440, size: 64, offset: 5120)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !784, file: !541, line: 622, baseType: !440, size: 64, offset: 5184)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !784, file: !541, line: 623, baseType: !586, size: 64, offset: 5248)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !784, file: !541, line: 623, baseType: !586, size: 64, offset: 5312)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !784, file: !541, line: 623, baseType: !586, size: 64, offset: 5376)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !784, file: !541, line: 624, baseType: !501, size: 32, offset: 5440)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !784, file: !541, line: 625, baseType: !821, size: 64, offset: 5504)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{!344}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !784, file: !541, line: 626, baseType: !327, size: 64, offset: 5568)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !784, file: !541, line: 627, baseType: !586, size: 64, offset: 5632)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !784, file: !541, line: 628, baseType: !386, size: 32, offset: 5696)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !784, file: !541, line: 629, baseType: !363, size: 64, offset: 5760)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !784, file: !541, line: 630, baseType: !829, size: 32, offset: 5824)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !116, line: 213, baseType: !115)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !784, file: !541, line: 631, baseType: !386, size: 32, offset: 5856)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !784, file: !541, line: 631, baseType: !386, size: 32, offset: 5888)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !784, file: !541, line: 632, baseType: !501, size: 32, offset: 5920)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !784, file: !541, line: 633, baseType: !501, size: 32, offset: 5952)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !784, file: !541, line: 634, baseType: !374, size: 64, offset: 6016)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !784, file: !541, line: 634, baseType: !327, size: 64, offset: 6080)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !784, file: !541, line: 635, baseType: !394, size: 64, offset: 6144)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !566, file: !541, line: 100, baseType: !838, size: 64, offset: 3520)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!344, !558, !386, !386, !841, !844}
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !116, line: 215, baseType: !843)
!843 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !566, file: !541, line: 101, baseType: !684, size: 64, offset: 3584)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !566, file: !541, line: 102, baseType: !847, size: 64, offset: 3648)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{!344, !558, !603, !603, !637}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !566, file: !541, line: 103, baseType: !569, size: 64, offset: 3712)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !566, file: !541, line: 105, baseType: !852, size: 64, offset: 3776)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{!344, !558, !603, !603, !636, !637}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !566, file: !541, line: 106, baseType: !684, size: 64, offset: 3840)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !566, file: !541, line: 107, baseType: !857, size: 64, offset: 3904)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DISubroutineType(types: !859)
!859 = !{!344, !558, !350}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !566, file: !541, line: 108, baseType: !861, size: 64, offset: 3968)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!344, !558, !864, !636, !637}
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !38, line: 25, baseType: !363)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !566, file: !541, line: 109, baseType: !821, size: 64, offset: 4032)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !566, file: !541, line: 111, baseType: !867, size: 64, offset: 4096)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DISubroutineType(types: !869)
!869 = !{!344, !558, !558, !558, !440, !558}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !566, file: !541, line: 112, baseType: !871, size: 64, offset: 4160)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!344, !558, !558, !558, !558}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !566, file: !541, line: 113, baseType: !875, size: 64, offset: 4224)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!344, !558, !878, !878}
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !604, line: 30, baseType: !879)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !604, line: 30, flags: DIFlagFwdDecl)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !566, file: !541, line: 114, baseType: !569, size: 64, offset: 4288)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !566, file: !541, line: 115, baseType: !688, size: 64, offset: 4352)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !566, file: !541, line: 117, baseType: !747, size: 64, offset: 4416)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !566, file: !541, line: 118, baseType: !747, size: 64, offset: 4480)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !566, file: !541, line: 119, baseType: !861, size: 64, offset: 4544)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !566, file: !541, line: 120, baseType: !887, size: 64, offset: 4608)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{!344, !558, !890, !661}
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !38, line: 1675, baseType: !120)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !566, file: !541, line: 121, baseType: !821, size: 64, offset: 4672)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !566, file: !541, line: 123, baseType: !893, size: 64, offset: 4736)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DISubroutineType(types: !895)
!895 = !{!344, !558, !386, !327}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !566, file: !541, line: 124, baseType: !897, size: 64, offset: 4800)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DISubroutineType(types: !899)
!899 = !{!344, !558, !782, !586, !327}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !566, file: !541, line: 125, baseType: !901, size: 64, offset: 4864)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{!344, !477, !558}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !566, file: !541, line: 126, baseType: !583, size: 64, offset: 4928)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !566, file: !541, line: 127, baseType: !583, size: 64, offset: 4992)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !566, file: !541, line: 129, baseType: !907, size: 64, offset: 5056)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!344, !558, !737}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !566, file: !541, line: 130, baseType: !911, size: 64, offset: 5120)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!344, !558, !914, !914}
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !62, line: 654, baseType: !915)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !62, line: 653, size: 128, elements: !917)
!917 = !{!918, !919}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !916, file: !62, line: 653, baseType: !386, size: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !916, file: !62, line: 653, baseType: !586, size: 64, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !566, file: !541, line: 131, baseType: !911, size: 64, offset: 5184)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !566, file: !541, line: 132, baseType: !922, size: 64, offset: 5248)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!344, !558, !431, !431, !431}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !566, file: !541, line: 133, baseType: !857, size: 64, offset: 5312)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !566, file: !541, line: 135, baseType: !927, size: 64, offset: 5376)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{!344, !558, !440, !661}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !566, file: !541, line: 136, baseType: !927, size: 64, offset: 5440)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !566, file: !541, line: 137, baseType: !932, size: 64, offset: 5504)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!344, !558, !661}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !566, file: !541, line: 138, baseType: !569, size: 64, offset: 5568)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !566, file: !541, line: 139, baseType: !937, size: 64, offset: 5632)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DISubroutineType(types: !939)
!939 = !{!344, !558, !940, !940}
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !566, file: !541, line: 141, baseType: !821, size: 64, offset: 5696)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !566, file: !541, line: 142, baseType: !943, size: 64, offset: 5760)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!344, !558, !558, !440, !558}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !566, file: !541, line: 143, baseType: !947, size: 64, offset: 5824)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{!344, !558, !558, !558}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !566, file: !541, line: 144, baseType: !821, size: 64, offset: 5888)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !566, file: !541, line: 145, baseType: !943, size: 64, offset: 5952)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !566, file: !541, line: 147, baseType: !947, size: 64, offset: 6016)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !566, file: !541, line: 148, baseType: !821, size: 64, offset: 6080)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !566, file: !541, line: 149, baseType: !943, size: 64, offset: 6144)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !566, file: !541, line: 150, baseType: !947, size: 64, offset: 6208)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !566, file: !541, line: 151, baseType: !957, size: 64, offset: 6272)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!344, !558, !501}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !566, file: !541, line: 153, baseType: !684, size: 64, offset: 6336)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !566, file: !541, line: 154, baseType: !684, size: 64, offset: 6400)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !566, file: !541, line: 155, baseType: !684, size: 64, offset: 6464)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !566, file: !541, line: 156, baseType: !684, size: 64, offset: 6528)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !566, file: !541, line: 157, baseType: !857, size: 64, offset: 6592)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !566, file: !541, line: 159, baseType: !966, size: 64, offset: 6656)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!344, !558, !386, !574}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !566, file: !541, line: 160, baseType: !684, size: 64, offset: 6720)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !566, file: !541, line: 161, baseType: !684, size: 64, offset: 6784)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !566, file: !541, line: 162, baseType: !684, size: 64, offset: 6848)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !566, file: !541, line: 163, baseType: !684, size: 64, offset: 6912)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !566, file: !541, line: 165, baseType: !947, size: 64, offset: 6976)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !566, file: !541, line: 166, baseType: !947, size: 64, offset: 7040)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !566, file: !541, line: 167, baseType: !747, size: 64, offset: 7104)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !566, file: !541, line: 168, baseType: !977, size: 64, offset: 7168)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!344, !558, !586, !386}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !566, file: !541, line: 169, baseType: !981, size: 64, offset: 7232)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!344, !558, !661, !431}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !566, file: !541, line: 171, baseType: !708, size: 64, offset: 7296)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !566, file: !541, line: 172, baseType: !684, size: 64, offset: 7360)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !566, file: !541, line: 173, baseType: !987, size: 64, offset: 7424)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!344, !558, !431, !771}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !566, file: !541, line: 174, baseType: !847, size: 64, offset: 7488)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !566, file: !541, line: 175, baseType: !847, size: 64, offset: 7552)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !566, file: !541, line: 177, baseType: !583, size: 64, offset: 7616)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !566, file: !541, line: 178, baseType: !633, size: 64, offset: 7680)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !566, file: !541, line: 179, baseType: !583, size: 64, offset: 7744)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !566, file: !541, line: 180, baseType: !590, size: 64, offset: 7808)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !566, file: !541, line: 181, baseType: !997, size: 64, offset: 7872)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!344, !558, !323, !636, !637}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !566, file: !541, line: 183, baseType: !907, size: 64, offset: 7936)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !566, file: !541, line: 184, baseType: !668, size: 64, offset: 8000)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !566, file: !541, line: 185, baseType: !1003, size: 64, offset: 8064)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!344, !558, !1006}
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !566, file: !541, line: 186, baseType: !1008, size: 64, offset: 8128)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!344, !558, !386, !572, !448}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !566, file: !541, line: 187, baseType: !727, size: 64, offset: 8192)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !566, file: !541, line: 189, baseType: !1013, size: 64, offset: 8256)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!344, !558, !386, !386, !431, !574}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !566, file: !541, line: 190, baseType: !821, size: 64, offset: 8320)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !566, file: !541, line: 191, baseType: !943, size: 64, offset: 8384)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !566, file: !541, line: 192, baseType: !947, size: 64, offset: 8448)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !566, file: !541, line: 193, baseType: !1020, size: 64, offset: 8512)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!344, !558, !779, !1023}
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !38, line: 1401, baseType: !1024)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !541, line: 660, size: 5312, elements: !1026)
!1026 = !{!1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1025, file: !541, line: 661, baseType: !563, size: 4480)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1025, file: !541, line: 661, baseType: !788, size: 32, offset: 4480)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1025, file: !541, line: 662, baseType: !386, size: 32, offset: 4512)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1025, file: !541, line: 662, baseType: !386, size: 32, offset: 4544)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1025, file: !541, line: 662, baseType: !386, size: 32, offset: 4576)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1025, file: !541, line: 663, baseType: !386, size: 32, offset: 4608)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1025, file: !541, line: 664, baseType: !386, size: 32, offset: 4640)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1025, file: !541, line: 665, baseType: !431, size: 64, offset: 4672)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1025, file: !541, line: 666, baseType: !431, size: 64, offset: 4736)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1025, file: !541, line: 667, baseType: !386, size: 32, offset: 4800)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1025, file: !541, line: 668, baseType: !829, size: 32, offset: 4832)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1025, file: !541, line: 670, baseType: !431, size: 64, offset: 4864)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1025, file: !541, line: 670, baseType: !431, size: 64, offset: 4928)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1025, file: !541, line: 671, baseType: !431, size: 64, offset: 4992)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1025, file: !541, line: 672, baseType: !431, size: 64, offset: 5056)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1025, file: !541, line: 673, baseType: !431, size: 64, offset: 5120)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1025, file: !541, line: 674, baseType: !386, size: 32, offset: 5184)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1025, file: !541, line: 675, baseType: !431, size: 64, offset: 5248)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !566, file: !541, line: 195, baseType: !1046, size: 64, offset: 8576)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!344, !1023, !558, !558}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !566, file: !541, line: 196, baseType: !1046, size: 64, offset: 8640)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !566, file: !541, line: 197, baseType: !821, size: 64, offset: 8704)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !566, file: !541, line: 198, baseType: !943, size: 64, offset: 8768)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !566, file: !541, line: 199, baseType: !947, size: 64, offset: 8832)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !566, file: !541, line: 201, baseType: !1054, size: 64, offset: 8896)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!344, !558, !386, !386}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !566, file: !541, line: 202, baseType: !722, size: 64, offset: 8960)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !566, file: !541, line: 203, baseType: !590, size: 64, offset: 9024)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !566, file: !541, line: 204, baseType: !776, size: 64, offset: 9088)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !566, file: !541, line: 205, baseType: !907, size: 64, offset: 9152)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !566, file: !541, line: 206, baseType: !1062, size: 64, offset: 9216)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!344, !323, !558, !386, !636, !637}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !566, file: !541, line: 208, baseType: !1066, size: 64, offset: 9280)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!344, !386, !732}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !566, file: !541, line: 209, baseType: !947, size: 64, offset: 9344)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !566, file: !541, line: 210, baseType: !739, size: 64, offset: 9408)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !560, file: !541, line: 438, baseType: !1072, size: 64, offset: 13952)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !604, line: 60, baseType: !1073)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !116, line: 240, size: 640, elements: !1075)
!1075 = !{!1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1074, file: !116, line: 241, baseType: !323, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1074, file: !116, line: 242, baseType: !403, size: 32, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1074, file: !116, line: 243, baseType: !386, size: 32, offset: 96)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1074, file: !116, line: 243, baseType: !386, size: 32, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1074, file: !116, line: 244, baseType: !386, size: 32, offset: 160)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1074, file: !116, line: 244, baseType: !386, size: 32, offset: 192)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1074, file: !116, line: 245, baseType: !431, size: 64, offset: 256)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1074, file: !116, line: 246, baseType: !501, size: 32, offset: 320)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1074, file: !116, line: 247, baseType: !386, size: 32, offset: 352)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1074, file: !116, line: 251, baseType: !386, size: 32, offset: 384)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1074, file: !116, line: 252, baseType: !878, size: 64, offset: 448)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1074, file: !116, line: 253, baseType: !501, size: 32, offset: 512)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1074, file: !116, line: 254, baseType: !386, size: 32, offset: 544)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1074, file: !116, line: 254, baseType: !386, size: 32, offset: 576)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1074, file: !116, line: 255, baseType: !386, size: 32, offset: 608)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !560, file: !541, line: 438, baseType: !1072, size: 64, offset: 14016)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !560, file: !541, line: 439, baseType: !327, size: 64, offset: 14080)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !560, file: !541, line: 440, baseType: !1094, size: 32, offset: 14144)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !38, line: 161, baseType: !265)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !560, file: !541, line: 441, baseType: !501, size: 32, offset: 14176)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !560, file: !541, line: 442, baseType: !501, size: 32, offset: 14208)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !560, file: !541, line: 443, baseType: !1098, size: 448, offset: 14272)
!1098 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1099, size: 448, elements: !1100)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !38, line: 1159, baseType: !363)
!1100 = !{!1101}
!1101 = !DISubrange(count: 7)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !560, file: !541, line: 444, baseType: !501, size: 32, offset: 14720)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !560, file: !541, line: 445, baseType: !501, size: 32, offset: 14752)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !560, file: !541, line: 446, baseType: !386, size: 32, offset: 14784)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !560, file: !541, line: 447, baseType: !424, size: 64, offset: 14848)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !560, file: !541, line: 448, baseType: !424, size: 64, offset: 14912)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !560, file: !541, line: 449, baseType: !644, size: 640, offset: 14976)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !560, file: !541, line: 450, baseType: !576, size: 32, offset: 15616)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !560, file: !541, line: 451, baseType: !1110, size: 2880, offset: 15680)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !541, line: 318, baseType: !1111)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !541, line: 319, size: 2880, elements: !1112)
!1112 = !{!1113, !1114, !1115, !1116, !1117, !1118, !1119, !1132, !1133, !1138, !1143, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1158, !1159, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1191, !1192, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1215, !1216, !1217, !1221, !1222}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1111, file: !541, line: 320, baseType: !386, size: 32)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1111, file: !541, line: 321, baseType: !386, size: 32, offset: 32)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1111, file: !541, line: 322, baseType: !386, size: 32, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1111, file: !541, line: 323, baseType: !386, size: 32, offset: 96)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1111, file: !541, line: 324, baseType: !386, size: 32, offset: 128)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1111, file: !541, line: 325, baseType: !386, size: 32, offset: 160)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1111, file: !541, line: 326, baseType: !1120, size: 64, offset: 192)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !541, line: 293, baseType: !1121)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !541, line: 295, size: 448, elements: !1123)
!1123 = !{!1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1122, file: !541, line: 296, baseType: !1120, size: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1122, file: !541, line: 297, baseType: !448, size: 64, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1122, file: !541, line: 297, baseType: !448, size: 64, offset: 128)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1122, file: !541, line: 298, baseType: !431, size: 64, offset: 192)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1122, file: !541, line: 298, baseType: !431, size: 64, offset: 256)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1122, file: !541, line: 299, baseType: !386, size: 32, offset: 320)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1122, file: !541, line: 300, baseType: !386, size: 32, offset: 352)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1122, file: !541, line: 301, baseType: !386, size: 32, offset: 384)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1111, file: !541, line: 326, baseType: !1120, size: 64, offset: 256)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1111, file: !541, line: 328, baseType: !1134, size: 64, offset: 320)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!344, !558, !1137, !431}
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1111, file: !541, line: 329, baseType: !1139, size: 64, offset: 384)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = !DISubroutineType(types: !1141)
!1141 = !{!344, !1137, !1142, !433, !433, !451, !431}
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1111, file: !541, line: 330, baseType: !1144, size: 64, offset: 448)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{!344, !1137}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1111, file: !541, line: 331, baseType: !1144, size: 64, offset: 512)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1111, file: !541, line: 334, baseType: !323, size: 64, offset: 576)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1111, file: !541, line: 335, baseType: !403, size: 32, offset: 640)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1111, file: !541, line: 335, baseType: !403, size: 32, offset: 672)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1111, file: !541, line: 336, baseType: !403, size: 32, offset: 704)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1111, file: !541, line: 336, baseType: !403, size: 32, offset: 736)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1111, file: !541, line: 337, baseType: !1154, size: 64, offset: 768)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !324, line: 339, baseType: !1156)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !324, line: 339, flags: DIFlagFwdDecl)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1111, file: !541, line: 338, baseType: !1154, size: 64, offset: 832)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1111, file: !541, line: 339, baseType: !1160, size: 64, offset: 896)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !324, line: 341, baseType: !1162)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !324, line: 351, size: 192, elements: !1163)
!1163 = !{!1164, !1165, !1166, !1167, !1168}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1162, file: !324, line: 354, baseType: !74, size: 32)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1162, file: !324, line: 355, baseType: !74, size: 32, offset: 32)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1162, file: !324, line: 356, baseType: !74, size: 32, offset: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1162, file: !324, line: 361, baseType: !74, size: 32, offset: 96)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1162, file: !324, line: 362, baseType: !497, size: 64, offset: 128)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1111, file: !541, line: 340, baseType: !386, size: 32, offset: 960)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1111, file: !541, line: 340, baseType: !386, size: 32, offset: 992)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1111, file: !541, line: 341, baseType: !448, size: 64, offset: 1024)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1111, file: !541, line: 342, baseType: !431, size: 64, offset: 1088)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1111, file: !541, line: 343, baseType: !451, size: 64, offset: 1152)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1111, file: !541, line: 344, baseType: !433, size: 64, offset: 1216)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1111, file: !541, line: 345, baseType: !386, size: 32, offset: 1280)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1111, file: !541, line: 346, baseType: !1142, size: 64, offset: 1344)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1111, file: !541, line: 347, baseType: !501, size: 32, offset: 1408)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1111, file: !541, line: 348, baseType: !386, size: 32, offset: 1440)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1111, file: !541, line: 351, baseType: !501, size: 32, offset: 1472)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1111, file: !541, line: 352, baseType: !501, size: 32, offset: 1504)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1111, file: !541, line: 353, baseType: !403, size: 32, offset: 1536)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1111, file: !541, line: 354, baseType: !403, size: 32, offset: 1568)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1111, file: !541, line: 355, baseType: !1142, size: 64, offset: 1600)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1111, file: !541, line: 356, baseType: !1142, size: 64, offset: 1664)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1111, file: !541, line: 357, baseType: !1186, size: 64, offset: 1728)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !541, line: 310, baseType: !1188)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !541, line: 308, size: 32, elements: !1189)
!1189 = !{!1190}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1188, file: !541, line: 309, baseType: !386, size: 32)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1111, file: !541, line: 357, baseType: !1186, size: 64, offset: 1792)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1111, file: !541, line: 358, baseType: !1193, size: 64, offset: 1856)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !541, line: 316, baseType: !1195)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !541, line: 312, size: 128, elements: !1196)
!1196 = !{!1197, !1198, !1199}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1195, file: !541, line: 313, baseType: !327, size: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1195, file: !541, line: 314, baseType: !386, size: 32, offset: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1195, file: !541, line: 315, baseType: !365, size: 8, offset: 96)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1111, file: !541, line: 359, baseType: !1193, size: 64, offset: 1920)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1111, file: !541, line: 360, baseType: !1193, size: 64, offset: 1984)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1111, file: !541, line: 361, baseType: !386, size: 32, offset: 2048)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1111, file: !541, line: 362, baseType: !403, size: 32, offset: 2080)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1111, file: !541, line: 363, baseType: !386, size: 32, offset: 2112)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1111, file: !541, line: 364, baseType: !1142, size: 64, offset: 2176)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1111, file: !541, line: 365, baseType: !1160, size: 64, offset: 2240)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1111, file: !541, line: 366, baseType: !403, size: 32, offset: 2304)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1111, file: !541, line: 367, baseType: !403, size: 32, offset: 2336)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1111, file: !541, line: 368, baseType: !1154, size: 64, offset: 2368)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1111, file: !541, line: 369, baseType: !1154, size: 64, offset: 2432)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1111, file: !541, line: 370, baseType: !1212, size: 64, offset: 2496)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !6, line: 678, baseType: !1213)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1214 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !6, line: 678, flags: DIFlagFwdDecl)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1111, file: !541, line: 371, baseType: !1212, size: 64, offset: 2560)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1111, file: !541, line: 372, baseType: !1212, size: 64, offset: 2624)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1111, file: !541, line: 373, baseType: !1218, size: 64, offset: 2688)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !324, line: 331, baseType: !1219)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64)
!1220 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !324, line: 331, flags: DIFlagFwdDecl)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1111, file: !541, line: 374, baseType: !497, size: 64, offset: 2752)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1111, file: !541, line: 375, baseType: !1223, size: 64, offset: 2816)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !560, file: !541, line: 451, baseType: !1110, size: 2880, offset: 18560)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !560, file: !541, line: 452, baseType: !1226, size: 64, offset: 21440)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !38, line: 1723, baseType: !1227)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !541, line: 681, size: 4864, elements: !1229)
!1229 = !{!1230, !1231, !1232, !1233, !1234, !1235, !1236, !1240}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1228, file: !541, line: 682, baseType: !563, size: 4480)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1228, file: !541, line: 682, baseType: !788, size: 32, offset: 4480)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1228, file: !541, line: 683, baseType: !501, size: 32, offset: 4512)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1228, file: !541, line: 684, baseType: !386, size: 32, offset: 4544)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1228, file: !541, line: 685, baseType: !940, size: 64, offset: 4608)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1228, file: !541, line: 686, baseType: !448, size: 64, offset: 4672)
