; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/utils/vsection.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/utils/vsection.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscSection = type { %struct._p_PetscObject, [1 x i32], i32, i32, %struct._p_IS*, i32, i32, i32*, i32*, i32, %struct._p_PetscSection*, i32*, i32, i32, i8**, i32*, %struct._p_PetscSection**, i32, i8***, %struct._p_PetscObject*, %struct.kh_ClPerm_s*, %struct._p_PetscSection*, %struct._p_IS*, %struct._p_PetscSectionSym* }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!34 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!35 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!37 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!38 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!39 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!40 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!41 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!42 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 475, baseType: !5, size: 32, elements: !44)
!44 = !{!45, !46, !47}
!45 = !DIEnumerator(name: "VEC_IGNORE_OFF_PROC_ENTRIES", value: 0, isUnsigned: true)
!46 = !DIEnumerator(name: "VEC_IGNORE_NEGATIVE_INDICES", value: 1, isUnsigned: true)
!47 = !DIEnumerator(name: "VEC_SUBSET_OFF_PROC_ENTRIES", value: 2, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 701, baseType: !5, size: 32, elements: !49)
!49 = !{!50, !51, !52, !53, !54}
!50 = !DIEnumerator(name: "PETSC_MEMTYPE_HOST", value: 0, isUnsigned: true)
!51 = !DIEnumerator(name: "PETSC_MEMTYPE_DEVICE", value: 1, isUnsigned: true)
!52 = !DIEnumerator(name: "PETSC_MEMTYPE_CUDA", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSC_MEMTYPE_NVSHMEM", value: 17, isUnsigned: true)
!54 = !DIEnumerator(name: "PETSC_MEMTYPE_HIP", value: 3, isUnsigned: true)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 472, baseType: !5, size: 32, elements: !56)
!56 = !{!57, !58, !59, !60, !61}
!57 = !DIEnumerator(name: "PETSC_OFFLOAD_UNALLOCATED", value: 0, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_OFFLOAD_CPU", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_OFFLOAD_GPU", value: 2, isUnsigned: true)
!60 = !DIEnumerator(name: "PETSC_OFFLOAD_BOTH", value: 3, isUnsigned: true)
!61 = !DIEnumerator(name: "PETSC_OFFLOAD_VECKOKKOS", value: 256, isUnsigned: true)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 663, baseType: !5, size: 32, elements: !64)
!63 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!64 = !{!65, !66, !67}
!65 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!66 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!67 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !69)
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87}
!70 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!72 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !89)
!89 = !{!90, !91, !92}
!90 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!93 = !{!94, !98, !99, !135, !269, !185, !106, !161}
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !95, line: 330, baseType: !96)
!95 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !95, line: 330, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !102, line: 73, size: 4480, elements: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!103 = !{!104, !107, !156, !157, !159, !162, !163, !164, !165, !173, !174, !176, !180, !184, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !197, !198, !199, !201, !202, !204, !206, !207, !208, !209, !210, !213, !215, !216, !217, !218, !219, !222, !224, !225, !226, !236, !238, !239, !243, !244, !293, !298, !300, !301, !302}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !101, file: !102, line: 74, baseType: !105, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !106)
!106 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !101, file: !102, line: 75, baseType: !108, size: 448, offset: 64)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 448, elements: !154)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !102, line: 53, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !102, line: 45, size: 448, elements: !111)
!111 = !{!112, !118, !126, !131, !138, !142, !149}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !110, file: !102, line: 46, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!116, !99, !117}
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !106)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !110, file: !102, line: 47, baseType: !119, size: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!116, !99, !122}
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !123, line: 16, baseType: !124)
!123 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !123, line: 16, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !110, file: !102, line: 48, baseType: !127, size: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!116, !130}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !110, file: !102, line: 49, baseType: !132, size: 64, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!116, !99, !135, !99}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!137 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !110, file: !102, line: 50, baseType: !139, size: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!116, !99, !135, !130}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !110, file: !102, line: 51, baseType: !143, size: 64, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!116, !99, !135, !146}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{null}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !110, file: !102, line: 52, baseType: !150, size: 64, offset: 384)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!116, !99, !135, !153}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!154 = !{!155}
!155 = !DISubrange(count: 1)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !101, file: !102, line: 76, baseType: !94, size: 64, offset: 512)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !101, file: !102, line: 77, baseType: !158, size: 32, offset: 576)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !106)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !101, file: !102, line: 78, baseType: !160, size: 64, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !161)
!161 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !101, file: !102, line: 78, baseType: !160, size: 64, offset: 704)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !101, file: !102, line: 78, baseType: !160, size: 64, offset: 768)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !101, file: !102, line: 78, baseType: !160, size: 64, offset: 832)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !101, file: !102, line: 79, baseType: !166, size: 64, offset: 896)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !169, line: 27, baseType: !170)
!169 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !171, line: 43, baseType: !172)
!171 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!172 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !101, file: !102, line: 80, baseType: !158, size: 32, offset: 960)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !101, file: !102, line: 81, baseType: !175, size: 32, offset: 992)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !106)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !101, file: !102, line: 82, baseType: !177, size: 64, offset: 1024)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !101, file: !102, line: 83, baseType: !181, size: 64, offset: 1088)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !101, file: !102, line: 84, baseType: !185, size: 64, offset: 1152)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !101, file: !102, line: 85, baseType: !185, size: 64, offset: 1216)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !101, file: !102, line: 86, baseType: !185, size: 64, offset: 1280)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !101, file: !102, line: 87, baseType: !185, size: 64, offset: 1344)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !101, file: !102, line: 88, baseType: !99, size: 64, offset: 1408)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !101, file: !102, line: 89, baseType: !166, size: 64, offset: 1472)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !101, file: !102, line: 90, baseType: !185, size: 64, offset: 1536)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !101, file: !102, line: 91, baseType: !185, size: 64, offset: 1600)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !101, file: !102, line: 92, baseType: !158, size: 32, offset: 1664)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !101, file: !102, line: 93, baseType: !98, size: 64, offset: 1728)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !101, file: !102, line: 94, baseType: !196, size: 64, offset: 1792)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !167)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !101, file: !102, line: 95, baseType: !158, size: 32, offset: 1856)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !101, file: !102, line: 95, baseType: !158, size: 32, offset: 1888)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !101, file: !102, line: 96, baseType: !200, size: 64, offset: 1920)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !101, file: !102, line: 96, baseType: !200, size: 64, offset: 1984)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !101, file: !102, line: 97, baseType: !203, size: 64, offset: 2048)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !101, file: !102, line: 97, baseType: !205, size: 64, offset: 2112)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !101, file: !102, line: 98, baseType: !158, size: 32, offset: 2176)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !101, file: !102, line: 98, baseType: !158, size: 32, offset: 2208)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !101, file: !102, line: 99, baseType: !200, size: 64, offset: 2240)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !101, file: !102, line: 99, baseType: !200, size: 64, offset: 2304)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !101, file: !102, line: 100, baseType: !211, size: 64, offset: 2368)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !161)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !101, file: !102, line: 100, baseType: !214, size: 64, offset: 2432)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !101, file: !102, line: 101, baseType: !158, size: 32, offset: 2496)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !101, file: !102, line: 101, baseType: !158, size: 32, offset: 2528)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !101, file: !102, line: 102, baseType: !200, size: 64, offset: 2560)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !101, file: !102, line: 102, baseType: !200, size: 64, offset: 2624)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !101, file: !102, line: 103, baseType: !220, size: 64, offset: 2688)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !212)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !101, file: !102, line: 103, baseType: !223, size: 64, offset: 2752)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !101, file: !102, line: 104, baseType: !153, size: 64, offset: 2816)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !101, file: !102, line: 105, baseType: !158, size: 32, offset: 2880)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !101, file: !102, line: 106, baseType: !227, size: 128, offset: 2944)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 128, elements: !234)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !102, line: 64, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !102, line: 61, size: 128, elements: !231)
!231 = !{!232, !233}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !230, file: !102, line: 62, baseType: !146, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !230, file: !102, line: 63, baseType: !98, size: 64, offset: 64)
!234 = !{!235}
!235 = !DISubrange(count: 2)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !101, file: !102, line: 107, baseType: !237, size: 64, offset: 3072)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 64, elements: !234)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !101, file: !102, line: 108, baseType: !98, size: 64, offset: 3136)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !101, file: !102, line: 109, baseType: !240, size: 64, offset: 3200)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!116, !98}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !101, file: !102, line: 111, baseType: !158, size: 32, offset: 3264)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !101, file: !102, line: 112, baseType: !245, size: 320, offset: 3328)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 320, elements: !291)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!116, !249, !99, !98}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !252)
!252 = !{!253, !254, !279, !280, !281, !282, !283, !284, !285, !286, !287}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !251, file: !10, line: 100, baseType: !158, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !251, file: !10, line: 101, baseType: !255, size: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !258)
!258 = !{!259, !260, !261, !262, !263, !266, !267, !268, !272, !274, !276, !277, !278}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !257, file: !10, line: 84, baseType: !185, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !257, file: !10, line: 85, baseType: !185, size: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !257, file: !10, line: 86, baseType: !98, size: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !257, file: !10, line: 87, baseType: !177, size: 64, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !257, file: !10, line: 88, baseType: !264, size: 64, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !257, file: !10, line: 89, baseType: !137, size: 8, offset: 320)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !257, file: !10, line: 90, baseType: !185, size: 64, offset: 384)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !257, file: !10, line: 91, baseType: !269, size: 64, offset: 448)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !270, line: 46, baseType: !271)
!270 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!271 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !257, file: !10, line: 92, baseType: !273, size: 32, offset: 512)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !257, file: !10, line: 93, baseType: !275, size: 32, offset: 544)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !257, file: !10, line: 94, baseType: !255, size: 64, offset: 576)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !257, file: !10, line: 95, baseType: !185, size: 64, offset: 640)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !257, file: !10, line: 96, baseType: !98, size: 64, offset: 704)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !251, file: !10, line: 102, baseType: !185, size: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !251, file: !10, line: 102, baseType: !185, size: 64, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !251, file: !10, line: 103, baseType: !185, size: 64, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !251, file: !10, line: 104, baseType: !94, size: 64, offset: 320)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !251, file: !10, line: 105, baseType: !273, size: 32, offset: 384)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !251, file: !10, line: 105, baseType: !273, size: 32, offset: 416)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !251, file: !10, line: 105, baseType: !273, size: 32, offset: 448)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !251, file: !10, line: 106, baseType: !99, size: 64, offset: 512)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !251, file: !10, line: 107, baseType: !288, size: 64, offset: 576)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!291 = !{!292}
!292 = !DISubrange(count: 5)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !101, file: !102, line: 113, baseType: !294, size: 320, offset: 3648)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 320, elements: !291)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!116, !99, !98}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !101, file: !102, line: 114, baseType: !299, size: 320, offset: 3968)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 320, elements: !291)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !101, file: !102, line: 115, baseType: !273, size: 32, offset: 4288)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !101, file: !102, line: 120, baseType: !288, size: 64, offset: 4352)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !101, file: !102, line: 121, baseType: !273, size: 32, offset: 4416)
!303 = !{i32 7, !"Dwarf Version", i32 4}
!304 = !{i32 2, !"Debug Info Version", i32 3}
!305 = !{i32 1, !"wchar_size", i32 4}
!306 = !{i32 7, !"PIC Level", i32 2}
!307 = !{i32 7, !"uwtable", i32 1}
!308 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!309 = distinct !DISubprogram(name: "PetscSectionVecView", scope: !310, file: !310, line: 82, type: !311, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !710)
!310 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/vec/utils/vsection.c", directory: "/home/users/ndemeye/xSDK")
!311 = !DISubroutineType(types: !312)
!312 = !{!116, !313, !418, !122}
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !314, line: 18, baseType: !315)
!314 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !317, line: 29, size: 5760, elements: !318)
!317 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sectionimpl.h", directory: "/home/users/ndemeye/xSDK")
!318 = !{!319, !321, !323, !324, !325, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !341, !342, !344, !345, !347, !348, !377, !378, !379}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !316, file: !317, line: 30, baseType: !320, size: 4480)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !102, line: 122, baseType: !101)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !316, file: !317, line: 30, baseType: !322, size: 32, offset: 4480)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 32, elements: !154)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "pStart", scope: !316, file: !317, line: 31, baseType: !158, size: 32, offset: 4512)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "pEnd", scope: !316, file: !317, line: 31, baseType: !158, size: 32, offset: 4544)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !316, file: !317, line: 32, baseType: !326, size: 64, offset: 4608)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !327, line: 11, baseType: !328)
!327 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !327, line: 11, flags: DIFlagFwdDecl)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "pointMajor", scope: !316, file: !317, line: 33, baseType: !273, size: 32, offset: 4672)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "includesConstraints", scope: !316, file: !317, line: 34, baseType: !273, size: 32, offset: 4704)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "atlasDof", scope: !316, file: !317, line: 35, baseType: !203, size: 64, offset: 4736)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "atlasOff", scope: !316, file: !317, line: 36, baseType: !203, size: 64, offset: 4800)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "maxDof", scope: !316, file: !317, line: 37, baseType: !158, size: 32, offset: 4864)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !316, file: !317, line: 38, baseType: !313, size: 64, offset: 4928)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "bcIndices", scope: !316, file: !317, line: 39, baseType: !203, size: 64, offset: 4992)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !316, file: !317, line: 40, baseType: !273, size: 32, offset: 5056)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "numFields", scope: !316, file: !317, line: 42, baseType: !158, size: 32, offset: 5088)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "fieldNames", scope: !316, file: !317, line: 43, baseType: !340, size: 64, offset: 5120)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "numFieldComponents", scope: !316, file: !317, line: 44, baseType: !203, size: 64, offset: 5184)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !316, file: !317, line: 45, baseType: !343, size: 64, offset: 5248)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "useFieldOff", scope: !316, file: !317, line: 46, baseType: !273, size: 32, offset: 5312)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "compNames", scope: !316, file: !317, line: 47, baseType: !346, size: 64, offset: 5376)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "clObj", scope: !316, file: !317, line: 49, baseType: !99, size: 64, offset: 5440)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "clHash", scope: !316, file: !317, line: 50, baseType: !349, size: 64, offset: 5504)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClPerm", file: !317, line: 27, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_ClPerm_t", file: !317, line: 27, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_ClPerm_s", file: !317, line: 27, size: 320, elements: !353)
!353 = !{!354, !358, !359, !360, !361, !363, !370}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !352, file: !317, line: 27, baseType: !355, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !356, line: 166, baseType: !357)
!356 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/khash/khash.h", directory: "/home/users/ndemeye/xSDK")
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !356, line: 139, baseType: !5)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !352, file: !317, line: 27, baseType: !355, size: 32, offset: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !352, file: !317, line: 27, baseType: !355, size: 32, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !352, file: !317, line: 27, baseType: !355, size: 32, offset: 96)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !352, file: !317, line: 27, baseType: !362, size: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !352, file: !317, line: 27, baseType: !364, size: 64, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermKey", file: !317, line: 10, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PetscSectionClosurePermKey", file: !317, line: 8, size: 64, elements: !367)
!367 = !{!368, !369}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !366, file: !317, line: 9, baseType: !158, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !366, file: !317, line: 9, baseType: !158, size: 32, offset: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !352, file: !317, line: 27, baseType: !371, size: 64, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermVal", file: !317, line: 14, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !317, line: 12, size: 128, elements: !374)
!374 = !{!375, !376}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !373, file: !317, line: 13, baseType: !203, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "invPerm", scope: !373, file: !317, line: 13, baseType: !203, size: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "clSection", scope: !316, file: !317, line: 51, baseType: !313, size: 64, offset: 5568)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "clPoints", scope: !316, file: !317, line: 52, baseType: !326, size: 64, offset: 5632)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !316, file: !317, line: 53, baseType: !380, size: 64, offset: 5696)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionSym", file: !314, line: 33, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSectionSym", file: !317, line: 72, size: 4864, elements: !383)
!383 = !{!384, !385, !407, !408, !417}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !382, file: !317, line: 73, baseType: !320, size: 4480)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !382, file: !317, line: 73, baseType: !386, size: 192, offset: 4480)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 192, elements: !154)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSectionSymOps", file: !317, line: 56, size: 192, elements: !388)
!388 = !{!389, !399, !403}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "getpoints", scope: !387, file: !317, line: 57, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!116, !380, !313, !158, !393, !395, !396}
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !221)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !387, file: !317, line: 58, baseType: !400, size: 64, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!116, !380}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !387, file: !317, line: 59, baseType: !404, size: 64, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!116, !380, !122}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !382, file: !317, line: 74, baseType: !98, size: 64, offset: 4672)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !382, file: !317, line: 75, baseType: !409, size: 64, offset: 4736)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "SymWorkLink", file: !317, line: 62, baseType: !410)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_SymWorkLink", file: !317, line: 64, size: 256, elements: !412)
!412 = !{!413, !414, !415, !416}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !411, file: !317, line: 66, baseType: !409, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "perms", scope: !411, file: !317, line: 67, baseType: !395, size: 64, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "rots", scope: !411, file: !317, line: 68, baseType: !396, size: 64, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "numPoints", scope: !411, file: !317, line: 69, baseType: !158, size: 32, offset: 192)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !382, file: !317, line: 76, baseType: !409, size: 64, offset: 4800)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !25, line: 21, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !421, line: 142, size: 12800, elements: !422)
!421 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!422 = !{!423, !424, !635, !656, !657, !658, !704, !705, !706, !707, !709}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !420, file: !421, line: 143, baseType: !320, size: 4480)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !420, file: !421, line: 143, baseType: !425, size: 5248, offset: 4480)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 5248, elements: !154)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !421, line: 23, size: 5248, elements: !427)
!427 = !{!428, !433, !438, !442, !446, !452, !457, !458, !459, !463, !467, !468, !469, !473, !477, !481, !482, !486, !490, !494, !495, !500, !504, !505, !509, !513, !514, !515, !519, !520, !527, !532, !533, !534, !538, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !558, !559, !560, !564, !568, !569, !570, !571, !575, !576, !577, !578, !579, !580, !581, !585, !586, !590, !594, !595, !599, !600, !604, !605, !606, !607, !608, !609, !610, !611, !615, !616, !617, !623, !627, !628, !629}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !426, file: !421, line: 24, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!116, !418, !432}
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !426, file: !421, line: 25, baseType: !434, size: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{!116, !418, !158, !437}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !426, file: !421, line: 26, baseType: !439, size: 64, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!116, !158, !432}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !426, file: !421, line: 27, baseType: !443, size: 64, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!116, !418, !418, !220}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !426, file: !421, line: 28, baseType: !447, size: 64, offset: 256)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!116, !418, !158, !450, !220}
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !418)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !426, file: !421, line: 29, baseType: !453, size: 64, offset: 320)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!116, !418, !456, !211}
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !25, line: 155, baseType: !24)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !426, file: !421, line: 30, baseType: !443, size: 64, offset: 384)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !426, file: !421, line: 31, baseType: !447, size: 64, offset: 448)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !426, file: !421, line: 32, baseType: !460, size: 64, offset: 512)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!116, !418, !221}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !426, file: !421, line: 33, baseType: !464, size: 64, offset: 576)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!116, !418, !418}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !426, file: !421, line: 34, baseType: !460, size: 64, offset: 640)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !426, file: !421, line: 35, baseType: !464, size: 64, offset: 704)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !426, file: !421, line: 36, baseType: !470, size: 64, offset: 768)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!116, !418, !221, !418}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !426, file: !421, line: 37, baseType: !474, size: 64, offset: 832)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!116, !418, !221, !221, !418}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !426, file: !421, line: 38, baseType: !478, size: 64, offset: 896)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!116, !418, !158, !397, !432}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !426, file: !421, line: 39, baseType: !470, size: 64, offset: 960)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !426, file: !421, line: 40, baseType: !483, size: 64, offset: 1024)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{!116, !418, !221, !418, !418}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !426, file: !421, line: 41, baseType: !487, size: 64, offset: 1088)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!116, !418, !221, !221, !221, !418, !418}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !426, file: !421, line: 42, baseType: !491, size: 64, offset: 1152)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!116, !418, !418, !418}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !426, file: !421, line: 43, baseType: !491, size: 64, offset: 1216)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !426, file: !421, line: 44, baseType: !496, size: 64, offset: 1280)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{!116, !418, !158, !393, !397, !499}
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !426, file: !421, line: 45, baseType: !501, size: 64, offset: 1344)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!116, !418}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !426, file: !421, line: 46, baseType: !501, size: 64, offset: 1408)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !426, file: !421, line: 47, baseType: !506, size: 64, offset: 1472)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!116, !418, !223}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !426, file: !421, line: 48, baseType: !510, size: 64, offset: 1536)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{!116, !418, !203}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !426, file: !421, line: 49, baseType: !510, size: 64, offset: 1600)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !426, file: !421, line: 50, baseType: !506, size: 64, offset: 1664)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !426, file: !421, line: 51, baseType: !516, size: 64, offset: 1728)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{!116, !418, !203, !211}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !426, file: !421, line: 52, baseType: !516, size: 64, offset: 1792)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !426, file: !421, line: 53, baseType: !521, size: 64, offset: 1856)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{!116, !418, !524}
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !426, file: !421, line: 54, baseType: !528, size: 64, offset: 1920)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!116, !418, !531, !273}
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !25, line: 475, baseType: !43)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !426, file: !421, line: 55, baseType: !496, size: 64, offset: 1984)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !426, file: !421, line: 56, baseType: !501, size: 64, offset: 2048)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !426, file: !421, line: 57, baseType: !535, size: 64, offset: 2112)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!116, !418, !122}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !426, file: !421, line: 58, baseType: !539, size: 64, offset: 2176)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!116, !418, !397}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !426, file: !421, line: 59, baseType: !539, size: 64, offset: 2240)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !426, file: !421, line: 60, baseType: !443, size: 64, offset: 2304)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !426, file: !421, line: 61, baseType: !443, size: 64, offset: 2368)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !426, file: !421, line: 62, baseType: !453, size: 64, offset: 2432)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !426, file: !421, line: 63, baseType: !447, size: 64, offset: 2496)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !426, file: !421, line: 64, baseType: !447, size: 64, offset: 2560)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !426, file: !421, line: 65, baseType: !535, size: 64, offset: 2624)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !426, file: !421, line: 66, baseType: !501, size: 64, offset: 2688)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !426, file: !421, line: 67, baseType: !501, size: 64, offset: 2752)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !426, file: !421, line: 68, baseType: !552, size: 64, offset: 2816)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{!116, !418, !555}
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !327, line: 30, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !327, line: 30, flags: DIFlagFwdDecl)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !426, file: !421, line: 69, baseType: !496, size: 64, offset: 2880)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !426, file: !421, line: 70, baseType: !501, size: 64, offset: 2944)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !426, file: !421, line: 71, baseType: !561, size: 64, offset: 3008)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DISubroutineType(types: !563)
!563 = !{!116, !249, !418}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !426, file: !421, line: 72, baseType: !565, size: 64, offset: 3072)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{!116, !418, !418, !211}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !426, file: !421, line: 73, baseType: !491, size: 64, offset: 3136)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !426, file: !421, line: 74, baseType: !491, size: 64, offset: 3200)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !426, file: !421, line: 75, baseType: !491, size: 64, offset: 3264)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !426, file: !421, line: 76, baseType: !572, size: 64, offset: 3328)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!116, !418, !158, !393, !220}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !426, file: !421, line: 77, baseType: !501, size: 64, offset: 3392)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !426, file: !421, line: 78, baseType: !501, size: 64, offset: 3456)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !426, file: !421, line: 79, baseType: !501, size: 64, offset: 3520)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !426, file: !421, line: 80, baseType: !501, size: 64, offset: 3584)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !426, file: !421, line: 81, baseType: !460, size: 64, offset: 3648)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !426, file: !421, line: 82, baseType: !501, size: 64, offset: 3712)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !426, file: !421, line: 83, baseType: !582, size: 64, offset: 3776)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!116, !418, !158, !418, !499}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !426, file: !421, line: 84, baseType: !582, size: 64, offset: 3840)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !426, file: !421, line: 85, baseType: !587, size: 64, offset: 3904)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!116, !418, !418, !220, !220}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !426, file: !421, line: 86, baseType: !591, size: 64, offset: 3968)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!116, !418, !326, !432}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !426, file: !421, line: 87, baseType: !591, size: 64, offset: 4032)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !426, file: !421, line: 88, baseType: !596, size: 64, offset: 4096)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{!116, !418, !396}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !426, file: !421, line: 89, baseType: !596, size: 64, offset: 4160)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !426, file: !421, line: 90, baseType: !601, size: 64, offset: 4224)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!116, !418, !158, !393, !393, !418, !499}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !426, file: !421, line: 91, baseType: !601, size: 64, offset: 4288)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !426, file: !421, line: 92, baseType: !535, size: 64, offset: 4352)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !426, file: !421, line: 93, baseType: !535, size: 64, offset: 4416)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !426, file: !421, line: 94, baseType: !464, size: 64, offset: 4480)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !426, file: !421, line: 95, baseType: !464, size: 64, offset: 4544)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !426, file: !421, line: 96, baseType: !464, size: 64, offset: 4608)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !426, file: !421, line: 97, baseType: !464, size: 64, offset: 4672)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !426, file: !421, line: 98, baseType: !612, size: 64, offset: 4736)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{!116, !418, !273}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !426, file: !421, line: 99, baseType: !506, size: 64, offset: 4800)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !426, file: !421, line: 100, baseType: !506, size: 64, offset: 4864)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !426, file: !421, line: 101, baseType: !618, size: 64, offset: 4928)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{!116, !418, !223, !621}
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !48)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !426, file: !421, line: 102, baseType: !624, size: 64, offset: 4992)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{!116, !418, !396, !621}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !426, file: !421, line: 103, baseType: !506, size: 64, offset: 5056)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !426, file: !421, line: 104, baseType: !596, size: 64, offset: 5120)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !426, file: !421, line: 105, baseType: !630, size: 64, offset: 5184)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!116, !158, !450, !432, !633}
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !420, file: !421, line: 144, baseType: !636, size: 64, offset: 9728)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !327, line: 60, baseType: !637)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !639, line: 240, size: 640, elements: !640)
!639 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!640 = !{!641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !638, file: !639, line: 241, baseType: !94, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !638, file: !639, line: 242, baseType: !175, size: 32, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !638, file: !639, line: 243, baseType: !158, size: 32, offset: 96)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !638, file: !639, line: 243, baseType: !158, size: 32, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !638, file: !639, line: 244, baseType: !158, size: 32, offset: 160)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !638, file: !639, line: 244, baseType: !158, size: 32, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !638, file: !639, line: 245, baseType: !203, size: 64, offset: 256)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !638, file: !639, line: 246, baseType: !273, size: 32, offset: 320)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !638, file: !639, line: 247, baseType: !158, size: 32, offset: 352)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !638, file: !639, line: 251, baseType: !158, size: 32, offset: 384)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !638, file: !639, line: 252, baseType: !555, size: 64, offset: 448)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !638, file: !639, line: 253, baseType: !273, size: 32, offset: 512)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !638, file: !639, line: 254, baseType: !158, size: 32, offset: 544)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !638, file: !639, line: 254, baseType: !158, size: 32, offset: 576)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !638, file: !639, line: 255, baseType: !158, size: 32, offset: 608)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !420, file: !421, line: 145, baseType: !98, size: 64, offset: 9792)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !420, file: !421, line: 146, baseType: !273, size: 32, offset: 9856)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !420, file: !421, line: 147, baseType: !659, size: 1344, offset: 9920)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !421, line: 140, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !421, line: 114, size: 1344, elements: !661)
!661 = !{!662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !680, !681, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !660, file: !421, line: 115, baseType: !158, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !660, file: !421, line: 116, baseType: !158, size: 32, offset: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !660, file: !421, line: 117, baseType: !158, size: 32, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !660, file: !421, line: 118, baseType: !158, size: 32, offset: 96)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !660, file: !421, line: 119, baseType: !158, size: 32, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !660, file: !421, line: 120, baseType: !158, size: 32, offset: 160)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !660, file: !421, line: 121, baseType: !203, size: 64, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !660, file: !421, line: 122, baseType: !220, size: 64, offset: 256)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !660, file: !421, line: 124, baseType: !94, size: 64, offset: 320)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !660, file: !421, line: 125, baseType: !175, size: 32, offset: 384)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !660, file: !421, line: 125, baseType: !175, size: 32, offset: 416)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !660, file: !421, line: 126, baseType: !175, size: 32, offset: 448)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !660, file: !421, line: 126, baseType: !175, size: 32, offset: 480)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !660, file: !421, line: 127, baseType: !676, size: 64, offset: 512)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !95, line: 339, baseType: !678)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !95, line: 339, flags: DIFlagFwdDecl)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !660, file: !421, line: 128, baseType: !676, size: 64, offset: 576)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !660, file: !421, line: 129, baseType: !682, size: 64, offset: 640)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !95, line: 341, baseType: !684)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !95, line: 351, size: 192, elements: !685)
!685 = !{!686, !687, !688, !689, !690}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !684, file: !95, line: 354, baseType: !106, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !684, file: !95, line: 355, baseType: !106, size: 32, offset: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !684, file: !95, line: 356, baseType: !106, size: 32, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !684, file: !95, line: 361, baseType: !106, size: 32, offset: 96)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !684, file: !95, line: 362, baseType: !269, size: 64, offset: 128)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !660, file: !421, line: 130, baseType: !158, size: 32, offset: 704)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !660, file: !421, line: 130, baseType: !158, size: 32, offset: 736)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !660, file: !421, line: 131, baseType: !220, size: 64, offset: 768)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !660, file: !421, line: 131, baseType: !220, size: 64, offset: 832)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !660, file: !421, line: 132, baseType: !203, size: 64, offset: 896)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !660, file: !421, line: 132, baseType: !203, size: 64, offset: 960)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !660, file: !421, line: 133, baseType: !158, size: 32, offset: 1024)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !660, file: !421, line: 134, baseType: !203, size: 64, offset: 1088)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !660, file: !421, line: 135, baseType: !158, size: 32, offset: 1152)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !660, file: !421, line: 136, baseType: !273, size: 32, offset: 1184)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !660, file: !421, line: 137, baseType: !273, size: 32, offset: 1216)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !660, file: !421, line: 138, baseType: !499, size: 32, offset: 1248)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !660, file: !421, line: 139, baseType: !203, size: 64, offset: 1280)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !420, file: !421, line: 147, baseType: !659, size: 1344, offset: 11264)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !420, file: !421, line: 148, baseType: !273, size: 32, offset: 12608)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !420, file: !421, line: 149, baseType: !158, size: 32, offset: 12640)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !420, file: !421, line: 150, baseType: !708, size: 32, offset: 12672)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !25, line: 472, baseType: !55)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !420, file: !421, line: 157, baseType: !185, size: 64, offset: 12736)
!710 = !{!711, !712, !713, !714, !715, !716, !717, !721, !723, !726, !728, !732, !737, !739, !742}
!711 = !DILocalVariable(name: "s", arg: 1, scope: !309, file: !310, line: 82, type: !313)
!712 = !DILocalVariable(name: "v", arg: 2, scope: !309, file: !310, line: 82, type: !418)
!713 = !DILocalVariable(name: "viewer", arg: 3, scope: !309, file: !310, line: 82, type: !122)
!714 = !DILocalVariable(name: "isascii", scope: !309, file: !310, line: 84, type: !273)
!715 = !DILocalVariable(name: "f", scope: !309, file: !310, line: 85, type: !158)
!716 = !DILocalVariable(name: "ierr", scope: !309, file: !310, line: 86, type: !116)
!717 = !DILocalVariable(name: "ierr__", scope: !718, file: !310, line: 91, type: !116)
!718 = distinct !DILexicalBlock(scope: !719, file: !310, line: 91, column: 92)
!719 = distinct !DILexicalBlock(scope: !720, file: !310, line: 91, column: 16)
!720 = distinct !DILexicalBlock(scope: !309, file: !310, line: 91, column: 7)
!721 = !DILocalVariable(name: "ierr__", scope: !722, file: !310, line: 93, type: !116)
!722 = distinct !DILexicalBlock(scope: !309, file: !310, line: 93, column: 83)
!723 = !DILocalVariable(name: "name", scope: !724, file: !310, line: 95, type: !135)
!724 = distinct !DILexicalBlock(scope: !725, file: !310, line: 94, column: 16)
!725 = distinct !DILexicalBlock(scope: !309, file: !310, line: 94, column: 7)
!726 = !DILocalVariable(name: "ierr__", scope: !727, file: !310, line: 97, type: !116)
!727 = distinct !DILexicalBlock(scope: !724, file: !310, line: 97, column: 55)
!728 = !DILocalVariable(name: "ierr__", scope: !729, file: !310, line: 99, type: !116)
!729 = distinct !DILexicalBlock(scope: !730, file: !310, line: 99, column: 88)
!730 = distinct !DILexicalBlock(scope: !731, file: !310, line: 98, column: 23)
!731 = distinct !DILexicalBlock(scope: !724, file: !310, line: 98, column: 9)
!732 = !DILocalVariable(name: "ierr__", scope: !733, file: !310, line: 101, type: !116)
!733 = distinct !DILexicalBlock(scope: !734, file: !310, line: 101, column: 111)
!734 = distinct !DILexicalBlock(scope: !735, file: !310, line: 100, column: 42)
!735 = distinct !DILexicalBlock(scope: !736, file: !310, line: 100, column: 7)
!736 = distinct !DILexicalBlock(scope: !730, file: !310, line: 100, column: 7)
!737 = !DILocalVariable(name: "ierr__", scope: !738, file: !310, line: 102, type: !116)
!738 = distinct !DILexicalBlock(scope: !734, file: !310, line: 102, column: 66)
!739 = !DILocalVariable(name: "ierr__", scope: !740, file: !310, line: 105, type: !116)
!740 = distinct !DILexicalBlock(scope: !741, file: !310, line: 105, column: 59)
!741 = distinct !DILexicalBlock(scope: !731, file: !310, line: 104, column: 12)
!742 = !DILocalVariable(name: "ierr__", scope: !743, file: !310, line: 106, type: !116)
!743 = distinct !DILexicalBlock(scope: !741, file: !310, line: 106, column: 54)
!744 = !DILocation(line: 0, scope: !309)
!745 = !{!746, !746, i64 0}
!746 = !{!"any pointer", !747, i64 0}
!747 = !{!"omnipotent char", !748, i64 0}
!748 = !{!"Simple C/C++ TBAA"}
!749 = !DILocation(line: 84, column: 3, scope: !309)
!750 = !DILocation(line: 88, column: 3, scope: !751)
!751 = distinct !DILexicalBlock(scope: !752, file: !310, line: 88, column: 3)
!752 = distinct !DILexicalBlock(scope: !753, file: !310, line: 88, column: 3)
!753 = distinct !DILexicalBlock(scope: !309, file: !310, line: 88, column: 3)
!754 = !DILocation(line: 88, column: 3, scope: !752)
!755 = !DILocation(line: 88, column: 3, scope: !756)
!756 = distinct !DILexicalBlock(scope: !757, file: !310, line: 88, column: 3)
!757 = distinct !DILexicalBlock(scope: !751, file: !310, line: 88, column: 3)
!758 = !{!759, !760, i64 1536}
!759 = !{!"", !747, i64 0, !747, i64 512, !747, i64 1024, !747, i64 1280, !760, i64 1536, !760, i64 1540, !747, i64 1544}
!760 = !{!"int", !747, i64 0}
!761 = !DILocation(line: 88, column: 3, scope: !757)
