; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/error/adebug.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/error/adebug.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct._n_PetscOptions = type opaque

@petscwaitonerrorflg = local_unnamed_addr global i32 0, align 4, !dbg !0
@petscindebugger = local_unnamed_addr global i32 0, align 4, !dbg !30
@petscstack = external local_unnamed_addr global %struct.PetscStack*, align 8
@__func__.PetscSetDebugTerminal = private unnamed_addr constant [22 x i8] c"PetscSetDebugTerminal\00", align 1
@.str = private unnamed_addr constant [76 x i8] c"/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/error/adebug.c\00", align 1
@DebugTerminal = internal global [4096 x i8] zeroinitializer, align 16, !dbg !39
@ompi_mpi_comm_self = external global %struct.ompi_predefined_communicator_t, align 1

!1030 = !DILocation(line: 403, column: 11, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !1026, file: !32, line: 402, column: 48)
!1032 = !DILocation(line: 404, column: 11, scope: !1031)
!1033 = !DILocation(line: 408, column: 3, scope: !547)
!1034 = !DILocation(line: 409, column: 15, scope: !621)
!1035 = !DILocation(line: 410, column: 12, scope: !621)
!1036 = !DILocation(line: 0, scope: !620)
!1037 = !DILocation(line: 410, column: 77, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !620, file: !32, line: 410, column: 77)
!1039 = !DILocation(line: 410, column: 77, scope: !620)
!1040 = !DILocation(line: 411, column: 9, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !621, file: !32, line: 411, column: 9)
!1042 = !DILocation(line: 411, column: 19, scope: !1041)
!1043 = !DILocation(line: 411, column: 9, scope: !621)
!1044 = !DILocation(line: 411, column: 36, scope: !1041)
!1045 = !DILocation(line: 411, column: 34, scope: !1041)
!1046 = !DILocation(line: 411, column: 24, scope: !1041)
!1047 = !DILocation(line: 430, column: 16, scope: !621)
!1048 = !DILocation(line: 430, column: 5, scope: !621)
!1049 = !DILocation(line: 434, column: 3, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1051, file: !32, line: 434, column: 3)
!1051 = distinct !DILexicalBlock(scope: !1052, file: !32, line: 434, column: 3)
!1052 = distinct !DILexicalBlock(scope: !525, file: !32, line: 434, column: 3)
!1053 = !DILocation(line: 434, column: 3, scope: !1051)
!1054 = !DILocation(line: 434, column: 3, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1056, file: !32, line: 434, column: 3)
!1056 = distinct !DILexicalBlock(scope: !1050, file: !32, line: 434, column: 3)
!1057 = !DILocation(line: 434, column: 3, scope: !1056)
!1058 = !DILocation(line: 434, column: 3, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1060, file: !32, line: 434, column: 3)
!1060 = distinct !DILexicalBlock(scope: !1055, file: !32, line: 434, column: 3)
!1061 = !DILocation(line: 434, column: 3, scope: !1060)
!1062 = !DILocation(line: 434, column: 3, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1059, file: !32, line: 434, column: 3)
!1064 = !DILocation(line: 434, column: 3, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1055, file: !32, line: 434, column: 3)
!1066 = !DILocation(line: 434, column: 3, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !1065, file: !32, line: 434, column: 3)
!1068 = !DILocation(line: 434, column: 3, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1070, file: !32, line: 434, column: 3)
!1070 = distinct !DILexicalBlock(scope: !1067, file: !32, line: 434, column: 3)
!1071 = !DILocation(line: 434, column: 3, scope: !1070)
!1072 = !DILocation(line: 434, column: 3, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1069, file: !32, line: 434, column: 3)
!1074 = !DILocation(line: 435, column: 1, scope: !525)
!1075 = !DISubprogram(name: "PetscGetDisplay", scope: !134, file: !134, line: 2538, type: !1076, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !138)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!26, !28, !137}
!1078 = !DISubprogram(name: "PetscGetProgramName", scope: !134, file: !134, line: 2489, type: !1076, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !138)
!1079 = !DISubprogram(name: "fork", scope: !1080, file: !1080, line: 759, type: !1081, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !138)
!1080 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!26}
!1083 = !DISubprogram(name: "getppid", scope: !1080, file: !1080, line: 634, type: !1081, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !138)
!1084 = !DISubprogram(name: "PetscGetHostName", scope: !134, file: !134, line: 2487, type: !1076, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !138)
!1085 = !DISubprogram(name: "execvp", scope: !1080, file: !1080, line: 581, type: !1086, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !138)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!26, !23, !1088}
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!1090 = !DISubprogram(name: "perror", scope: !1091, file: !1091, line: 775, type: !1092, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !138)
!1091 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!1092 = !DISubroutineType(types: !1093)
!1093 = !{null, !23}
!1094 = !DISubprogram(name: "PetscStrncmp", scope: !134, file: !134, line: 1349, type: !1095, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !138)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{!26, !23, !23, !137, !145}
!1097 = !DISubprogram(name: "PetscSNPrintf", scope: !134, file: !134, line: 1660, type: !1098, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !138)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!52, !28, !137, !23, null}
!1100 = !DISubprogram(name: "PetscPOpen", scope: !134, file: !134, line: 1672, type: !1101, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !138)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{!26, !20, !23, !23, !23, !1103}
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1106, line: 245, size: 1728, elements: !1107)
!1106 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/libio.h", directory: "")
!1107 = !{!1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1127, !1128, !1129, !1130, !1134, !1136, !1138, !1142, !1145, !1147, !1148, !1149, !1150, !1151, !1154, !1155}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1105, file: !1106, line: 246, baseType: !26, size: 32)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1105, file: !1106, line: 251, baseType: !28, size: 64, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1105, file: !1106, line: 252, baseType: !28, size: 64, offset: 128)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1105, file: !1106, line: 253, baseType: !28, size: 64, offset: 192)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1105, file: !1106, line: 254, baseType: !28, size: 64, offset: 256)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1105, file: !1106, line: 255, baseType: !28, size: 64, offset: 320)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1105, file: !1106, line: 256, baseType: !28, size: 64, offset: 384)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1105, file: !1106, line: 257, baseType: !28, size: 64, offset: 448)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1105, file: !1106, line: 258, baseType: !28, size: 64, offset: 512)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1105, file: !1106, line: 260, baseType: !28, size: 64, offset: 576)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1105, file: !1106, line: 261, baseType: !28, size: 64, offset: 640)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1105, file: !1106, line: 262, baseType: !28, size: 64, offset: 704)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1105, file: !1106, line: 264, baseType: !1121, size: 64, offset: 768)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1106, line: 160, size: 192, elements: !1123)
!1123 = !{!1124, !1125, !1126}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1122, file: !1106, line: 161, baseType: !1121, size: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !1122, file: !1106, line: 162, baseType: !1104, size: 64, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !1122, file: !1106, line: 166, baseType: !26, size: 32, offset: 128)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1105, file: !1106, line: 266, baseType: !1104, size: 64, offset: 832)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1105, file: !1106, line: 268, baseType: !26, size: 32, offset: 896)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1105, file: !1106, line: 272, baseType: !26, size: 32, offset: 928)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1105, file: !1106, line: 274, baseType: !1131, size: 64, offset: 960)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !1132, line: 140, baseType: !1133)
!1132 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!1133 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1105, file: !1106, line: 278, baseType: !1135, size: 16, offset: 1024)
!1135 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1105, file: !1106, line: 279, baseType: !1137, size: 8, offset: 1040)
!1137 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1105, file: !1106, line: 280, baseType: !1139, size: 8, offset: 1048)
!1139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 8, elements: !1140)
!1140 = !{!1141}
!1141 = !DISubrange(count: 1)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1105, file: !1106, line: 284, baseType: !1143, size: 64, offset: 1088)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1106, line: 154, baseType: null)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1105, file: !1106, line: 293, baseType: !1146, size: 64, offset: 1152)
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !1132, line: 141, baseType: !1133)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1105, file: !1106, line: 301, baseType: !22, size: 64, offset: 1216)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1105, file: !1106, line: 302, baseType: !22, size: 64, offset: 1280)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !1105, file: !1106, line: 303, baseType: !22, size: 64, offset: 1344)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !1105, file: !1106, line: 304, baseType: !22, size: 64, offset: 1408)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1105, file: !1106, line: 306, baseType: !1152, size: 64, offset: 1472)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1153, line: 46, baseType: !137)
!1153 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1105, file: !1106, line: 307, baseType: !26, size: 32, offset: 1536)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1105, file: !1106, line: 309, baseType: !1156, size: 160, offset: 1568)
!1156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 160, elements: !1157)
!1157 = !{!1158}
!1158 = !DISubrange(count: 20)
!1159 = !DISubprogram(name: "PetscStrchr", scope: !134, file: !134, line: 1354, type: !1160, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !138)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!26, !23, !25, !27}
!1162 = !DISubprogram(name: "PetscOptionsGetReal", scope: !1163, file: !1163, line: 24, type: !1164, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !138)
!1163 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!1164 = !DISubroutineType(types: !1165)
!1165 = !{!26, !1166, !23, !23, !1168, !145}
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !1163, line: 10, flags: DIFlagFwdDecl)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!1169 = !DISubprogram(name: "PetscSleep", scope: !134, file: !134, line: 1420, type: !1170, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !138)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!26, !530}
!1172 = distinct !DISubprogram(name: "PetscAttachDebuggerErrorHandler", scope: !32, file: !32, line: 479, type: !1173, scopeLine: 480, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1176)
!1173 = !DISubroutineType(types: !1174)
!1174 = !{!52, !18, !26, !23, !23, !52, !1175, !23, !22}
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorType", file: !12, line: 663, baseType: !11)
!1176 = !{!1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185}
!1177 = !DILocalVariable(name: "comm", arg: 1, scope: !1172, file: !32, line: 479, type: !18)
!1178 = !DILocalVariable(name: "line", arg: 2, scope: !1172, file: !32, line: 479, type: !26)
!1179 = !DILocalVariable(name: "fun", arg: 3, scope: !1172, file: !32, line: 479, type: !23)
!1180 = !DILocalVariable(name: "file", arg: 4, scope: !1172, file: !32, line: 479, type: !23)
!1181 = !DILocalVariable(name: "num", arg: 5, scope: !1172, file: !32, line: 479, type: !52)
!1182 = !DILocalVariable(name: "p", arg: 6, scope: !1172, file: !32, line: 479, type: !1175)
!1183 = !DILocalVariable(name: "mess", arg: 7, scope: !1172, file: !32, line: 479, type: !23)
!1184 = !DILocalVariable(name: "ctx", arg: 8, scope: !1172, file: !32, line: 479, type: !22)
!1185 = !DILocalVariable(name: "ierr", scope: !1172, file: !32, line: 481, type: !52)
!1186 = !DILocation(line: 0, scope: !1172)
!1187 = !DILocation(line: 483, column: 3, scope: !1188)
!1188 = distinct !DILexicalBlock(scope: !1189, file: !32, line: 483, column: 3)
!1189 = distinct !DILexicalBlock(scope: !1190, file: !32, line: 483, column: 3)
!1190 = distinct !DILexicalBlock(scope: !1172, file: !32, line: 483, column: 3)
!1191 = !DILocation(line: 483, column: 3, scope: !1189)
!1192 = !DILocation(line: 483, column: 3, scope: !1193)
!1193 = distinct !DILexicalBlock(scope: !1194, file: !32, line: 483, column: 3)
!1194 = distinct !DILexicalBlock(scope: !1188, file: !32, line: 483, column: 3)
!1195 = !DILocation(line: 483, column: 3, scope: !1194)
!1196 = !DILocation(line: 483, column: 3, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1193, file: !32, line: 483, column: 3)
!1198 = !DILocation(line: 484, column: 8, scope: !1199)
!1199 = distinct !DILexicalBlock(scope: !1172, file: !32, line: 484, column: 7)
!1200 = !DILocation(line: 484, column: 7, scope: !1172)
!1201 = !DILocation(line: 485, column: 8, scope: !1202)
!1202 = distinct !DILexicalBlock(scope: !1172, file: !32, line: 485, column: 7)
!1203 = !DILocation(line: 485, column: 7, scope: !1172)
!1204 = !DILocation(line: 487, column: 5, scope: !1172)
