; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/constrained/impls/ipm/ipm.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/constrained/impls/ipm/ipm.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque

!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 181, baseType: !26, size: 32, elements: !27)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctao.h", directory: "/home/users/ndemeye/xSDK")
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40}
!28 = !DIEnumerator(name: "TAO_CONVERGED_GATOL", value: 3)
!29 = !DIEnumerator(name: "TAO_CONVERGED_GRTOL", value: 4)
!30 = !DIEnumerator(name: "TAO_CONVERGED_GTTOL", value: 5)
!31 = !DIEnumerator(name: "TAO_CONVERGED_STEPTOL", value: 6)
!32 = !DIEnumerator(name: "TAO_CONVERGED_MINF", value: 7)
!33 = !DIEnumerator(name: "TAO_CONVERGED_USER", value: 8)
!34 = !DIEnumerator(name: "TAO_DIVERGED_MAXITS", value: -2)
!35 = !DIEnumerator(name: "TAO_DIVERGED_NAN", value: -4)
!36 = !DIEnumerator(name: "TAO_DIVERGED_MAXFCN", value: -5)
!37 = !DIEnumerator(name: "TAO_DIVERGED_LS_FAILURE", value: -6)
!38 = !DIEnumerator(name: "TAO_DIVERGED_TR_REDUCTION", value: -7)
!39 = !DIEnumerator(name: "TAO_DIVERGED_USER", value: -8)
!40 = !DIEnumerator(name: "TAO_CONTINUE_ITERATING", value: 0)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 26, baseType: !5, size: 32, elements: !42)
!42 = !{!43, !44, !45}
!43 = !DIEnumerator(name: "TAO_SUBSET_SUBVEC", value: 0, isUnsigned: true)
!44 = !DIEnumerator(name: "TAO_SUBSET_MASK", value: 1, isUnsigned: true)
!45 = !DIEnumerator(name: "TAO_SUBSET_MATRIXFREE", value: 2, isUnsigned: true)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 663, baseType: !5, size: 32, elements: !48)
!47 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!48 = !{!49, !50, !51}
!49 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!50 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!51 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !53)
!53 = !{!54, !55, !56}
!54 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!55 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!56 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 580, baseType: !5, size: 32, elements: !58)
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67}
!59 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!60 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!61 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!62 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!63 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!64 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!65 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!66 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!67 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 424, baseType: !5, size: 32, elements: !70)
!69 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!70 = !{!71, !72}
!71 = !DIEnumerator(name: "MAT_FLUSH_ASSEMBLY", value: 1, isUnsigned: true)
!72 = !DIEnumerator(name: "MAT_FINAL_ASSEMBLY", value: 0, isUnsigned: true)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !74, line: 30, baseType: !5, size: 32, elements: !75)
!74 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!75 = !{!76, !77, !78, !79, !80}
!76 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!77 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!78 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!79 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!80 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!81 = !{!82, !85, !103, !184, !124, !290, !174, !26, !195}
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !83, line: 46, baseType: !84)
!83 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!84 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !88, line: 73, size: 4480, elements: !89)
!88 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!89 = !{!90, !92, !145, !146, !148, !151, !152, !153, !154, !162, !163, !165, !169, !173, !175, !176, !177, !178, !179, !180, !181, !182, !183, !185, !187, !188, !189, !191, !192, !194, !196, !197, !198, !199, !200, !203, !205, !206, !207, !208, !209, !212, !214, !215, !216, !226, !228, !229, !233, !234, !280, !285, !287, !288, !289}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !87, file: !88, line: 74, baseType: !91, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !87, file: !88, line: 75, baseType: !93, size: 448, offset: 64)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 448, elements: !143)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !88, line: 53, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !88, line: 45, size: 448, elements: !96)
!96 = !{!97, !107, !115, !120, !127, !131, !138}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !95, file: !88, line: 46, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!101, !85, !102}
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !104, line: 330, baseType: !105)
!104 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !104, line: 330, flags: DIFlagFwdDecl)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !95, file: !88, line: 47, baseType: !108, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!101, !85, !111}
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !112, line: 16, baseType: !113)
!112 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !112, line: 16, flags: DIFlagFwdDecl)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !95, file: !88, line: 48, baseType: !116, size: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!101, !119}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !95, file: !88, line: 49, baseType: !121, size: 64, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!101, !85, !124, !85}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!126 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !95, file: !88, line: 50, baseType: !128, size: 64, offset: 256)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!101, !85, !124, !119}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !95, file: !88, line: 51, baseType: !132, size: 64, offset: 320)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!101, !85, !124, !135}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{null}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !95, file: !88, line: 52, baseType: !139, size: 64, offset: 384)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!101, !85, !124, !142}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!143 = !{!144}
!144 = !DISubrange(count: 1)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !87, file: !88, line: 76, baseType: !103, size: 64, offset: 512)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !87, file: !88, line: 77, baseType: !147, size: 32, offset: 576)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !87, file: !88, line: 78, baseType: !149, size: 64, offset: 640)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !150)
!150 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !87, file: !88, line: 78, baseType: !149, size: 64, offset: 704)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !87, file: !88, line: 78, baseType: !149, size: 64, offset: 768)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !87, file: !88, line: 78, baseType: !149, size: 64, offset: 832)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !87, file: !88, line: 79, baseType: !155, size: 64, offset: 896)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !158, line: 27, baseType: !159)
!158 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !160, line: 43, baseType: !161)
!160 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!161 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !87, file: !88, line: 80, baseType: !147, size: 32, offset: 960)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !87, file: !88, line: 81, baseType: !164, size: 32, offset: 992)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !87, file: !88, line: 82, baseType: !166, size: 64, offset: 1024)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !87, file: !88, line: 83, baseType: !170, size: 64, offset: 1088)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !87, file: !88, line: 84, baseType: !174, size: 64, offset: 1152)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !87, file: !88, line: 85, baseType: !174, size: 64, offset: 1216)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !87, file: !88, line: 86, baseType: !174, size: 64, offset: 1280)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !87, file: !88, line: 87, baseType: !174, size: 64, offset: 1344)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !87, file: !88, line: 88, baseType: !85, size: 64, offset: 1408)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !87, file: !88, line: 89, baseType: !155, size: 64, offset: 1472)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !87, file: !88, line: 90, baseType: !174, size: 64, offset: 1536)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !87, file: !88, line: 91, baseType: !174, size: 64, offset: 1600)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !87, file: !88, line: 92, baseType: !147, size: 32, offset: 1664)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !87, file: !88, line: 93, baseType: !184, size: 64, offset: 1728)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !87, file: !88, line: 94, baseType: !186, size: 64, offset: 1792)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !156)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !87, file: !88, line: 95, baseType: !147, size: 32, offset: 1856)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !87, file: !88, line: 95, baseType: !147, size: 32, offset: 1888)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !87, file: !88, line: 96, baseType: !190, size: 64, offset: 1920)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !87, file: !88, line: 96, baseType: !190, size: 64, offset: 1984)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !87, file: !88, line: 97, baseType: !193, size: 64, offset: 2048)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !87, file: !88, line: 97, baseType: !195, size: 64, offset: 2112)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !87, file: !88, line: 98, baseType: !147, size: 32, offset: 2176)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !87, file: !88, line: 98, baseType: !147, size: 32, offset: 2208)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !87, file: !88, line: 99, baseType: !190, size: 64, offset: 2240)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !87, file: !88, line: 99, baseType: !190, size: 64, offset: 2304)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !87, file: !88, line: 100, baseType: !201, size: 64, offset: 2368)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !150)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !87, file: !88, line: 100, baseType: !204, size: 64, offset: 2432)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !87, file: !88, line: 101, baseType: !147, size: 32, offset: 2496)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !87, file: !88, line: 101, baseType: !147, size: 32, offset: 2528)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !87, file: !88, line: 102, baseType: !190, size: 64, offset: 2560)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !87, file: !88, line: 102, baseType: !190, size: 64, offset: 2624)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !87, file: !88, line: 103, baseType: !210, size: 64, offset: 2688)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !202)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !87, file: !88, line: 103, baseType: !213, size: 64, offset: 2752)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !87, file: !88, line: 104, baseType: !142, size: 64, offset: 2816)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !87, file: !88, line: 105, baseType: !147, size: 32, offset: 2880)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !87, file: !88, line: 106, baseType: !217, size: 128, offset: 2944)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 128, elements: !224)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !88, line: 64, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !88, line: 61, size: 128, elements: !221)
!221 = !{!222, !223}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !220, file: !88, line: 62, baseType: !135, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !220, file: !88, line: 63, baseType: !184, size: 64, offset: 64)
!224 = !{!225}
!225 = !DISubrange(count: 2)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !87, file: !88, line: 107, baseType: !227, size: 64, offset: 3072)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 64, elements: !224)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !87, file: !88, line: 108, baseType: !184, size: 64, offset: 3136)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !87, file: !88, line: 109, baseType: !230, size: 64, offset: 3200)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!101, !184}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !87, file: !88, line: 111, baseType: !147, size: 32, offset: 3264)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !87, file: !88, line: 112, baseType: !235, size: 320, offset: 3328)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 320, elements: !278)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!101, !239, !85, !184}
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !242)
!242 = !{!243, !244, !266, !267, !268, !269, !270, !271, !272, !273, !274}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !241, file: !10, line: 100, baseType: !147, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !241, file: !10, line: 101, baseType: !245, size: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !248)
!248 = !{!249, !250, !251, !252, !253, !256, !257, !258, !259, !261, !263, !264, !265}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !247, file: !10, line: 84, baseType: !174, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !247, file: !10, line: 85, baseType: !174, size: 64, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !247, file: !10, line: 86, baseType: !184, size: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !247, file: !10, line: 87, baseType: !166, size: 64, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !247, file: !10, line: 88, baseType: !254, size: 64, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !124)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !247, file: !10, line: 89, baseType: !126, size: 8, offset: 320)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !247, file: !10, line: 90, baseType: !174, size: 64, offset: 384)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !247, file: !10, line: 91, baseType: !82, size: 64, offset: 448)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !247, file: !10, line: 92, baseType: !260, size: 32, offset: 512)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !247, file: !10, line: 93, baseType: !262, size: 32, offset: 544)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !247, file: !10, line: 94, baseType: !245, size: 64, offset: 576)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !247, file: !10, line: 95, baseType: !174, size: 64, offset: 640)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !247, file: !10, line: 96, baseType: !184, size: 64, offset: 704)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !241, file: !10, line: 102, baseType: !174, size: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !241, file: !10, line: 102, baseType: !174, size: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !241, file: !10, line: 103, baseType: !174, size: 64, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !241, file: !10, line: 104, baseType: !103, size: 64, offset: 320)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !241, file: !10, line: 105, baseType: !260, size: 32, offset: 384)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !241, file: !10, line: 105, baseType: !260, size: 32, offset: 416)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !241, file: !10, line: 105, baseType: !260, size: 32, offset: 448)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !241, file: !10, line: 106, baseType: !85, size: 64, offset: 512)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !241, file: !10, line: 107, baseType: !275, size: 64, offset: 576)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!278 = !{!279}
!279 = !DISubrange(count: 5)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !87, file: !88, line: 113, baseType: !281, size: 320, offset: 3648)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 320, elements: !278)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!101, !85, !184}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !87, file: !88, line: 114, baseType: !286, size: 320, offset: 3968)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 320, elements: !278)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !87, file: !88, line: 115, baseType: !260, size: 32, offset: 4288)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !87, file: !88, line: 120, baseType: !275, size: 64, offset: 4352)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !87, file: !88, line: 121, baseType: !260, size: 32, offset: 4416)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "TAO_IPM", file: !292, line: 48, baseType: !293)
!292 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/tao/constrained/impls/ipm/ipm.h", directory: "/home/users/ndemeye/xSDK")
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !292, line: 9, size: 4032, elements: !294)
!294 = !{!295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !317, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !364, !365, !366, !367, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "mi", scope: !293, file: !292, line: 10, baseType: !147, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "me", scope: !293, file: !292, line: 10, baseType: !147, size: 32, offset: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !293, file: !292, line: 10, baseType: !147, size: 32, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "nxb", scope: !293, file: !292, line: 10, baseType: !147, size: 32, offset: 96)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "nib", scope: !293, file: !292, line: 10, baseType: !147, size: 32, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "nb", scope: !293, file: !292, line: 10, baseType: !147, size: 32, offset: 160)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "nslack", scope: !293, file: !292, line: 10, baseType: !147, size: 32, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "nuser_inequalities", scope: !293, file: !292, line: 11, baseType: !147, size: 32, offset: 224)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "nxlb", scope: !293, file: !292, line: 12, baseType: !147, size: 32, offset: 256)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "nxub", scope: !293, file: !292, line: 12, baseType: !147, size: 32, offset: 288)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "niub", scope: !293, file: !292, line: 12, baseType: !147, size: 32, offset: 320)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "nilb", scope: !293, file: !292, line: 12, baseType: !147, size: 32, offset: 352)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !293, file: !292, line: 13, baseType: !211, size: 64, offset: 384)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !293, file: !292, line: 13, baseType: !211, size: 64, offset: 448)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "taumin", scope: !293, file: !292, line: 13, baseType: !211, size: 64, offset: 512)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "dec", scope: !293, file: !292, line: 13, baseType: !211, size: 64, offset: 576)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "muaff", scope: !293, file: !292, line: 14, baseType: !211, size: 64, offset: 640)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "lag_ls", scope: !293, file: !292, line: 15, baseType: !313, size: 64, offset: 704)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearch", file: !314, line: 5, baseType: !315)
!314 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctaolinesearch.h", directory: "/home/users/ndemeye/xSDK")
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TaoLineSearch", file: !314, line: 5, flags: DIFlagFwdDecl)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !293, file: !292, line: 16, baseType: !318, size: 64, offset: 768)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !74, line: 21, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !74, line: 21, flags: DIFlagFwdDecl)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "rhs_x", scope: !293, file: !292, line: 16, baseType: !318, size: 64, offset: 832)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "save_x", scope: !293, file: !292, line: 16, baseType: !318, size: 64, offset: 896)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "lamdai", scope: !293, file: !292, line: 17, baseType: !318, size: 64, offset: 960)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "dlamdai", scope: !293, file: !292, line: 17, baseType: !318, size: 64, offset: 1024)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "rhs_lamdai", scope: !293, file: !292, line: 17, baseType: !318, size: 64, offset: 1088)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "save_lamdai", scope: !293, file: !292, line: 17, baseType: !318, size: 64, offset: 1152)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "lamdae", scope: !293, file: !292, line: 18, baseType: !318, size: 64, offset: 1216)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "dlamdae", scope: !293, file: !292, line: 18, baseType: !318, size: 64, offset: 1280)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "rhs_lamdae", scope: !293, file: !292, line: 18, baseType: !318, size: 64, offset: 1344)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "save_lamdae", scope: !293, file: !292, line: 18, baseType: !318, size: 64, offset: 1408)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !293, file: !292, line: 19, baseType: !318, size: 64, offset: 1472)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !293, file: !292, line: 19, baseType: !318, size: 64, offset: 1536)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "rhs_s", scope: !293, file: !292, line: 19, baseType: !318, size: 64, offset: 1600)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "save_s", scope: !293, file: !292, line: 19, baseType: !318, size: 64, offset: 1664)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ci", scope: !293, file: !292, line: 20, baseType: !318, size: 64, offset: 1728)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "Zero_nb", scope: !293, file: !292, line: 21, baseType: !318, size: 64, offset: 1792)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "One_nb", scope: !293, file: !292, line: 21, baseType: !318, size: 64, offset: 1856)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "Inf_nb", scope: !293, file: !292, line: 21, baseType: !318, size: 64, offset: 1920)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "kkt_f", scope: !293, file: !292, line: 22, baseType: !211, size: 64, offset: 1984)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "rd", scope: !293, file: !292, line: 23, baseType: !318, size: 64, offset: 2048)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "rpe", scope: !293, file: !292, line: 24, baseType: !318, size: 64, offset: 2112)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "rpi", scope: !293, file: !292, line: 25, baseType: !318, size: 64, offset: 2176)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "complementarity", scope: !293, file: !292, line: 26, baseType: !318, size: 64, offset: 2240)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "phi", scope: !293, file: !292, line: 27, baseType: !211, size: 64, offset: 2304)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !293, file: !292, line: 28, baseType: !346, size: 64, offset: 2368)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !69, line: 16, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !69, line: 16, flags: DIFlagFwdDecl)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "Y", scope: !293, file: !292, line: 29, baseType: !346, size: 64, offset: 2432)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "Ai", scope: !293, file: !292, line: 30, baseType: !346, size: 64, offset: 2496)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "K", scope: !293, file: !292, line: 34, baseType: !346, size: 64, offset: 2560)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "bigrhs", scope: !293, file: !292, line: 39, baseType: !318, size: 64, offset: 2624)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "bigstep", scope: !293, file: !292, line: 40, baseType: !318, size: 64, offset: 2688)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "monitorkkt", scope: !293, file: !292, line: 41, baseType: !260, size: 32, offset: 2752)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "alpha1", scope: !293, file: !292, line: 42, baseType: !211, size: 64, offset: 2816)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "alpha2", scope: !293, file: !292, line: 42, baseType: !211, size: 64, offset: 2880)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "pushs", scope: !293, file: !292, line: 43, baseType: !211, size: 64, offset: 2944)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "pushnu", scope: !293, file: !292, line: 43, baseType: !211, size: 64, offset: 3008)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "isxl", scope: !293, file: !292, line: 44, baseType: !360, size: 64, offset: 3072)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !361, line: 11, baseType: !362)
!361 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !361, line: 11, flags: DIFlagFwdDecl)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "isxu", scope: !293, file: !292, line: 44, baseType: !360, size: 64, offset: 3136)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "isil", scope: !293, file: !292, line: 44, baseType: !360, size: 64, offset: 3200)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "isiu", scope: !293, file: !292, line: 44, baseType: !360, size: 64, offset: 3264)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ci_scat", scope: !293, file: !292, line: 45, baseType: !368, size: 64, offset: 3328)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !369, line: 59, baseType: !370)
!369 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !369, line: 15, baseType: !371)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !369, line: 15, flags: DIFlagFwdDecl)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "xl_scat", scope: !293, file: !292, line: 45, baseType: !368, size: 64, offset: 3392)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "xu_scat", scope: !293, file: !292, line: 45, baseType: !368, size: 64, offset: 3456)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "step1", scope: !293, file: !292, line: 46, baseType: !368, size: 64, offset: 3520)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "step2", scope: !293, file: !292, line: 46, baseType: !368, size: 64, offset: 3584)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "step3", scope: !293, file: !292, line: 46, baseType: !368, size: 64, offset: 3648)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "step4", scope: !293, file: !292, line: 46, baseType: !368, size: 64, offset: 3712)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "rhs1", scope: !293, file: !292, line: 47, baseType: !368, size: 64, offset: 3776)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "rhs2", scope: !293, file: !292, line: 47, baseType: !368, size: 64, offset: 3840)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "rhs3", scope: !293, file: !292, line: 47, baseType: !368, size: 64, offset: 3904)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "rhs4", scope: !293, file: !292, line: 47, baseType: !368, size: 64, offset: 3968)
!383 = !{i32 7, !"Dwarf Version", i32 4}
!384 = !{i32 2, !"Debug Info Version", i32 3}
!385 = !{i32 1, !"wchar_size", i32 4}
!386 = !{i32 7, !"PIC Level", i32 2}
!387 = !{i32 7, !"uwtable", i32 1}
!388 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!389 = distinct !DISubprogram(name: "TaoCreate_IPM", scope: !390, file: !390, line: 1088, type: !391, scopeLine: 1089, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !608)
!390 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/tao/constrained/impls/ipm/ipm.c", directory: "/home/users/ndemeye/xSDK")
!391 = !DISubroutineType(types: !392)
!392 = !{!101, !393}
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tao", file: !25, line: 118, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Tao", file: !396, line: 45, size: 14656, elements: !397)
!396 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/taoimpl.h", directory: "/home/users/ndemeye/xSDK")
!397 = !{!398, !400, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !483, !489, !491, !492, !493, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !600, !601, !602, !603, !604, !605, !606, !607}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !395, file: !396, line: 46, baseType: !399, size: 4480)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !88, line: 122, baseType: !87)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !395, file: !396, line: 46, baseType: !401, size: 1536, offset: 4480)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !402, size: 1536, elements: !143)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TaoOps", file: !396, line: 13, size: 1536, elements: !403)
!403 = !{!404, !408, !412, !416, !420, !421, !422, !423, !424, !425, !426, !430, !434, !435, !436, !437, !441, !445, !446, !450, !452, !453, !457, !461}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !402, file: !396, line: 15, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!101, !393, !318, !201, !184}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgradient", scope: !402, file: !396, line: 16, baseType: !409, size: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!101, !393, !318, !201, !318, !184}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "computegradient", scope: !402, file: !396, line: 17, baseType: !413, size: 64, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!101, !393, !318, !318, !184}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "computehessian", scope: !402, file: !396, line: 18, baseType: !417, size: 64, offset: 192)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!101, !393, !318, !346, !346, !184}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidual", scope: !402, file: !396, line: 19, baseType: !413, size: 64, offset: 256)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidualjacobian", scope: !402, file: !396, line: 20, baseType: !417, size: 64, offset: 320)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "computeconstraints", scope: !402, file: !396, line: 21, baseType: !413, size: 64, offset: 384)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "computeinequalityconstraints", scope: !402, file: !396, line: 22, baseType: !413, size: 64, offset: 448)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "computeequalityconstraints", scope: !402, file: !396, line: 23, baseType: !413, size: 64, offset: 512)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobian", scope: !402, file: !396, line: 24, baseType: !417, size: 64, offset: 576)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianstate", scope: !402, file: !396, line: 25, baseType: !427, size: 64, offset: 640)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!101, !393, !318, !346, !346, !346, !184}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobiandesign", scope: !402, file: !396, line: 26, baseType: !431, size: 64, offset: 704)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!101, !393, !318, !346, !184}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianinequality", scope: !402, file: !396, line: 27, baseType: !417, size: 64, offset: 768)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianequality", scope: !402, file: !396, line: 28, baseType: !417, size: 64, offset: 832)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "computebounds", scope: !402, file: !396, line: 29, baseType: !413, size: 64, offset: 896)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !402, file: !396, line: 30, baseType: !438, size: 64, offset: 960)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!101, !393, !147, !184}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "convergencetest", scope: !402, file: !396, line: 31, baseType: !442, size: 64, offset: 1024)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!101, !393, !184}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "convergencedestroy", scope: !402, file: !396, line: 32, baseType: !230, size: 64, offset: 1088)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "computedual", scope: !402, file: !396, line: 35, baseType: !447, size: 64, offset: 1152)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!101, !393, !318, !318}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !402, file: !396, line: 36, baseType: !451, size: 64, offset: 1216)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !402, file: !396, line: 37, baseType: !451, size: 64, offset: 1280)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !402, file: !396, line: 38, baseType: !454, size: 64, offset: 1344)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!101, !393, !111}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !402, file: !396, line: 39, baseType: !458, size: 64, offset: 1408)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!101, !239, !393}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !402, file: !396, line: 40, baseType: !451, size: 64, offset: 1472)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !395, file: !396, line: 47, baseType: !184, size: 64, offset: 6016)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "user_objP", scope: !395, file: !396, line: 48, baseType: !184, size: 64, offset: 6080)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "user_objgradP", scope: !395, file: !396, line: 49, baseType: !184, size: 64, offset: 6144)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "user_gradP", scope: !395, file: !396, line: 50, baseType: !184, size: 64, offset: 6208)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "user_hessP", scope: !395, file: !396, line: 51, baseType: !184, size: 64, offset: 6272)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsresP", scope: !395, file: !396, line: 52, baseType: !184, size: 64, offset: 6336)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsjacP", scope: !395, file: !396, line: 53, baseType: !184, size: 64, offset: 6400)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "user_conP", scope: !395, file: !396, line: 54, baseType: !184, size: 64, offset: 6464)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_equalityP", scope: !395, file: !396, line: 55, baseType: !184, size: 64, offset: 6528)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_inequalityP", scope: !395, file: !396, line: 56, baseType: !184, size: 64, offset: 6592)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "user_jacP", scope: !395, file: !396, line: 57, baseType: !184, size: 64, offset: 6656)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_equalityP", scope: !395, file: !396, line: 58, baseType: !184, size: 64, offset: 6720)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_inequalityP", scope: !395, file: !396, line: 59, baseType: !184, size: 64, offset: 6784)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_stateP", scope: !395, file: !396, line: 60, baseType: !184, size: 64, offset: 6848)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_designP", scope: !395, file: !396, line: 61, baseType: !184, size: 64, offset: 6912)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "user_boundsP", scope: !395, file: !396, line: 62, baseType: !184, size: 64, offset: 6976)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "user_update", scope: !395, file: !396, line: 63, baseType: !184, size: 64, offset: 7040)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !395, file: !396, line: 65, baseType: !480, size: 640, offset: 7104)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 640, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 10)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !395, file: !396, line: 66, baseType: !484, size: 640, offset: 7744)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 640, elements: !481)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!101, !488}
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !395, file: !396, line: 67, baseType: !490, size: 640, offset: 8384)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 640, elements: !481)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !395, file: !396, line: 68, baseType: !147, size: 32, offset: 9024)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !395, file: !396, line: 69, baseType: !184, size: 64, offset: 9088)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !395, file: !396, line: 70, baseType: !494, size: 32, offset: 9152)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoConvergedReason", file: !25, line: 196, baseType: !24)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !395, file: !396, line: 72, baseType: !260, size: 32, offset: 9184)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !395, file: !396, line: 73, baseType: !184, size: 64, offset: 9216)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "solution", scope: !395, file: !396, line: 75, baseType: !318, size: 64, offset: 9280)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !395, file: !396, line: 76, baseType: !318, size: 64, offset: 9344)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "stepdirection", scope: !395, file: !396, line: 77, baseType: !318, size: 64, offset: 9408)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "XL", scope: !395, file: !396, line: 78, baseType: !318, size: 64, offset: 9472)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "XU", scope: !395, file: !396, line: 79, baseType: !318, size: 64, offset: 9536)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "IL", scope: !395, file: !396, line: 80, baseType: !318, size: 64, offset: 9600)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "IU", scope: !395, file: !396, line: 81, baseType: !318, size: 64, offset: 9664)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "DI", scope: !395, file: !396, line: 82, baseType: !318, size: 64, offset: 9728)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "DE", scope: !395, file: !396, line: 83, baseType: !318, size: 64, offset: 9792)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "hessian", scope: !395, file: !396, line: 84, baseType: !346, size: 64, offset: 9856)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "hessian_pre", scope: !395, file: !396, line: 85, baseType: !346, size: 64, offset: 9920)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm", scope: !395, file: !396, line: 86, baseType: !346, size: 64, offset: 9984)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm_tmp", scope: !395, file: !396, line: 87, baseType: !318, size: 64, offset: 10048)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ls_res", scope: !395, file: !396, line: 88, baseType: !318, size: 64, offset: 10112)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac", scope: !395, file: !396, line: 89, baseType: !346, size: 64, offset: 10176)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac_pre", scope: !395, file: !396, line: 90, baseType: !346, size: 64, offset: 10240)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_v", scope: !395, file: !396, line: 91, baseType: !318, size: 64, offset: 10304)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_n", scope: !395, file: !396, line: 92, baseType: !147, size: 32, offset: 10368)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_rows", scope: !395, file: !396, line: 93, baseType: !193, size: 64, offset: 10432)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_cols", scope: !395, file: !396, line: 94, baseType: !193, size: 64, offset: 10496)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_w", scope: !395, file: !396, line: 95, baseType: !201, size: 64, offset: 10560)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !395, file: !396, line: 96, baseType: !318, size: 64, offset: 10624)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_equality", scope: !395, file: !396, line: 97, baseType: !318, size: 64, offset: 10688)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_inequality", scope: !395, file: !396, line: 98, baseType: !318, size: 64, offset: 10752)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !395, file: !396, line: 99, baseType: !346, size: 64, offset: 10816)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !395, file: !396, line: 100, baseType: !346, size: 64, offset: 10880)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality", scope: !395, file: !396, line: 101, baseType: !346, size: 64, offset: 10944)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality_pre", scope: !395, file: !396, line: 102, baseType: !346, size: 64, offset: 11008)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality", scope: !395, file: !396, line: 103, baseType: !346, size: 64, offset: 11072)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality_pre", scope: !395, file: !396, line: 104, baseType: !346, size: 64, offset: 11136)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state", scope: !395, file: !396, line: 105, baseType: !346, size: 64, offset: 11200)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_inv", scope: !395, file: !396, line: 106, baseType: !346, size: 64, offset: 11264)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design", scope: !395, file: !396, line: 107, baseType: !346, size: 64, offset: 11328)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_pre", scope: !395, file: !396, line: 108, baseType: !346, size: 64, offset: 11392)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design_pre", scope: !395, file: !396, line: 109, baseType: !346, size: 64, offset: 11456)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "state_is", scope: !395, file: !396, line: 110, baseType: !360, size: 64, offset: 11520)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "design_is", scope: !395, file: !396, line: 111, baseType: !360, size: 64, offset: 11584)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !395, file: !396, line: 112, baseType: !202, size: 64, offset: 11648)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !395, file: !396, line: 113, baseType: !202, size: 64, offset: 11712)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "gnorm0", scope: !395, file: !396, line: 114, baseType: !202, size: 64, offset: 11776)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm", scope: !395, file: !396, line: 115, baseType: !202, size: 64, offset: 11840)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm0", scope: !395, file: !396, line: 116, baseType: !202, size: 64, offset: 11904)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !395, file: !396, line: 117, baseType: !202, size: 64, offset: 11968)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !395, file: !396, line: 119, baseType: !147, size: 32, offset: 12032)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !395, file: !396, line: 120, baseType: !147, size: 32, offset: 12064)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "max_constraints", scope: !395, file: !396, line: 121, baseType: !147, size: 32, offset: 12096)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !395, file: !396, line: 122, baseType: !147, size: 32, offset: 12128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ngrads", scope: !395, file: !396, line: 123, baseType: !147, size: 32, offset: 12160)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncgrads", scope: !395, file: !396, line: 124, baseType: !147, size: 32, offset: 12192)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "nhess", scope: !395, file: !396, line: 125, baseType: !147, size: 32, offset: 12224)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !395, file: !396, line: 126, baseType: !147, size: 32, offset: 12256)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ntotalits", scope: !395, file: !396, line: 127, baseType: !147, size: 32, offset: 12288)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "nconstraints", scope: !395, file: !396, line: 128, baseType: !147, size: 32, offset: 12320)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "niconstraints", scope: !395, file: !396, line: 129, baseType: !147, size: 32, offset: 12352)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "neconstraints", scope: !395, file: !396, line: 130, baseType: !147, size: 32, offset: 12384)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "njac", scope: !395, file: !396, line: 131, baseType: !147, size: 32, offset: 12416)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "njac_equality", scope: !395, file: !396, line: 132, baseType: !147, size: 32, offset: 12448)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "njac_inequality", scope: !395, file: !396, line: 133, baseType: !147, size: 32, offset: 12480)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "njac_state", scope: !395, file: !396, line: 134, baseType: !147, size: 32, offset: 12512)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "njac_design", scope: !395, file: !396, line: 135, baseType: !147, size: 32, offset: 12544)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_its", scope: !395, file: !396, line: 137, baseType: !147, size: 32, offset: 12576)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_tot_its", scope: !395, file: !396, line: 138, baseType: !147, size: 32, offset: 12608)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !395, file: !396, line: 140, baseType: !313, size: 64, offset: 12672)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "lsflag", scope: !395, file: !396, line: 141, baseType: !260, size: 32, offset: 12736)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !395, file: !396, line: 142, baseType: !562, size: 64, offset: 12800)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !563, line: 22, baseType: !564)
!563 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !563, line: 22, flags: DIFlagFwdDecl)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "trust0", scope: !395, file: !396, line: 143, baseType: !202, size: 64, offset: 12864)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !395, file: !396, line: 144, baseType: !202, size: 64, offset: 12928)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "gatol", scope: !395, file: !396, line: 146, baseType: !202, size: 64, offset: 12992)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "grtol", scope: !395, file: !396, line: 147, baseType: !202, size: 64, offset: 13056)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "gttol", scope: !395, file: !396, line: 148, baseType: !202, size: 64, offset: 13120)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "catol", scope: !395, file: !396, line: 149, baseType: !202, size: 64, offset: 13184)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "crtol", scope: !395, file: !396, line: 150, baseType: !202, size: 64, offset: 13248)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "steptol", scope: !395, file: !396, line: 151, baseType: !202, size: 64, offset: 13312)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "fmin", scope: !395, file: !396, line: 152, baseType: !202, size: 64, offset: 13376)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs_changed", scope: !395, file: !396, line: 153, baseType: !260, size: 32, offset: 13440)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "max_it_changed", scope: !395, file: !396, line: 154, baseType: !260, size: 32, offset: 13472)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "gatol_changed", scope: !395, file: !396, line: 155, baseType: !260, size: 32, offset: 13504)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "grtol_changed", scope: !395, file: !396, line: 156, baseType: !260, size: 32, offset: 13536)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "gttol_changed", scope: !395, file: !396, line: 157, baseType: !260, size: 32, offset: 13568)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "fmin_changed", scope: !395, file: !396, line: 158, baseType: !260, size: 32, offset: 13600)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "catol_changed", scope: !395, file: !396, line: 159, baseType: !260, size: 32, offset: 13632)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "crtol_changed", scope: !395, file: !396, line: 160, baseType: !260, size: 32, offset: 13664)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "steptol_changed", scope: !395, file: !396, line: 161, baseType: !260, size: 32, offset: 13696)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "trust0_changed", scope: !395, file: !396, line: 162, baseType: !260, size: 32, offset: 13728)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "printreason", scope: !395, file: !396, line: 163, baseType: !260, size: 32, offset: 13760)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "viewsolution", scope: !395, file: !396, line: 164, baseType: !260, size: 32, offset: 13792)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "viewgradient", scope: !395, file: !396, line: 165, baseType: !260, size: 32, offset: 13824)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "viewconstraints", scope: !395, file: !396, line: 166, baseType: !260, size: 32, offset: 13856)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "viewhessian", scope: !395, file: !396, line: 167, baseType: !260, size: 32, offset: 13888)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "viewjacobian", scope: !395, file: !396, line: 168, baseType: !260, size: 32, offset: 13920)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "bounded", scope: !395, file: !396, line: 169, baseType: !260, size: 32, offset: 13952)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "constrained", scope: !395, file: !396, line: 170, baseType: !260, size: 32, offset: 13984)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "eq_constrained", scope: !395, file: !396, line: 171, baseType: !260, size: 32, offset: 14016)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_constrained", scope: !395, file: !396, line: 172, baseType: !260, size: 32, offset: 14048)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_doublesided", scope: !395, file: !396, line: 173, baseType: !260, size: 32, offset: 14080)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "header_printed", scope: !395, file: !396, line: 174, baseType: !260, size: 32, offset: 14112)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "recycle", scope: !395, file: !396, line: 175, baseType: !260, size: 32, offset: 14144)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "subset_type", scope: !395, file: !396, line: 177, baseType: !599, size: 32, offset: 14176)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoSubsetType", file: !25, line: 26, baseType: !41)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "hist_max", scope: !395, file: !396, line: 178, baseType: !147, size: 32, offset: 14208)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "hist_obj", scope: !395, file: !396, line: 179, baseType: !201, size: 64, offset: 14272)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "hist_resid", scope: !395, file: !396, line: 180, baseType: !201, size: 64, offset: 14336)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "hist_cnorm", scope: !395, file: !396, line: 181, baseType: !201, size: 64, offset: 14400)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "hist_lits", scope: !395, file: !396, line: 182, baseType: !193, size: 64, offset: 14464)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "hist_len", scope: !395, file: !396, line: 183, baseType: !147, size: 32, offset: 14528)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "hist_reset", scope: !395, file: !396, line: 184, baseType: !260, size: 32, offset: 14560)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "hist_malloc", scope: !395, file: !396, line: 185, baseType: !260, size: 32, offset: 14592)
!608 = !{!609, !610, !611, !612, !614, !616, !618}
!609 = !DILocalVariable(name: "tao", arg: 1, scope: !389, file: !390, line: 1088, type: !393)
!610 = !DILocalVariable(name: "ipmP", scope: !389, file: !390, line: 1090, type: !290)
!611 = !DILocalVariable(name: "ierr", scope: !389, file: !390, line: 1091, type: !101)
!612 = !DILocalVariable(name: "ierr__", scope: !613, file: !390, line: 1101, type: !101)
!613 = distinct !DILexicalBlock(scope: !389, file: !390, line: 1101, column: 33)
!614 = !DILocalVariable(name: "ierr__", scope: !615, file: !390, line: 1113, type: !101)
!615 = distinct !DILexicalBlock(scope: !389, file: !390, line: 1113, column: 57)
!616 = !DILocalVariable(name: "ierr__", scope: !617, file: !390, line: 1114, type: !101)
!617 = distinct !DILexicalBlock(scope: !389, file: !390, line: 1114, column: 83)
!618 = !DILocalVariable(name: "ierr__", scope: !619, file: !390, line: 1115, type: !101)
!619 = distinct !DILexicalBlock(scope: !389, file: !390, line: 1115, column: 57)
!620 = !DILocation(line: 0, scope: !389)
!621 = !DILocation(line: 1090, column: 3, scope: !389)
!622 = !DILocation(line: 1093, column: 3, scope: !623)
!623 = distinct !DILexicalBlock(scope: !624, file: !390, line: 1093, column: 3)
!624 = distinct !DILexicalBlock(scope: !625, file: !390, line: 1093, column: 3)
!625 = distinct !DILexicalBlock(scope: !389, file: !390, line: 1093, column: 3)
!626 = !{!627, !627, i64 0}
!627 = !{!"any pointer", !628, i64 0}
!628 = !{!"omnipotent char", !629, i64 0}
!629 = !{!"Simple C/C++ TBAA"}
!630 = !DILocation(line: 1093, column: 3, scope: !624)
!631 = !DILocation(line: 1093, column: 3, scope: !632)
!632 = distinct !DILexicalBlock(scope: !633, file: !390, line: 1093, column: 3)
!633 = distinct !DILexicalBlock(scope: !623, file: !390, line: 1093, column: 3)
!634 = !{!635, !636, i64 1536}
!635 = !{!"", !628, i64 0, !628, i64 512, !628, i64 1024, !628, i64 1280, !636, i64 1536, !636, i64 1540, !628, i64 1544}
!636 = !{!"int", !628, i64 0}
!637 = !DILocation(line: 1093, column: 3, scope: !633)
!638 = !DILocation(line: 1093, column: 3, scope: !639)
!639 = distinct !DILexicalBlock(scope: !632, file: !390, line: 1093, column: 3)
!640 = !{!636, !636, i64 0}
!641 = !{!635, !636, i64 1540}
!642 = !DILocation(line: 1094, column: 13, scope: !389)
!643 = !DILocation(line: 1094, column: 19, scope: !389)
!644 = !{!645, !627, i64 152}
!645 = !{!"_TaoOps", !627, i64 0, !627, i64 8, !627, i64 16, !627, i64 24, !627, i64 32, !627, i64 40, !627, i64 48, !627, i64 56, !627, i64 64, !627, i64 72, !627, i64 80, !627, i64 88, !627, i64 96, !627, i64 104, !627, i64 112, !627, i64 120, !627, i64 128, !627, i64 136, !627, i64 144, !627, i64 152, !627, i64 160, !627, i64 168, !627, i64 176, !627, i64 184}
!646 = !DILocation(line: 1095, column: 13, scope: !389)
!647 = !DILocation(line: 1095, column: 19, scope: !389)
!648 = !{!645, !627, i64 160}
!649 = !DILocation(line: 1096, column: 13, scope: !389)
!650 = !DILocation(line: 1096, column: 18, scope: !389)
!651 = !{!645, !627, i64 168}
!652 = !DILocation(line: 1097, column: 13, scope: !389)
!653 = !DILocation(line: 1097, column: 28, scope: !389)
!654 = !{!645, !627, i64 176}
!655 = !DILocation(line: 1098, column: 13, scope: !389)
!656 = !DILocation(line: 1098, column: 21, scope: !389)
!657 = !{!645, !627, i64 184}
!658 = !DILocation(line: 1101, column: 10, scope: !389)
!659 = !{!"branch_weights", i32 2146410443, i32 1073205}
!660 = !DILocation(line: 0, scope: !613)
!661 = !DILocation(line: 1101, column: 33, scope: !613)
!662 = !{!"branch_weights", i32 2000, i32 1}
!663 = !DILocation(line: 1101, column: 33, scope: !664)
!664 = distinct !DILexicalBlock(scope: !613, file: !390, line: 1101, column: 33)
!665 = !DILocation(line: 1102, column: 22, scope: !389)
!666 = !DILocation(line: 1102, column: 8, scope: !389)
!667 = !DILocation(line: 1102, column: 13, scope: !389)
