; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/color/impls/greedy/greedy.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/color/impls/greedy/greedy.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!252 = !DIEnumerator(name: "MATOP_RART", value: 136, isUnsigned: true)
!253 = !DIEnumerator(name: "MATOP_RART_SYMBOLIC", value: 137, isUnsigned: true)
!254 = !DIEnumerator(name: "MATOP_RART_NUMERIC", value: 138, isUnsigned: true)
!255 = !DIEnumerator(name: "MATOP_SET_BLOCK_SIZES", value: 139, isUnsigned: true)
!256 = !DIEnumerator(name: "MATOP_AYPX", value: 140, isUnsigned: true)
!257 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!258 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!259 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!260 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!261 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!262 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 161, baseType: !5, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272}
!265 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1345, baseType: !5, size: 32, elements: !295)
!295 = !{!296, !297, !298, !299}
!296 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_RANDOM", value: 0, isUnsigned: true)
!297 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_LEXICAL", value: 1, isUnsigned: true)
!298 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_LF", value: 2, isUnsigned: true)
!299 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_SL", value: 3, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !301, line: 663, baseType: !5, size: 32, elements: !302)
!301 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!302 = !{!303, !304, !305}
!303 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!304 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!305 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!306 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !307)
!307 = !{!308, !309, !310}
!308 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!309 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!310 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!311 = !{!312, !315, !333, !414, !354, !394, !520, !523, !404, !72, !526, !1338, !817, !1438, !5}
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !313, line: 46, baseType: !314)
!313 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!314 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !318, line: 73, size: 4480, elements: !319)
!318 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!319 = !{!320, !322, !375, !376, !378, !381, !382, !383, !384, !392, !393, !395, !399, !403, !405, !406, !407, !408, !409, !410, !411, !412, !413, !415, !417, !418, !419, !421, !422, !424, !426, !427, !428, !429, !430, !433, !435, !436, !437, !438, !439, !442, !444, !445, !446, !456, !458, !459, !463, !464, !510, !515, !517, !518, !519}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !317, file: !318, line: 74, baseType: !321, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !317, file: !318, line: 75, baseType: !323, size: 448, offset: 64)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 448, elements: !373)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !318, line: 53, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !318, line: 45, size: 448, elements: !326)
!326 = !{!327, !337, !345, !350, !357, !361, !368}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !325, file: !318, line: 46, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!331, !315, !332}
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !334, line: 330, baseType: !335)
!334 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !334, line: 330, flags: DIFlagFwdDecl)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !325, file: !318, line: 47, baseType: !338, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!331, !315, !341}
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !342, line: 16, baseType: !343)
!342 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !342, line: 16, flags: DIFlagFwdDecl)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !325, file: !318, line: 48, baseType: !346, size: 64, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!331, !349}
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !325, file: !318, line: 49, baseType: !351, size: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!331, !315, !354, !315}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !356)
!356 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !325, file: !318, line: 50, baseType: !358, size: 64, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!331, !315, !354, !349}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !325, file: !318, line: 51, baseType: !362, size: 64, offset: 320)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!331, !315, !354, !365}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{null}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !325, file: !318, line: 52, baseType: !369, size: 64, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!331, !315, !354, !372}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!373 = !{!374}
!374 = !DISubrange(count: 1)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !317, file: !318, line: 76, baseType: !333, size: 64, offset: 512)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !317, file: !318, line: 77, baseType: !377, size: 32, offset: 576)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !317, file: !318, line: 78, baseType: !379, size: 64, offset: 640)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !380)
!380 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !317, file: !318, line: 78, baseType: !379, size: 64, offset: 704)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !317, file: !318, line: 78, baseType: !379, size: 64, offset: 768)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !317, file: !318, line: 78, baseType: !379, size: 64, offset: 832)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !317, file: !318, line: 79, baseType: !385, size: 64, offset: 896)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !388, line: 27, baseType: !389)
!388 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !390, line: 43, baseType: !391)
!390 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!391 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !317, file: !318, line: 80, baseType: !377, size: 32, offset: 960)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !317, file: !318, line: 81, baseType: !394, size: 32, offset: 992)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !317, file: !318, line: 82, baseType: !396, size: 64, offset: 1024)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !317, file: !318, line: 83, baseType: !400, size: 64, offset: 1088)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !401)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !317, file: !318, line: 84, baseType: !404, size: 64, offset: 1152)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !317, file: !318, line: 85, baseType: !404, size: 64, offset: 1216)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !317, file: !318, line: 86, baseType: !404, size: 64, offset: 1280)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !317, file: !318, line: 87, baseType: !404, size: 64, offset: 1344)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !317, file: !318, line: 88, baseType: !315, size: 64, offset: 1408)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !317, file: !318, line: 89, baseType: !385, size: 64, offset: 1472)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !317, file: !318, line: 90, baseType: !404, size: 64, offset: 1536)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !317, file: !318, line: 91, baseType: !404, size: 64, offset: 1600)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !317, file: !318, line: 92, baseType: !377, size: 32, offset: 1664)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !317, file: !318, line: 93, baseType: !414, size: 64, offset: 1728)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !317, file: !318, line: 94, baseType: !416, size: 64, offset: 1792)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !386)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !317, file: !318, line: 95, baseType: !377, size: 32, offset: 1856)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !317, file: !318, line: 95, baseType: !377, size: 32, offset: 1888)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !317, file: !318, line: 96, baseType: !420, size: 64, offset: 1920)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !317, file: !318, line: 96, baseType: !420, size: 64, offset: 1984)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !317, file: !318, line: 97, baseType: !423, size: 64, offset: 2048)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !317, file: !318, line: 97, baseType: !425, size: 64, offset: 2112)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !317, file: !318, line: 98, baseType: !377, size: 32, offset: 2176)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !317, file: !318, line: 98, baseType: !377, size: 32, offset: 2208)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !317, file: !318, line: 99, baseType: !420, size: 64, offset: 2240)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !317, file: !318, line: 99, baseType: !420, size: 64, offset: 2304)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !317, file: !318, line: 100, baseType: !431, size: 64, offset: 2368)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !380)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !317, file: !318, line: 100, baseType: !434, size: 64, offset: 2432)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !317, file: !318, line: 101, baseType: !377, size: 32, offset: 2496)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !317, file: !318, line: 101, baseType: !377, size: 32, offset: 2528)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !317, file: !318, line: 102, baseType: !420, size: 64, offset: 2560)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !317, file: !318, line: 102, baseType: !420, size: 64, offset: 2624)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !317, file: !318, line: 103, baseType: !440, size: 64, offset: 2688)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !432)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !317, file: !318, line: 103, baseType: !443, size: 64, offset: 2752)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !317, file: !318, line: 104, baseType: !372, size: 64, offset: 2816)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !317, file: !318, line: 105, baseType: !377, size: 32, offset: 2880)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !317, file: !318, line: 106, baseType: !447, size: 128, offset: 2944)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 128, elements: !454)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !318, line: 64, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !318, line: 61, size: 128, elements: !451)
!451 = !{!452, !453}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !450, file: !318, line: 62, baseType: !365, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !450, file: !318, line: 63, baseType: !414, size: 64, offset: 64)
!454 = !{!455}
!455 = !DISubrange(count: 2)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !317, file: !318, line: 107, baseType: !457, size: 64, offset: 3072)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 64, elements: !454)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !317, file: !318, line: 108, baseType: !414, size: 64, offset: 3136)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !317, file: !318, line: 109, baseType: !460, size: 64, offset: 3200)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!331, !414}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !317, file: !318, line: 111, baseType: !377, size: 32, offset: 3264)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !317, file: !318, line: 112, baseType: !465, size: 320, offset: 3328)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 320, elements: !508)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!331, !469, !315, !414}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !472)
!472 = !{!473, !474, !496, !497, !498, !499, !500, !501, !502, !503, !504}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !471, file: !10, line: 100, baseType: !377, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !471, file: !10, line: 101, baseType: !475, size: 64, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !476)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !478)
!478 = !{!479, !480, !481, !482, !483, !486, !487, !488, !489, !491, !493, !494, !495}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !477, file: !10, line: 84, baseType: !404, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !477, file: !10, line: 85, baseType: !404, size: 64, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !477, file: !10, line: 86, baseType: !414, size: 64, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !477, file: !10, line: 87, baseType: !396, size: 64, offset: 192)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !477, file: !10, line: 88, baseType: !484, size: 64, offset: 256)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !354)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !477, file: !10, line: 89, baseType: !356, size: 8, offset: 320)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !477, file: !10, line: 90, baseType: !404, size: 64, offset: 384)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !477, file: !10, line: 91, baseType: !312, size: 64, offset: 448)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !477, file: !10, line: 92, baseType: !490, size: 32, offset: 512)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !477, file: !10, line: 93, baseType: !492, size: 32, offset: 544)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !477, file: !10, line: 94, baseType: !475, size: 64, offset: 576)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !477, file: !10, line: 95, baseType: !404, size: 64, offset: 640)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !477, file: !10, line: 96, baseType: !414, size: 64, offset: 704)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !471, file: !10, line: 102, baseType: !404, size: 64, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !471, file: !10, line: 102, baseType: !404, size: 64, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !471, file: !10, line: 103, baseType: !404, size: 64, offset: 256)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !471, file: !10, line: 104, baseType: !333, size: 64, offset: 320)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !471, file: !10, line: 105, baseType: !490, size: 32, offset: 384)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !471, file: !10, line: 105, baseType: !490, size: 32, offset: 416)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !471, file: !10, line: 105, baseType: !490, size: 32, offset: 448)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !471, file: !10, line: 106, baseType: !315, size: 64, offset: 512)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !471, file: !10, line: 107, baseType: !505, size: 64, offset: 576)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!508 = !{!509}
!509 = !DISubrange(count: 5)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !317, file: !318, line: 113, baseType: !511, size: 320, offset: 3648)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 320, elements: !508)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!331, !315, !414}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !317, file: !318, line: 114, baseType: !516, size: 320, offset: 3968)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 320, elements: !508)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !317, file: !318, line: 115, baseType: !490, size: 32, offset: 4288)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !317, file: !318, line: 120, baseType: !505, size: 64, offset: 4352)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !317, file: !318, line: 121, baseType: !490, size: 32, offset: 4416)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !334, line: 331, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !334, line: 331, flags: DIFlagFwdDecl)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !334, line: 338, baseType: !524)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !334, line: 338, flags: DIFlagFwdDecl)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_MPIAIJ", file: !528, line: 70, baseType: !529)
!528 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/aij/mpi/mpiaij.h", directory: "/home/users/ndemeye/xSDK")
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !528, line: 34, size: 1344, elements: !530)
!530 = !{!531, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1323, !1324, !1325, !1326, !1332, !1333, !1334, !1335, !1336, !1337}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !529, file: !528, line: 35, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !533)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !535, line: 436, size: 23424, elements: !536)
!535 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!536 = !{!537, !539, !1046, !1066, !1067, !1068, !1070, !1071, !1072, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1196, !1197, !1213, !1214, !1215, !1216, !1217, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1252, !1272, !1273, !1275, !1276, !1277, !1278, !1279, !1280, !1298, !1299}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !534, file: !535, line: 437, baseType: !538, size: 4480)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !318, line: 122, baseType: !317)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !534, file: !535, line: 437, baseType: !540, size: 9472, offset: 4480)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !541, size: 9472, elements: !373)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !535, line: 32, size: 9472, elements: !542)
!542 = !{!543, !552, !556, !557, !564, !568, !569, !570, !571, !572, !573, !574, !598, !602, !607, !613, !632, !637, !641, !642, !647, !652, !653, !658, !662, !666, !670, !674, !678, !679, !680, !681, !682, !686, !687, !692, !693, !694, !695, !696, !701, !708, !713, !717, !721, !725, !729, !730, !734, !735, !742, !747, !748, !749, !750, !812, !820, !821, !825, !826, !830, !831, !835, !840, !841, !845, !849, !856, !857, !858, !859, !860, !861, !866, !867, !871, !875, !879, !880, !881, !885, !895, !896, !900, !901, !905, !906, !910, !911, !916, !917, !921, !925, !926, !927, !928, !929, !930, !931, !935, !936, !937, !938, !939, !940, !944, !945, !946, !947, !948, !949, !950, !951, !955, !959, !960, !961, !965, !966, !967, !968, !969, !970, !971, !975, !976, !977, !982, !986, !987, !991, !992, !993, !994, !1020, !1024, !1025, !1026, !1027, !1028, !1032, !1033, !1034, !1035, !1036, !1040, !1044, !1045}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !541, file: !535, line: 34, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{!331, !532, !377, !547, !377, !547, !549, !551}
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !377)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !441)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !541, file: !535, line: 35, baseType: !553, size: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{!331, !532, !377, !423, !425, !443}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !541, file: !535, line: 36, baseType: !553, size: 64, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !541, file: !535, line: 37, baseType: !558, size: 64, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{!331, !532, !561, !561}
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !562)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !541, file: !535, line: 38, baseType: !565, size: 64, offset: 256)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{!331, !532, !561, !561, !561}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !541, file: !535, line: 40, baseType: !558, size: 64, offset: 320)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !541, file: !535, line: 41, baseType: !565, size: 64, offset: 384)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !541, file: !535, line: 42, baseType: !558, size: 64, offset: 448)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !541, file: !535, line: 43, baseType: !565, size: 64, offset: 512)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !541, file: !535, line: 44, baseType: !558, size: 64, offset: 576)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !541, file: !535, line: 46, baseType: !565, size: 64, offset: 640)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !541, file: !535, line: 47, baseType: !575, size: 64, offset: 704)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{!331, !532, !578, !578, !582}
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !579, line: 11, baseType: !580)
!579 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !579, line: 11, flags: DIFlagFwdDecl)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !584)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !585)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !586)
!586 = !{!587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !585, file: !36, line: 1227, baseType: !432, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !585, file: !36, line: 1228, baseType: !432, size: 64, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !585, file: !36, line: 1229, baseType: !432, size: 64, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !585, file: !36, line: 1230, baseType: !432, size: 64, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !585, file: !36, line: 1231, baseType: !432, size: 64, offset: 256)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !585, file: !36, line: 1232, baseType: !432, size: 64, offset: 320)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !585, file: !36, line: 1233, baseType: !432, size: 64, offset: 384)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !585, file: !36, line: 1234, baseType: !432, size: 64, offset: 448)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !585, file: !36, line: 1236, baseType: !432, size: 64, offset: 512)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !585, file: !36, line: 1237, baseType: !432, size: 64, offset: 576)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !585, file: !36, line: 1238, baseType: !432, size: 64, offset: 640)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !541, file: !535, line: 48, baseType: !599, size: 64, offset: 768)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!331, !532, !578, !582}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !541, file: !535, line: 49, baseType: !603, size: 64, offset: 832)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!331, !532, !561, !432, !606, !432, !377, !377, !561}
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !541, file: !535, line: 50, baseType: !608, size: 64, offset: 896)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!331, !532, !611, !612}
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !541, file: !535, line: 52, baseType: !614, size: 64, offset: 960)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!331, !532, !617, !618}
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !620)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !621)
!621 = !{!622, !623, !624, !625, !626, !627, !628, !629, !630, !631}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !620, file: !36, line: 593, baseType: !379, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !620, file: !36, line: 594, baseType: !379, size: 64, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !620, file: !36, line: 594, baseType: !379, size: 64, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !620, file: !36, line: 594, baseType: !379, size: 64, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !620, file: !36, line: 595, baseType: !379, size: 64, offset: 256)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !620, file: !36, line: 596, baseType: !379, size: 64, offset: 320)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !620, file: !36, line: 597, baseType: !379, size: 64, offset: 384)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !620, file: !36, line: 598, baseType: !379, size: 64, offset: 448)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !620, file: !36, line: 598, baseType: !379, size: 64, offset: 512)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !620, file: !36, line: 599, baseType: !379, size: 64, offset: 576)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !541, file: !535, line: 53, baseType: !633, size: 64, offset: 1024)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{!331, !532, !532, !636}
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !541, file: !535, line: 54, baseType: !638, size: 64, offset: 1088)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!331, !532, !561}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !541, file: !535, line: 55, baseType: !558, size: 64, offset: 1152)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !541, file: !535, line: 56, baseType: !643, size: 64, offset: 1216)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!331, !532, !646, !431}
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !541, file: !535, line: 58, baseType: !648, size: 64, offset: 1280)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!331, !532, !651}
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !541, file: !535, line: 59, baseType: !648, size: 64, offset: 1344)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !541, file: !535, line: 60, baseType: !654, size: 64, offset: 1408)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!331, !532, !657, !490}
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !541, file: !535, line: 61, baseType: !659, size: 64, offset: 1472)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!331, !532}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !541, file: !535, line: 63, baseType: !663, size: 64, offset: 1536)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!331, !532, !377, !547, !441, !561, !561}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !541, file: !535, line: 64, baseType: !667, size: 64, offset: 1600)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!331, !532, !532, !578, !578, !582}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !541, file: !535, line: 65, baseType: !671, size: 64, offset: 1664)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!331, !532, !532, !582}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !541, file: !535, line: 66, baseType: !675, size: 64, offset: 1728)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!331, !532, !532, !578, !582}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !541, file: !535, line: 67, baseType: !671, size: 64, offset: 1792)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !541, file: !535, line: 69, baseType: !659, size: 64, offset: 1856)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !541, file: !535, line: 70, baseType: !667, size: 64, offset: 1920)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !541, file: !535, line: 71, baseType: !675, size: 64, offset: 1984)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !541, file: !535, line: 72, baseType: !683, size: 64, offset: 2048)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{!331, !532, !612}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !541, file: !535, line: 73, baseType: !659, size: 64, offset: 2112)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !541, file: !535, line: 75, baseType: !688, size: 64, offset: 2176)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!331, !532, !691, !612}
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !541, file: !535, line: 76, baseType: !558, size: 64, offset: 2240)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !541, file: !535, line: 77, baseType: !558, size: 64, offset: 2304)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !541, file: !535, line: 78, baseType: !575, size: 64, offset: 2368)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !541, file: !535, line: 79, baseType: !599, size: 64, offset: 2432)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !541, file: !535, line: 81, baseType: !697, size: 64, offset: 2496)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{!331, !532, !441, !532, !700}
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !541, file: !535, line: 82, baseType: !702, size: 64, offset: 2560)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!331, !532, !377, !705, !705, !611, !707}
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !578)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !541, file: !535, line: 83, baseType: !709, size: 64, offset: 2624)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!331, !532, !377, !712, !377}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !541, file: !535, line: 84, baseType: !714, size: 64, offset: 2688)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!331, !532, !377, !547, !377, !547, !440}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !541, file: !535, line: 85, baseType: !718, size: 64, offset: 2752)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!331, !532, !532, !700}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !541, file: !535, line: 87, baseType: !722, size: 64, offset: 2816)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!331, !532, !561, !423}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !541, file: !535, line: 88, baseType: !726, size: 64, offset: 2880)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!331, !532, !441}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !541, file: !535, line: 89, baseType: !726, size: 64, offset: 2944)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !541, file: !535, line: 90, baseType: !731, size: 64, offset: 3008)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!331, !532, !561, !551}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !541, file: !535, line: 91, baseType: !663, size: 64, offset: 3072)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !541, file: !535, line: 93, baseType: !736, size: 64, offset: 3136)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!331, !532, !739}
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !740)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !541, file: !535, line: 94, baseType: !743, size: 64, offset: 3200)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!331, !532, !377, !490, !490, !423, !746, !746, !636}
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !541, file: !535, line: 95, baseType: !743, size: 64, offset: 3264)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !541, file: !535, line: 96, baseType: !743, size: 64, offset: 3328)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !541, file: !535, line: 97, baseType: !743, size: 64, offset: 3392)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !541, file: !535, line: 99, baseType: !751, size: 64, offset: 3456)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!331, !532, !754, !757}
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !579, line: 51, baseType: !755)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !579, line: 51, flags: DIFlagFwdDecl)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !758)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !535, line: 609, size: 6208, elements: !760)
!760 = !{!761, !762, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !781, !788, !789, !790, !791, !792, !793, !794, !795, !799, !800, !801, !802, !803, !805, !806, !807, !808, !809, !810, !811}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !759, file: !535, line: 610, baseType: !538, size: 4480)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !759, file: !535, line: 610, baseType: !763, size: 32, offset: 4480)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !373)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !759, file: !535, line: 611, baseType: !377, size: 32, offset: 4512)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !759, file: !535, line: 611, baseType: !377, size: 32, offset: 4544)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !759, file: !535, line: 611, baseType: !377, size: 32, offset: 4576)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !759, file: !535, line: 612, baseType: !377, size: 32, offset: 4608)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !759, file: !535, line: 613, baseType: !377, size: 32, offset: 4640)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !759, file: !535, line: 614, baseType: !423, size: 64, offset: 4672)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !759, file: !535, line: 615, baseType: !425, size: 64, offset: 4736)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !759, file: !535, line: 616, baseType: !712, size: 64, offset: 4800)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !759, file: !535, line: 617, baseType: !423, size: 64, offset: 4864)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !759, file: !535, line: 618, baseType: !774, size: 64, offset: 4928)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !535, line: 602, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !535, line: 598, size: 128, elements: !777)
!777 = !{!778, !779, !780}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !776, file: !535, line: 599, baseType: !377, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !776, file: !535, line: 600, baseType: !377, size: 32, offset: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !776, file: !535, line: 601, baseType: !440, size: 64, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !759, file: !535, line: 619, baseType: !782, size: 64, offset: 4992)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !535, line: 607, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !535, line: 604, size: 128, elements: !785)
!785 = !{!786, !787}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !784, file: !535, line: 605, baseType: !377, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !784, file: !535, line: 606, baseType: !440, size: 64, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !759, file: !535, line: 620, baseType: !440, size: 64, offset: 5056)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !759, file: !535, line: 621, baseType: !432, size: 64, offset: 5120)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !759, file: !535, line: 622, baseType: !432, size: 64, offset: 5184)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !759, file: !535, line: 623, baseType: !561, size: 64, offset: 5248)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !759, file: !535, line: 623, baseType: !561, size: 64, offset: 5312)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !759, file: !535, line: 623, baseType: !561, size: 64, offset: 5376)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !759, file: !535, line: 624, baseType: !490, size: 32, offset: 5440)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !759, file: !535, line: 625, baseType: !796, size: 64, offset: 5504)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{!331}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !759, file: !535, line: 626, baseType: !414, size: 64, offset: 5568)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !759, file: !535, line: 627, baseType: !561, size: 64, offset: 5632)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !759, file: !535, line: 628, baseType: !377, size: 32, offset: 5696)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !759, file: !535, line: 629, baseType: !354, size: 64, offset: 5760)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !759, file: !535, line: 630, baseType: !804, size: 32, offset: 5824)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !759, file: !535, line: 631, baseType: !377, size: 32, offset: 5856)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !759, file: !535, line: 631, baseType: !377, size: 32, offset: 5888)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !759, file: !535, line: 632, baseType: !490, size: 32, offset: 5920)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !759, file: !535, line: 633, baseType: !490, size: 32, offset: 5952)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !759, file: !535, line: 634, baseType: !365, size: 64, offset: 6016)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !759, file: !535, line: 634, baseType: !414, size: 64, offset: 6080)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !759, file: !535, line: 635, baseType: !385, size: 64, offset: 6144)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !541, file: !535, line: 100, baseType: !813, size: 64, offset: 3520)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{!331, !532, !377, !377, !816, !819}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !818)
!818 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !541, file: !535, line: 101, baseType: !659, size: 64, offset: 3584)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !541, file: !535, line: 102, baseType: !822, size: 64, offset: 3648)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!331, !532, !578, !578, !612}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !541, file: !535, line: 103, baseType: !544, size: 64, offset: 3712)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !541, file: !535, line: 105, baseType: !827, size: 64, offset: 3776)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{!331, !532, !578, !578, !611, !612}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !541, file: !535, line: 106, baseType: !659, size: 64, offset: 3840)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !541, file: !535, line: 107, baseType: !832, size: 64, offset: 3904)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DISubroutineType(types: !834)
!834 = !{!331, !532, !341}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !541, file: !535, line: 108, baseType: !836, size: 64, offset: 3968)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{!331, !532, !839, !611, !612}
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !354)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !541, file: !535, line: 109, baseType: !796, size: 64, offset: 4032)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !541, file: !535, line: 111, baseType: !842, size: 64, offset: 4096)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!331, !532, !532, !532, !432, !532}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !541, file: !535, line: 112, baseType: !846, size: 64, offset: 4160)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!331, !532, !532, !532, !532}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !541, file: !535, line: 113, baseType: !850, size: 64, offset: 4224)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!331, !532, !853, !853}
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !579, line: 30, baseType: !854)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !579, line: 30, flags: DIFlagFwdDecl)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !541, file: !535, line: 114, baseType: !544, size: 64, offset: 4288)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !541, file: !535, line: 115, baseType: !663, size: 64, offset: 4352)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !541, file: !535, line: 117, baseType: !722, size: 64, offset: 4416)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !541, file: !535, line: 118, baseType: !722, size: 64, offset: 4480)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !541, file: !535, line: 119, baseType: !836, size: 64, offset: 4544)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !541, file: !535, line: 120, baseType: !862, size: 64, offset: 4608)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DISubroutineType(types: !864)
!864 = !{!331, !532, !865, !636}
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !541, file: !535, line: 121, baseType: !796, size: 64, offset: 4672)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !541, file: !535, line: 123, baseType: !868, size: 64, offset: 4736)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!331, !532, !377, !414}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !541, file: !535, line: 124, baseType: !872, size: 64, offset: 4800)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!331, !532, !757, !561, !414}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !541, file: !535, line: 125, baseType: !876, size: 64, offset: 4864)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{!331, !469, !532}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !541, file: !535, line: 126, baseType: !558, size: 64, offset: 4928)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !541, file: !535, line: 127, baseType: !558, size: 64, offset: 4992)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !541, file: !535, line: 129, baseType: !882, size: 64, offset: 5056)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DISubroutineType(types: !884)
!884 = !{!331, !532, !712}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !541, file: !535, line: 130, baseType: !886, size: 64, offset: 5120)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DISubroutineType(types: !888)
!888 = !{!331, !532, !889, !889}
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !890)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !892)
!892 = !{!893, !894}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !891, file: !60, line: 653, baseType: !377, size: 32)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !891, file: !60, line: 653, baseType: !561, size: 64, offset: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !541, file: !535, line: 131, baseType: !886, size: 64, offset: 5184)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !541, file: !535, line: 132, baseType: !897, size: 64, offset: 5248)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DISubroutineType(types: !899)
!899 = !{!331, !532, !423, !423, !423}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !541, file: !535, line: 133, baseType: !832, size: 64, offset: 5312)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !541, file: !535, line: 135, baseType: !902, size: 64, offset: 5376)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{!331, !532, !432, !636}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !541, file: !535, line: 136, baseType: !902, size: 64, offset: 5440)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !541, file: !535, line: 137, baseType: !907, size: 64, offset: 5504)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!331, !532, !636}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !541, file: !535, line: 138, baseType: !544, size: 64, offset: 5568)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !541, file: !535, line: 139, baseType: !912, size: 64, offset: 5632)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{!331, !532, !915, !915}
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !541, file: !535, line: 141, baseType: !796, size: 64, offset: 5696)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !541, file: !535, line: 142, baseType: !918, size: 64, offset: 5760)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{!331, !532, !532, !432, !532}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !541, file: !535, line: 143, baseType: !922, size: 64, offset: 5824)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!331, !532, !532, !532}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !541, file: !535, line: 144, baseType: !796, size: 64, offset: 5888)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !541, file: !535, line: 145, baseType: !918, size: 64, offset: 5952)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !541, file: !535, line: 147, baseType: !922, size: 64, offset: 6016)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !541, file: !535, line: 148, baseType: !796, size: 64, offset: 6080)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !541, file: !535, line: 149, baseType: !918, size: 64, offset: 6144)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !541, file: !535, line: 150, baseType: !922, size: 64, offset: 6208)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !541, file: !535, line: 151, baseType: !932, size: 64, offset: 6272)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!331, !532, !490}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !541, file: !535, line: 153, baseType: !659, size: 64, offset: 6336)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !541, file: !535, line: 154, baseType: !659, size: 64, offset: 6400)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !541, file: !535, line: 155, baseType: !659, size: 64, offset: 6464)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !541, file: !535, line: 156, baseType: !659, size: 64, offset: 6528)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !541, file: !535, line: 157, baseType: !832, size: 64, offset: 6592)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !541, file: !535, line: 159, baseType: !941, size: 64, offset: 6656)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{!331, !532, !377, !549}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !541, file: !535, line: 160, baseType: !659, size: 64, offset: 6720)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !541, file: !535, line: 161, baseType: !659, size: 64, offset: 6784)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !541, file: !535, line: 162, baseType: !659, size: 64, offset: 6848)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !541, file: !535, line: 163, baseType: !659, size: 64, offset: 6912)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !541, file: !535, line: 165, baseType: !922, size: 64, offset: 6976)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !541, file: !535, line: 166, baseType: !922, size: 64, offset: 7040)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !541, file: !535, line: 167, baseType: !722, size: 64, offset: 7104)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !541, file: !535, line: 168, baseType: !952, size: 64, offset: 7168)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DISubroutineType(types: !954)
!954 = !{!331, !532, !561, !377}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !541, file: !535, line: 169, baseType: !956, size: 64, offset: 7232)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DISubroutineType(types: !958)
!958 = !{!331, !532, !636, !423}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !541, file: !535, line: 171, baseType: !683, size: 64, offset: 7296)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !541, file: !535, line: 172, baseType: !659, size: 64, offset: 7360)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !541, file: !535, line: 173, baseType: !962, size: 64, offset: 7424)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!331, !532, !423, !746}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !541, file: !535, line: 174, baseType: !822, size: 64, offset: 7488)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !541, file: !535, line: 175, baseType: !822, size: 64, offset: 7552)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !541, file: !535, line: 177, baseType: !558, size: 64, offset: 7616)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !541, file: !535, line: 178, baseType: !608, size: 64, offset: 7680)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !541, file: !535, line: 179, baseType: !558, size: 64, offset: 7744)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !541, file: !535, line: 180, baseType: !565, size: 64, offset: 7808)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !541, file: !535, line: 181, baseType: !972, size: 64, offset: 7872)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!331, !532, !333, !611, !612}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !541, file: !535, line: 183, baseType: !882, size: 64, offset: 7936)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !541, file: !535, line: 184, baseType: !643, size: 64, offset: 8000)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !541, file: !535, line: 185, baseType: !978, size: 64, offset: 8064)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!331, !532, !981}
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !541, file: !535, line: 186, baseType: !983, size: 64, offset: 8128)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!331, !532, !377, !547, !440}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !541, file: !535, line: 187, baseType: !702, size: 64, offset: 8192)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !541, file: !535, line: 189, baseType: !988, size: 64, offset: 8256)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!331, !532, !377, !377, !423, !549}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !541, file: !535, line: 190, baseType: !796, size: 64, offset: 8320)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !541, file: !535, line: 191, baseType: !918, size: 64, offset: 8384)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !541, file: !535, line: 192, baseType: !922, size: 64, offset: 8448)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !541, file: !535, line: 193, baseType: !995, size: 64, offset: 8512)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!331, !532, !754, !998}
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !999)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !535, line: 660, size: 5312, elements: !1001)
!1001 = !{!1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1000, file: !535, line: 661, baseType: !538, size: 4480)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1000, file: !535, line: 661, baseType: !763, size: 32, offset: 4480)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1000, file: !535, line: 662, baseType: !377, size: 32, offset: 4512)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1000, file: !535, line: 662, baseType: !377, size: 32, offset: 4544)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1000, file: !535, line: 662, baseType: !377, size: 32, offset: 4576)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1000, file: !535, line: 663, baseType: !377, size: 32, offset: 4608)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1000, file: !535, line: 664, baseType: !377, size: 32, offset: 4640)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1000, file: !535, line: 665, baseType: !423, size: 64, offset: 4672)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1000, file: !535, line: 666, baseType: !423, size: 64, offset: 4736)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1000, file: !535, line: 667, baseType: !377, size: 32, offset: 4800)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1000, file: !535, line: 668, baseType: !804, size: 32, offset: 4832)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1000, file: !535, line: 670, baseType: !423, size: 64, offset: 4864)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1000, file: !535, line: 670, baseType: !423, size: 64, offset: 4928)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1000, file: !535, line: 671, baseType: !423, size: 64, offset: 4992)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1000, file: !535, line: 672, baseType: !423, size: 64, offset: 5056)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1000, file: !535, line: 673, baseType: !423, size: 64, offset: 5120)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1000, file: !535, line: 674, baseType: !377, size: 32, offset: 5184)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1000, file: !535, line: 675, baseType: !423, size: 64, offset: 5248)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !541, file: !535, line: 195, baseType: !1021, size: 64, offset: 8576)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!331, !998, !532, !532}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !541, file: !535, line: 196, baseType: !1021, size: 64, offset: 8640)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !541, file: !535, line: 197, baseType: !796, size: 64, offset: 8704)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !541, file: !535, line: 198, baseType: !918, size: 64, offset: 8768)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !541, file: !535, line: 199, baseType: !922, size: 64, offset: 8832)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !541, file: !535, line: 201, baseType: !1029, size: 64, offset: 8896)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!331, !532, !377, !377}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !541, file: !535, line: 202, baseType: !697, size: 64, offset: 8960)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !541, file: !535, line: 203, baseType: !565, size: 64, offset: 9024)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !541, file: !535, line: 204, baseType: !751, size: 64, offset: 9088)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !541, file: !535, line: 205, baseType: !882, size: 64, offset: 9152)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !541, file: !535, line: 206, baseType: !1037, size: 64, offset: 9216)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!331, !333, !532, !377, !611, !612}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !541, file: !535, line: 208, baseType: !1041, size: 64, offset: 9280)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!331, !377, !707}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !541, file: !535, line: 209, baseType: !922, size: 64, offset: 9344)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !541, file: !535, line: 210, baseType: !714, size: 64, offset: 9408)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !534, file: !535, line: 438, baseType: !1047, size: 64, offset: 13952)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !579, line: 60, baseType: !1048)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1050)
!1050 = !{!1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1049, file: !114, line: 241, baseType: !333, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1049, file: !114, line: 242, baseType: !394, size: 32, offset: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1049, file: !114, line: 243, baseType: !377, size: 32, offset: 96)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1049, file: !114, line: 243, baseType: !377, size: 32, offset: 128)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1049, file: !114, line: 244, baseType: !377, size: 32, offset: 160)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1049, file: !114, line: 244, baseType: !377, size: 32, offset: 192)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1049, file: !114, line: 245, baseType: !423, size: 64, offset: 256)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1049, file: !114, line: 246, baseType: !490, size: 32, offset: 320)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1049, file: !114, line: 247, baseType: !377, size: 32, offset: 352)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1049, file: !114, line: 251, baseType: !377, size: 32, offset: 384)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1049, file: !114, line: 252, baseType: !853, size: 64, offset: 448)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1049, file: !114, line: 253, baseType: !490, size: 32, offset: 512)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1049, file: !114, line: 254, baseType: !377, size: 32, offset: 544)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1049, file: !114, line: 254, baseType: !377, size: 32, offset: 576)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1049, file: !114, line: 255, baseType: !377, size: 32, offset: 608)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !534, file: !535, line: 438, baseType: !1047, size: 64, offset: 14016)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !534, file: !535, line: 439, baseType: !414, size: 64, offset: 14080)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !534, file: !535, line: 440, baseType: !1069, size: 32, offset: 14144)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !534, file: !535, line: 441, baseType: !490, size: 32, offset: 14176)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !534, file: !535, line: 442, baseType: !490, size: 32, offset: 14208)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !534, file: !535, line: 443, baseType: !1073, size: 448, offset: 14272)
!1073 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1074, size: 448, elements: !1075)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !354)
!1075 = !{!1076}
!1076 = !DISubrange(count: 7)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !534, file: !535, line: 444, baseType: !490, size: 32, offset: 14720)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !534, file: !535, line: 445, baseType: !490, size: 32, offset: 14752)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !534, file: !535, line: 446, baseType: !377, size: 32, offset: 14784)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !534, file: !535, line: 447, baseType: !416, size: 64, offset: 14848)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !534, file: !535, line: 448, baseType: !416, size: 64, offset: 14912)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !534, file: !535, line: 449, baseType: !619, size: 640, offset: 14976)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !534, file: !535, line: 450, baseType: !551, size: 32, offset: 15616)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !534, file: !535, line: 451, baseType: !1085, size: 2880, offset: 15680)
!1085 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !535, line: 318, baseType: !1086)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !535, line: 319, size: 2880, elements: !1087)
!1087 = !{!1088, !1089, !1090, !1091, !1092, !1093, !1094, !1107, !1108, !1113, !1118, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1133, !1134, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1166, !1167, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1190, !1191, !1192, !1193, !1194}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1086, file: !535, line: 320, baseType: !377, size: 32)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1086, file: !535, line: 321, baseType: !377, size: 32, offset: 32)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1086, file: !535, line: 322, baseType: !377, size: 32, offset: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1086, file: !535, line: 323, baseType: !377, size: 32, offset: 96)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1086, file: !535, line: 324, baseType: !377, size: 32, offset: 128)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1086, file: !535, line: 325, baseType: !377, size: 32, offset: 160)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1086, file: !535, line: 326, baseType: !1095, size: 64, offset: 192)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !535, line: 293, baseType: !1096)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !535, line: 295, size: 448, elements: !1098)
!1098 = !{!1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1097, file: !535, line: 296, baseType: !1095, size: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1097, file: !535, line: 297, baseType: !440, size: 64, offset: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1097, file: !535, line: 297, baseType: !440, size: 64, offset: 128)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1097, file: !535, line: 298, baseType: !423, size: 64, offset: 192)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1097, file: !535, line: 298, baseType: !423, size: 64, offset: 256)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1097, file: !535, line: 299, baseType: !377, size: 32, offset: 320)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1097, file: !535, line: 300, baseType: !377, size: 32, offset: 352)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1097, file: !535, line: 301, baseType: !377, size: 32, offset: 384)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1086, file: !535, line: 326, baseType: !1095, size: 64, offset: 256)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1086, file: !535, line: 328, baseType: !1109, size: 64, offset: 320)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{!331, !532, !1112, !423}
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1086, file: !535, line: 329, baseType: !1114, size: 64, offset: 384)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!331, !1112, !1117, !425, !425, !443, !423}
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1086, file: !535, line: 330, baseType: !1119, size: 64, offset: 448)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = !DISubroutineType(types: !1121)
!1121 = !{!331, !1112}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1086, file: !535, line: 331, baseType: !1119, size: 64, offset: 512)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1086, file: !535, line: 334, baseType: !333, size: 64, offset: 576)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1086, file: !535, line: 335, baseType: !394, size: 32, offset: 640)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1086, file: !535, line: 335, baseType: !394, size: 32, offset: 672)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1086, file: !535, line: 336, baseType: !394, size: 32, offset: 704)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1086, file: !535, line: 336, baseType: !394, size: 32, offset: 736)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1086, file: !535, line: 337, baseType: !1129, size: 64, offset: 768)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !334, line: 339, baseType: !1131)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !334, line: 339, flags: DIFlagFwdDecl)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1086, file: !535, line: 338, baseType: !1129, size: 64, offset: 832)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1086, file: !535, line: 339, baseType: !1135, size: 64, offset: 896)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !334, line: 341, baseType: !1137)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !334, line: 351, size: 192, elements: !1138)
!1138 = !{!1139, !1140, !1141, !1142, !1143}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1137, file: !334, line: 354, baseType: !72, size: 32)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1137, file: !334, line: 355, baseType: !72, size: 32, offset: 32)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1137, file: !334, line: 356, baseType: !72, size: 32, offset: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1137, file: !334, line: 361, baseType: !72, size: 32, offset: 96)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1137, file: !334, line: 362, baseType: !312, size: 64, offset: 128)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1086, file: !535, line: 340, baseType: !377, size: 32, offset: 960)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1086, file: !535, line: 340, baseType: !377, size: 32, offset: 992)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1086, file: !535, line: 341, baseType: !440, size: 64, offset: 1024)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1086, file: !535, line: 342, baseType: !423, size: 64, offset: 1088)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1086, file: !535, line: 343, baseType: !443, size: 64, offset: 1152)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1086, file: !535, line: 344, baseType: !425, size: 64, offset: 1216)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1086, file: !535, line: 345, baseType: !377, size: 32, offset: 1280)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1086, file: !535, line: 346, baseType: !1117, size: 64, offset: 1344)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1086, file: !535, line: 347, baseType: !490, size: 32, offset: 1408)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1086, file: !535, line: 348, baseType: !377, size: 32, offset: 1440)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1086, file: !535, line: 351, baseType: !490, size: 32, offset: 1472)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1086, file: !535, line: 352, baseType: !490, size: 32, offset: 1504)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1086, file: !535, line: 353, baseType: !394, size: 32, offset: 1536)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1086, file: !535, line: 354, baseType: !394, size: 32, offset: 1568)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1086, file: !535, line: 355, baseType: !1117, size: 64, offset: 1600)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1086, file: !535, line: 356, baseType: !1117, size: 64, offset: 1664)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1086, file: !535, line: 357, baseType: !1161, size: 64, offset: 1728)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !535, line: 310, baseType: !1163)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !535, line: 308, size: 32, elements: !1164)
!1164 = !{!1165}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1163, file: !535, line: 309, baseType: !377, size: 32)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1086, file: !535, line: 357, baseType: !1161, size: 64, offset: 1792)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1086, file: !535, line: 358, baseType: !1168, size: 64, offset: 1856)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !535, line: 316, baseType: !1170)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !535, line: 312, size: 128, elements: !1171)
!1171 = !{!1172, !1173, !1174}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1170, file: !535, line: 313, baseType: !414, size: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1170, file: !535, line: 314, baseType: !377, size: 32, offset: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1170, file: !535, line: 315, baseType: !356, size: 8, offset: 96)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1086, file: !535, line: 359, baseType: !1168, size: 64, offset: 1920)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1086, file: !535, line: 360, baseType: !1168, size: 64, offset: 1984)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1086, file: !535, line: 361, baseType: !377, size: 32, offset: 2048)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1086, file: !535, line: 362, baseType: !394, size: 32, offset: 2080)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1086, file: !535, line: 363, baseType: !377, size: 32, offset: 2112)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1086, file: !535, line: 364, baseType: !1117, size: 64, offset: 2176)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1086, file: !535, line: 365, baseType: !1135, size: 64, offset: 2240)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1086, file: !535, line: 366, baseType: !394, size: 32, offset: 2304)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1086, file: !535, line: 367, baseType: !394, size: 32, offset: 2336)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1086, file: !535, line: 368, baseType: !1129, size: 64, offset: 2368)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1086, file: !535, line: 369, baseType: !1129, size: 64, offset: 2432)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1086, file: !535, line: 370, baseType: !1187, size: 64, offset: 2496)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1188)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1086, file: !535, line: 371, baseType: !1187, size: 64, offset: 2560)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1086, file: !535, line: 372, baseType: !1187, size: 64, offset: 2624)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1086, file: !535, line: 373, baseType: !520, size: 64, offset: 2688)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1086, file: !535, line: 374, baseType: !312, size: 64, offset: 2752)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1086, file: !535, line: 375, baseType: !1195, size: 64, offset: 2816)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !534, file: !535, line: 451, baseType: !1085, size: 2880, offset: 18560)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !534, file: !535, line: 452, baseType: !1198, size: 64, offset: 21440)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1199)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !535, line: 681, size: 4864, elements: !1201)
!1201 = !{!1202, !1203, !1204, !1205, !1206, !1207, !1208, !1212}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1200, file: !535, line: 682, baseType: !538, size: 4480)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1200, file: !535, line: 682, baseType: !763, size: 32, offset: 4480)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1200, file: !535, line: 683, baseType: !490, size: 32, offset: 4512)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1200, file: !535, line: 684, baseType: !377, size: 32, offset: 4544)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1200, file: !535, line: 685, baseType: !915, size: 64, offset: 4608)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1200, file: !535, line: 686, baseType: !440, size: 64, offset: 4672)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1200, file: !535, line: 687, baseType: !1209, size: 64, offset: 4736)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64)
!1210 = !DISubroutineType(types: !1211)
!1211 = !{!331, !1198, !561, !414}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1200, file: !535, line: 688, baseType: !414, size: 64, offset: 4800)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !534, file: !535, line: 453, baseType: !1198, size: 64, offset: 21504)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !534, file: !535, line: 454, baseType: !1198, size: 64, offset: 21568)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !534, file: !535, line: 455, baseType: !377, size: 32, offset: 21632)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "preallocated", scope: !534, file: !535, line: 456, baseType: !490, size: 32, offset: 21664)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !534, file: !535, line: 457, baseType: !1218, size: 320, offset: 21696)
