; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/ftn-custom/zutils.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/ftn-custom/zutils.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ompi_communicator_t = type opaque
%struct.ompi_predefined_communicator_t = type opaque
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "PETSC_NULL_CHARACTER_Fortran", scope: !2, file: !246, line: 27, type: !49, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !32, globals: !243, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/ftn-custom/zutils.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!4 = !{!5, !11, !26}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 170, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 81, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!14 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!24 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!25 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 663, baseType: !7, size: 32, elements: !28)
!27 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!28 = !{!29, !30, !31}
!29 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!31 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!32 = !{!33, !36, !38, !39, !40, !44, !45, !49, !51, !47, !81, !242, !212, !86}
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !34, line: 46, baseType: !35)
!34 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!35 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !37)
!37 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !37)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !41, line: 330, baseType: !42)
!41 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !41, line: 330, flags: DIFlagFwdDecl)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !48)
!48 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !54, line: 73, size: 4480, elements: !55)
!54 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!55 = !{!56, !58, !106, !107, !108, !110, !111, !112, !113, !121, !122, !123, !127, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !143, !144, !145, !147, !148, !149, !151, !152, !153, !154, !155, !157, !159, !160, !161, !162, !163, !164, !166, !167, !168, !178, !180, !181, !185, !186, !232, !237, !239, !240, !241}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !53, file: !54, line: 74, baseType: !57, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !37)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !53, file: !54, line: 75, baseType: !59, size: 448, offset: 64)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 448, elements: !104)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !54, line: 53, baseType: !61)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !54, line: 45, size: 448, elements: !62)
!62 = !{!63, !69, !77, !82, !88, !92, !99}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !61, file: !54, line: 46, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!67, !51, !68}
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !37)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !61, file: !54, line: 47, baseType: !70, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!67, !51, !73}
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !74, line: 16, baseType: !75)
!74 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !74, line: 16, flags: DIFlagFwdDecl)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !61, file: !54, line: 48, baseType: !78, size: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!67, !81}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !61, file: !54, line: 49, baseType: !83, size: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!67, !51, !86, !51}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !61, file: !54, line: 50, baseType: !89, size: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!67, !51, !86, !81}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !61, file: !54, line: 51, baseType: !93, size: 64, offset: 320)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!67, !51, !86, !96}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{null}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !61, file: !54, line: 52, baseType: !100, size: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!67, !51, !86, !103}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!104 = !{!105}
!105 = !DISubrange(count: 1)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !53, file: !54, line: 76, baseType: !40, size: 64, offset: 512)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !53, file: !54, line: 77, baseType: !39, size: 32, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !53, file: !54, line: 78, baseType: !109, size: 64, offset: 640)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !48)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !53, file: !54, line: 78, baseType: !109, size: 64, offset: 704)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !53, file: !54, line: 78, baseType: !109, size: 64, offset: 768)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !53, file: !54, line: 78, baseType: !109, size: 64, offset: 832)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !53, file: !54, line: 79, baseType: !114, size: 64, offset: 896)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !117, line: 27, baseType: !118)
!117 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !119, line: 43, baseType: !120)
!119 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!120 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !53, file: !54, line: 80, baseType: !39, size: 32, offset: 960)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !53, file: !54, line: 81, baseType: !36, size: 32, offset: 992)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !53, file: !54, line: 82, baseType: !124, size: 64, offset: 1024)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !53, file: !54, line: 83, baseType: !128, size: 64, offset: 1088)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !53, file: !54, line: 84, baseType: !49, size: 64, offset: 1152)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !53, file: !54, line: 85, baseType: !49, size: 64, offset: 1216)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !53, file: !54, line: 86, baseType: !49, size: 64, offset: 1280)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !53, file: !54, line: 87, baseType: !49, size: 64, offset: 1344)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !53, file: !54, line: 88, baseType: !51, size: 64, offset: 1408)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !53, file: !54, line: 89, baseType: !114, size: 64, offset: 1472)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !53, file: !54, line: 90, baseType: !49, size: 64, offset: 1536)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !53, file: !54, line: 91, baseType: !49, size: 64, offset: 1600)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !53, file: !54, line: 92, baseType: !39, size: 32, offset: 1664)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !53, file: !54, line: 93, baseType: !44, size: 64, offset: 1728)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !53, file: !54, line: 94, baseType: !142, size: 64, offset: 1792)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !115)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !53, file: !54, line: 95, baseType: !39, size: 32, offset: 1856)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !53, file: !54, line: 95, baseType: !39, size: 32, offset: 1888)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !53, file: !54, line: 96, baseType: !146, size: 64, offset: 1920)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !53, file: !54, line: 96, baseType: !146, size: 64, offset: 1984)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !53, file: !54, line: 97, baseType: !38, size: 64, offset: 2048)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !53, file: !54, line: 97, baseType: !150, size: 64, offset: 2112)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !53, file: !54, line: 98, baseType: !39, size: 32, offset: 2176)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !53, file: !54, line: 98, baseType: !39, size: 32, offset: 2208)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !53, file: !54, line: 99, baseType: !146, size: 64, offset: 2240)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !53, file: !54, line: 99, baseType: !146, size: 64, offset: 2304)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !53, file: !54, line: 100, baseType: !156, size: 64, offset: 2368)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !53, file: !54, line: 100, baseType: !158, size: 64, offset: 2432)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !53, file: !54, line: 101, baseType: !39, size: 32, offset: 2496)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !53, file: !54, line: 101, baseType: !39, size: 32, offset: 2528)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !53, file: !54, line: 102, baseType: !146, size: 64, offset: 2560)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !53, file: !54, line: 102, baseType: !146, size: 64, offset: 2624)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !53, file: !54, line: 103, baseType: !45, size: 64, offset: 2688)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !53, file: !54, line: 103, baseType: !165, size: 64, offset: 2752)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !53, file: !54, line: 104, baseType: !103, size: 64, offset: 2816)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !53, file: !54, line: 105, baseType: !39, size: 32, offset: 2880)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !53, file: !54, line: 106, baseType: !169, size: 128, offset: 2944)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 128, elements: !176)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !54, line: 64, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !54, line: 61, size: 128, elements: !173)
!173 = !{!174, !175}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !172, file: !54, line: 62, baseType: !96, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !172, file: !54, line: 63, baseType: !44, size: 64, offset: 64)
!176 = !{!177}
!177 = !DISubrange(count: 2)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !53, file: !54, line: 107, baseType: !179, size: 64, offset: 3072)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 64, elements: !176)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !53, file: !54, line: 108, baseType: !44, size: 64, offset: 3136)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !53, file: !54, line: 109, baseType: !182, size: 64, offset: 3200)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!67, !44}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !53, file: !54, line: 111, baseType: !39, size: 32, offset: 3264)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !53, file: !54, line: 112, baseType: !187, size: 320, offset: 3328)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 320, elements: !230)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!67, !191, !51, !44}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !194)
!194 = !{!195, !196, !218, !219, !220, !221, !222, !223, !224, !225, !226}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !193, file: !12, line: 100, baseType: !39, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !193, file: !12, line: 101, baseType: !197, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !200)
!200 = !{!201, !202, !203, !204, !205, !208, !209, !210, !211, !213, !215, !216, !217}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !199, file: !12, line: 84, baseType: !49, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !199, file: !12, line: 85, baseType: !49, size: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !199, file: !12, line: 86, baseType: !44, size: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !199, file: !12, line: 87, baseType: !124, size: 64, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !199, file: !12, line: 88, baseType: !206, size: 64, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !199, file: !12, line: 89, baseType: !50, size: 8, offset: 320)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !199, file: !12, line: 90, baseType: !49, size: 64, offset: 384)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !199, file: !12, line: 91, baseType: !33, size: 64, offset: 448)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !199, file: !12, line: 92, baseType: !212, size: 32, offset: 512)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !199, file: !12, line: 93, baseType: !214, size: 32, offset: 544)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !199, file: !12, line: 94, baseType: !197, size: 64, offset: 576)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !199, file: !12, line: 95, baseType: !49, size: 64, offset: 640)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !199, file: !12, line: 96, baseType: !44, size: 64, offset: 704)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !193, file: !12, line: 102, baseType: !49, size: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !193, file: !12, line: 102, baseType: !49, size: 64, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !193, file: !12, line: 103, baseType: !49, size: 64, offset: 256)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !193, file: !12, line: 104, baseType: !40, size: 64, offset: 320)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !193, file: !12, line: 105, baseType: !212, size: 32, offset: 384)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !193, file: !12, line: 105, baseType: !212, size: 32, offset: 416)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !193, file: !12, line: 105, baseType: !212, size: 32, offset: 448)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !193, file: !12, line: 106, baseType: !51, size: 64, offset: 512)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !193, file: !12, line: 107, baseType: !227, size: 64, offset: 576)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!230 = !{!231}
!231 = !DISubrange(count: 5)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !53, file: !54, line: 113, baseType: !233, size: 320, offset: 3648)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 320, elements: !230)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!67, !51, !44}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !53, file: !54, line: 114, baseType: !238, size: 320, offset: 3968)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 320, elements: !230)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !53, file: !54, line: 115, baseType: !212, size: 32, offset: 4288)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !53, file: !54, line: 120, baseType: !227, size: 64, offset: 4352)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !53, file: !54, line: 121, baseType: !212, size: 32, offset: 4416)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!243 = !{!0, !244, !247, !249, !251, !253, !255, !257}
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "PETSC_NULL_INTEGER_Fortran", scope: !2, file: !246, line: 28, type: !44, isLocal: false, isDefinition: true)
!246 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/ftn-custom/zutils.c", directory: "/home/users/ndemeye/xSDK")
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "PETSC_NULL_SCALAR_Fortran", scope: !2, file: !246, line: 29, type: !44, isLocal: false, isDefinition: true)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "PETSC_NULL_DOUBLE_Fortran", scope: !2, file: !246, line: 30, type: !44, isLocal: false, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "PETSC_NULL_REAL_Fortran", scope: !2, file: !246, line: 31, type: !44, isLocal: false, isDefinition: true)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "PETSC_NULL_BOOL_Fortran", scope: !2, file: !246, line: 32, type: !44, isLocal: false, isDefinition: true)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "PETSC_NULL_FUNCTION_Fortran", scope: !2, file: !246, line: 34, type: !96, isLocal: false, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "PETSC_NULL_MPI_COMM_Fortran", scope: !2, file: !246, line: 36, type: !44, isLocal: false, isDefinition: true)
!259 = !{i32 7, !"Dwarf Version", i32 4}
!260 = !{i32 2, !"Debug Info Version", i32 3}
!261 = !{i32 1, !"wchar_size", i32 4}
!262 = !{i32 7, !"PIC Level", i32 2}
!263 = !{i32 7, !"uwtable", i32 1}
!264 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!265 = distinct !DISubprogram(name: "PetscIntAddressToFortran", scope: !246, file: !246, line: 38, type: !266, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !270)
!266 = !DISubroutineType(types: !267)
!267 = !{!33, !268, !268}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!270 = !{!271, !272, !273, !274, !275, !276, !277, !281}
!271 = !DILocalVariable(name: "base", arg: 1, scope: !265, file: !246, line: 38, type: !268)
!272 = !DILocalVariable(name: "addr", arg: 2, scope: !265, file: !246, line: 38, type: !268)
!273 = !DILocalVariable(name: "tmp1", scope: !265, file: !246, line: 40, type: !33)
!274 = !DILocalVariable(name: "tmp2", scope: !265, file: !246, line: 40, type: !33)
!275 = !DILocalVariable(name: "tmp3", scope: !265, file: !246, line: 41, type: !33)
!276 = !DILocalVariable(name: "itmp2", scope: !265, file: !246, line: 42, type: !33)
!277 = !DILocalVariable(name: "idx", scope: !278, file: !246, line: 66, type: !39)
!278 = distinct !DILexicalBlock(scope: !279, file: !246, line: 66, column: 5)
!279 = distinct !DILexicalBlock(scope: !280, file: !246, line: 62, column: 29)
!280 = distinct !DILexicalBlock(scope: !265, file: !246, line: 62, column: 7)
!281 = !DILocalVariable(name: "errcode", scope: !278, file: !246, line: 66, type: !36)
!282 = !DILocation(line: 0, scope: !265)
!283 = !DILocation(line: 40, column: 17, scope: !265)
!284 = !DILocation(line: 41, column: 17, scope: !265)
!285 = !DILocation(line: 45, column: 12, scope: !286)
!286 = distinct !DILexicalBlock(scope: !265, file: !246, line: 45, column: 7)
