; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/impls/seq/dvec2.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/impls/seq/dvec2.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_Vec = type { %struct._p_PetscObject, [1 x %struct._VecOps], %struct._n_PetscLayout*, i8*, i32, %struct.VecStash, %struct.VecStash, i32, i32, i32, i8* }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!12 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 155, baseType: !5, size: 32, elements: !26)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!26 = !{!27, !28, !29, !30, !31}
!27 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!30 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!31 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 580, baseType: !5, size: 32, elements: !33)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42}
!34 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!35 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!37 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!38 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!39 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!40 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!41 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!42 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 475, baseType: !5, size: 32, elements: !44)
!44 = !{!45, !46, !47}
!45 = !DIEnumerator(name: "VEC_IGNORE_OFF_PROC_ENTRIES", value: 0, isUnsigned: true)
!46 = !DIEnumerator(name: "VEC_IGNORE_NEGATIVE_INDICES", value: 1, isUnsigned: true)
!47 = !DIEnumerator(name: "VEC_SUBSET_OFF_PROC_ENTRIES", value: 2, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 701, baseType: !5, size: 32, elements: !49)
!49 = !{!50, !51, !52, !53, !54}
!50 = !DIEnumerator(name: "PETSC_MEMTYPE_HOST", value: 0, isUnsigned: true)
!51 = !DIEnumerator(name: "PETSC_MEMTYPE_DEVICE", value: 1, isUnsigned: true)
!52 = !DIEnumerator(name: "PETSC_MEMTYPE_CUDA", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSC_MEMTYPE_NVSHMEM", value: 17, isUnsigned: true)
!54 = !DIEnumerator(name: "PETSC_MEMTYPE_HIP", value: 3, isUnsigned: true)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 472, baseType: !5, size: 32, elements: !56)
!56 = !{!57, !58, !59, !60, !61}
!57 = !DIEnumerator(name: "PETSC_OFFLOAD_UNALLOCATED", value: 0, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_OFFLOAD_CPU", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_OFFLOAD_GPU", value: 2, isUnsigned: true)
!60 = !DIEnumerator(name: "PETSC_OFFLOAD_BOTH", value: 3, isUnsigned: true)
!61 = !DIEnumerator(name: "PETSC_OFFLOAD_VECKOKKOS", value: 256, isUnsigned: true)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 663, baseType: !5, size: 32, elements: !64)
!63 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!64 = !{!65, !66, !67}
!65 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!66 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!67 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!68 = !{!69, !96, !177, !117, !204, !252, !157, !93, !580, !583, !167, !82, !586, !203, !5}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !25, line: 21, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !73, line: 142, size: 12800, elements: !74)
!73 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!74 = !{!75, !286, !505, !526, !527, !528, !574, !575, !576, !577, !579}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !72, file: !73, line: 143, baseType: !76, size: 4480)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !77, line: 122, baseType: !78)
!77 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !77, line: 73, size: 4480, elements: !79)
!79 = !{!80, !83, !138, !139, !141, !144, !145, !146, !147, !155, !156, !158, !162, !166, !168, !169, !170, !171, !172, !173, !174, !175, !176, !178, !180, !181, !182, !184, !185, !187, !189, !190, !191, !192, !193, !196, !198, !199, !200, !201, !202, !205, !207, !208, !209, !219, !221, !222, !226, !227, !276, !281, !283, !284, !285}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !78, file: !77, line: 74, baseType: !81, size: 32)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !82)
!82 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !78, file: !77, line: 75, baseType: !84, size: 448, offset: 64)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 448, elements: !136)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !77, line: 53, baseType: !86)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !77, line: 45, size: 448, elements: !87)
!87 = !{!88, !100, !108, !113, !120, !124, !131}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !86, file: !77, line: 46, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!92, !93, !95}
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !82)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !97, line: 330, baseType: !98)
!97 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !97, line: 330, flags: DIFlagFwdDecl)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !86, file: !77, line: 47, baseType: !101, size: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!92, !93, !104}
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !105, line: 16, baseType: !106)
!105 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !105, line: 16, flags: DIFlagFwdDecl)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !86, file: !77, line: 48, baseType: !109, size: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!92, !112}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !86, file: !77, line: 49, baseType: !114, size: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!92, !93, !117, !93}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!119 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !86, file: !77, line: 50, baseType: !121, size: 64, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!92, !93, !117, !112}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !86, file: !77, line: 51, baseType: !125, size: 64, offset: 320)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!92, !93, !117, !128}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{null}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !86, file: !77, line: 52, baseType: !132, size: 64, offset: 384)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!92, !93, !117, !135}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!136 = !{!137}
!137 = !DISubrange(count: 1)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !78, file: !77, line: 76, baseType: !96, size: 64, offset: 512)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !78, file: !77, line: 77, baseType: !140, size: 32, offset: 576)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !82)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !78, file: !77, line: 78, baseType: !142, size: 64, offset: 640)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !143)
!143 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !78, file: !77, line: 78, baseType: !142, size: 64, offset: 704)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !78, file: !77, line: 78, baseType: !142, size: 64, offset: 768)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !78, file: !77, line: 78, baseType: !142, size: 64, offset: 832)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !78, file: !77, line: 79, baseType: !148, size: 64, offset: 896)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !151, line: 27, baseType: !152)
!151 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !153, line: 43, baseType: !154)
!153 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!154 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !78, file: !77, line: 80, baseType: !140, size: 32, offset: 960)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !78, file: !77, line: 81, baseType: !157, size: 32, offset: 992)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !82)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !78, file: !77, line: 82, baseType: !159, size: 64, offset: 1024)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !78, file: !77, line: 83, baseType: !163, size: 64, offset: 1088)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !78, file: !77, line: 84, baseType: !167, size: 64, offset: 1152)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !78, file: !77, line: 85, baseType: !167, size: 64, offset: 1216)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !78, file: !77, line: 86, baseType: !167, size: 64, offset: 1280)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !78, file: !77, line: 87, baseType: !167, size: 64, offset: 1344)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !78, file: !77, line: 88, baseType: !93, size: 64, offset: 1408)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !78, file: !77, line: 89, baseType: !148, size: 64, offset: 1472)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !78, file: !77, line: 90, baseType: !167, size: 64, offset: 1536)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !78, file: !77, line: 91, baseType: !167, size: 64, offset: 1600)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !78, file: !77, line: 92, baseType: !140, size: 32, offset: 1664)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !78, file: !77, line: 93, baseType: !177, size: 64, offset: 1728)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !78, file: !77, line: 94, baseType: !179, size: 64, offset: 1792)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !149)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !78, file: !77, line: 95, baseType: !140, size: 32, offset: 1856)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !78, file: !77, line: 95, baseType: !140, size: 32, offset: 1888)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !78, file: !77, line: 96, baseType: !183, size: 64, offset: 1920)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !78, file: !77, line: 96, baseType: !183, size: 64, offset: 1984)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !78, file: !77, line: 97, baseType: !186, size: 64, offset: 2048)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !78, file: !77, line: 97, baseType: !188, size: 64, offset: 2112)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !78, file: !77, line: 98, baseType: !140, size: 32, offset: 2176)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !78, file: !77, line: 98, baseType: !140, size: 32, offset: 2208)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !78, file: !77, line: 99, baseType: !183, size: 64, offset: 2240)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !78, file: !77, line: 99, baseType: !183, size: 64, offset: 2304)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !78, file: !77, line: 100, baseType: !194, size: 64, offset: 2368)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !143)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !78, file: !77, line: 100, baseType: !197, size: 64, offset: 2432)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !78, file: !77, line: 101, baseType: !140, size: 32, offset: 2496)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !78, file: !77, line: 101, baseType: !140, size: 32, offset: 2528)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !78, file: !77, line: 102, baseType: !183, size: 64, offset: 2560)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !78, file: !77, line: 102, baseType: !183, size: 64, offset: 2624)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !78, file: !77, line: 103, baseType: !203, size: 64, offset: 2688)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !195)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !78, file: !77, line: 103, baseType: !206, size: 64, offset: 2752)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !78, file: !77, line: 104, baseType: !135, size: 64, offset: 2816)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !78, file: !77, line: 105, baseType: !140, size: 32, offset: 2880)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !78, file: !77, line: 106, baseType: !210, size: 128, offset: 2944)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 128, elements: !217)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !77, line: 64, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !77, line: 61, size: 128, elements: !214)
!214 = !{!215, !216}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !213, file: !77, line: 62, baseType: !128, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !213, file: !77, line: 63, baseType: !177, size: 64, offset: 64)
!217 = !{!218}
!218 = !DISubrange(count: 2)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !78, file: !77, line: 107, baseType: !220, size: 64, offset: 3072)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !217)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !78, file: !77, line: 108, baseType: !177, size: 64, offset: 3136)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !78, file: !77, line: 109, baseType: !223, size: 64, offset: 3200)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!92, !177}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !78, file: !77, line: 111, baseType: !140, size: 32, offset: 3264)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !78, file: !77, line: 112, baseType: !228, size: 320, offset: 3328)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 320, elements: !274)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!92, !232, !93, !177}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !235)
!235 = !{!236, !237, !262, !263, !264, !265, !266, !267, !268, !269, !270}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !234, file: !10, line: 100, baseType: !140, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !234, file: !10, line: 101, baseType: !238, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !241)
!241 = !{!242, !243, !244, !245, !246, !249, !250, !251, !255, !257, !259, !260, !261}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !240, file: !10, line: 84, baseType: !167, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !240, file: !10, line: 85, baseType: !167, size: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !240, file: !10, line: 86, baseType: !177, size: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !240, file: !10, line: 87, baseType: !159, size: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !240, file: !10, line: 88, baseType: !247, size: 64, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !240, file: !10, line: 89, baseType: !119, size: 8, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !240, file: !10, line: 90, baseType: !167, size: 64, offset: 384)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !240, file: !10, line: 91, baseType: !252, size: 64, offset: 448)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !253, line: 46, baseType: !254)
!253 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!254 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !240, file: !10, line: 92, baseType: !256, size: 32, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !240, file: !10, line: 93, baseType: !258, size: 32, offset: 544)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !240, file: !10, line: 94, baseType: !238, size: 64, offset: 576)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !240, file: !10, line: 95, baseType: !167, size: 64, offset: 640)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !240, file: !10, line: 96, baseType: !177, size: 64, offset: 704)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !234, file: !10, line: 102, baseType: !167, size: 64, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !234, file: !10, line: 102, baseType: !167, size: 64, offset: 192)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !234, file: !10, line: 103, baseType: !167, size: 64, offset: 256)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !234, file: !10, line: 104, baseType: !96, size: 64, offset: 320)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !234, file: !10, line: 105, baseType: !256, size: 32, offset: 384)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !234, file: !10, line: 105, baseType: !256, size: 32, offset: 416)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !234, file: !10, line: 105, baseType: !256, size: 32, offset: 448)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !234, file: !10, line: 106, baseType: !93, size: 64, offset: 512)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !234, file: !10, line: 107, baseType: !271, size: 64, offset: 576)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!274 = !{!275}
!275 = !DISubrange(count: 5)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !78, file: !77, line: 113, baseType: !277, size: 320, offset: 3648)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 320, elements: !274)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!92, !93, !177}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !78, file: !77, line: 114, baseType: !282, size: 320, offset: 3968)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 320, elements: !274)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !78, file: !77, line: 115, baseType: !256, size: 32, offset: 4288)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !78, file: !77, line: 120, baseType: !271, size: 64, offset: 4352)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !78, file: !77, line: 121, baseType: !256, size: 32, offset: 4416)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !72, file: !73, line: 143, baseType: !287, size: 5248, offset: 4480)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 5248, elements: !136)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !73, line: 23, size: 5248, elements: !289)
!289 = !{!290, !294, !299, !303, !307, !313, !318, !319, !320, !324, !328, !329, !330, !334, !338, !344, !345, !349, !353, !357, !358, !365, !369, !370, !374, !378, !379, !380, !384, !385, !392, !397, !398, !399, !403, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !424, !425, !426, !430, !434, !435, !436, !437, !441, !442, !443, !444, !445, !446, !447, !451, !452, !456, !463, !464, !469, !470, !474, !475, !476, !477, !478, !479, !480, !481, !485, !486, !487, !493, !497, !498, !499}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !288, file: !73, line: 24, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!92, !70, !69}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !288, file: !73, line: 25, baseType: !295, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!92, !70, !140, !298}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !288, file: !73, line: 26, baseType: !300, size: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!92, !140, !69}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !288, file: !73, line: 27, baseType: !304, size: 64, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!92, !70, !70, !203}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !288, file: !73, line: 28, baseType: !308, size: 64, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!92, !70, !140, !311, !203}
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !288, file: !73, line: 29, baseType: !314, size: 64, offset: 320)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!92, !70, !317, !194}
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !25, line: 155, baseType: !24)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !288, file: !73, line: 30, baseType: !304, size: 64, offset: 384)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !288, file: !73, line: 31, baseType: !308, size: 64, offset: 448)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !288, file: !73, line: 32, baseType: !321, size: 64, offset: 512)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!92, !70, !204}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !288, file: !73, line: 33, baseType: !325, size: 64, offset: 576)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!92, !70, !70}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !288, file: !73, line: 34, baseType: !321, size: 64, offset: 640)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !288, file: !73, line: 35, baseType: !325, size: 64, offset: 704)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !288, file: !73, line: 36, baseType: !331, size: 64, offset: 768)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!92, !70, !204, !70}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !288, file: !73, line: 37, baseType: !335, size: 64, offset: 832)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!92, !70, !204, !204, !70}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !288, file: !73, line: 38, baseType: !339, size: 64, offset: 896)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!92, !70, !140, !342, !69}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !288, file: !73, line: 39, baseType: !331, size: 64, offset: 960)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !288, file: !73, line: 40, baseType: !346, size: 64, offset: 1024)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!92, !70, !204, !70, !70}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !288, file: !73, line: 41, baseType: !350, size: 64, offset: 1088)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!92, !70, !204, !204, !204, !70, !70}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !288, file: !73, line: 42, baseType: !354, size: 64, offset: 1152)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!92, !70, !70, !70}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !288, file: !73, line: 43, baseType: !354, size: 64, offset: 1216)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !288, file: !73, line: 44, baseType: !359, size: 64, offset: 1280)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!92, !70, !140, !362, !342, !364}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !288, file: !73, line: 45, baseType: !366, size: 64, offset: 1344)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!92, !70}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !288, file: !73, line: 46, baseType: !366, size: 64, offset: 1408)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !288, file: !73, line: 47, baseType: !371, size: 64, offset: 1472)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!92, !70, !206}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !288, file: !73, line: 48, baseType: !375, size: 64, offset: 1536)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!92, !70, !186}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !288, file: !73, line: 49, baseType: !375, size: 64, offset: 1600)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !288, file: !73, line: 50, baseType: !371, size: 64, offset: 1664)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !288, file: !73, line: 51, baseType: !381, size: 64, offset: 1728)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!92, !70, !186, !194}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !288, file: !73, line: 52, baseType: !381, size: 64, offset: 1792)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !288, file: !73, line: 53, baseType: !386, size: 64, offset: 1856)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!92, !70, !389}
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !288, file: !73, line: 54, baseType: !393, size: 64, offset: 1920)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!92, !70, !396, !256}
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !25, line: 475, baseType: !43)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !288, file: !73, line: 55, baseType: !359, size: 64, offset: 1984)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !288, file: !73, line: 56, baseType: !366, size: 64, offset: 2048)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !288, file: !73, line: 57, baseType: !400, size: 64, offset: 2112)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!92, !70, !104}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !288, file: !73, line: 58, baseType: !404, size: 64, offset: 2176)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!92, !70, !342}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !288, file: !73, line: 59, baseType: !404, size: 64, offset: 2240)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !288, file: !73, line: 60, baseType: !304, size: 64, offset: 2304)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !288, file: !73, line: 61, baseType: !304, size: 64, offset: 2368)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !288, file: !73, line: 62, baseType: !314, size: 64, offset: 2432)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !288, file: !73, line: 63, baseType: !308, size: 64, offset: 2496)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !288, file: !73, line: 64, baseType: !308, size: 64, offset: 2560)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !288, file: !73, line: 65, baseType: !400, size: 64, offset: 2624)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !288, file: !73, line: 66, baseType: !366, size: 64, offset: 2688)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !288, file: !73, line: 67, baseType: !366, size: 64, offset: 2752)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !288, file: !73, line: 68, baseType: !417, size: 64, offset: 2816)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!92, !70, !420}
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !421, line: 30, baseType: !422)
!421 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !421, line: 30, flags: DIFlagFwdDecl)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !288, file: !73, line: 69, baseType: !359, size: 64, offset: 2880)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !288, file: !73, line: 70, baseType: !366, size: 64, offset: 2944)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !288, file: !73, line: 71, baseType: !427, size: 64, offset: 3008)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!92, !232, !70}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !288, file: !73, line: 72, baseType: !431, size: 64, offset: 3072)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!92, !70, !70, !194}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !288, file: !73, line: 73, baseType: !354, size: 64, offset: 3136)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !288, file: !73, line: 74, baseType: !354, size: 64, offset: 3200)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !288, file: !73, line: 75, baseType: !354, size: 64, offset: 3264)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !288, file: !73, line: 76, baseType: !438, size: 64, offset: 3328)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!92, !70, !140, !362, !203}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !288, file: !73, line: 77, baseType: !366, size: 64, offset: 3392)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !288, file: !73, line: 78, baseType: !366, size: 64, offset: 3456)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !288, file: !73, line: 79, baseType: !366, size: 64, offset: 3520)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !288, file: !73, line: 80, baseType: !366, size: 64, offset: 3584)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !288, file: !73, line: 81, baseType: !321, size: 64, offset: 3648)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !288, file: !73, line: 82, baseType: !366, size: 64, offset: 3712)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !288, file: !73, line: 83, baseType: !448, size: 64, offset: 3776)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{!92, !70, !140, !70, !364}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !288, file: !73, line: 84, baseType: !448, size: 64, offset: 3840)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !288, file: !73, line: 85, baseType: !453, size: 64, offset: 3904)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!92, !70, !70, !203, !203}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !288, file: !73, line: 86, baseType: !457, size: 64, offset: 3968)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!92, !70, !460, !69}
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !421, line: 11, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !421, line: 11, flags: DIFlagFwdDecl)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !288, file: !73, line: 87, baseType: !457, size: 64, offset: 4032)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !288, file: !73, line: 88, baseType: !465, size: 64, offset: 4096)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!92, !70, !468}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !288, file: !73, line: 89, baseType: !465, size: 64, offset: 4160)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !288, file: !73, line: 90, baseType: !471, size: 64, offset: 4224)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!92, !70, !140, !362, !362, !70, !364}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !288, file: !73, line: 91, baseType: !471, size: 64, offset: 4288)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !288, file: !73, line: 92, baseType: !400, size: 64, offset: 4352)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !288, file: !73, line: 93, baseType: !400, size: 64, offset: 4416)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !288, file: !73, line: 94, baseType: !325, size: 64, offset: 4480)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !288, file: !73, line: 95, baseType: !325, size: 64, offset: 4544)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !288, file: !73, line: 96, baseType: !325, size: 64, offset: 4608)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !288, file: !73, line: 97, baseType: !325, size: 64, offset: 4672)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !288, file: !73, line: 98, baseType: !482, size: 64, offset: 4736)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!92, !70, !256}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !288, file: !73, line: 99, baseType: !371, size: 64, offset: 4800)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !288, file: !73, line: 100, baseType: !371, size: 64, offset: 4864)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !288, file: !73, line: 101, baseType: !488, size: 64, offset: 4928)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!92, !70, !206, !491}
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !48)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !288, file: !73, line: 102, baseType: !494, size: 64, offset: 4992)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{!92, !70, !468, !491}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !288, file: !73, line: 103, baseType: !371, size: 64, offset: 5056)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !288, file: !73, line: 104, baseType: !465, size: 64, offset: 5120)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !288, file: !73, line: 105, baseType: !500, size: 64, offset: 5184)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!92, !140, !311, !69, !503}
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !72, file: !73, line: 144, baseType: !506, size: 64, offset: 9728)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !421, line: 60, baseType: !507)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !509, line: 240, size: 640, elements: !510)
!509 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!510 = !{!511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !508, file: !509, line: 241, baseType: !96, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !508, file: !509, line: 242, baseType: !157, size: 32, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !508, file: !509, line: 243, baseType: !140, size: 32, offset: 96)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !508, file: !509, line: 243, baseType: !140, size: 32, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !508, file: !509, line: 244, baseType: !140, size: 32, offset: 160)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !508, file: !509, line: 244, baseType: !140, size: 32, offset: 192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !508, file: !509, line: 245, baseType: !186, size: 64, offset: 256)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !508, file: !509, line: 246, baseType: !256, size: 32, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !508, file: !509, line: 247, baseType: !140, size: 32, offset: 352)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !508, file: !509, line: 251, baseType: !140, size: 32, offset: 384)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !508, file: !509, line: 252, baseType: !420, size: 64, offset: 448)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !508, file: !509, line: 253, baseType: !256, size: 32, offset: 512)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !508, file: !509, line: 254, baseType: !140, size: 32, offset: 544)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !508, file: !509, line: 254, baseType: !140, size: 32, offset: 576)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !508, file: !509, line: 255, baseType: !140, size: 32, offset: 608)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !72, file: !73, line: 145, baseType: !177, size: 64, offset: 9792)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !72, file: !73, line: 146, baseType: !256, size: 32, offset: 9856)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !72, file: !73, line: 147, baseType: !529, size: 1344, offset: 9920)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !73, line: 140, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 114, size: 1344, elements: !531)
!531 = !{!532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !550, !551, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !530, file: !73, line: 115, baseType: !140, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !530, file: !73, line: 116, baseType: !140, size: 32, offset: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !530, file: !73, line: 117, baseType: !140, size: 32, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !530, file: !73, line: 118, baseType: !140, size: 32, offset: 96)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !530, file: !73, line: 119, baseType: !140, size: 32, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !530, file: !73, line: 120, baseType: !140, size: 32, offset: 160)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !530, file: !73, line: 121, baseType: !186, size: 64, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !530, file: !73, line: 122, baseType: !203, size: 64, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !530, file: !73, line: 124, baseType: !96, size: 64, offset: 320)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !530, file: !73, line: 125, baseType: !157, size: 32, offset: 384)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !530, file: !73, line: 125, baseType: !157, size: 32, offset: 416)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !530, file: !73, line: 126, baseType: !157, size: 32, offset: 448)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !530, file: !73, line: 126, baseType: !157, size: 32, offset: 480)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !530, file: !73, line: 127, baseType: !546, size: 64, offset: 512)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !97, line: 339, baseType: !548)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !97, line: 339, flags: DIFlagFwdDecl)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !530, file: !73, line: 128, baseType: !546, size: 64, offset: 576)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !530, file: !73, line: 129, baseType: !552, size: 64, offset: 640)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !97, line: 341, baseType: !554)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !97, line: 351, size: 192, elements: !555)
!555 = !{!556, !557, !558, !559, !560}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !554, file: !97, line: 354, baseType: !82, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !554, file: !97, line: 355, baseType: !82, size: 32, offset: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !554, file: !97, line: 356, baseType: !82, size: 32, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !554, file: !97, line: 361, baseType: !82, size: 32, offset: 96)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !554, file: !97, line: 362, baseType: !252, size: 64, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !530, file: !73, line: 130, baseType: !140, size: 32, offset: 704)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !530, file: !73, line: 130, baseType: !140, size: 32, offset: 736)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !530, file: !73, line: 131, baseType: !203, size: 64, offset: 768)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !530, file: !73, line: 131, baseType: !203, size: 64, offset: 832)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !530, file: !73, line: 132, baseType: !186, size: 64, offset: 896)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !530, file: !73, line: 132, baseType: !186, size: 64, offset: 960)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !530, file: !73, line: 133, baseType: !140, size: 32, offset: 1024)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !530, file: !73, line: 134, baseType: !186, size: 64, offset: 1088)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !530, file: !73, line: 135, baseType: !140, size: 32, offset: 1152)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !530, file: !73, line: 136, baseType: !256, size: 32, offset: 1184)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !530, file: !73, line: 137, baseType: !256, size: 32, offset: 1216)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !530, file: !73, line: 138, baseType: !364, size: 32, offset: 1248)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !530, file: !73, line: 139, baseType: !186, size: 64, offset: 1280)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !72, file: !73, line: 147, baseType: !529, size: 1344, offset: 11264)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !72, file: !73, line: 148, baseType: !256, size: 32, offset: 12608)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !72, file: !73, line: 149, baseType: !140, size: 32, offset: 12640)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !72, file: !73, line: 150, baseType: !578, size: 32, offset: 12672)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !25, line: 472, baseType: !55)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !72, file: !73, line: 157, baseType: !167, size: 64, offset: 12736)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !97, line: 331, baseType: !581)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !97, line: 331, flags: DIFlagFwdDecl)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !97, line: 338, baseType: !584)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !97, line: 338, flags: DIFlagFwdDecl)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec_Seq", file: !588, line: 16, baseType: !589)
!588 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/vec/vec/impls/dvecimpl.h", directory: "/home/users/ndemeye/xSDK")
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !588, line: 14, size: 192, elements: !590)
!590 = !{!591, !592, !593}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !589, file: !588, line: 15, baseType: !203, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "array_allocated", scope: !589, file: !588, line: 15, baseType: !203, size: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "unplacedarray", scope: !589, file: !588, line: 15, baseType: !203, size: 64, offset: 128)
!594 = !{i32 7, !"Dwarf Version", i32 4}
!595 = !{i32 2, !"Debug Info Version", i32 3}
!596 = !{i32 1, !"wchar_size", i32 4}
!597 = !{i32 7, !"PIC Level", i32 2}
!598 = !{i32 7, !"uwtable", i32 1}
!599 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!600 = distinct !DISubprogram(name: "VecMDot_Seq", scope: !601, file: !601, line: 92, type: !309, scopeLine: 93, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !602)
!601 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/vec/impls/seq/dvec2.c", directory: "/home/users/ndemeye/xSDK")
!602 = !{!603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !630, !633, !635, !637, !639, !641, !643, !645, !647, !649, !651, !653, !655, !658, !660, !662, !664, !666, !668, !670, !672, !674}
!603 = !DILocalVariable(name: "xin", arg: 1, scope: !600, file: !601, line: 92, type: !70)
!604 = !DILocalVariable(name: "nv", arg: 2, scope: !600, file: !601, line: 92, type: !140)
!605 = !DILocalVariable(name: "yin", arg: 3, scope: !600, file: !601, line: 92, type: !311)
!606 = !DILocalVariable(name: "z", arg: 4, scope: !600, file: !601, line: 92, type: !203)
!607 = !DILocalVariable(name: "ierr", scope: !600, file: !601, line: 94, type: !92)
!608 = !DILocalVariable(name: "n", scope: !600, file: !601, line: 95, type: !140)
!609 = !DILocalVariable(name: "i", scope: !600, file: !601, line: 95, type: !140)
!610 = !DILocalVariable(name: "j", scope: !600, file: !601, line: 95, type: !140)
!611 = !DILocalVariable(name: "nv_rem", scope: !600, file: !601, line: 95, type: !140)
!612 = !DILocalVariable(name: "j_rem", scope: !600, file: !601, line: 95, type: !140)
!613 = !DILocalVariable(name: "sum0", scope: !600, file: !601, line: 96, type: !204)
!614 = !DILocalVariable(name: "sum1", scope: !600, file: !601, line: 96, type: !204)
!615 = !DILocalVariable(name: "sum2", scope: !600, file: !601, line: 96, type: !204)
!616 = !DILocalVariable(name: "sum3", scope: !600, file: !601, line: 96, type: !204)
!617 = !DILocalVariable(name: "x0", scope: !600, file: !601, line: 96, type: !204)
!618 = !DILocalVariable(name: "x1", scope: !600, file: !601, line: 96, type: !204)
!619 = !DILocalVariable(name: "x2", scope: !600, file: !601, line: 96, type: !204)
!620 = !DILocalVariable(name: "x3", scope: !600, file: !601, line: 96, type: !204)
!621 = !DILocalVariable(name: "yy0", scope: !600, file: !601, line: 97, type: !342)
!622 = !DILocalVariable(name: "yy1", scope: !600, file: !601, line: 97, type: !342)
!623 = !DILocalVariable(name: "yy2", scope: !600, file: !601, line: 97, type: !342)
!624 = !DILocalVariable(name: "yy3", scope: !600, file: !601, line: 97, type: !342)
!625 = !DILocalVariable(name: "x", scope: !600, file: !601, line: 97, type: !342)
!626 = !DILocalVariable(name: "xbase", scope: !600, file: !601, line: 97, type: !342)
!627 = !DILocalVariable(name: "yy", scope: !600, file: !601, line: 98, type: !69)
!628 = !DILocalVariable(name: "ierr__", scope: !629, file: !601, line: 109, type: !92)
!629 = distinct !DILexicalBlock(scope: !600, file: !601, line: 109, column: 40)
!630 = !DILocalVariable(name: "ierr__", scope: !631, file: !601, line: 114, type: !92)
!631 = distinct !DILexicalBlock(scope: !632, file: !601, line: 114, column: 40)
!632 = distinct !DILexicalBlock(scope: !600, file: !601, line: 112, column: 19)
!633 = !DILocalVariable(name: "ierr__", scope: !634, file: !601, line: 115, type: !92)
!634 = distinct !DILexicalBlock(scope: !632, file: !601, line: 115, column: 40)
!635 = !DILocalVariable(name: "ierr__", scope: !636, file: !601, line: 116, type: !92)
!636 = distinct !DILexicalBlock(scope: !632, file: !601, line: 116, column: 40)
