; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/plex/plexply.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/plex/plexply.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque

!42 = !{!43, !44, !45}
!43 = !DIEnumerator(name: "DM_POINTLOCATION_NONE", value: 0, isUnsigned: true)
!44 = !DIEnumerator(name: "DM_POINTLOCATION_NEAREST", value: 1, isUnsigned: true)
!45 = !DIEnumerator(name: "DM_POINTLOCATION_REMOVE", value: 2, isUnsigned: true)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 140, baseType: !5, size: 32, elements: !48)
!47 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/dmimpl.h", directory: "/home/users/ndemeye/xSDK")
!48 = !{!49, !50}
!49 = !DIEnumerator(name: "DMVEC_STATUS_IN", value: 0, isUnsigned: true)
!50 = !DIEnumerator(name: "DMVEC_STATUS_OUT", value: 1, isUnsigned: true)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 42, baseType: !5, size: 32, elements: !52)
!52 = !{!53, !54, !55, !56, !57}
!53 = !DIEnumerator(name: "DM_BOUNDARY_NONE", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "DM_BOUNDARY_GHOSTED", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "DM_BOUNDARY_MIRROR", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "DM_BOUNDARY_PERIODIC", value: 3, isUnsigned: true)
!57 = !DIEnumerator(name: "DM_BOUNDARY_TWIST", value: 4, isUnsigned: true)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 60, baseType: !5, size: 32, elements: !59)
!59 = !{!60, !61, !62, !63, !64, !65}
!60 = !DIEnumerator(name: "DM_BC_ESSENTIAL", value: 1, isUnsigned: true)
!61 = !DIEnumerator(name: "DM_BC_ESSENTIAL_FIELD", value: 5, isUnsigned: true)
!62 = !DIEnumerator(name: "DM_BC_NATURAL", value: 2, isUnsigned: true)
!63 = !DIEnumerator(name: "DM_BC_NATURAL_FIELD", value: 6, isUnsigned: true)
!64 = !DIEnumerator(name: "DM_BC_ESSENTIAL_BD_FIELD", value: 9, isUnsigned: true)
!65 = !DIEnumerator(name: "DM_BC_NATURAL_RIEMANN", value: 10, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !67, line: 663, baseType: !5, size: 32, elements: !68)
!67 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!68 = !{!69, !70, !71}
!69 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!70 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 481, baseType: !73, size: 32, elements: !74)
!73 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!74 = !{!75, !76, !77, !78, !79, !80}
!75 = !DIEnumerator(name: "FILE_MODE_UNDEFINED", value: -1)
!76 = !DIEnumerator(name: "FILE_MODE_READ", value: 0)
!77 = !DIEnumerator(name: "FILE_MODE_WRITE", value: 1)
!78 = !DIEnumerator(name: "FILE_MODE_APPEND", value: 2)
!79 = !DIEnumerator(name: "FILE_MODE_UPDATE", value: 3)
!80 = !DIEnumerator(name: "FILE_MODE_APPEND_UPDATE", value: 4)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !82)
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!83 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!101 = !{!102, !104, !108, !73, !109, !144}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !105, line: 330, baseType: !106)
!105 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !105, line: 330, flags: DIFlagFwdDecl)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !112, line: 73, size: 4480, elements: !113)
!112 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!113 = !{!114, !116, !164, !165, !167, !170, !171, !172, !173, !181, !182, !184, !188, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !204, !205, !206, !208, !209, !211, !213, !214, !215, !216, !217, !220, !222, !223, !224, !225, !226, !229, !231, !232, !233, !243, !245, !246, !250, !251, !300, !305, !307, !308, !309}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !111, file: !112, line: 74, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !73)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !111, file: !112, line: 75, baseType: !117, size: 448, offset: 64)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 448, elements: !162)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !112, line: 53, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !112, line: 45, size: 448, elements: !120)
!120 = !{!121, !127, !135, !140, !146, !150, !157}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !119, file: !112, line: 46, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!125, !109, !126}
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !73)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !119, file: !112, line: 47, baseType: !128, size: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!125, !109, !131}
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !132, line: 16, baseType: !133)
!132 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !132, line: 16, flags: DIFlagFwdDecl)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !119, file: !112, line: 48, baseType: !136, size: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!125, !139}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !119, file: !112, line: 49, baseType: !141, size: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!125, !109, !144, !109}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !119, file: !112, line: 50, baseType: !147, size: 64, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!125, !109, !144, !139}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !119, file: !112, line: 51, baseType: !151, size: 64, offset: 320)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!125, !109, !144, !154}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{null}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !119, file: !112, line: 52, baseType: !158, size: 64, offset: 384)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!125, !109, !144, !161}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!162 = !{!163}
!163 = !DISubrange(count: 1)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !111, file: !112, line: 76, baseType: !104, size: 64, offset: 512)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !111, file: !112, line: 77, baseType: !166, size: 32, offset: 576)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !73)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !111, file: !112, line: 78, baseType: !168, size: 64, offset: 640)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !169)
!169 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !111, file: !112, line: 78, baseType: !168, size: 64, offset: 704)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !111, file: !112, line: 78, baseType: !168, size: 64, offset: 768)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !111, file: !112, line: 78, baseType: !168, size: 64, offset: 832)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !111, file: !112, line: 79, baseType: !174, size: 64, offset: 896)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !177, line: 27, baseType: !178)
!177 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !179, line: 43, baseType: !180)
!179 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!180 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !111, file: !112, line: 80, baseType: !166, size: 32, offset: 960)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !111, file: !112, line: 81, baseType: !183, size: 32, offset: 992)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !73)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !111, file: !112, line: 82, baseType: !185, size: 64, offset: 1024)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !111, file: !112, line: 83, baseType: !189, size: 64, offset: 1088)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !111, file: !112, line: 84, baseType: !102, size: 64, offset: 1152)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !111, file: !112, line: 85, baseType: !102, size: 64, offset: 1216)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !111, file: !112, line: 86, baseType: !102, size: 64, offset: 1280)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !111, file: !112, line: 87, baseType: !102, size: 64, offset: 1344)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !111, file: !112, line: 88, baseType: !109, size: 64, offset: 1408)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !111, file: !112, line: 89, baseType: !174, size: 64, offset: 1472)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !111, file: !112, line: 90, baseType: !102, size: 64, offset: 1536)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !111, file: !112, line: 91, baseType: !102, size: 64, offset: 1600)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !111, file: !112, line: 92, baseType: !166, size: 32, offset: 1664)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !111, file: !112, line: 93, baseType: !108, size: 64, offset: 1728)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !111, file: !112, line: 94, baseType: !203, size: 64, offset: 1792)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !175)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !111, file: !112, line: 95, baseType: !166, size: 32, offset: 1856)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !111, file: !112, line: 95, baseType: !166, size: 32, offset: 1888)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !111, file: !112, line: 96, baseType: !207, size: 64, offset: 1920)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !111, file: !112, line: 96, baseType: !207, size: 64, offset: 1984)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !111, file: !112, line: 97, baseType: !210, size: 64, offset: 2048)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !111, file: !112, line: 97, baseType: !212, size: 64, offset: 2112)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !111, file: !112, line: 98, baseType: !166, size: 32, offset: 2176)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !111, file: !112, line: 98, baseType: !166, size: 32, offset: 2208)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !111, file: !112, line: 99, baseType: !207, size: 64, offset: 2240)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !111, file: !112, line: 99, baseType: !207, size: 64, offset: 2304)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !111, file: !112, line: 100, baseType: !218, size: 64, offset: 2368)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !169)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !111, file: !112, line: 100, baseType: !221, size: 64, offset: 2432)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !111, file: !112, line: 101, baseType: !166, size: 32, offset: 2496)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !111, file: !112, line: 101, baseType: !166, size: 32, offset: 2528)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !111, file: !112, line: 102, baseType: !207, size: 64, offset: 2560)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !111, file: !112, line: 102, baseType: !207, size: 64, offset: 2624)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !111, file: !112, line: 103, baseType: !227, size: 64, offset: 2688)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !219)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !111, file: !112, line: 103, baseType: !230, size: 64, offset: 2752)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !111, file: !112, line: 104, baseType: !161, size: 64, offset: 2816)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !111, file: !112, line: 105, baseType: !166, size: 32, offset: 2880)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !111, file: !112, line: 106, baseType: !234, size: 128, offset: 2944)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 128, elements: !241)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !112, line: 64, baseType: !237)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !112, line: 61, size: 128, elements: !238)
!238 = !{!239, !240}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !237, file: !112, line: 62, baseType: !154, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !237, file: !112, line: 63, baseType: !108, size: 64, offset: 64)
!241 = !{!242}
!242 = !DISubrange(count: 2)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !111, file: !112, line: 107, baseType: !244, size: 64, offset: 3072)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 64, elements: !241)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !111, file: !112, line: 108, baseType: !108, size: 64, offset: 3136)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !111, file: !112, line: 109, baseType: !247, size: 64, offset: 3200)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!125, !108}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !111, file: !112, line: 111, baseType: !166, size: 32, offset: 3264)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !111, file: !112, line: 112, baseType: !252, size: 320, offset: 3328)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 320, elements: !298)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!125, !256, !109, !108}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !259)
!259 = !{!260, !261, !286, !287, !288, !289, !290, !291, !292, !293, !294}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !258, file: !10, line: 100, baseType: !166, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !258, file: !10, line: 101, baseType: !262, size: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !265)
!265 = !{!266, !267, !268, !269, !270, !273, !274, !275, !279, !281, !283, !284, !285}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !264, file: !10, line: 84, baseType: !102, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !264, file: !10, line: 85, baseType: !102, size: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !264, file: !10, line: 86, baseType: !108, size: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !264, file: !10, line: 87, baseType: !185, size: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !264, file: !10, line: 88, baseType: !271, size: 64, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !264, file: !10, line: 89, baseType: !103, size: 8, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !264, file: !10, line: 90, baseType: !102, size: 64, offset: 384)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !264, file: !10, line: 91, baseType: !276, size: 64, offset: 448)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !277, line: 46, baseType: !278)
!277 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!278 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !264, file: !10, line: 92, baseType: !280, size: 32, offset: 512)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !264, file: !10, line: 93, baseType: !282, size: 32, offset: 544)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !264, file: !10, line: 94, baseType: !262, size: 64, offset: 576)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !264, file: !10, line: 95, baseType: !102, size: 64, offset: 640)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !264, file: !10, line: 96, baseType: !108, size: 64, offset: 704)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !258, file: !10, line: 102, baseType: !102, size: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !258, file: !10, line: 102, baseType: !102, size: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !258, file: !10, line: 103, baseType: !102, size: 64, offset: 256)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !258, file: !10, line: 104, baseType: !104, size: 64, offset: 320)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !258, file: !10, line: 105, baseType: !280, size: 32, offset: 384)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !258, file: !10, line: 105, baseType: !280, size: 32, offset: 416)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !258, file: !10, line: 105, baseType: !280, size: 32, offset: 448)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !258, file: !10, line: 106, baseType: !109, size: 64, offset: 512)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !258, file: !10, line: 107, baseType: !295, size: 64, offset: 576)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!298 = !{!299}
!299 = !DISubrange(count: 5)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !111, file: !112, line: 113, baseType: !301, size: 320, offset: 3648)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 320, elements: !298)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!125, !109, !108}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !111, file: !112, line: 114, baseType: !306, size: 320, offset: 3968)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 320, elements: !298)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !111, file: !112, line: 115, baseType: !280, size: 32, offset: 4288)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !111, file: !112, line: 120, baseType: !295, size: 64, offset: 4352)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !111, file: !112, line: 121, baseType: !280, size: 32, offset: 4416)
!310 = !{i32 7, !"Dwarf Version", i32 4}
!311 = !{i32 2, !"Debug Info Version", i32 3}
!312 = !{i32 1, !"wchar_size", i32 4}
!313 = !{i32 7, !"PIC Level", i32 2}
!314 = !{i32 7, !"uwtable", i32 1}
!315 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!316 = distinct !DISubprogram(name: "DMPlexCreatePLYFromFile", scope: !317, file: !317, line: 20, type: !318, scopeLine: 21, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1068)
!317 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/dm/impls/plex/plexply.c", directory: "/home/users/ndemeye/xSDK")
!318 = !DISubroutineType(types: !319)
!319 = !{!125, !104, !144, !280, !320}
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !41, line: 14, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !47, line: 202, size: 40000, elements: !324)
!324 = !{!325, !327, !563, !567, !568, !569, !570, !580, !581, !589, !590, !598, !599, !600, !601, !605, !606, !610, !612, !614, !615, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !643, !655, !667, !679, !688, !689, !712, !713, !714, !715, !716, !717, !719, !810, !811, !831, !832, !833, !834, !835, !836, !840, !841, !845, !846, !847, !848, !849, !850, !851, !852, !853, !856, !868, !869, !870, !879, !967, !968, !1056, !1057, !1058, !1059, !1061, !1063, !1064, !1065, !1066, !1067}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !323, file: !47, line: 203, baseType: !326, size: 4480)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !112, line: 122, baseType: !111)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !323, file: !47, line: 203, baseType: !328, size: 3456, offset: 4480)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 3456, elements: !162)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMOps", file: !47, line: 30, size: 3456, elements: !330)
!330 = !{!331, !335, !336, !340, !344, !348, !349, !350, !359, !360, !361, !373, !374, !382, !391, !400, !404, !408, !409, !414, !415, !419, !420, !424, !425, !433, !437, !442, !443, !444, !445, !446, !447, !448, !452, !458, !462, !467, !471, !482, !486, !491, !498, !502, !503, !509, !520, !524, !534, !538, !546, !550, !558, !559}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !329, file: !47, line: 31, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!125, !321, !131}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !329, file: !47, line: 32, baseType: !332, size: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !329, file: !47, line: 33, baseType: !337, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!125, !321, !320}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !329, file: !47, line: 34, baseType: !341, size: 64, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!125, !256, !321}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !329, file: !47, line: 35, baseType: !345, size: 64, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!125, !321}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalsection", scope: !329, file: !47, line: 36, baseType: !345, size: 64, offset: 320)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "createdefaultconstraints", scope: !329, file: !47, line: 37, baseType: !345, size: 64, offset: 384)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "createglobalvector", scope: !329, file: !47, line: 38, baseType: !351, size: 64, offset: 448)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!125, !321, !354}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !356, line: 21, baseType: !357)
!356 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !356, line: 21, flags: DIFlagFwdDecl)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalvector", scope: !329, file: !47, line: 39, baseType: !351, size: 64, offset: 512)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "getlocaltoglobalmapping", scope: !329, file: !47, line: 40, baseType: !345, size: 64, offset: 576)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "createfieldis", scope: !329, file: !47, line: 41, baseType: !362, size: 64, offset: 640)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!125, !321, !210, !365, !367}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !370, line: 11, baseType: !371)
!370 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !370, line: 11, flags: DIFlagFwdDecl)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatedm", scope: !329, file: !47, line: 42, baseType: !337, size: 64, offset: 704)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatefield", scope: !329, file: !47, line: 43, baseType: !375, size: 64, offset: 768)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!125, !321, !378}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMField", file: !41, line: 165, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMField", file: !41, line: 165, flags: DIFlagFwdDecl)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "getcoloring", scope: !329, file: !47, line: 45, baseType: !383, size: 64, offset: 832)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!125, !321, !386, !387}
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !25, line: 213, baseType: !24)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !370, line: 51, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !370, line: 51, flags: DIFlagFwdDecl)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "creatematrix", scope: !329, file: !47, line: 46, baseType: !392, size: 64, offset: 896)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!125, !321, !395}
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !397, line: 16, baseType: !398)
!397 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !397, line: 16, flags: DIFlagFwdDecl)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "createinterpolation", scope: !329, file: !47, line: 47, baseType: !401, size: 64, offset: 960)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!125, !321, !321, !395, !354}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "createrestriction", scope: !329, file: !47, line: 48, baseType: !405, size: 64, offset: 1024)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!125, !321, !321, !395}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "createmassmatrix", scope: !329, file: !47, line: 49, baseType: !405, size: 64, offset: 1088)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "hascreateinjection", scope: !329, file: !47, line: 50, baseType: !410, size: 64, offset: 1152)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!125, !321, !413}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "createinjection", scope: !329, file: !47, line: 51, baseType: !405, size: 64, offset: 1216)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !329, file: !47, line: 53, baseType: !416, size: 64, offset: 1280)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!125, !321, !104, !320}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "coarsen", scope: !329, file: !47, line: 54, baseType: !416, size: 64, offset: 1344)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "refinehierarchy", scope: !329, file: !47, line: 55, baseType: !421, size: 64, offset: 1408)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!125, !321, !166, !320}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhierarchy", scope: !329, file: !47, line: 56, baseType: !421, size: 64, offset: 1472)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "adaptlabel", scope: !329, file: !47, line: 57, baseType: !426, size: 64, offset: 1536)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!125, !321, !429, !320}
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabel", file: !430, line: 12, baseType: !431)
!430 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmlabel.h", directory: "/home/users/ndemeye/xSDK")
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMLabel", file: !430, line: 12, flags: DIFlagFwdDecl)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "adaptmetric", scope: !329, file: !47, line: 58, baseType: !434, size: 64, offset: 1600)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{!125, !321, !355, !429, !320}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalbegin", scope: !329, file: !47, line: 60, baseType: !438, size: 64, offset: 1664)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!125, !321, !355, !441, !355}
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !29)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalend", scope: !329, file: !47, line: 61, baseType: !438, size: 64, offset: 1728)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalbegin", scope: !329, file: !47, line: 62, baseType: !438, size: 64, offset: 1792)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalend", scope: !329, file: !47, line: 63, baseType: !438, size: 64, offset: 1856)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalbegin", scope: !329, file: !47, line: 64, baseType: !438, size: 64, offset: 1920)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalend", scope: !329, file: !47, line: 65, baseType: !438, size: 64, offset: 1984)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !329, file: !47, line: 67, baseType: !345, size: 64, offset: 2048)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !329, file: !47, line: 69, baseType: !449, size: 64, offset: 2112)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!125, !321, !355, !355}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "createsubdm", scope: !329, file: !47, line: 71, baseType: !453, size: 64, offset: 2176)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!125, !321, !166, !456, !368, !320}
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "createsuperdm", scope: !329, file: !47, line: 72, baseType: !459, size: 64, offset: 2240)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!125, !320, !166, !367, !320}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "createfielddecomposition", scope: !329, file: !47, line: 73, baseType: !463, size: 64, offset: 2304)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!125, !321, !210, !365, !367, !466}
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "createdomaindecomposition", scope: !329, file: !47, line: 74, baseType: !468, size: 64, offset: 2368)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!125, !321, !210, !365, !367, !367, !466}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "createddscatters", scope: !329, file: !47, line: 75, baseType: !472, size: 64, offset: 2432)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!125, !321, !166, !320, !475, !475, !475}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !478, line: 59, baseType: !479)
!478 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !478, line: 15, baseType: !480)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !478, line: 15, flags: DIFlagFwdDecl)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "getdimpoints", scope: !329, file: !47, line: 77, baseType: !483, size: 64, offset: 2496)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{!125, !321, !166, !210, !210}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "locatepoints", scope: !329, file: !47, line: 78, baseType: !487, size: 64, offset: 2560)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!125, !321, !355, !490, !479}
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMPointLocationType", file: !41, line: 74, baseType: !40)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "getneighbors", scope: !329, file: !47, line: 79, baseType: !492, size: 64, offset: 2624)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!125, !321, !210, !495}
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !183)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "getboundingbox", scope: !329, file: !47, line: 80, baseType: !499, size: 64, offset: 2688)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{!125, !321, !218, !218}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalboundingbox", scope: !329, file: !47, line: 81, baseType: !499, size: 64, offset: 2752)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "locatepointssubdomain", scope: !329, file: !47, line: 82, baseType: !504, size: 64, offset: 2816)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!125, !321, !355, !507}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlocal", scope: !329, file: !47, line: 84, baseType: !510, size: 64, offset: 2880)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{!125, !321, !219, !513, !519, !441, !355}
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{!125, !166, !219, !517, !166, !227, !108}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !219)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlabellocal", scope: !329, file: !47, line: 85, baseType: !521, size: 64, offset: 2944)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{!125, !321, !219, !429, !166, !456, !166, !456, !513, !519, !441, !355}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlocal", scope: !329, file: !47, line: 86, baseType: !525, size: 64, offset: 3008)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!125, !321, !219, !355, !528, !441, !355}
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{null, !166, !166, !166, !456, !456, !532, !532, !532, !456, !456, !532, !532, !532, !219, !517, !166, !532, !227}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !228)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlabellocal", scope: !329, file: !47, line: 87, baseType: !535, size: 64, offset: 3072)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!125, !321, !219, !429, !166, !456, !166, !456, !355, !528, !441, !355}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "projectbdfieldlabellocal", scope: !329, file: !47, line: 88, baseType: !539, size: 64, offset: 3136)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!125, !321, !219, !429, !166, !456, !166, !456, !355, !542, !441, !355}
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{null, !166, !166, !166, !456, !456, !532, !532, !532, !456, !456, !532, !532, !532, !219, !517, !517, !166, !532, !227}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "computel2diff", scope: !329, file: !47, line: 89, baseType: !547, size: 64, offset: 3200)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{!125, !321, !219, !513, !519, !355, !218}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "computel2gradientdiff", scope: !329, file: !47, line: 90, baseType: !551, size: 64, offset: 3264)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!125, !321, !219, !554, !519, !355, !517, !218}
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!125, !166, !219, !517, !517, !166, !227, !108}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "computel2fielddiff", scope: !329, file: !47, line: 91, baseType: !547, size: 64, offset: 3328)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "getcompatibility", scope: !329, file: !47, line: 93, baseType: !560, size: 64, offset: 3392)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{!125, !321, !321, !413, !413}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "localin", scope: !323, file: !47, line: 204, baseType: !564, size: 6400, offset: 7936)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, size: 6400, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 100)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "localout", scope: !323, file: !47, line: 204, baseType: !564, size: 6400, offset: 14336)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "globalin", scope: !323, file: !47, line: 205, baseType: !564, size: 6400, offset: 20736)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "globalout", scope: !323, file: !47, line: 205, baseType: !564, size: 6400, offset: 27136)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "namedglobal", scope: !323, file: !47, line: 206, baseType: !571, size: 64, offset: 33536)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMNamedVecLink", file: !47, line: 141, baseType: !572)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMNamedVecLink", file: !47, line: 142, size: 256, elements: !574)
!574 = !{!575, !576, !577, !579}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !573, file: !47, line: 143, baseType: !355, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !573, file: !47, line: 144, baseType: !102, size: 64, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !573, file: !47, line: 145, baseType: !578, size: 32, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMVecStatus", file: !47, line: 140, baseType: !46)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !573, file: !47, line: 146, baseType: !571, size: 64, offset: 192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "namedlocal", scope: !323, file: !47, line: 207, baseType: !571, size: 64, offset: 33600)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !323, file: !47, line: 208, baseType: !582, size: 64, offset: 33664)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMWorkLink", file: !47, line: 149, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMWorkLink", file: !47, line: 150, size: 192, elements: !585)
!585 = !{!586, !587, !588}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !584, file: !47, line: 151, baseType: !276, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !584, file: !47, line: 152, baseType: !108, size: 64, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !584, file: !47, line: 153, baseType: !582, size: 64, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !323, file: !47, line: 208, baseType: !582, size: 64, offset: 33728)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !323, file: !47, line: 209, baseType: !591, size: 64, offset: 33792)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabelLink", file: !47, line: 163, baseType: !592)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DMLabelLink", file: !47, line: 158, size: 192, elements: !594)
!594 = !{!595, !596, !597}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !593, file: !47, line: 159, baseType: !429, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !593, file: !47, line: 160, baseType: !280, size: 32, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !593, file: !47, line: 161, baseType: !592, size: 64, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "depthLabel", scope: !323, file: !47, line: 210, baseType: !429, size: 64, offset: 33856)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "celltypeLabel", scope: !323, file: !47, line: 211, baseType: !429, size: 64, offset: 33920)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !323, file: !47, line: 212, baseType: !108, size: 64, offset: 33984)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "ctxdestroy", scope: !323, file: !47, line: 213, baseType: !602, size: 64, offset: 34048)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!125, !519}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "coloringtype", scope: !323, file: !47, line: 214, baseType: !386, size: 32, offset: 34112)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !323, file: !47, line: 215, baseType: !607, size: 64, offset: 34176)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !397, line: 1378, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !397, line: 1378, flags: DIFlagFwdDecl)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "vectype", scope: !323, file: !47, line: 216, baseType: !611, size: 64, offset: 34240)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecType", file: !356, line: 83, baseType: !144)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "mattype", scope: !323, file: !47, line: 217, baseType: !613, size: 64, offset: 34304)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !397, line: 25, baseType: !144)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !323, file: !47, line: 218, baseType: !166, size: 32, offset: 34368)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ltogmap", scope: !323, file: !47, line: 219, baseType: !616, size: 64, offset: 34432)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !370, line: 30, baseType: !617)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !370, line: 30, flags: DIFlagFwdDecl)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_only", scope: !323, file: !47, line: 220, baseType: !280, size: 32, offset: 34496)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "structure_only", scope: !323, file: !47, line: 221, baseType: !280, size: 32, offset: 34528)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "levelup", scope: !323, file: !47, line: 222, baseType: !166, size: 32, offset: 34560)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "leveldown", scope: !323, file: !47, line: 222, baseType: !166, size: 32, offset: 34592)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !323, file: !47, line: 223, baseType: !280, size: 32, offset: 34624)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !323, file: !47, line: 224, baseType: !280, size: 32, offset: 34656)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !323, file: !47, line: 225, baseType: !108, size: 64, offset: 34688)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "coarseMesh", scope: !323, file: !47, line: 227, baseType: !321, size: 64, offset: 34752)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "fineMesh", scope: !323, file: !47, line: 228, baseType: !321, size: 64, offset: 34816)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !323, file: !47, line: 229, baseType: !629, size: 64, offset: 34880)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCoarsenHookLink", file: !47, line: 100, baseType: !630)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMCoarsenHookLink", file: !47, line: 101, size: 256, elements: !632)
!632 = !{!633, !637, !641, !642}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !631, file: !47, line: 102, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!125, !321, !321, !108}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !631, file: !47, line: 103, baseType: !638, size: 64, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!125, !321, !396, !355, !396, !321, !108}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !631, file: !47, line: 104, baseType: !108, size: 64, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !631, file: !47, line: 105, baseType: !629, size: 64, offset: 192)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !323, file: !47, line: 230, baseType: !644, size: 64, offset: 34944)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMRefineHookLink", file: !47, line: 108, baseType: !645)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMRefineHookLink", file: !47, line: 109, size: 256, elements: !647)
!647 = !{!648, !649, !653, !654}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !646, file: !47, line: 110, baseType: !634, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "interphook", scope: !646, file: !47, line: 111, baseType: !650, size: 64, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{!125, !321, !396, !321, !108}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !646, file: !47, line: 112, baseType: !108, size: 64, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !646, file: !47, line: 113, baseType: !644, size: 64, offset: 192)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "subdomainhook", scope: !323, file: !47, line: 231, baseType: !656, size: 64, offset: 35008)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSubDomainHookLink", file: !47, line: 116, baseType: !657)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMSubDomainHookLink", file: !47, line: 117, size: 256, elements: !659)
!659 = !{!660, !661, !665, !666}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ddhook", scope: !658, file: !47, line: 118, baseType: !634, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !658, file: !47, line: 119, baseType: !662, size: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{!125, !321, !477, !477, !321, !108}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !658, file: !47, line: 120, baseType: !108, size: 64, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !658, file: !47, line: 121, baseType: !656, size: 64, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "gtolhook", scope: !323, file: !47, line: 232, baseType: !668, size: 64, offset: 35072)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGlobalToLocalHookLink", file: !47, line: 124, baseType: !669)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMGlobalToLocalHookLink", file: !47, line: 125, size: 256, elements: !671)
!671 = !{!672, !676, !677, !678}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !670, file: !47, line: 126, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!125, !321, !355, !441, !355, !108}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !670, file: !47, line: 127, baseType: !673, size: 64, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !670, file: !47, line: 128, baseType: !108, size: 64, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !670, file: !47, line: 129, baseType: !668, size: 64, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ltoghook", scope: !323, file: !47, line: 233, baseType: !680, size: 64, offset: 35136)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLocalToGlobalHookLink", file: !47, line: 132, baseType: !681)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMLocalToGlobalHookLink", file: !47, line: 133, size: 256, elements: !683)
!683 = !{!684, !685, !686, !687}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !682, file: !47, line: 134, baseType: !673, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !682, file: !47, line: 135, baseType: !673, size: 64, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !682, file: !47, line: 136, baseType: !108, size: 64, offset: 128)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !682, file: !47, line: 137, baseType: !680, size: 64, offset: 192)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !323, file: !47, line: 235, baseType: !166, size: 32, offset: 35200)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "auxData", scope: !323, file: !47, line: 237, baseType: !690, size: 64, offset: 35264)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapAux", file: !47, line: 27, baseType: !691)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapAux_t", file: !47, line: 27, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapAux_s", file: !47, line: 27, size: 320, elements: !694)
!694 = !{!695, !699, !700, !701, !702, !704, !711}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !693, file: !47, line: 27, baseType: !696, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !697, line: 166, baseType: !698)
!697 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/khash/khash.h", directory: "/home/users/ndemeye/xSDK")
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !697, line: 139, baseType: !5)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !693, file: !47, line: 27, baseType: !696, size: 32, offset: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !693, file: !47, line: 27, baseType: !696, size: 32, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !693, file: !47, line: 27, baseType: !696, size: 32, offset: 96)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !693, file: !47, line: 27, baseType: !703, size: 64, offset: 128)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !693, file: !47, line: 27, baseType: !705, size: 64, offset: 192)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHashAuxKey", file: !47, line: 21, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscHashAuxKey", file: !47, line: 17, size: 128, elements: !708)
!708 = !{!709, !710}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !707, file: !47, line: 19, baseType: !429, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !707, file: !47, line: 20, baseType: !166, size: 32, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !693, file: !47, line: 27, baseType: !354, size: 64, offset: 256)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "sfMigration", scope: !323, file: !47, line: 239, baseType: !479, size: 64, offset: 35328)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !323, file: !47, line: 240, baseType: !479, size: 64, offset: 35392)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "sectionSF", scope: !323, file: !47, line: 241, baseType: !479, size: 64, offset: 35456)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "sfNatural", scope: !323, file: !47, line: 242, baseType: !479, size: 64, offset: 35520)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "useNatural", scope: !323, file: !47, line: 243, baseType: !280, size: 32, offset: 35584)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !323, file: !47, line: 245, baseType: !718, size: 64, offset: 35616)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 64, elements: !241)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "localSection", scope: !323, file: !47, line: 246, baseType: !720, size: 64, offset: 35712)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !721, line: 18, baseType: !722)
!721 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !724, line: 29, size: 5760, elements: !725)
!724 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sectionimpl.h", directory: "/home/users/ndemeye/xSDK")
!725 = !{!726, !727, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !745, !746, !747, !748, !773, !774, !775}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !723, file: !724, line: 30, baseType: !326, size: 4480)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !723, file: !724, line: 30, baseType: !728, size: 32, offset: 4480)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 32, elements: !162)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "pStart", scope: !723, file: !724, line: 31, baseType: !166, size: 32, offset: 4512)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "pEnd", scope: !723, file: !724, line: 31, baseType: !166, size: 32, offset: 4544)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !723, file: !724, line: 32, baseType: !369, size: 64, offset: 4608)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "pointMajor", scope: !723, file: !724, line: 33, baseType: !280, size: 32, offset: 4672)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "includesConstraints", scope: !723, file: !724, line: 34, baseType: !280, size: 32, offset: 4704)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "atlasDof", scope: !723, file: !724, line: 35, baseType: !210, size: 64, offset: 4736)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "atlasOff", scope: !723, file: !724, line: 36, baseType: !210, size: 64, offset: 4800)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "maxDof", scope: !723, file: !724, line: 37, baseType: !166, size: 32, offset: 4864)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !723, file: !724, line: 38, baseType: !720, size: 64, offset: 4928)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "bcIndices", scope: !723, file: !724, line: 39, baseType: !210, size: 64, offset: 4992)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !723, file: !724, line: 40, baseType: !280, size: 32, offset: 5056)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "numFields", scope: !723, file: !724, line: 42, baseType: !166, size: 32, offset: 5088)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "fieldNames", scope: !723, file: !724, line: 43, baseType: !366, size: 64, offset: 5120)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "numFieldComponents", scope: !723, file: !724, line: 44, baseType: !210, size: 64, offset: 5184)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !723, file: !724, line: 45, baseType: !744, size: 64, offset: 5248)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "useFieldOff", scope: !723, file: !724, line: 46, baseType: !280, size: 32, offset: 5312)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "compNames", scope: !723, file: !724, line: 47, baseType: !365, size: 64, offset: 5376)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "clObj", scope: !723, file: !724, line: 49, baseType: !109, size: 64, offset: 5440)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "clHash", scope: !723, file: !724, line: 50, baseType: !749, size: 64, offset: 5504)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClPerm", file: !724, line: 27, baseType: !750)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_ClPerm_t", file: !724, line: 27, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_ClPerm_s", file: !724, line: 27, size: 320, elements: !753)
!753 = !{!754, !755, !756, !757, !758, !759, !766}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !752, file: !724, line: 27, baseType: !696, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !752, file: !724, line: 27, baseType: !696, size: 32, offset: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !752, file: !724, line: 27, baseType: !696, size: 32, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !752, file: !724, line: 27, baseType: !696, size: 32, offset: 96)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !752, file: !724, line: 27, baseType: !703, size: 64, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !752, file: !724, line: 27, baseType: !760, size: 64, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermKey", file: !724, line: 10, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PetscSectionClosurePermKey", file: !724, line: 8, size: 64, elements: !763)
!763 = !{!764, !765}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !762, file: !724, line: 9, baseType: !166, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !762, file: !724, line: 9, baseType: !166, size: 32, offset: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !752, file: !724, line: 27, baseType: !767, size: 64, offset: 256)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermVal", file: !724, line: 14, baseType: !769)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !724, line: 12, size: 128, elements: !770)
!770 = !{!771, !772}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !769, file: !724, line: 13, baseType: !210, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "invPerm", scope: !769, file: !724, line: 13, baseType: !210, size: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "clSection", scope: !723, file: !724, line: 51, baseType: !720, size: 64, offset: 5568)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "clPoints", scope: !723, file: !724, line: 52, baseType: !369, size: 64, offset: 5632)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !723, file: !724, line: 53, baseType: !776, size: 64, offset: 5696)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionSym", file: !721, line: 33, baseType: !777)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSectionSym", file: !724, line: 72, size: 4864, elements: !779)
!779 = !{!780, !781, !799, !800, !809}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !778, file: !724, line: 73, baseType: !326, size: 4480)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !778, file: !724, line: 73, baseType: !782, size: 192, offset: 4480)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !783, size: 192, elements: !162)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSectionSymOps", file: !724, line: 56, size: 192, elements: !784)
!784 = !{!785, !791, !795}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "getpoints", scope: !783, file: !724, line: 57, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!125, !776, !720, !166, !456, !789, !790}
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !783, file: !724, line: 58, baseType: !792, size: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{!125, !776}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !783, file: !724, line: 59, baseType: !796, size: 64, offset: 128)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{!125, !776, !131}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !778, file: !724, line: 74, baseType: !108, size: 64, offset: 4672)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !778, file: !724, line: 75, baseType: !801, size: 64, offset: 4736)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "SymWorkLink", file: !724, line: 62, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_SymWorkLink", file: !724, line: 64, size: 256, elements: !804)
!804 = !{!805, !806, !807, !808}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !803, file: !724, line: 66, baseType: !801, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "perms", scope: !803, file: !724, line: 67, baseType: !789, size: 64, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "rots", scope: !803, file: !724, line: 68, baseType: !790, size: 64, offset: 128)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "numPoints", scope: !803, file: !724, line: 69, baseType: !166, size: 32, offset: 192)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !778, file: !724, line: 76, baseType: !801, size: 64, offset: 4800)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "globalSection", scope: !323, file: !47, line: 247, baseType: !720, size: 64, offset: 35776)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !323, file: !47, line: 248, baseType: !812, size: 64, offset: 35840)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !370, line: 60, baseType: !813)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !25, line: 240, size: 640, elements: !815)
!815 = !{!816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !814, file: !25, line: 241, baseType: !104, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !814, file: !25, line: 242, baseType: !183, size: 32, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !814, file: !25, line: 243, baseType: !166, size: 32, offset: 96)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !814, file: !25, line: 243, baseType: !166, size: 32, offset: 128)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !814, file: !25, line: 244, baseType: !166, size: 32, offset: 160)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !814, file: !25, line: 244, baseType: !166, size: 32, offset: 192)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !814, file: !25, line: 245, baseType: !210, size: 64, offset: 256)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !814, file: !25, line: 246, baseType: !280, size: 32, offset: 320)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !814, file: !25, line: 247, baseType: !166, size: 32, offset: 352)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !814, file: !25, line: 251, baseType: !166, size: 32, offset: 384)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !814, file: !25, line: 252, baseType: !616, size: 64, offset: 448)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !814, file: !25, line: 253, baseType: !280, size: 32, offset: 512)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !814, file: !25, line: 254, baseType: !166, size: 32, offset: 544)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !814, file: !25, line: 254, baseType: !166, size: 32, offset: 576)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !814, file: !25, line: 255, baseType: !166, size: 32, offset: 608)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintSection", scope: !323, file: !47, line: 250, baseType: !720, size: 64, offset: 35904)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintMat", scope: !323, file: !47, line: 251, baseType: !396, size: 64, offset: 35968)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "transformDM", scope: !323, file: !47, line: 253, baseType: !321, size: 64, offset: 36032)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !323, file: !47, line: 254, baseType: !355, size: 64, offset: 36096)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "transformCtx", scope: !323, file: !47, line: 255, baseType: !108, size: 64, offset: 36160)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "transformSetUp", scope: !323, file: !47, line: 256, baseType: !837, size: 64, offset: 36224)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{!125, !321, !108}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "transformDestroy", scope: !323, file: !47, line: 257, baseType: !837, size: 64, offset: 36288)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "transformGetMatrix", scope: !323, file: !47, line: 258, baseType: !842, size: 64, offset: 36352)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!125, !321, !517, !280, !790, !108}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !323, file: !47, line: 260, baseType: !166, size: 32, offset: 36416)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateDM", scope: !323, file: !47, line: 261, baseType: !321, size: 64, offset: 36480)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "coordinates", scope: !323, file: !47, line: 262, baseType: !355, size: 64, offset: 36544)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatesLocal", scope: !323, file: !47, line: 263, baseType: !355, size: 64, offset: 36608)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !323, file: !47, line: 264, baseType: !280, size: 32, offset: 36672)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateField", scope: !323, file: !47, line: 265, baseType: !379, size: 64, offset: 36736)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !323, file: !47, line: 266, baseType: !218, size: 64, offset: 36800)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "maxCell", scope: !323, file: !47, line: 266, baseType: !218, size: 64, offset: 36864)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "bdtype", scope: !323, file: !47, line: 267, baseType: !854, size: 64, offset: 36928)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryType", file: !41, line: 42, baseType: !51)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "nullspaceConstructors", scope: !323, file: !47, line: 269, baseType: !857, size: 640, offset: 36992)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !858, size: 640, elements: !866)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "NullSpaceFunc", file: !47, line: 15, baseType: !859)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!125, !321, !166, !166, !862}
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !397, line: 1723, baseType: !864)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !397, line: 1723, flags: DIFlagFwdDecl)
!866 = !{!867}
!867 = !DISubrange(count: 10)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullspaceConstructors", scope: !323, file: !47, line: 270, baseType: !857, size: 640, offset: 37632)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !323, file: !47, line: 272, baseType: !166, size: 32, offset: 38272)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !323, file: !47, line: 273, baseType: !871, size: 64, offset: 38336)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "RegionField", file: !47, line: 178, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Field", file: !47, line: 173, size: 256, elements: !874)
!874 = !{!875, !876, !877, !878}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !873, file: !47, line: 174, baseType: !109, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !873, file: !47, line: 175, baseType: !429, size: 64, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !873, file: !47, line: 176, baseType: !718, size: 64, offset: 128)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "avoidTensor", scope: !873, file: !47, line: 177, baseType: !280, size: 32, offset: 192)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !323, file: !47, line: 274, baseType: !880, size: 64, offset: 38400)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundary", file: !47, line: 165, baseType: !881)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Boundary", file: !47, line: 167, size: 192, elements: !883)
!883 = !{!884, !965, !966}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "dsboundary", scope: !882, file: !47, line: 168, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSBoundary", file: !886, line: 11, baseType: !887)
!886 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscdsimpl.h", directory: "/home/users/ndemeye/xSDK")
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DSBoundary", file: !886, line: 13, size: 832, elements: !889)
!889 = !{!890, !891, !892, !893, !894, !895, !956, !958, !959, !960, !961, !962, !963, !964}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !888, file: !886, line: 14, baseType: !144, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !888, file: !886, line: 15, baseType: !429, size: 64, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "lname", scope: !888, file: !886, line: 16, baseType: !144, size: 64, offset: 128)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "Nv", scope: !888, file: !886, line: 17, baseType: !166, size: 32, offset: 192)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !888, file: !886, line: 18, baseType: !210, size: 64, offset: 256)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "wf", scope: !888, file: !886, line: 19, baseType: !896, size: 64, offset: 320)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscWeakForm", file: !897, line: 22, baseType: !898)
!897 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdstypes.h", directory: "/home/users/ndemeye/xSDK")
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscWeakForm", file: !886, line: 81, size: 4992, elements: !900)
!900 = !{!901, !902, !916, !917, !918, !927}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !899, file: !886, line: 82, baseType: !326, size: 4480)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !899, file: !886, line: 82, baseType: !903, size: 256, offset: 4480)
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !904, size: 256, elements: !162)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscWeakFormOps", file: !886, line: 74, size: 256, elements: !905)
!905 = !{!906, !910, !911, !915}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !904, file: !886, line: 75, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!125, !896}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !904, file: !886, line: 76, baseType: !907, size: 64, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !904, file: !886, line: 77, baseType: !912, size: 64, offset: 128)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{!125, !896, !131}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !904, file: !886, line: 78, baseType: !907, size: 64, offset: 192)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !899, file: !886, line: 83, baseType: !108, size: 64, offset: 4736)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !899, file: !886, line: 85, baseType: !166, size: 32, offset: 4800)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !899, file: !886, line: 86, baseType: !919, size: 64, offset: 4864)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunkBuffer", file: !886, line: 41, baseType: !921)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !886, line: 36, size: 256, elements: !922)
!922 = !{!923, !924, !925, !926}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !921, file: !886, line: 37, baseType: !276, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !921, file: !886, line: 38, baseType: !276, size: 64, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "unitbytes", scope: !921, file: !886, line: 39, baseType: !276, size: 64, offset: 128)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !921, file: !886, line: 40, baseType: !102, size: 64, offset: 192)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "form", scope: !899, file: !886, line: 87, baseType: !928, size: 64, offset: 4928)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapForm", file: !886, line: 54, baseType: !930)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapForm_t", file: !886, line: 54, baseType: !932)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapForm_s", file: !886, line: 54, size: 320, elements: !933)
!933 = !{!934, !935, !936, !937, !938, !939, !948}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !932, file: !886, line: 54, baseType: !696, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !932, file: !886, line: 54, baseType: !696, size: 32, offset: 32)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !932, file: !886, line: 54, baseType: !696, size: 32, offset: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !932, file: !886, line: 54, baseType: !696, size: 32, offset: 96)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !932, file: !886, line: 54, baseType: !703, size: 64, offset: 128)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !932, file: !886, line: 54, baseType: !940, size: 64, offset: 192)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFormKey", file: !897, line: 41, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscFormKey", file: !897, line: 35, size: 192, elements: !943)
!943 = !{!944, !945, !946, !947}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !942, file: !897, line: 37, baseType: !429, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !942, file: !897, line: 38, baseType: !166, size: 32, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !942, file: !897, line: 39, baseType: !166, size: 32, offset: 96)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !942, file: !897, line: 40, baseType: !166, size: 32, offset: 128)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !932, file: !886, line: 54, baseType: !949, size: 64, offset: 256)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunk", file: !886, line: 34, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !886, line: 30, size: 96, elements: !952)
!952 = !{!953, !954, !955}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !951, file: !886, line: 31, baseType: !166, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !951, file: !886, line: 32, baseType: !166, size: 32, offset: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !951, file: !886, line: 33, baseType: !166, size: 32, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !888, file: !886, line: 20, baseType: !957, size: 32, offset: 384)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryConditionType", file: !41, line: 60, baseType: !58)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !888, file: !886, line: 21, baseType: !166, size: 32, offset: 416)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !888, file: !886, line: 22, baseType: !166, size: 32, offset: 448)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "comps", scope: !888, file: !886, line: 23, baseType: !210, size: 64, offset: 512)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !888, file: !886, line: 24, baseType: !154, size: 64, offset: 576)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "func_t", scope: !888, file: !886, line: 25, baseType: !154, size: 64, offset: 640)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !888, file: !886, line: 26, baseType: !108, size: 64, offset: 704)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !888, file: !886, line: 27, baseType: !885, size: 64, offset: 768)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !882, file: !47, line: 169, baseType: !429, size: 64, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !882, file: !47, line: 170, baseType: !880, size: 64, offset: 128)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "Nds", scope: !323, file: !47, line: 275, baseType: !166, size: 32, offset: 38464)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "probs", scope: !323, file: !47, line: 276, baseType: !969, size: 64, offset: 38528)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSpace", file: !47, line: 184, baseType: !971)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Space", file: !47, line: 180, size: 192, elements: !972)
!972 = !{!973, !1054, !1055}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !971, file: !47, line: 181, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDS", file: !897, line: 13, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDS", file: !886, line: 98, size: 7232, elements: !977)
!977 = !{!978, !979, !993, !994, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1010, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !976, file: !886, line: 99, baseType: !326, size: 4480)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !976, file: !886, line: 99, baseType: !980, size: 256, offset: 4480)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !981, size: 256, elements: !162)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscDSOps", file: !886, line: 91, size: 256, elements: !982)
!982 = !{!983, !987, !988, !992}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !981, file: !886, line: 92, baseType: !984, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!125, !974}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !981, file: !886, line: 93, baseType: !984, size: 64, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !981, file: !886, line: 94, baseType: !989, size: 64, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!125, !974, !131}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !981, file: !886, line: 95, baseType: !984, size: 64, offset: 192)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !976, file: !886, line: 100, baseType: !108, size: 64, offset: 4736)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "subprobs", scope: !976, file: !886, line: 101, baseType: !995, size: 64, offset: 4800)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !976, file: !886, line: 102, baseType: !280, size: 32, offset: 4864)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "isHybrid", scope: !976, file: !886, line: 103, baseType: !280, size: 32, offset: 4896)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !976, file: !886, line: 104, baseType: !166, size: 32, offset: 4928)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !976, file: !886, line: 105, baseType: !166, size: 32, offset: 4960)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !976, file: !886, line: 106, baseType: !139, size: 64, offset: 4992)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !976, file: !886, line: 108, baseType: !885, size: 64, offset: 5056)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "useJacPre", scope: !976, file: !886, line: 109, baseType: !280, size: 32, offset: 5120)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "implicit", scope: !976, file: !886, line: 110, baseType: !413, size: 64, offset: 5184)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "jetDegree", scope: !976, file: !886, line: 111, baseType: !210, size: 64, offset: 5248)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "wf", scope: !976, file: !886, line: 112, baseType: !896, size: 64, offset: 5312)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !976, file: !886, line: 113, baseType: !1007, size: 64, offset: 5376)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscPointFunc", file: !1009, line: 563, baseType: !529)
!1009 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscds.h", directory: "/home/users/ndemeye/xSDK")
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "exactSol", scope: !976, file: !886, line: 114, baseType: !1011, size: 64, offset: 5440)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSimplePointFunc", file: !1009, line: 580, baseType: !514)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "exactCtx", scope: !976, file: !886, line: 115, baseType: !519, size: 64, offset: 5504)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "exactSol_t", scope: !976, file: !886, line: 116, baseType: !1011, size: 64, offset: 5568)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "exactCtx_t", scope: !976, file: !886, line: 117, baseType: !519, size: 64, offset: 5632)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "numConstants", scope: !976, file: !886, line: 118, baseType: !166, size: 32, offset: 5696)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "constants", scope: !976, file: !886, line: 119, baseType: !227, size: 64, offset: 5760)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !976, file: !886, line: 120, baseType: !519, size: 64, offset: 5824)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "totDim", scope: !976, file: !886, line: 122, baseType: !166, size: 32, offset: 5888)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "totComp", scope: !976, file: !886, line: 123, baseType: !166, size: 32, offset: 5920)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !976, file: !886, line: 124, baseType: !210, size: 64, offset: 5952)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "Nb", scope: !976, file: !886, line: 125, baseType: !210, size: 64, offset: 6016)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !976, file: !886, line: 126, baseType: !210, size: 64, offset: 6080)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "offDer", scope: !976, file: !886, line: 127, baseType: !210, size: 64, offset: 6144)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !976, file: !886, line: 128, baseType: !1026, size: 64, offset: 6208)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscTabulation", file: !1028, line: 481, baseType: !1029)
!1028 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdt.h", directory: "/home/users/ndemeye/xSDK")
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscTabulation", file: !1028, line: 469, size: 256, elements: !1031)
!1031 = !{!1032, !1033, !1034, !1035, !1036, !1037, !1038}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "K", scope: !1030, file: !1028, line: 470, baseType: !166, size: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "Nr", scope: !1030, file: !1028, line: 471, baseType: !166, size: 32, offset: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "Np", scope: !1030, file: !1028, line: 472, baseType: !166, size: 32, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "Nb", scope: !1030, file: !1028, line: 473, baseType: !166, size: 32, offset: 96)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !1030, file: !1028, line: 474, baseType: !166, size: 32, offset: 128)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "cdim", scope: !1030, file: !1028, line: 475, baseType: !166, size: 32, offset: 160)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !1030, file: !1028, line: 476, baseType: !221, size: 64, offset: 192)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "Tf", scope: !976, file: !886, line: 129, baseType: !1026, size: 64, offset: 6272)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !976, file: !886, line: 131, baseType: !227, size: 64, offset: 6336)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "u_t", scope: !976, file: !886, line: 132, baseType: !227, size: 64, offset: 6400)
