; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/mf/snesmfj.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/mf/snesmfj.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_SNES = type { %struct._p_PetscObject, [1 x %struct._SNESOps], %struct._p_DM*, i32, %struct._p_SNES*, i32, i32, i8*, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Mat*, i8*, %struct._p_KSP*, %struct._p_LineSearch*, i32, i32, %struct._p_Vec*, %struct._p_Vec*, i8*, double, [5 x i32 (%struct._p_SNES*, i32, double, i8*)*], [5 x i32 (i8**)*], [5 x i8*], i32, i8*, i32, [5 x i32 (%struct._p_SNES*, i8*)*], [5 x i32 (i8**)*], [5 x i8*], i32, i32, i32, i8*, i32, i32, i32, i32, i32, double, double, double, double, double, double, double, double, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct._p_Vec**, i32, double*, i32*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, double, double, %struct._p_Vec**, i32, i32, i32, i32, double, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 }

!316 = !{!317, !318, !319, !320}
!317 = !DIEnumerator(name: "PC_SIDE_DEFAULT", value: -1)
!318 = !DIEnumerator(name: "PC_LEFT", value: 0)
!319 = !DIEnumerator(name: "PC_RIGHT", value: 1)
!320 = !DIEnumerator(name: "PC_SYMMETRIC", value: 2)
!321 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 406, baseType: !26, size: 32, elements: !322)
!322 = !{!323, !324, !325, !326, !327, !328}
!323 = !DIEnumerator(name: "SNES_NORM_DEFAULT", value: -1)
!324 = !DIEnumerator(name: "SNES_NORM_NONE", value: 0)
!325 = !DIEnumerator(name: "SNES_NORM_ALWAYS", value: 1)
!326 = !DIEnumerator(name: "SNES_NORM_INITIAL_ONLY", value: 2)
!327 = !DIEnumerator(name: "SNES_NORM_FINAL_ONLY", value: 3)
!328 = !DIEnumerator(name: "SNES_NORM_INITIAL_FINAL_ONLY", value: 4)
!329 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 493, baseType: !26, size: 32, elements: !330)
!330 = !{!331, !332, !333}
!331 = !DIEnumerator(name: "SNES_FUNCTION_DEFAULT", value: -1)
!332 = !DIEnumerator(name: "SNES_FUNCTION_UNPRECONDITIONED", value: 0)
!333 = !DIEnumerator(name: "SNES_FUNCTION_PRECONDITIONED", value: 1)
!334 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !335, line: 663, baseType: !5, size: 32, elements: !336)
!335 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!336 = !{!337, !338, !339}
!337 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!338 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!339 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!340 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !341)
!341 = !{!342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359}
!342 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!343 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!344 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!345 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!346 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!347 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!348 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!349 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!350 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!351 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!352 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!353 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!354 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!355 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!356 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!357 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!358 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!359 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!360 = !{!361, !365, !366, !369, !391, !1520, !1523, !1521}
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !362, line: 330, baseType: !363)
!362 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !362, line: 330, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !368)
!368 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !25, line: 18, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !372, line: 38, size: 11648, elements: !373)
!372 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/snesimpl.h", directory: "/home/users/ndemeye/xSDK")
!373 = !{!374, !576, !1406, !1411, !1412, !1413, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1429, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1444, !1446, !1447, !1448, !1449, !1450, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1486, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !371, file: !372, line: 39, baseType: !375, size: 4480)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !376, line: 122, baseType: !377)
!376 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !376, line: 73, size: 4480, elements: !378)
!378 = !{!379, !381, !429, !430, !432, !435, !436, !437, !438, !446, !447, !449, !453, !457, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !470, !471, !472, !474, !475, !477, !479, !480, !481, !482, !483, !486, !488, !489, !490, !491, !492, !495, !497, !498, !499, !509, !511, !512, !516, !517, !566, !571, !573, !574, !575}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !377, file: !376, line: 74, baseType: !380, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !377, file: !376, line: 75, baseType: !382, size: 448, offset: 64)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 448, elements: !427)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !376, line: 53, baseType: !384)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !376, line: 45, size: 448, elements: !385)
!385 = !{!386, !394, !402, !407, !411, !415, !422}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !384, file: !376, line: 46, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!390, !391, !393}
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !384, file: !376, line: 47, baseType: !395, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!390, !391, !398}
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !399, line: 16, baseType: !400)
!399 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !399, line: 16, flags: DIFlagFwdDecl)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !384, file: !376, line: 48, baseType: !403, size: 64, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!390, !406}
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !384, file: !376, line: 49, baseType: !408, size: 64, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!390, !391, !366, !391}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !384, file: !376, line: 50, baseType: !412, size: 64, offset: 256)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!390, !391, !366, !406}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !384, file: !376, line: 51, baseType: !416, size: 64, offset: 320)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!390, !391, !366, !419}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{null}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !384, file: !376, line: 52, baseType: !423, size: 64, offset: 384)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!390, !391, !366, !426}
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!427 = !{!428}
!428 = !DISubrange(count: 1)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !377, file: !376, line: 76, baseType: !361, size: 64, offset: 512)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !377, file: !376, line: 77, baseType: !431, size: 32, offset: 576)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !377, file: !376, line: 78, baseType: !433, size: 64, offset: 640)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !434)
!434 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !377, file: !376, line: 78, baseType: !433, size: 64, offset: 704)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !377, file: !376, line: 78, baseType: !433, size: 64, offset: 768)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !377, file: !376, line: 78, baseType: !433, size: 64, offset: 832)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !377, file: !376, line: 79, baseType: !439, size: 64, offset: 896)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !441)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !442, line: 27, baseType: !443)
!442 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !444, line: 43, baseType: !445)
!444 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!445 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !377, file: !376, line: 80, baseType: !431, size: 32, offset: 960)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !377, file: !376, line: 81, baseType: !448, size: 32, offset: 992)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !377, file: !376, line: 82, baseType: !450, size: 64, offset: 1024)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !377, file: !376, line: 83, baseType: !454, size: 64, offset: 1088)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !377, file: !376, line: 84, baseType: !458, size: 64, offset: 1152)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !377, file: !376, line: 85, baseType: !458, size: 64, offset: 1216)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !377, file: !376, line: 86, baseType: !458, size: 64, offset: 1280)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !377, file: !376, line: 87, baseType: !458, size: 64, offset: 1344)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !377, file: !376, line: 88, baseType: !391, size: 64, offset: 1408)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !377, file: !376, line: 89, baseType: !439, size: 64, offset: 1472)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !377, file: !376, line: 90, baseType: !458, size: 64, offset: 1536)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !377, file: !376, line: 91, baseType: !458, size: 64, offset: 1600)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !377, file: !376, line: 92, baseType: !431, size: 32, offset: 1664)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !377, file: !376, line: 93, baseType: !365, size: 64, offset: 1728)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !377, file: !376, line: 94, baseType: !469, size: 64, offset: 1792)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !440)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !377, file: !376, line: 95, baseType: !431, size: 32, offset: 1856)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !377, file: !376, line: 95, baseType: !431, size: 32, offset: 1888)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !377, file: !376, line: 96, baseType: !473, size: 64, offset: 1920)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !377, file: !376, line: 96, baseType: !473, size: 64, offset: 1984)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !377, file: !376, line: 97, baseType: !476, size: 64, offset: 2048)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !377, file: !376, line: 97, baseType: !478, size: 64, offset: 2112)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !377, file: !376, line: 98, baseType: !431, size: 32, offset: 2176)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !377, file: !376, line: 98, baseType: !431, size: 32, offset: 2208)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !377, file: !376, line: 99, baseType: !473, size: 64, offset: 2240)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !377, file: !376, line: 99, baseType: !473, size: 64, offset: 2304)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !377, file: !376, line: 100, baseType: !484, size: 64, offset: 2368)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !434)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !377, file: !376, line: 100, baseType: !487, size: 64, offset: 2432)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !377, file: !376, line: 101, baseType: !431, size: 32, offset: 2496)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !377, file: !376, line: 101, baseType: !431, size: 32, offset: 2528)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !377, file: !376, line: 102, baseType: !473, size: 64, offset: 2560)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !377, file: !376, line: 102, baseType: !473, size: 64, offset: 2624)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !377, file: !376, line: 103, baseType: !493, size: 64, offset: 2688)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !485)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !377, file: !376, line: 103, baseType: !496, size: 64, offset: 2752)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !377, file: !376, line: 104, baseType: !426, size: 64, offset: 2816)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !377, file: !376, line: 105, baseType: !431, size: 32, offset: 2880)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !377, file: !376, line: 106, baseType: !500, size: 128, offset: 2944)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 128, elements: !507)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !376, line: 64, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !376, line: 61, size: 128, elements: !504)
!504 = !{!505, !506}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !503, file: !376, line: 62, baseType: !419, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !503, file: !376, line: 63, baseType: !365, size: 64, offset: 64)
!507 = !{!508}
!508 = !DISubrange(count: 2)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !377, file: !376, line: 107, baseType: !510, size: 64, offset: 3072)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 64, elements: !507)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !377, file: !376, line: 108, baseType: !365, size: 64, offset: 3136)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !377, file: !376, line: 109, baseType: !513, size: 64, offset: 3200)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!390, !365}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !377, file: !376, line: 111, baseType: !431, size: 32, offset: 3264)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !377, file: !376, line: 112, baseType: !518, size: 320, offset: 3328)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !519, size: 320, elements: !564)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{!390, !522, !391, !365}
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !525)
!525 = !{!526, !527, !552, !553, !554, !555, !556, !557, !558, !559, !560}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !524, file: !10, line: 100, baseType: !431, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !524, file: !10, line: 101, baseType: !528, size: 64, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !531)
!531 = !{!532, !533, !534, !535, !536, !539, !540, !541, !545, !547, !549, !550, !551}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !530, file: !10, line: 84, baseType: !458, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !530, file: !10, line: 85, baseType: !458, size: 64, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !530, file: !10, line: 86, baseType: !365, size: 64, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !530, file: !10, line: 87, baseType: !450, size: 64, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !530, file: !10, line: 88, baseType: !537, size: 64, offset: 256)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !366)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !530, file: !10, line: 89, baseType: !368, size: 8, offset: 320)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !530, file: !10, line: 90, baseType: !458, size: 64, offset: 384)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !530, file: !10, line: 91, baseType: !542, size: 64, offset: 448)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !543, line: 46, baseType: !544)
!543 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!544 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !530, file: !10, line: 92, baseType: !546, size: 32, offset: 512)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !530, file: !10, line: 93, baseType: !548, size: 32, offset: 544)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !530, file: !10, line: 94, baseType: !528, size: 64, offset: 576)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !530, file: !10, line: 95, baseType: !458, size: 64, offset: 640)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !530, file: !10, line: 96, baseType: !365, size: 64, offset: 704)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !524, file: !10, line: 102, baseType: !458, size: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !524, file: !10, line: 102, baseType: !458, size: 64, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !524, file: !10, line: 103, baseType: !458, size: 64, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !524, file: !10, line: 104, baseType: !361, size: 64, offset: 320)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !524, file: !10, line: 105, baseType: !546, size: 32, offset: 384)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !524, file: !10, line: 105, baseType: !546, size: 32, offset: 416)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !524, file: !10, line: 105, baseType: !546, size: 32, offset: 448)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !524, file: !10, line: 106, baseType: !391, size: 64, offset: 512)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !524, file: !10, line: 107, baseType: !561, size: 64, offset: 576)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !562)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!564 = !{!565}
!565 = !DISubrange(count: 5)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !377, file: !376, line: 113, baseType: !567, size: 320, offset: 3648)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 320, elements: !564)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!390, !391, !365}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !377, file: !376, line: 114, baseType: !572, size: 320, offset: 3968)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 320, elements: !564)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !377, file: !376, line: 115, baseType: !546, size: 32, offset: 4288)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !377, file: !376, line: 120, baseType: !561, size: 64, offset: 4352)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !377, file: !376, line: 121, baseType: !546, size: 32, offset: 4416)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !371, file: !372, line: 39, baseType: !577, size: 1088, offset: 4480)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 1088, elements: !427)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SNESOps", file: !372, line: 12, size: 1088, elements: !579)
!579 = !{!580, !587, !591, !595, !601, !602, !606, !607, !611, !615, !616, !617, !622, !626, !630, !634, !1405}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "computeinitialguess", scope: !578, file: !372, line: 13, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{!390, !369, !584, !365}
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !81, line: 21, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !81, line: 21, flags: DIFlagFwdDecl)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "computescaling", scope: !578, file: !372, line: 14, baseType: !588, size: 64, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!390, !584, !584, !365}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !578, file: !372, line: 15, baseType: !592, size: 64, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!390, !369, !431}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !578, file: !372, line: 16, baseType: !596, size: 64, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{!390, !369, !431, !485, !485, !485, !599, !365}
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESConvergedReason", file: !25, line: 257, baseType: !24)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !578, file: !372, line: 17, baseType: !513, size: 64, offset: 256)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !578, file: !372, line: 18, baseType: !603, size: 64, offset: 320)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!390, !369}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !578, file: !372, line: 19, baseType: !603, size: 64, offset: 384)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !578, file: !372, line: 20, baseType: !608, size: 64, offset: 448)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!390, !369, !398}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !578, file: !372, line: 21, baseType: !612, size: 64, offset: 512)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{!390, !522, !369}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !578, file: !372, line: 22, baseType: !603, size: 64, offset: 576)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !578, file: !372, line: 23, baseType: !603, size: 64, offset: 640)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "usercompute", scope: !578, file: !372, line: 24, baseType: !618, size: 64, offset: 704)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{!390, !369, !621}
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "userdestroy", scope: !578, file: !372, line: 25, baseType: !623, size: 64, offset: 768)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{!390, !621}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !578, file: !372, line: 26, baseType: !627, size: 64, offset: 832)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!390, !369, !584, !584}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "computepfunction", scope: !578, file: !372, line: 27, baseType: !631, size: 64, offset: 896)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!390, !369, !584, !584, !365}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "computepjacobian", scope: !578, file: !372, line: 28, baseType: !635, size: 64, offset: 960)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!390, !369, !584, !638, !638, !365}
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !57, line: 16, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !641, line: 436, size: 23424, elements: !642)
!641 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!642 = !{!643, !644, !1148, !1168, !1169, !1170, !1172, !1173, !1174, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1301, !1302, !1318, !1319, !1320, !1321, !1322, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1357, !1377, !1378, !1380, !1381, !1382, !1383, !1384, !1385, !1403, !1404}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !640, file: !641, line: 437, baseType: !375, size: 4480)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !640, file: !641, line: 437, baseType: !645, size: 9472, offset: 4480)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !646, size: 9472, elements: !427)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !641, line: 32, size: 9472, elements: !647)
!647 = !{!648, !657, !661, !662, !666, !670, !671, !672, !673, !674, !675, !676, !700, !704, !709, !715, !734, !739, !743, !744, !749, !754, !755, !760, !764, !768, !772, !776, !780, !781, !782, !783, !784, !788, !789, !794, !795, !796, !797, !798, !803, !810, !815, !819, !823, !827, !831, !832, !836, !837, !844, !849, !850, !851, !852, !914, !922, !923, !927, !928, !932, !933, !937, !942, !943, !947, !951, !958, !959, !960, !961, !962, !963, !968, !969, !973, !977, !981, !982, !983, !987, !997, !998, !1002, !1003, !1007, !1008, !1012, !1013, !1018, !1019, !1023, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1037, !1038, !1039, !1040, !1041, !1042, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1057, !1061, !1062, !1063, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1077, !1078, !1079, !1084, !1088, !1089, !1093, !1094, !1095, !1096, !1122, !1126, !1127, !1128, !1129, !1130, !1134, !1135, !1136, !1137, !1138, !1142, !1146, !1147}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !646, file: !641, line: 34, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{!390, !638, !431, !652, !431, !652, !654, !656}
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !431)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !45)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !646, file: !641, line: 35, baseType: !658, size: 64, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!390, !638, !431, !476, !478, !496}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !646, file: !641, line: 36, baseType: !658, size: 64, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !646, file: !641, line: 37, baseType: !663, size: 64, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!390, !638, !584, !584}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !646, file: !641, line: 38, baseType: !667, size: 64, offset: 256)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!390, !638, !584, !584, !584}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !646, file: !641, line: 40, baseType: !663, size: 64, offset: 320)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !646, file: !641, line: 41, baseType: !667, size: 64, offset: 384)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !646, file: !641, line: 42, baseType: !663, size: 64, offset: 448)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !646, file: !641, line: 43, baseType: !667, size: 64, offset: 512)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !646, file: !641, line: 44, baseType: !663, size: 64, offset: 576)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !646, file: !641, line: 46, baseType: !667, size: 64, offset: 640)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !646, file: !641, line: 47, baseType: !677, size: 64, offset: 704)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!390, !638, !680, !680, !684}
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !681, line: 11, baseType: !682)
!681 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !681, line: 11, flags: DIFlagFwdDecl)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !686)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !57, line: 1239, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !57, line: 1226, size: 704, elements: !688)
!688 = !{!689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !687, file: !57, line: 1227, baseType: !485, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !687, file: !57, line: 1228, baseType: !485, size: 64, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !687, file: !57, line: 1229, baseType: !485, size: 64, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !687, file: !57, line: 1230, baseType: !485, size: 64, offset: 192)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !687, file: !57, line: 1231, baseType: !485, size: 64, offset: 256)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !687, file: !57, line: 1232, baseType: !485, size: 64, offset: 320)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !687, file: !57, line: 1233, baseType: !485, size: 64, offset: 384)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !687, file: !57, line: 1234, baseType: !485, size: 64, offset: 448)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !687, file: !57, line: 1236, baseType: !485, size: 64, offset: 512)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !687, file: !57, line: 1237, baseType: !485, size: 64, offset: 576)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !687, file: !57, line: 1238, baseType: !485, size: 64, offset: 640)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !646, file: !641, line: 48, baseType: !701, size: 64, offset: 768)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!390, !638, !680, !684}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !646, file: !641, line: 49, baseType: !705, size: 64, offset: 832)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!390, !638, !584, !485, !708, !485, !431, !431, !584}
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !57, line: 1291, baseType: !56)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !646, file: !641, line: 50, baseType: !710, size: 64, offset: 896)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!390, !638, !713, !714}
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !57, line: 238, baseType: !69)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !646, file: !641, line: 52, baseType: !716, size: 64, offset: 960)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!390, !638, !719, !720}
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !57, line: 612, baseType: !75)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !57, line: 600, baseType: !722)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !57, line: 592, size: 640, elements: !723)
!723 = !{!724, !725, !726, !727, !728, !729, !730, !731, !732, !733}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !722, file: !57, line: 593, baseType: !433, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !722, file: !57, line: 594, baseType: !433, size: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !722, file: !57, line: 594, baseType: !433, size: 64, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !722, file: !57, line: 594, baseType: !433, size: 64, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !722, file: !57, line: 595, baseType: !433, size: 64, offset: 256)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !722, file: !57, line: 596, baseType: !433, size: 64, offset: 320)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !722, file: !57, line: 597, baseType: !433, size: 64, offset: 384)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !722, file: !57, line: 598, baseType: !433, size: 64, offset: 448)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !722, file: !57, line: 598, baseType: !433, size: 64, offset: 512)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !722, file: !57, line: 599, baseType: !433, size: 64, offset: 576)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !646, file: !641, line: 53, baseType: !735, size: 64, offset: 1024)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!390, !638, !638, !738}
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !646, file: !641, line: 54, baseType: !740, size: 64, offset: 1088)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{!390, !638, !584}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !646, file: !641, line: 55, baseType: !663, size: 64, offset: 1152)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !646, file: !641, line: 56, baseType: !745, size: 64, offset: 1216)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!390, !638, !748, !484}
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !81, line: 155, baseType: !80)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !646, file: !641, line: 58, baseType: !750, size: 64, offset: 1280)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!390, !638, !753}
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !57, line: 424, baseType: !88)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !646, file: !641, line: 59, baseType: !750, size: 64, offset: 1344)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !646, file: !641, line: 60, baseType: !756, size: 64, offset: 1408)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!390, !638, !759, !546}
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !57, line: 469, baseType: !92)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !646, file: !641, line: 61, baseType: !761, size: 64, offset: 1472)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!390, !638}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !646, file: !641, line: 63, baseType: !765, size: 64, offset: 1536)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!390, !638, !431, !652, !494, !584, !584}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !646, file: !641, line: 64, baseType: !769, size: 64, offset: 1600)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{!390, !638, !638, !680, !680, !684}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !646, file: !641, line: 65, baseType: !773, size: 64, offset: 1664)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{!390, !638, !638, !684}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !646, file: !641, line: 66, baseType: !777, size: 64, offset: 1728)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!390, !638, !638, !680, !684}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !646, file: !641, line: 67, baseType: !773, size: 64, offset: 1792)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !646, file: !641, line: 69, baseType: !761, size: 64, offset: 1856)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !646, file: !641, line: 70, baseType: !769, size: 64, offset: 1920)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !646, file: !641, line: 71, baseType: !777, size: 64, offset: 1984)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !646, file: !641, line: 72, baseType: !785, size: 64, offset: 2048)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{!390, !638, !714}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !646, file: !641, line: 73, baseType: !761, size: 64, offset: 2112)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !646, file: !641, line: 75, baseType: !790, size: 64, offset: 2176)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{!390, !638, !793, !714}
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !57, line: 563, baseType: !122)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !646, file: !641, line: 76, baseType: !663, size: 64, offset: 2240)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !646, file: !641, line: 77, baseType: !663, size: 64, offset: 2304)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !646, file: !641, line: 78, baseType: !677, size: 64, offset: 2368)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !646, file: !641, line: 79, baseType: !701, size: 64, offset: 2432)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !646, file: !641, line: 81, baseType: !799, size: 64, offset: 2496)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!390, !638, !494, !638, !802}
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !57, line: 285, baseType: !127)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !646, file: !641, line: 82, baseType: !804, size: 64, offset: 2560)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!390, !638, !431, !807, !807, !713, !809}
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !680)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !646, file: !641, line: 83, baseType: !811, size: 64, offset: 2624)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DISubroutineType(types: !813)
!813 = !{!390, !638, !431, !814, !431}
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !646, file: !641, line: 84, baseType: !816, size: 64, offset: 2688)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{!390, !638, !431, !652, !431, !652, !493}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !646, file: !641, line: 85, baseType: !820, size: 64, offset: 2752)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{!390, !638, !638, !802}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !646, file: !641, line: 87, baseType: !824, size: 64, offset: 2816)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DISubroutineType(types: !826)
!826 = !{!390, !638, !584, !476}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !646, file: !641, line: 88, baseType: !828, size: 64, offset: 2880)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DISubroutineType(types: !830)
!830 = !{!390, !638, !494}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !646, file: !641, line: 89, baseType: !828, size: 64, offset: 2944)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !646, file: !641, line: 90, baseType: !833, size: 64, offset: 3008)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{!390, !638, !584, !656}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !646, file: !641, line: 91, baseType: !765, size: 64, offset: 3072)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !646, file: !641, line: 93, baseType: !838, size: 64, offset: 3136)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!390, !638, !841}
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !842)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !646, file: !641, line: 94, baseType: !845, size: 64, offset: 3200)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{!390, !638, !431, !546, !546, !476, !848, !848, !738}
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !646, file: !641, line: 95, baseType: !845, size: 64, offset: 3264)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !646, file: !641, line: 96, baseType: !845, size: 64, offset: 3328)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !646, file: !641, line: 97, baseType: !845, size: 64, offset: 3392)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !646, file: !641, line: 99, baseType: !853, size: 64, offset: 3456)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{!390, !638, !856, !859}
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !681, line: 51, baseType: !857)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !681, line: 51, flags: DIFlagFwdDecl)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !57, line: 1378, baseType: !860)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !641, line: 609, size: 6208, elements: !862)
!862 = !{!863, !864, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !883, !890, !891, !892, !893, !894, !895, !896, !897, !901, !902, !903, !904, !905, !907, !908, !909, !910, !911, !912, !913}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !861, file: !641, line: 610, baseType: !375, size: 4480)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !861, file: !641, line: 610, baseType: !865, size: 32, offset: 4480)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 32, elements: !427)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !861, file: !641, line: 611, baseType: !431, size: 32, offset: 4512)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !861, file: !641, line: 611, baseType: !431, size: 32, offset: 4544)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !861, file: !641, line: 611, baseType: !431, size: 32, offset: 4576)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !861, file: !641, line: 612, baseType: !431, size: 32, offset: 4608)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !861, file: !641, line: 613, baseType: !431, size: 32, offset: 4640)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !861, file: !641, line: 614, baseType: !476, size: 64, offset: 4672)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !861, file: !641, line: 615, baseType: !478, size: 64, offset: 4736)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !861, file: !641, line: 616, baseType: !814, size: 64, offset: 4800)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !861, file: !641, line: 617, baseType: !476, size: 64, offset: 4864)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !861, file: !641, line: 618, baseType: !876, size: 64, offset: 4928)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !641, line: 602, baseType: !878)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !641, line: 598, size: 128, elements: !879)
!879 = !{!880, !881, !882}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !878, file: !641, line: 599, baseType: !431, size: 32)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !878, file: !641, line: 600, baseType: !431, size: 32, offset: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !878, file: !641, line: 601, baseType: !493, size: 64, offset: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !861, file: !641, line: 619, baseType: !884, size: 64, offset: 4992)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !641, line: 607, baseType: !886)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !641, line: 604, size: 128, elements: !887)
!887 = !{!888, !889}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !886, file: !641, line: 605, baseType: !431, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !886, file: !641, line: 606, baseType: !493, size: 64, offset: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !861, file: !641, line: 620, baseType: !493, size: 64, offset: 5056)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !861, file: !641, line: 621, baseType: !485, size: 64, offset: 5120)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !861, file: !641, line: 622, baseType: !485, size: 64, offset: 5184)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !861, file: !641, line: 623, baseType: !584, size: 64, offset: 5248)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !861, file: !641, line: 623, baseType: !584, size: 64, offset: 5312)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !861, file: !641, line: 623, baseType: !584, size: 64, offset: 5376)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !861, file: !641, line: 624, baseType: !546, size: 32, offset: 5440)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !861, file: !641, line: 625, baseType: !898, size: 64, offset: 5504)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{!390}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !861, file: !641, line: 626, baseType: !365, size: 64, offset: 5568)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !861, file: !641, line: 627, baseType: !584, size: 64, offset: 5632)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !861, file: !641, line: 628, baseType: !431, size: 32, offset: 5696)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !861, file: !641, line: 629, baseType: !366, size: 64, offset: 5760)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !861, file: !641, line: 630, baseType: !906, size: 32, offset: 5824)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !134, line: 213, baseType: !133)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !861, file: !641, line: 631, baseType: !431, size: 32, offset: 5856)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !861, file: !641, line: 631, baseType: !431, size: 32, offset: 5888)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !861, file: !641, line: 632, baseType: !546, size: 32, offset: 5920)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !861, file: !641, line: 633, baseType: !546, size: 32, offset: 5952)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !861, file: !641, line: 634, baseType: !419, size: 64, offset: 6016)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !861, file: !641, line: 634, baseType: !365, size: 64, offset: 6080)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !861, file: !641, line: 635, baseType: !439, size: 64, offset: 6144)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !646, file: !641, line: 100, baseType: !915, size: 64, offset: 3520)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!390, !638, !431, !431, !918, !921}
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !134, line: 215, baseType: !920)
!920 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !646, file: !641, line: 101, baseType: !761, size: 64, offset: 3584)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !646, file: !641, line: 102, baseType: !924, size: 64, offset: 3648)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{!390, !638, !680, !680, !714}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !646, file: !641, line: 103, baseType: !649, size: 64, offset: 3712)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !646, file: !641, line: 105, baseType: !929, size: 64, offset: 3776)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{!390, !638, !680, !680, !713, !714}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !646, file: !641, line: 106, baseType: !761, size: 64, offset: 3840)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !646, file: !641, line: 107, baseType: !934, size: 64, offset: 3904)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!390, !638, !398}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !646, file: !641, line: 108, baseType: !938, size: 64, offset: 3968)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!390, !638, !941, !713, !714}
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !57, line: 25, baseType: !366)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !646, file: !641, line: 109, baseType: !898, size: 64, offset: 4032)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !646, file: !641, line: 111, baseType: !944, size: 64, offset: 4096)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{!390, !638, !638, !638, !485, !638}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !646, file: !641, line: 112, baseType: !948, size: 64, offset: 4160)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{!390, !638, !638, !638, !638}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !646, file: !641, line: 113, baseType: !952, size: 64, offset: 4224)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DISubroutineType(types: !954)
!954 = !{!390, !638, !955, !955}
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !681, line: 30, baseType: !956)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !681, line: 30, flags: DIFlagFwdDecl)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !646, file: !641, line: 114, baseType: !649, size: 64, offset: 4288)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !646, file: !641, line: 115, baseType: !765, size: 64, offset: 4352)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !646, file: !641, line: 117, baseType: !824, size: 64, offset: 4416)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !646, file: !641, line: 118, baseType: !824, size: 64, offset: 4480)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !646, file: !641, line: 119, baseType: !938, size: 64, offset: 4544)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !646, file: !641, line: 120, baseType: !964, size: 64, offset: 4608)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{!390, !638, !967, !738}
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !57, line: 1675, baseType: !138)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !646, file: !641, line: 121, baseType: !898, size: 64, offset: 4672)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !646, file: !641, line: 123, baseType: !970, size: 64, offset: 4736)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!390, !638, !431, !365}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !646, file: !641, line: 124, baseType: !974, size: 64, offset: 4800)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!390, !638, !859, !584, !365}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !646, file: !641, line: 125, baseType: !978, size: 64, offset: 4864)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!390, !522, !638}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !646, file: !641, line: 126, baseType: !663, size: 64, offset: 4928)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !646, file: !641, line: 127, baseType: !663, size: 64, offset: 4992)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !646, file: !641, line: 129, baseType: !984, size: 64, offset: 5056)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!390, !638, !814}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !646, file: !641, line: 130, baseType: !988, size: 64, offset: 5120)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!390, !638, !991, !991}
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !81, line: 654, baseType: !992)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !81, line: 653, size: 128, elements: !994)
!994 = !{!995, !996}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !993, file: !81, line: 653, baseType: !431, size: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !993, file: !81, line: 653, baseType: !584, size: 64, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !646, file: !641, line: 131, baseType: !988, size: 64, offset: 5184)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !646, file: !641, line: 132, baseType: !999, size: 64, offset: 5248)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!390, !638, !476, !476, !476}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !646, file: !641, line: 133, baseType: !934, size: 64, offset: 5312)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !646, file: !641, line: 135, baseType: !1004, size: 64, offset: 5376)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!390, !638, !485, !738}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !646, file: !641, line: 136, baseType: !1004, size: 64, offset: 5440)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !646, file: !641, line: 137, baseType: !1009, size: 64, offset: 5504)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!390, !638, !738}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !646, file: !641, line: 138, baseType: !649, size: 64, offset: 5568)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !646, file: !641, line: 139, baseType: !1014, size: 64, offset: 5632)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!390, !638, !1017, !1017}
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !646, file: !641, line: 141, baseType: !898, size: 64, offset: 5696)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !646, file: !641, line: 142, baseType: !1020, size: 64, offset: 5760)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!390, !638, !638, !485, !638}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !646, file: !641, line: 143, baseType: !1024, size: 64, offset: 5824)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!390, !638, !638, !638}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !646, file: !641, line: 144, baseType: !898, size: 64, offset: 5888)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !646, file: !641, line: 145, baseType: !1020, size: 64, offset: 5952)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !646, file: !641, line: 147, baseType: !1024, size: 64, offset: 6016)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !646, file: !641, line: 148, baseType: !898, size: 64, offset: 6080)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !646, file: !641, line: 149, baseType: !1020, size: 64, offset: 6144)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !646, file: !641, line: 150, baseType: !1024, size: 64, offset: 6208)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !646, file: !641, line: 151, baseType: !1034, size: 64, offset: 6272)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!390, !638, !546}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !646, file: !641, line: 153, baseType: !761, size: 64, offset: 6336)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !646, file: !641, line: 154, baseType: !761, size: 64, offset: 6400)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !646, file: !641, line: 155, baseType: !761, size: 64, offset: 6464)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !646, file: !641, line: 156, baseType: !761, size: 64, offset: 6528)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !646, file: !641, line: 157, baseType: !934, size: 64, offset: 6592)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !646, file: !641, line: 159, baseType: !1043, size: 64, offset: 6656)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!390, !638, !431, !654}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !646, file: !641, line: 160, baseType: !761, size: 64, offset: 6720)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !646, file: !641, line: 161, baseType: !761, size: 64, offset: 6784)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !646, file: !641, line: 162, baseType: !761, size: 64, offset: 6848)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !646, file: !641, line: 163, baseType: !761, size: 64, offset: 6912)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !646, file: !641, line: 165, baseType: !1024, size: 64, offset: 6976)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !646, file: !641, line: 166, baseType: !1024, size: 64, offset: 7040)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !646, file: !641, line: 167, baseType: !824, size: 64, offset: 7104)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !646, file: !641, line: 168, baseType: !1054, size: 64, offset: 7168)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!390, !638, !584, !431}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !646, file: !641, line: 169, baseType: !1058, size: 64, offset: 7232)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!390, !638, !738, !476}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !646, file: !641, line: 171, baseType: !785, size: 64, offset: 7296)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !646, file: !641, line: 172, baseType: !761, size: 64, offset: 7360)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !646, file: !641, line: 173, baseType: !1064, size: 64, offset: 7424)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!390, !638, !476, !848}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !646, file: !641, line: 174, baseType: !924, size: 64, offset: 7488)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !646, file: !641, line: 175, baseType: !924, size: 64, offset: 7552)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !646, file: !641, line: 177, baseType: !663, size: 64, offset: 7616)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !646, file: !641, line: 178, baseType: !710, size: 64, offset: 7680)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !646, file: !641, line: 179, baseType: !663, size: 64, offset: 7744)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !646, file: !641, line: 180, baseType: !667, size: 64, offset: 7808)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !646, file: !641, line: 181, baseType: !1074, size: 64, offset: 7872)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!390, !638, !361, !713, !714}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !646, file: !641, line: 183, baseType: !984, size: 64, offset: 7936)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !646, file: !641, line: 184, baseType: !745, size: 64, offset: 8000)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !646, file: !641, line: 185, baseType: !1080, size: 64, offset: 8064)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!390, !638, !1083}
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !646, file: !641, line: 186, baseType: !1085, size: 64, offset: 8128)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!390, !638, !431, !652, !493}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !646, file: !641, line: 187, baseType: !804, size: 64, offset: 8192)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !646, file: !641, line: 189, baseType: !1090, size: 64, offset: 8256)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!390, !638, !431, !431, !476, !654}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !646, file: !641, line: 190, baseType: !898, size: 64, offset: 8320)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !646, file: !641, line: 191, baseType: !1020, size: 64, offset: 8384)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !646, file: !641, line: 192, baseType: !1024, size: 64, offset: 8448)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !646, file: !641, line: 193, baseType: !1097, size: 64, offset: 8512)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!390, !638, !856, !1100}
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !57, line: 1401, baseType: !1101)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !641, line: 660, size: 5312, elements: !1103)
!1103 = !{!1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1102, file: !641, line: 661, baseType: !375, size: 4480)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1102, file: !641, line: 661, baseType: !865, size: 32, offset: 4480)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1102, file: !641, line: 662, baseType: !431, size: 32, offset: 4512)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1102, file: !641, line: 662, baseType: !431, size: 32, offset: 4544)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1102, file: !641, line: 662, baseType: !431, size: 32, offset: 4576)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1102, file: !641, line: 663, baseType: !431, size: 32, offset: 4608)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1102, file: !641, line: 664, baseType: !431, size: 32, offset: 4640)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1102, file: !641, line: 665, baseType: !476, size: 64, offset: 4672)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1102, file: !641, line: 666, baseType: !476, size: 64, offset: 4736)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1102, file: !641, line: 667, baseType: !431, size: 32, offset: 4800)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1102, file: !641, line: 668, baseType: !906, size: 32, offset: 4832)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1102, file: !641, line: 670, baseType: !476, size: 64, offset: 4864)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1102, file: !641, line: 670, baseType: !476, size: 64, offset: 4928)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1102, file: !641, line: 671, baseType: !476, size: 64, offset: 4992)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1102, file: !641, line: 672, baseType: !476, size: 64, offset: 5056)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1102, file: !641, line: 673, baseType: !476, size: 64, offset: 5120)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1102, file: !641, line: 674, baseType: !431, size: 32, offset: 5184)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1102, file: !641, line: 675, baseType: !476, size: 64, offset: 5248)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !646, file: !641, line: 195, baseType: !1123, size: 64, offset: 8576)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{!390, !1100, !638, !638}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !646, file: !641, line: 196, baseType: !1123, size: 64, offset: 8640)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !646, file: !641, line: 197, baseType: !898, size: 64, offset: 8704)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !646, file: !641, line: 198, baseType: !1020, size: 64, offset: 8768)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !646, file: !641, line: 199, baseType: !1024, size: 64, offset: 8832)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !646, file: !641, line: 201, baseType: !1131, size: 64, offset: 8896)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = !DISubroutineType(types: !1133)
!1133 = !{!390, !638, !431, !431}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !646, file: !641, line: 202, baseType: !799, size: 64, offset: 8960)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !646, file: !641, line: 203, baseType: !667, size: 64, offset: 9024)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !646, file: !641, line: 204, baseType: !853, size: 64, offset: 9088)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !646, file: !641, line: 205, baseType: !984, size: 64, offset: 9152)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !646, file: !641, line: 206, baseType: !1139, size: 64, offset: 9216)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = !DISubroutineType(types: !1141)
!1141 = !{!390, !361, !638, !431, !713, !714}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !646, file: !641, line: 208, baseType: !1143, size: 64, offset: 9280)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!390, !431, !809}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !646, file: !641, line: 209, baseType: !1024, size: 64, offset: 9344)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !646, file: !641, line: 210, baseType: !816, size: 64, offset: 9408)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !640, file: !641, line: 438, baseType: !1149, size: 64, offset: 13952)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !681, line: 60, baseType: !1150)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !134, line: 240, size: 640, elements: !1152)
!1152 = !{!1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1151, file: !134, line: 241, baseType: !361, size: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1151, file: !134, line: 242, baseType: !448, size: 32, offset: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1151, file: !134, line: 243, baseType: !431, size: 32, offset: 96)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1151, file: !134, line: 243, baseType: !431, size: 32, offset: 128)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1151, file: !134, line: 244, baseType: !431, size: 32, offset: 160)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1151, file: !134, line: 244, baseType: !431, size: 32, offset: 192)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1151, file: !134, line: 245, baseType: !476, size: 64, offset: 256)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1151, file: !134, line: 246, baseType: !546, size: 32, offset: 320)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1151, file: !134, line: 247, baseType: !431, size: 32, offset: 352)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1151, file: !134, line: 251, baseType: !431, size: 32, offset: 384)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1151, file: !134, line: 252, baseType: !955, size: 64, offset: 448)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1151, file: !134, line: 253, baseType: !546, size: 32, offset: 512)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1151, file: !134, line: 254, baseType: !431, size: 32, offset: 544)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1151, file: !134, line: 254, baseType: !431, size: 32, offset: 576)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1151, file: !134, line: 255, baseType: !431, size: 32, offset: 608)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !640, file: !641, line: 438, baseType: !1149, size: 64, offset: 14016)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !640, file: !641, line: 439, baseType: !365, size: 64, offset: 14080)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !640, file: !641, line: 440, baseType: !1171, size: 32, offset: 14144)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !57, line: 161, baseType: !283)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !640, file: !641, line: 441, baseType: !546, size: 32, offset: 14176)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !640, file: !641, line: 442, baseType: !546, size: 32, offset: 14208)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !640, file: !641, line: 443, baseType: !1175, size: 448, offset: 14272)
!1175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1176, size: 448, elements: !1177)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !57, line: 1159, baseType: !366)
!1177 = !{!1178}
!1178 = !DISubrange(count: 7)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !640, file: !641, line: 444, baseType: !546, size: 32, offset: 14720)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !640, file: !641, line: 445, baseType: !546, size: 32, offset: 14752)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !640, file: !641, line: 446, baseType: !431, size: 32, offset: 14784)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !640, file: !641, line: 447, baseType: !469, size: 64, offset: 14848)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !640, file: !641, line: 448, baseType: !469, size: 64, offset: 14912)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !640, file: !641, line: 449, baseType: !721, size: 640, offset: 14976)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !640, file: !641, line: 450, baseType: !656, size: 32, offset: 15616)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !640, file: !641, line: 451, baseType: !1187, size: 2880, offset: 15680)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !641, line: 318, baseType: !1188)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !641, line: 319, size: 2880, elements: !1189)
!1189 = !{!1190, !1191, !1192, !1193, !1194, !1195, !1196, !1209, !1210, !1215, !1220, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1235, !1236, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1268, !1269, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1292, !1293, !1294, !1298, !1299}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1188, file: !641, line: 320, baseType: !431, size: 32)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1188, file: !641, line: 321, baseType: !431, size: 32, offset: 32)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1188, file: !641, line: 322, baseType: !431, size: 32, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1188, file: !641, line: 323, baseType: !431, size: 32, offset: 96)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1188, file: !641, line: 324, baseType: !431, size: 32, offset: 128)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1188, file: !641, line: 325, baseType: !431, size: 32, offset: 160)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1188, file: !641, line: 326, baseType: !1197, size: 64, offset: 192)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !641, line: 293, baseType: !1198)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !641, line: 295, size: 448, elements: !1200)
!1200 = !{!1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1199, file: !641, line: 296, baseType: !1197, size: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1199, file: !641, line: 297, baseType: !493, size: 64, offset: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1199, file: !641, line: 297, baseType: !493, size: 64, offset: 128)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1199, file: !641, line: 298, baseType: !476, size: 64, offset: 192)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1199, file: !641, line: 298, baseType: !476, size: 64, offset: 256)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1199, file: !641, line: 299, baseType: !431, size: 32, offset: 320)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1199, file: !641, line: 300, baseType: !431, size: 32, offset: 352)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1199, file: !641, line: 301, baseType: !431, size: 32, offset: 384)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1188, file: !641, line: 326, baseType: !1197, size: 64, offset: 256)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1188, file: !641, line: 328, baseType: !1211, size: 64, offset: 320)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = !DISubroutineType(types: !1213)
!1213 = !{!390, !638, !1214, !476}
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1188, file: !641, line: 329, baseType: !1216, size: 64, offset: 384)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DISubroutineType(types: !1218)
!1218 = !{!390, !1214, !1219, !478, !478, !496, !476}
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1188, file: !641, line: 330, baseType: !1221, size: 64, offset: 448)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{!390, !1214}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1188, file: !641, line: 331, baseType: !1221, size: 64, offset: 512)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1188, file: !641, line: 334, baseType: !361, size: 64, offset: 576)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1188, file: !641, line: 335, baseType: !448, size: 32, offset: 640)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1188, file: !641, line: 335, baseType: !448, size: 32, offset: 672)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1188, file: !641, line: 336, baseType: !448, size: 32, offset: 704)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1188, file: !641, line: 336, baseType: !448, size: 32, offset: 736)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1188, file: !641, line: 337, baseType: !1231, size: 64, offset: 768)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !362, line: 339, baseType: !1233)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64)
!1234 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !362, line: 339, flags: DIFlagFwdDecl)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1188, file: !641, line: 338, baseType: !1231, size: 64, offset: 832)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1188, file: !641, line: 339, baseType: !1237, size: 64, offset: 896)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !362, line: 341, baseType: !1239)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !362, line: 351, size: 192, elements: !1240)
!1240 = !{!1241, !1242, !1243, !1244, !1245}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1239, file: !362, line: 354, baseType: !26, size: 32)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1239, file: !362, line: 355, baseType: !26, size: 32, offset: 32)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1239, file: !362, line: 356, baseType: !26, size: 32, offset: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1239, file: !362, line: 361, baseType: !26, size: 32, offset: 96)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1239, file: !362, line: 362, baseType: !542, size: 64, offset: 128)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1188, file: !641, line: 340, baseType: !431, size: 32, offset: 960)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1188, file: !641, line: 340, baseType: !431, size: 32, offset: 992)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1188, file: !641, line: 341, baseType: !493, size: 64, offset: 1024)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1188, file: !641, line: 342, baseType: !476, size: 64, offset: 1088)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1188, file: !641, line: 343, baseType: !496, size: 64, offset: 1152)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1188, file: !641, line: 344, baseType: !478, size: 64, offset: 1216)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1188, file: !641, line: 345, baseType: !431, size: 32, offset: 1280)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1188, file: !641, line: 346, baseType: !1219, size: 64, offset: 1344)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1188, file: !641, line: 347, baseType: !546, size: 32, offset: 1408)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1188, file: !641, line: 348, baseType: !431, size: 32, offset: 1440)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1188, file: !641, line: 351, baseType: !546, size: 32, offset: 1472)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1188, file: !641, line: 352, baseType: !546, size: 32, offset: 1504)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1188, file: !641, line: 353, baseType: !448, size: 32, offset: 1536)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1188, file: !641, line: 354, baseType: !448, size: 32, offset: 1568)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1188, file: !641, line: 355, baseType: !1219, size: 64, offset: 1600)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1188, file: !641, line: 356, baseType: !1219, size: 64, offset: 1664)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1188, file: !641, line: 357, baseType: !1263, size: 64, offset: 1728)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !641, line: 310, baseType: !1265)
!1265 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !641, line: 308, size: 32, elements: !1266)
!1266 = !{!1267}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1265, file: !641, line: 309, baseType: !431, size: 32)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1188, file: !641, line: 357, baseType: !1263, size: 64, offset: 1792)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1188, file: !641, line: 358, baseType: !1270, size: 64, offset: 1856)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64)
!1271 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !641, line: 316, baseType: !1272)
!1272 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !641, line: 312, size: 128, elements: !1273)
!1273 = !{!1274, !1275, !1276}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1272, file: !641, line: 313, baseType: !365, size: 64)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1272, file: !641, line: 314, baseType: !431, size: 32, offset: 64)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1272, file: !641, line: 315, baseType: !368, size: 8, offset: 96)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1188, file: !641, line: 359, baseType: !1270, size: 64, offset: 1920)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1188, file: !641, line: 360, baseType: !1270, size: 64, offset: 1984)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1188, file: !641, line: 361, baseType: !431, size: 32, offset: 2048)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1188, file: !641, line: 362, baseType: !448, size: 32, offset: 2080)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1188, file: !641, line: 363, baseType: !431, size: 32, offset: 2112)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1188, file: !641, line: 364, baseType: !1219, size: 64, offset: 2176)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1188, file: !641, line: 365, baseType: !1237, size: 64, offset: 2240)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1188, file: !641, line: 366, baseType: !448, size: 32, offset: 2304)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1188, file: !641, line: 367, baseType: !448, size: 32, offset: 2336)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1188, file: !641, line: 368, baseType: !1231, size: 64, offset: 2368)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1188, file: !641, line: 369, baseType: !1231, size: 64, offset: 2432)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1188, file: !641, line: 370, baseType: !1289, size: 64, offset: 2496)
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1290)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64)
!1291 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
