; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/adj/mpi/mpiadj.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/adj/mpi/mpiadj.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!333 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!334 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !335, line: 119, baseType: !7, size: 32, elements: !336)
!335 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewer.h", directory: "/home/users/ndemeye/xSDK")
!336 = !{!337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378}
!337 = !DIEnumerator(name: "PETSC_VIEWER_DEFAULT", value: 0, isUnsigned: true)
!338 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATLAB", value: 1, isUnsigned: true)
!339 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATHEMATICA", value: 2, isUnsigned: true)
!340 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!341 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!342 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!343 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!344 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!345 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!346 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!347 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!348 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!349 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!350 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!351 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!352 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!353 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!354 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!355 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!356 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!357 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!358 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!359 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!360 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!361 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!362 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!363 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!364 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!365 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!366 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!367 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!368 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!369 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!370 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!371 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!372 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!373 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!374 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!375 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!376 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!377 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!378 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!379 = !{!380, !383, !384, !387, !388, !423, !587, !472, !74, !603, !606, !609, !610, !462, !7, !492, !612}
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !323, line: 330, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !323, line: 330, flags: DIFlagFwdDecl)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !385, line: 46, baseType: !386)
!385 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!386 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !74)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !391, line: 73, size: 4480, elements: !392)
!391 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!392 = !{!393, !395, !444, !445, !446, !449, !450, !451, !452, !460, !461, !463, !467, !471, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !484, !485, !486, !488, !489, !491, !493, !494, !495, !496, !497, !500, !502, !503, !504, !505, !506, !509, !511, !512, !513, !523, !525, !526, !530, !531, !577, !582, !584, !585, !586}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !390, file: !391, line: 74, baseType: !394, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !74)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !390, file: !391, line: 75, baseType: !396, size: 448, offset: 64)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !397, size: 448, elements: !442)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !391, line: 53, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !391, line: 45, size: 448, elements: !399)
!399 = !{!400, !406, !414, !419, !426, !430, !437}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !398, file: !391, line: 46, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!404, !388, !405}
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !74)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !398, file: !391, line: 47, baseType: !407, size: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!404, !388, !410}
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !411, line: 16, baseType: !412)
!411 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !411, line: 16, flags: DIFlagFwdDecl)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !398, file: !391, line: 48, baseType: !415, size: 64, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!404, !418}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !398, file: !391, line: 49, baseType: !420, size: 64, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!404, !388, !423, !388}
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !425)
!425 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !398, file: !391, line: 50, baseType: !427, size: 64, offset: 256)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!404, !388, !423, !418}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !398, file: !391, line: 51, baseType: !431, size: 64, offset: 320)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!404, !388, !423, !434}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{null}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !398, file: !391, line: 52, baseType: !438, size: 64, offset: 384)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!404, !388, !423, !441}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!442 = !{!443}
!443 = !DISubrange(count: 1)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !390, file: !391, line: 76, baseType: !380, size: 64, offset: 512)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !390, file: !391, line: 77, baseType: !387, size: 32, offset: 576)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !390, file: !391, line: 78, baseType: !447, size: 64, offset: 640)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !448)
!448 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !390, file: !391, line: 78, baseType: !447, size: 64, offset: 704)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !390, file: !391, line: 78, baseType: !447, size: 64, offset: 768)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !390, file: !391, line: 78, baseType: !447, size: 64, offset: 832)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !390, file: !391, line: 79, baseType: !453, size: 64, offset: 896)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !456, line: 27, baseType: !457)
!456 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !458, line: 43, baseType: !459)
!458 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!459 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !390, file: !391, line: 80, baseType: !387, size: 32, offset: 960)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !390, file: !391, line: 81, baseType: !462, size: 32, offset: 992)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !74)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !390, file: !391, line: 82, baseType: !464, size: 64, offset: 1024)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !465)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !390, file: !391, line: 83, baseType: !468, size: 64, offset: 1088)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !390, file: !391, line: 84, baseType: !472, size: 64, offset: 1152)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !390, file: !391, line: 85, baseType: !472, size: 64, offset: 1216)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !390, file: !391, line: 86, baseType: !472, size: 64, offset: 1280)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !390, file: !391, line: 87, baseType: !472, size: 64, offset: 1344)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !390, file: !391, line: 88, baseType: !388, size: 64, offset: 1408)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !390, file: !391, line: 89, baseType: !453, size: 64, offset: 1472)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !390, file: !391, line: 90, baseType: !472, size: 64, offset: 1536)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !390, file: !391, line: 91, baseType: !472, size: 64, offset: 1600)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !390, file: !391, line: 92, baseType: !387, size: 32, offset: 1664)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !390, file: !391, line: 93, baseType: !383, size: 64, offset: 1728)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !390, file: !391, line: 94, baseType: !483, size: 64, offset: 1792)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !454)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !390, file: !391, line: 95, baseType: !387, size: 32, offset: 1856)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !390, file: !391, line: 95, baseType: !387, size: 32, offset: 1888)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !390, file: !391, line: 96, baseType: !487, size: 64, offset: 1920)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !390, file: !391, line: 96, baseType: !487, size: 64, offset: 1984)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !390, file: !391, line: 97, baseType: !490, size: 64, offset: 2048)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !390, file: !391, line: 97, baseType: !492, size: 64, offset: 2112)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !390, file: !391, line: 98, baseType: !387, size: 32, offset: 2176)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !390, file: !391, line: 98, baseType: !387, size: 32, offset: 2208)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !390, file: !391, line: 99, baseType: !487, size: 64, offset: 2240)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !390, file: !391, line: 99, baseType: !487, size: 64, offset: 2304)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !390, file: !391, line: 100, baseType: !498, size: 64, offset: 2368)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !448)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !390, file: !391, line: 100, baseType: !501, size: 64, offset: 2432)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !390, file: !391, line: 101, baseType: !387, size: 32, offset: 2496)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !390, file: !391, line: 101, baseType: !387, size: 32, offset: 2528)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !390, file: !391, line: 102, baseType: !487, size: 64, offset: 2560)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !390, file: !391, line: 102, baseType: !487, size: 64, offset: 2624)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !390, file: !391, line: 103, baseType: !507, size: 64, offset: 2688)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !499)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !390, file: !391, line: 103, baseType: !510, size: 64, offset: 2752)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !390, file: !391, line: 104, baseType: !441, size: 64, offset: 2816)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !390, file: !391, line: 105, baseType: !387, size: 32, offset: 2880)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !390, file: !391, line: 106, baseType: !514, size: 128, offset: 2944)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !515, size: 128, elements: !521)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !391, line: 64, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !391, line: 61, size: 128, elements: !518)
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !517, file: !391, line: 62, baseType: !434, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !517, file: !391, line: 63, baseType: !383, size: 64, offset: 64)
!521 = !{!522}
!522 = !DISubrange(count: 2)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !390, file: !391, line: 107, baseType: !524, size: 64, offset: 3072)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 64, elements: !521)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !390, file: !391, line: 108, baseType: !383, size: 64, offset: 3136)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !390, file: !391, line: 109, baseType: !527, size: 64, offset: 3200)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!404, !383}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !390, file: !391, line: 111, baseType: !387, size: 32, offset: 3264)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !390, file: !391, line: 112, baseType: !532, size: 320, offset: 3328)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !533, size: 320, elements: !575)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!404, !536, !388, !383}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !539)
!539 = !{!540, !541, !563, !564, !565, !566, !567, !568, !569, !570, !571}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !538, file: !12, line: 100, baseType: !387, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !538, file: !12, line: 101, baseType: !542, size: 64, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !545)
!545 = !{!546, !547, !548, !549, !550, !553, !554, !555, !556, !558, !560, !561, !562}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !544, file: !12, line: 84, baseType: !472, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !544, file: !12, line: 85, baseType: !472, size: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !544, file: !12, line: 86, baseType: !383, size: 64, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !544, file: !12, line: 87, baseType: !464, size: 64, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !544, file: !12, line: 88, baseType: !551, size: 64, offset: 256)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !423)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !544, file: !12, line: 89, baseType: !425, size: 8, offset: 320)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !544, file: !12, line: 90, baseType: !472, size: 64, offset: 384)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !544, file: !12, line: 91, baseType: !384, size: 64, offset: 448)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !544, file: !12, line: 92, baseType: !557, size: 32, offset: 512)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !544, file: !12, line: 93, baseType: !559, size: 32, offset: 544)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !544, file: !12, line: 94, baseType: !542, size: 64, offset: 576)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !544, file: !12, line: 95, baseType: !472, size: 64, offset: 640)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !544, file: !12, line: 96, baseType: !383, size: 64, offset: 704)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !538, file: !12, line: 102, baseType: !472, size: 64, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !538, file: !12, line: 102, baseType: !472, size: 64, offset: 192)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !538, file: !12, line: 103, baseType: !472, size: 64, offset: 256)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !538, file: !12, line: 104, baseType: !380, size: 64, offset: 320)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !538, file: !12, line: 105, baseType: !557, size: 32, offset: 384)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !538, file: !12, line: 105, baseType: !557, size: 32, offset: 416)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !538, file: !12, line: 105, baseType: !557, size: 32, offset: 448)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !538, file: !12, line: 106, baseType: !388, size: 64, offset: 512)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !538, file: !12, line: 107, baseType: !572, size: 64, offset: 576)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !573)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!575 = !{!576}
!576 = !DISubrange(count: 5)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !390, file: !391, line: 113, baseType: !578, size: 320, offset: 3648)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !579, size: 320, elements: !575)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!404, !388, !383}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !390, file: !391, line: 114, baseType: !583, size: 320, offset: 3968)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 320, elements: !575)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !390, file: !391, line: 115, baseType: !557, size: 32, offset: 4288)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !390, file: !391, line: 120, baseType: !572, size: 64, offset: 4352)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !390, file: !391, line: 121, baseType: !557, size: 32, offset: 4416)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_MPIAdj", file: !589, line: 25, baseType: !590)
!589 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/adj/mpi/mpiadj.h", directory: "/home/users/ndemeye/xSDK")
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !589, line: 13, size: 576, elements: !591)
!591 = !{!592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "nz", scope: !590, file: !589, line: 14, baseType: !387, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "diag", scope: !590, file: !589, line: 15, baseType: !490, size: 64, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !590, file: !589, line: 16, baseType: !490, size: 64, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !590, file: !589, line: 17, baseType: !490, size: 64, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !590, file: !589, line: 18, baseType: !490, size: 64, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "useedgeweights", scope: !590, file: !589, line: 19, baseType: !557, size: 32, offset: 320)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric", scope: !590, file: !589, line: 20, baseType: !557, size: 32, offset: 352)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "freeaij", scope: !590, file: !589, line: 21, baseType: !557, size: 32, offset: 384)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "freeaijwithfree", scope: !590, file: !589, line: 22, baseType: !557, size: 32, offset: 416)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "rowvalues", scope: !590, file: !589, line: 23, baseType: !507, size: 64, offset: 448)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "rowvalues_alloc", scope: !590, file: !589, line: 24, baseType: !387, size: 32, offset: 512)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !323, line: 331, baseType: !604)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !323, line: 331, flags: DIFlagFwdDecl)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !323, line: 338, baseType: !607)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !323, line: 338, flags: DIFlagFwdDecl)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !611, line: 1451, baseType: !434)
!611 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!613 = !{!0}
!614 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/impls/adj/mpi/mpiadj.c", directory: "/home/users/ndemeye/xSDK")
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !616, line: 32, size: 9472, elements: !617)
!616 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!617 = !{!618, !918, !922, !923, !927, !931, !932, !933, !934, !935, !936, !937, !957, !961, !966, !971, !977, !982, !986, !987, !992, !997, !998, !1003, !1007, !1011, !1015, !1019, !1023, !1024, !1025, !1026, !1027, !1031, !1032, !1037, !1038, !1039, !1040, !1041, !1046, !1053, !1058, !1062, !1066, !1070, !1074, !1075, !1079, !1080, !1087, !1092, !1093, !1094, !1095, !1156, !1164, !1165, !1169, !1170, !1174, !1175, !1176, !1181, !1182, !1186, !1190, !1194, !1195, !1196, !1197, !1198, !1199, !1204, !1205, !1209, !1213, !1217, !1218, !1219, !1223, !1233, !1234, !1238, !1239, !1243, !1244, !1248, !1249, !1253, !1254, !1258, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1272, !1273, !1274, !1275, !1276, !1277, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1292, !1296, !1297, !1298, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1312, !1313, !1314, !1319, !1323, !1324, !1328, !1329, !1330, !1331, !1357, !1361, !1362, !1363, !1364, !1365, !1369, !1370, !1371, !1372, !1373, !1377, !1381, !1382}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !615, file: !616, line: 34, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!404, !622, !387, !914, !387, !914, !916, !685}
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !38, line: 16, baseType: !623)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !616, line: 436, size: 23424, elements: !625)
!625 = !{!626, !628, !630, !654, !655, !656, !658, !659, !660, !665, !666, !667, !668, !669, !670, !684, !686, !798, !799, !820, !821, !822, !823, !824, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !859, !883, !884, !886, !887, !888, !889, !890, !891, !912, !913}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !624, file: !616, line: 437, baseType: !627, size: 4480)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !391, line: 122, baseType: !390)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !624, file: !616, line: 437, baseType: !629, size: 9472, offset: 4480)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !615, size: 9472, elements: !442)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !624, file: !616, line: 438, baseType: !631, size: 64, offset: 13952)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !632, line: 60, baseType: !633)
!632 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !116, line: 240, size: 640, elements: !635)
!635 = !{!636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !650, !651, !652, !653}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !634, file: !116, line: 241, baseType: !380, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !634, file: !116, line: 242, baseType: !462, size: 32, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !634, file: !116, line: 243, baseType: !387, size: 32, offset: 96)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !634, file: !116, line: 243, baseType: !387, size: 32, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !634, file: !116, line: 244, baseType: !387, size: 32, offset: 160)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !634, file: !116, line: 244, baseType: !387, size: 32, offset: 192)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !634, file: !116, line: 245, baseType: !490, size: 64, offset: 256)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !634, file: !116, line: 246, baseType: !557, size: 32, offset: 320)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !634, file: !116, line: 247, baseType: !387, size: 32, offset: 352)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !634, file: !116, line: 251, baseType: !387, size: 32, offset: 384)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !634, file: !116, line: 252, baseType: !647, size: 64, offset: 448)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !632, line: 30, baseType: !648)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !632, line: 30, flags: DIFlagFwdDecl)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !634, file: !116, line: 253, baseType: !557, size: 32, offset: 512)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !634, file: !116, line: 254, baseType: !387, size: 32, offset: 544)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !634, file: !116, line: 254, baseType: !387, size: 32, offset: 576)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !634, file: !116, line: 255, baseType: !387, size: 32, offset: 608)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !624, file: !616, line: 438, baseType: !631, size: 64, offset: 14016)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !624, file: !616, line: 439, baseType: !383, size: 64, offset: 14080)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !624, file: !616, line: 440, baseType: !657, size: 32, offset: 14144)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !38, line: 161, baseType: !265)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !624, file: !616, line: 441, baseType: !557, size: 32, offset: 14176)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !624, file: !616, line: 442, baseType: !557, size: 32, offset: 14208)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !624, file: !616, line: 443, baseType: !661, size: 448, offset: 14272)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !662, size: 448, elements: !663)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !38, line: 1159, baseType: !423)
!663 = !{!664}
!664 = !DISubrange(count: 7)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !624, file: !616, line: 444, baseType: !557, size: 32, offset: 14720)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !624, file: !616, line: 445, baseType: !557, size: 32, offset: 14752)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !624, file: !616, line: 446, baseType: !387, size: 32, offset: 14784)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !624, file: !616, line: 447, baseType: !483, size: 64, offset: 14848)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !624, file: !616, line: 448, baseType: !483, size: 64, offset: 14912)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !624, file: !616, line: 449, baseType: !671, size: 640, offset: 14976)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !38, line: 600, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 592, size: 640, elements: !673)
!673 = !{!674, !675, !676, !677, !678, !679, !680, !681, !682, !683}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !672, file: !38, line: 593, baseType: !447, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !672, file: !38, line: 594, baseType: !447, size: 64, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !672, file: !38, line: 594, baseType: !447, size: 64, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !672, file: !38, line: 594, baseType: !447, size: 64, offset: 192)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !672, file: !38, line: 595, baseType: !447, size: 64, offset: 256)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !672, file: !38, line: 596, baseType: !447, size: 64, offset: 320)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !672, file: !38, line: 597, baseType: !447, size: 64, offset: 384)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !672, file: !38, line: 598, baseType: !447, size: 64, offset: 448)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !672, file: !38, line: 598, baseType: !447, size: 64, offset: 512)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !672, file: !38, line: 599, baseType: !447, size: 64, offset: 576)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !624, file: !616, line: 450, baseType: !685, size: 32, offset: 15616)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !26)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !624, file: !616, line: 451, baseType: !687, size: 2880, offset: 15680)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !616, line: 318, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !616, line: 319, size: 2880, elements: !689)
!689 = !{!690, !691, !692, !693, !694, !695, !696, !709, !710, !715, !720, !724, !725, !726, !727, !728, !729, !730, !735, !736, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !768, !769, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !792, !793, !794, !795, !796}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !688, file: !616, line: 320, baseType: !387, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !688, file: !616, line: 321, baseType: !387, size: 32, offset: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !688, file: !616, line: 322, baseType: !387, size: 32, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !688, file: !616, line: 323, baseType: !387, size: 32, offset: 96)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !688, file: !616, line: 324, baseType: !387, size: 32, offset: 128)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !688, file: !616, line: 325, baseType: !387, size: 32, offset: 160)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !688, file: !616, line: 326, baseType: !697, size: 64, offset: 192)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !616, line: 293, baseType: !698)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !616, line: 295, size: 448, elements: !700)
!700 = !{!701, !702, !703, !704, !705, !706, !707, !708}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !699, file: !616, line: 296, baseType: !697, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !699, file: !616, line: 297, baseType: !507, size: 64, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !699, file: !616, line: 297, baseType: !507, size: 64, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !699, file: !616, line: 298, baseType: !490, size: 64, offset: 192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !699, file: !616, line: 298, baseType: !490, size: 64, offset: 256)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !699, file: !616, line: 299, baseType: !387, size: 32, offset: 320)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !699, file: !616, line: 300, baseType: !387, size: 32, offset: 352)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !699, file: !616, line: 301, baseType: !387, size: 32, offset: 384)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !688, file: !616, line: 326, baseType: !697, size: 64, offset: 256)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !688, file: !616, line: 328, baseType: !711, size: 64, offset: 320)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!404, !622, !714, !490}
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !688, file: !616, line: 329, baseType: !716, size: 64, offset: 384)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!404, !714, !719, !492, !492, !510, !490}
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !688, file: !616, line: 330, baseType: !721, size: 64, offset: 448)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{!404, !714}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !688, file: !616, line: 331, baseType: !721, size: 64, offset: 512)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !688, file: !616, line: 334, baseType: !380, size: 64, offset: 576)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !688, file: !616, line: 335, baseType: !462, size: 32, offset: 640)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !688, file: !616, line: 335, baseType: !462, size: 32, offset: 672)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !688, file: !616, line: 336, baseType: !462, size: 32, offset: 704)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !688, file: !616, line: 336, baseType: !462, size: 32, offset: 736)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !688, file: !616, line: 337, baseType: !731, size: 64, offset: 768)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !323, line: 339, baseType: !733)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !323, line: 339, flags: DIFlagFwdDecl)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !688, file: !616, line: 338, baseType: !731, size: 64, offset: 832)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !688, file: !616, line: 339, baseType: !737, size: 64, offset: 896)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !323, line: 341, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !323, line: 351, size: 192, elements: !740)
!740 = !{!741, !742, !743, !744, !745}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !739, file: !323, line: 354, baseType: !74, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !739, file: !323, line: 355, baseType: !74, size: 32, offset: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !739, file: !323, line: 356, baseType: !74, size: 32, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !739, file: !323, line: 361, baseType: !74, size: 32, offset: 96)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !739, file: !323, line: 362, baseType: !384, size: 64, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !688, file: !616, line: 340, baseType: !387, size: 32, offset: 960)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !688, file: !616, line: 340, baseType: !387, size: 32, offset: 992)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !688, file: !616, line: 341, baseType: !507, size: 64, offset: 1024)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !688, file: !616, line: 342, baseType: !490, size: 64, offset: 1088)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !688, file: !616, line: 343, baseType: !510, size: 64, offset: 1152)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !688, file: !616, line: 344, baseType: !492, size: 64, offset: 1216)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !688, file: !616, line: 345, baseType: !387, size: 32, offset: 1280)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !688, file: !616, line: 346, baseType: !719, size: 64, offset: 1344)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !688, file: !616, line: 347, baseType: !557, size: 32, offset: 1408)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !688, file: !616, line: 348, baseType: !387, size: 32, offset: 1440)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !688, file: !616, line: 351, baseType: !557, size: 32, offset: 1472)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !688, file: !616, line: 352, baseType: !557, size: 32, offset: 1504)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !688, file: !616, line: 353, baseType: !462, size: 32, offset: 1536)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !688, file: !616, line: 354, baseType: !462, size: 32, offset: 1568)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !688, file: !616, line: 355, baseType: !719, size: 64, offset: 1600)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !688, file: !616, line: 356, baseType: !719, size: 64, offset: 1664)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !688, file: !616, line: 357, baseType: !763, size: 64, offset: 1728)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !616, line: 310, baseType: !765)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !616, line: 308, size: 32, elements: !766)
!766 = !{!767}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !765, file: !616, line: 309, baseType: !387, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !688, file: !616, line: 357, baseType: !763, size: 64, offset: 1792)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !688, file: !616, line: 358, baseType: !770, size: 64, offset: 1856)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !616, line: 316, baseType: !772)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !616, line: 312, size: 128, elements: !773)
!773 = !{!774, !775, !776}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !772, file: !616, line: 313, baseType: !383, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !772, file: !616, line: 314, baseType: !387, size: 32, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !772, file: !616, line: 315, baseType: !425, size: 8, offset: 96)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !688, file: !616, line: 359, baseType: !770, size: 64, offset: 1920)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !688, file: !616, line: 360, baseType: !770, size: 64, offset: 1984)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !688, file: !616, line: 361, baseType: !387, size: 32, offset: 2048)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !688, file: !616, line: 362, baseType: !462, size: 32, offset: 2080)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !688, file: !616, line: 363, baseType: !387, size: 32, offset: 2112)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !688, file: !616, line: 364, baseType: !719, size: 64, offset: 2176)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !688, file: !616, line: 365, baseType: !737, size: 64, offset: 2240)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !688, file: !616, line: 366, baseType: !462, size: 32, offset: 2304)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !688, file: !616, line: 367, baseType: !462, size: 32, offset: 2336)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !688, file: !616, line: 368, baseType: !731, size: 64, offset: 2368)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !688, file: !616, line: 369, baseType: !731, size: 64, offset: 2432)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !688, file: !616, line: 370, baseType: !789, size: 64, offset: 2496)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !6, line: 678, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !6, line: 678, flags: DIFlagFwdDecl)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !688, file: !616, line: 371, baseType: !789, size: 64, offset: 2560)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !688, file: !616, line: 372, baseType: !789, size: 64, offset: 2624)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !688, file: !616, line: 373, baseType: !603, size: 64, offset: 2688)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !688, file: !616, line: 374, baseType: !384, size: 64, offset: 2752)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !688, file: !616, line: 375, baseType: !797, size: 64, offset: 2816)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !624, file: !616, line: 451, baseType: !687, size: 2880, offset: 18560)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !624, file: !616, line: 452, baseType: !800, size: 64, offset: 21440)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !38, line: 1723, baseType: !801)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !616, line: 681, size: 4864, elements: !803)
!803 = !{!804, !805, !807, !808, !809, !814, !815, !819}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !802, file: !616, line: 682, baseType: !627, size: 4480)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !802, file: !616, line: 682, baseType: !806, size: 32, offset: 4480)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 32, elements: !442)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !802, file: !616, line: 683, baseType: !557, size: 32, offset: 4512)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !802, file: !616, line: 684, baseType: !387, size: 32, offset: 4544)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !802, file: !616, line: 685, baseType: !810, size: 64, offset: 4608)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !62, line: 21, baseType: !812)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !62, line: 21, flags: DIFlagFwdDecl)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !802, file: !616, line: 686, baseType: !507, size: 64, offset: 4672)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !802, file: !616, line: 687, baseType: !816, size: 64, offset: 4736)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{!404, !800, !811, !383}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !802, file: !616, line: 688, baseType: !383, size: 64, offset: 4800)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !624, file: !616, line: 453, baseType: !800, size: 64, offset: 21504)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !624, file: !616, line: 454, baseType: !800, size: 64, offset: 21568)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !624, file: !616, line: 455, baseType: !387, size: 32, offset: 21632)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "preallocated", scope: !624, file: !616, line: 456, baseType: !557, size: 32, offset: 21664)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !624, file: !616, line: 457, baseType: !825, size: 320, offset: 21696)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStencilInfo", file: !616, line: 399, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !616, line: 394, size: 320, elements: !827)
!827 = !{!828, !829, !833, !834}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !826, file: !616, line: 395, baseType: !387, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "dims", scope: !826, file: !616, line: 396, baseType: !830, size: 128, offset: 32)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 128, elements: !831)
!831 = !{!832}
!832 = !DISubrange(count: 4)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "starts", scope: !826, file: !616, line: 397, baseType: !830, size: 128, offset: 160)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "noc", scope: !826, file: !616, line: 398, baseType: !557, size: 32, offset: 288)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric", scope: !624, file: !616, line: 458, baseType: !557, size: 32, offset: 22016)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "hermitian", scope: !624, file: !616, line: 458, baseType: !557, size: 32, offset: 22048)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "structurally_symmetric", scope: !624, file: !616, line: 458, baseType: !557, size: 32, offset: 22080)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "spd", scope: !624, file: !616, line: 458, baseType: !557, size: 32, offset: 22112)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric_set", scope: !624, file: !616, line: 459, baseType: !557, size: 32, offset: 22144)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "hermitian_set", scope: !624, file: !616, line: 459, baseType: !557, size: 32, offset: 22176)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "structurally_symmetric_set", scope: !624, file: !616, line: 459, baseType: !557, size: 32, offset: 22208)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "spd_set", scope: !624, file: !616, line: 459, baseType: !557, size: 32, offset: 22240)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric_eternal", scope: !624, file: !616, line: 460, baseType: !557, size: 32, offset: 22272)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "nooffprocentries", scope: !624, file: !616, line: 461, baseType: !557, size: 32, offset: 22304)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "nooffproczerorows", scope: !624, file: !616, line: 461, baseType: !557, size: 32, offset: 22336)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "assembly_subset", scope: !624, file: !616, line: 462, baseType: !557, size: 32, offset: 22368)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "submat_singleis", scope: !624, file: !616, line: 463, baseType: !557, size: 32, offset: 22400)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "structure_only", scope: !624, file: !616, line: 464, baseType: !557, size: 32, offset: 22432)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "sortedfull", scope: !624, file: !616, line: 465, baseType: !557, size: 32, offset: 22464)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "force_diagonals", scope: !624, file: !616, line: 466, baseType: !557, size: 32, offset: 22496)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "spptr", scope: !624, file: !616, line: 471, baseType: !383, size: 64, offset: 22528)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "solvertype", scope: !624, file: !616, line: 472, baseType: !472, size: 64, offset: 22592)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "checksymmetryonassembly", scope: !624, file: !616, line: 473, baseType: !557, size: 32, offset: 22656)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "checknullspaceonassembly", scope: !624, file: !616, line: 473, baseType: !557, size: 32, offset: 22688)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "checksymmetrytol", scope: !624, file: !616, line: 474, baseType: !499, size: 64, offset: 22720)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "schur", scope: !624, file: !616, line: 475, baseType: !622, size: 64, offset: 22784)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "schur_status", scope: !624, file: !616, line: 476, baseType: !858, size: 32, offset: 22848)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorSchurStatus", file: !38, line: 1265, baseType: !275)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "redundant", scope: !624, file: !616, line: 477, baseType: !860, size: 64, offset: 22912)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_Redundant", file: !616, line: 418, baseType: !862)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !616, line: 410, size: 896, elements: !863)
!863 = !{!864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !880, !881}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "nzlocal", scope: !862, file: !616, line: 411, baseType: !387, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !862, file: !616, line: 411, baseType: !387, size: 32, offset: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !862, file: !616, line: 411, baseType: !387, size: 32, offset: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "send_rank", scope: !862, file: !616, line: 412, baseType: !719, size: 64, offset: 128)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "recv_rank", scope: !862, file: !616, line: 412, baseType: !719, size: 64, offset: 192)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "sbuf_nz", scope: !862, file: !616, line: 413, baseType: !490, size: 64, offset: 256)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf_nz", scope: !862, file: !616, line: 413, baseType: !490, size: 64, offset: 320)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "sbuf_j", scope: !862, file: !616, line: 413, baseType: !490, size: 64, offset: 384)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf_j", scope: !862, file: !616, line: 413, baseType: !492, size: 64, offset: 448)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "sbuf_a", scope: !862, file: !616, line: 414, baseType: !507, size: 64, offset: 512)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf_a", scope: !862, file: !616, line: 414, baseType: !510, size: 64, offset: 576)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "subcomm", scope: !862, file: !616, line: 415, baseType: !380, size: 64, offset: 640)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "isrow", scope: !862, file: !616, line: 416, baseType: !877, size: 64, offset: 704)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !632, line: 11, baseType: !878)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !632, line: 11, flags: DIFlagFwdDecl)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "iscol", scope: !862, file: !616, line: 416, baseType: !877, size: 64, offset: 768)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "matseq", scope: !862, file: !616, line: 417, baseType: !882, size: 64, offset: 832)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "erroriffailure", scope: !624, file: !616, line: 478, baseType: !557, size: 32, offset: 22976)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "factorerrortype", scope: !624, file: !616, line: 479, baseType: !885, size: 32, offset: 23008)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorError", file: !38, line: 1203, baseType: !280)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "factorerror_zeropivot_value", scope: !624, file: !616, line: 480, baseType: !499, size: 64, offset: 23040)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "factorerror_zeropivot_row", scope: !624, file: !616, line: 481, baseType: !387, size: 32, offset: 23104)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "nblocks", scope: !624, file: !616, line: 482, baseType: !387, size: 32, offset: 23136)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "bsizes", scope: !624, file: !616, line: 482, baseType: !490, size: 64, offset: 23168)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "defaultvectype", scope: !624, file: !616, line: 483, baseType: !472, size: 64, offset: 23232)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "product", scope: !624, file: !616, line: 484, baseType: !892, size: 64, offset: 23296)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_Product", file: !616, line: 434, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !616, line: 420, size: 768, elements: !895)
!895 = !{!896, !898, !899, !900, !901, !902, !903, !904, !905, !909, !910, !911}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !894, file: !616, line: 421, baseType: !897, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatProductType", file: !38, line: 187, baseType: !287)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "alg", scope: !894, file: !616, line: 422, baseType: !472, size: 64, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !894, file: !616, line: 423, baseType: !622, size: 64, offset: 128)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !894, file: !616, line: 423, baseType: !622, size: 64, offset: 192)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !894, file: !616, line: 423, baseType: !622, size: 64, offset: 256)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "Dwork", scope: !894, file: !616, line: 423, baseType: !622, size: 64, offset: 320)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !894, file: !616, line: 424, baseType: !499, size: 64, offset: 384)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "api_user", scope: !894, file: !616, line: 425, baseType: !557, size: 32, offset: 448)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !894, file: !616, line: 428, baseType: !906, size: 64, offset: 512)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{!404, !622, !410}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "clear", scope: !894, file: !616, line: 431, baseType: !557, size: 32, offset: 576)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !894, file: !616, line: 432, baseType: !383, size: 64, offset: 640)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !894, file: !616, line: 433, baseType: !527, size: 64, offset: 704)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "form_explicit_transpose", scope: !624, file: !616, line: 485, baseType: !557, size: 32, offset: 23360)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "transupdated", scope: !624, file: !616, line: 486, baseType: !557, size: 32, offset: 23392)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !387)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !508)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !615, file: !616, line: 35, baseType: !919, size: 64, offset: 64)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DISubroutineType(types: !921)
!921 = !{!404, !622, !387, !490, !492, !510}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !615, file: !616, line: 36, baseType: !919, size: 64, offset: 128)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !615, file: !616, line: 37, baseType: !924, size: 64, offset: 192)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{!404, !622, !811, !811}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !615, file: !616, line: 38, baseType: !928, size: 64, offset: 256)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!404, !622, !811, !811, !811}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !615, file: !616, line: 40, baseType: !924, size: 64, offset: 320)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !615, file: !616, line: 41, baseType: !928, size: 64, offset: 384)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !615, file: !616, line: 42, baseType: !924, size: 64, offset: 448)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !615, file: !616, line: 43, baseType: !928, size: 64, offset: 512)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !615, file: !616, line: 44, baseType: !924, size: 64, offset: 576)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !615, file: !616, line: 46, baseType: !928, size: 64, offset: 640)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !615, file: !616, line: 47, baseType: !938, size: 64, offset: 704)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!404, !622, !877, !877, !941}
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !38, line: 1239, baseType: !944)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 1226, size: 704, elements: !945)
!945 = !{!946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !944, file: !38, line: 1227, baseType: !499, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !944, file: !38, line: 1228, baseType: !499, size: 64, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !944, file: !38, line: 1229, baseType: !499, size: 64, offset: 128)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !944, file: !38, line: 1230, baseType: !499, size: 64, offset: 192)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !944, file: !38, line: 1231, baseType: !499, size: 64, offset: 256)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !944, file: !38, line: 1232, baseType: !499, size: 64, offset: 320)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !944, file: !38, line: 1233, baseType: !499, size: 64, offset: 384)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !944, file: !38, line: 1234, baseType: !499, size: 64, offset: 448)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !944, file: !38, line: 1236, baseType: !499, size: 64, offset: 512)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !944, file: !38, line: 1237, baseType: !499, size: 64, offset: 576)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !944, file: !38, line: 1238, baseType: !499, size: 64, offset: 640)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !615, file: !616, line: 48, baseType: !958, size: 64, offset: 768)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!404, !622, !877, !941}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !615, file: !616, line: 49, baseType: !962, size: 64, offset: 832)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!404, !622, !811, !499, !965, !499, !387, !387, !811}
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !38, line: 1291, baseType: !37)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !615, file: !616, line: 50, baseType: !967, size: 64, offset: 896)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!404, !622, !970, !882}
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !38, line: 238, baseType: !50)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !615, file: !616, line: 52, baseType: !972, size: 64, offset: 960)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!404, !622, !975, !976}
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !38, line: 612, baseType: !56)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !615, file: !616, line: 53, baseType: !978, size: 64, offset: 1024)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!404, !622, !622, !981}
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !615, file: !616, line: 54, baseType: !983, size: 64, offset: 1088)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!404, !622, !811}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !615, file: !616, line: 55, baseType: !924, size: 64, offset: 1152)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !615, file: !616, line: 56, baseType: !988, size: 64, offset: 1216)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!404, !622, !991, !498}
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !62, line: 155, baseType: !61)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !615, file: !616, line: 58, baseType: !993, size: 64, offset: 1280)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!404, !622, !996}
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !38, line: 424, baseType: !69)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !615, file: !616, line: 59, baseType: !993, size: 64, offset: 1344)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !615, file: !616, line: 60, baseType: !999, size: 64, offset: 1408)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!404, !622, !1002, !557}
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !38, line: 469, baseType: !73)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !615, file: !616, line: 61, baseType: !1004, size: 64, offset: 1472)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!404, !622}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !615, file: !616, line: 63, baseType: !1008, size: 64, offset: 1536)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!404, !622, !387, !914, !508, !811, !811}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !615, file: !616, line: 64, baseType: !1012, size: 64, offset: 1600)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!404, !622, !622, !877, !877, !941}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !615, file: !616, line: 65, baseType: !1016, size: 64, offset: 1664)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!404, !622, !622, !941}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !615, file: !616, line: 66, baseType: !1020, size: 64, offset: 1728)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!404, !622, !622, !877, !941}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !615, file: !616, line: 67, baseType: !1016, size: 64, offset: 1792)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !615, file: !616, line: 69, baseType: !1004, size: 64, offset: 1856)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !615, file: !616, line: 70, baseType: !1012, size: 64, offset: 1920)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !615, file: !616, line: 71, baseType: !1020, size: 64, offset: 1984)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !615, file: !616, line: 72, baseType: !1028, size: 64, offset: 2048)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!404, !622, !882}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !615, file: !616, line: 73, baseType: !1004, size: 64, offset: 2112)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !615, file: !616, line: 75, baseType: !1033, size: 64, offset: 2176)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!404, !622, !1036, !882}
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !38, line: 563, baseType: !104)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !615, file: !616, line: 76, baseType: !924, size: 64, offset: 2240)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !615, file: !616, line: 77, baseType: !924, size: 64, offset: 2304)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !615, file: !616, line: 78, baseType: !938, size: 64, offset: 2368)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !615, file: !616, line: 79, baseType: !958, size: 64, offset: 2432)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !615, file: !616, line: 81, baseType: !1042, size: 64, offset: 2496)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!404, !622, !508, !622, !1045}
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !38, line: 285, baseType: !109)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !615, file: !616, line: 82, baseType: !1047, size: 64, offset: 2560)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!404, !622, !387, !1050, !1050, !970, !1052}
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !877)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !615, file: !616, line: 83, baseType: !1054, size: 64, offset: 2624)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!404, !622, !387, !1057, !387}
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !615, file: !616, line: 84, baseType: !1059, size: 64, offset: 2688)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!404, !622, !387, !914, !387, !914, !507}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !615, file: !616, line: 85, baseType: !1063, size: 64, offset: 2752)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!404, !622, !622, !1045}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !615, file: !616, line: 87, baseType: !1067, size: 64, offset: 2816)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!404, !622, !811, !490}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !615, file: !616, line: 88, baseType: !1071, size: 64, offset: 2880)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!404, !622, !508}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !615, file: !616, line: 89, baseType: !1071, size: 64, offset: 2944)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !615, file: !616, line: 90, baseType: !1076, size: 64, offset: 3008)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!404, !622, !811, !685}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !615, file: !616, line: 91, baseType: !1008, size: 64, offset: 3072)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !615, file: !616, line: 93, baseType: !1081, size: 64, offset: 3136)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!404, !622, !1084}
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !1085)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !615, file: !616, line: 94, baseType: !1088, size: 64, offset: 3200)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!404, !622, !387, !557, !557, !490, !1091, !1091, !981}
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !615, file: !616, line: 95, baseType: !1088, size: 64, offset: 3264)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !615, file: !616, line: 96, baseType: !1088, size: 64, offset: 3328)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !615, file: !616, line: 97, baseType: !1088, size: 64, offset: 3392)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !615, file: !616, line: 99, baseType: !1096, size: 64, offset: 3456)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!404, !622, !1099, !1102}
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !632, line: 51, baseType: !1100)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !632, line: 51, flags: DIFlagFwdDecl)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !38, line: 1378, baseType: !1103)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !616, line: 609, size: 6208, elements: !1105)
!1105 = !{!1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1125, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1143, !1144, !1145, !1146, !1147, !1149, !1150, !1151, !1152, !1153, !1154, !1155}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1104, file: !616, line: 610, baseType: !627, size: 4480)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1104, file: !616, line: 610, baseType: !806, size: 32, offset: 4480)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1104, file: !616, line: 611, baseType: !387, size: 32, offset: 4512)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1104, file: !616, line: 611, baseType: !387, size: 32, offset: 4544)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1104, file: !616, line: 611, baseType: !387, size: 32, offset: 4576)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1104, file: !616, line: 612, baseType: !387, size: 32, offset: 4608)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1104, file: !616, line: 613, baseType: !387, size: 32, offset: 4640)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1104, file: !616, line: 614, baseType: !490, size: 64, offset: 4672)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1104, file: !616, line: 615, baseType: !492, size: 64, offset: 4736)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !1104, file: !616, line: 616, baseType: !1057, size: 64, offset: 4800)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1104, file: !616, line: 617, baseType: !490, size: 64, offset: 4864)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !1104, file: !616, line: 618, baseType: !1118, size: 64, offset: 4928)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !616, line: 602, baseType: !1120)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !616, line: 598, size: 128, elements: !1121)
!1121 = !{!1122, !1123, !1124}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1120, file: !616, line: 599, baseType: !387, size: 32)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1120, file: !616, line: 600, baseType: !387, size: 32, offset: 32)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1120, file: !616, line: 601, baseType: !507, size: 64, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !1104, file: !616, line: 619, baseType: !1126, size: 64, offset: 4992)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !616, line: 607, baseType: !1128)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !616, line: 604, size: 128, elements: !1129)
!1129 = !{!1130, !1131}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1128, file: !616, line: 605, baseType: !387, size: 32)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1128, file: !616, line: 606, baseType: !507, size: 64, offset: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !1104, file: !616, line: 620, baseType: !507, size: 64, offset: 5056)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !1104, file: !616, line: 621, baseType: !499, size: 64, offset: 5120)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !1104, file: !616, line: 622, baseType: !499, size: 64, offset: 5184)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !1104, file: !616, line: 623, baseType: !811, size: 64, offset: 5248)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !1104, file: !616, line: 623, baseType: !811, size: 64, offset: 5312)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !1104, file: !616, line: 623, baseType: !811, size: 64, offset: 5376)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !1104, file: !616, line: 624, baseType: !557, size: 32, offset: 5440)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1104, file: !616, line: 625, baseType: !1140, size: 64, offset: 5504)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!404}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !1104, file: !616, line: 626, baseType: !383, size: 64, offset: 5568)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !1104, file: !616, line: 627, baseType: !811, size: 64, offset: 5632)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1104, file: !616, line: 628, baseType: !387, size: 32, offset: 5696)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !1104, file: !616, line: 629, baseType: !423, size: 64, offset: 5760)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1104, file: !616, line: 630, baseType: !1148, size: 32, offset: 5824)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !116, line: 213, baseType: !115)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1104, file: !616, line: 631, baseType: !387, size: 32, offset: 5856)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !1104, file: !616, line: 631, baseType: !387, size: 32, offset: 5888)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1104, file: !616, line: 632, baseType: !557, size: 32, offset: 5920)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !1104, file: !616, line: 633, baseType: !557, size: 32, offset: 5952)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !1104, file: !616, line: 634, baseType: !434, size: 64, offset: 6016)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !1104, file: !616, line: 634, baseType: !383, size: 64, offset: 6080)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !1104, file: !616, line: 635, baseType: !453, size: 64, offset: 6144)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !615, file: !616, line: 100, baseType: !1157, size: 64, offset: 3520)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!404, !622, !387, !387, !1160, !1163}
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !116, line: 215, baseType: !1162)
!1162 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !615, file: !616, line: 101, baseType: !1004, size: 64, offset: 3584)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !615, file: !616, line: 102, baseType: !1166, size: 64, offset: 3648)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{!404, !622, !877, !877, !882}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !615, file: !616, line: 103, baseType: !619, size: 64, offset: 3712)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !615, file: !616, line: 105, baseType: !1171, size: 64, offset: 3776)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{!404, !622, !877, !877, !970, !882}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !615, file: !616, line: 106, baseType: !1004, size: 64, offset: 3840)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !615, file: !616, line: 107, baseType: !906, size: 64, offset: 3904)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !615, file: !616, line: 108, baseType: !1177, size: 64, offset: 3968)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = !DISubroutineType(types: !1179)
!1179 = !{!404, !622, !1180, !970, !882}
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !38, line: 25, baseType: !423)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !615, file: !616, line: 109, baseType: !1140, size: 64, offset: 4032)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !615, file: !616, line: 111, baseType: !1183, size: 64, offset: 4096)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{!404, !622, !622, !622, !499, !622}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !615, file: !616, line: 112, baseType: !1187, size: 64, offset: 4160)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = !DISubroutineType(types: !1189)
!1189 = !{!404, !622, !622, !622, !622}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !615, file: !616, line: 113, baseType: !1191, size: 64, offset: 4224)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DISubroutineType(types: !1193)
!1193 = !{!404, !622, !647, !647}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !615, file: !616, line: 114, baseType: !619, size: 64, offset: 4288)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !615, file: !616, line: 115, baseType: !1008, size: 64, offset: 4352)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !615, file: !616, line: 117, baseType: !1067, size: 64, offset: 4416)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !615, file: !616, line: 118, baseType: !1067, size: 64, offset: 4480)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !615, file: !616, line: 119, baseType: !1177, size: 64, offset: 4544)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !615, file: !616, line: 120, baseType: !1200, size: 64, offset: 4608)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DISubroutineType(types: !1202)
!1202 = !{!404, !622, !1203, !981}
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !38, line: 1675, baseType: !120)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !615, file: !616, line: 121, baseType: !1140, size: 64, offset: 4672)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !615, file: !616, line: 123, baseType: !1206, size: 64, offset: 4736)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{!404, !622, !387, !383}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !615, file: !616, line: 124, baseType: !1210, size: 64, offset: 4800)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = !DISubroutineType(types: !1212)
!1212 = !{!404, !622, !1102, !811, !383}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !615, file: !616, line: 125, baseType: !1214, size: 64, offset: 4864)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1215 = !DISubroutineType(types: !1216)
!1216 = !{!404, !536, !622}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !615, file: !616, line: 126, baseType: !924, size: 64, offset: 4928)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !615, file: !616, line: 127, baseType: !924, size: 64, offset: 4992)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !615, file: !616, line: 129, baseType: !1220, size: 64, offset: 5056)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DISubroutineType(types: !1222)
!1222 = !{!404, !622, !1057}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !615, file: !616, line: 130, baseType: !1224, size: 64, offset: 5120)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64)
!1225 = !DISubroutineType(types: !1226)
!1226 = !{!404, !622, !1227, !1227}
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !62, line: 654, baseType: !1228)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !62, line: 653, size: 128, elements: !1230)
!1230 = !{!1231, !1232}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1229, file: !62, line: 653, baseType: !387, size: 32)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1229, file: !62, line: 653, baseType: !811, size: 64, offset: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !615, file: !616, line: 131, baseType: !1224, size: 64, offset: 5184)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !615, file: !616, line: 132, baseType: !1235, size: 64, offset: 5248)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!404, !622, !490, !490, !490}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !615, file: !616, line: 133, baseType: !906, size: 64, offset: 5312)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !615, file: !616, line: 135, baseType: !1240, size: 64, offset: 5376)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{!404, !622, !499, !981}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !615, file: !616, line: 136, baseType: !1240, size: 64, offset: 5440)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !615, file: !616, line: 137, baseType: !1245, size: 64, offset: 5504)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{!404, !622, !981}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !615, file: !616, line: 138, baseType: !619, size: 64, offset: 5568)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !615, file: !616, line: 139, baseType: !1250, size: 64, offset: 5632)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{!404, !622, !810, !810}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !615, file: !616, line: 141, baseType: !1140, size: 64, offset: 5696)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !615, file: !616, line: 142, baseType: !1255, size: 64, offset: 5760)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64)
!1256 = !DISubroutineType(types: !1257)
!1257 = !{!404, !622, !622, !499, !622}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !615, file: !616, line: 143, baseType: !1259, size: 64, offset: 5824)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{!404, !622, !622, !622}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !615, file: !616, line: 144, baseType: !1140, size: 64, offset: 5888)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !615, file: !616, line: 145, baseType: !1255, size: 64, offset: 5952)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !615, file: !616, line: 147, baseType: !1259, size: 64, offset: 6016)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !615, file: !616, line: 148, baseType: !1140, size: 64, offset: 6080)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !615, file: !616, line: 149, baseType: !1255, size: 64, offset: 6144)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !615, file: !616, line: 150, baseType: !1259, size: 64, offset: 6208)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !615, file: !616, line: 151, baseType: !1269, size: 64, offset: 6272)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = !DISubroutineType(types: !1271)
!1271 = !{!404, !622, !557}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !615, file: !616, line: 153, baseType: !1004, size: 64, offset: 6336)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !615, file: !616, line: 154, baseType: !1004, size: 64, offset: 6400)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !615, file: !616, line: 155, baseType: !1004, size: 64, offset: 6464)
