; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/linesearch/impls/cp/linesearchcp.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/linesearch/impls/cp/linesearchcp.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_LineSearch = type { %struct._p_PetscObject, [1 x %struct._LineSearchOps], %struct._p_SNES*, i8*, i32, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Vec*, i32, %struct._p_Vec**, double, i32, double, double, double, i32, i32, double, double, double, i32, double, double, double, i32, double, i8*, i8*, %struct._p_PetscViewer*, [5 x i32 (%struct._p_LineSearch*, i8*)*], [5 x i32 (i8**)*], [5 x i8*], i32 }

!1 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/linesearch/impls/cp/linesearchcp.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!2 = !{!3, !9, !24, !33, !39}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 170, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 81, baseType: !5, size: 32, elements: !11)
!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!12 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 616, baseType: !5, size: 32, elements: !26)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsnes.h", directory: "/home/users/ndemeye/xSDK")
!26 = !{!27, !28, !29, !30, !31, !32}
!27 = !DIEnumerator(name: "SNES_LINESEARCH_SUCCEEDED", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_NANORINF", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_DOMAIN", value: 2, isUnsigned: true)
!30 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_REDUCT", value: 3, isUnsigned: true)
!31 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_USER", value: 4, isUnsigned: true)
!32 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_FUNCTION", value: 5, isUnsigned: true)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !34, line: 663, baseType: !5, size: 32, elements: !35)
!34 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!35 = !{!36, !37, !38}
!36 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!37 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!38 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 238, baseType: !40, size: 32, elements: !41)
!40 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58}
!42 = !DIEnumerator(name: "SNES_CONVERGED_FNORM_ABS", value: 2)
!43 = !DIEnumerator(name: "SNES_CONVERGED_FNORM_RELATIVE", value: 3)
!44 = !DIEnumerator(name: "SNES_CONVERGED_SNORM_RELATIVE", value: 4)
!45 = !DIEnumerator(name: "SNES_CONVERGED_ITS", value: 5)
!46 = !DIEnumerator(name: "SNES_DIVERGED_FUNCTION_DOMAIN", value: -1)
!47 = !DIEnumerator(name: "SNES_DIVERGED_FUNCTION_COUNT", value: -2)
!48 = !DIEnumerator(name: "SNES_DIVERGED_LINEAR_SOLVE", value: -3)
!49 = !DIEnumerator(name: "SNES_DIVERGED_FNORM_NAN", value: -4)
!50 = !DIEnumerator(name: "SNES_DIVERGED_MAX_IT", value: -5)
!51 = !DIEnumerator(name: "SNES_DIVERGED_LINE_SEARCH", value: -6)
!52 = !DIEnumerator(name: "SNES_DIVERGED_INNER", value: -7)
!53 = !DIEnumerator(name: "SNES_DIVERGED_LOCAL_MIN", value: -8)
!54 = !DIEnumerator(name: "SNES_DIVERGED_DTOL", value: -9)
!55 = !DIEnumerator(name: "SNES_DIVERGED_JACOBIAN_DOMAIN", value: -10)
!56 = !DIEnumerator(name: "SNES_DIVERGED_TR_DELTA", value: -11)
!57 = !DIEnumerator(name: "SNES_CONVERGED_TR_DELTA", value: -11)
!58 = !DIEnumerator(name: "SNES_CONVERGED_ITERATING", value: 0)
!59 = !{!60, !63, !67, !68, !126}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!62 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !64, line: 330, baseType: !65)
!64 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !64, line: 330, flags: DIFlagFwdDecl)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !71, line: 73, size: 4480, elements: !72)
!71 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!72 = !{!73, !75, !121, !122, !124, !127, !128, !129, !130, !138, !139, !141, !145, !149, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !162, !163, !164, !166, !167, !169, !171, !172, !173, !174, !175, !178, !180, !181, !182, !183, !184, !187, !189, !190, !191, !201, !203, !204, !208, !209, !258, !263, !265, !266, !267}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !70, file: !71, line: 74, baseType: !74, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !40)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !70, file: !71, line: 75, baseType: !76, size: 448, offset: 64)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 448, elements: !119)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !71, line: 53, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !71, line: 45, size: 448, elements: !79)
!79 = !{!80, !86, !94, !99, !103, !107, !114}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !78, file: !71, line: 46, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{!84, !68, !85}
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !40)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !78, file: !71, line: 47, baseType: !87, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!84, !68, !90}
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !91, line: 16, baseType: !92)
!91 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !91, line: 16, flags: DIFlagFwdDecl)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !78, file: !71, line: 48, baseType: !95, size: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!84, !98}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !78, file: !71, line: 49, baseType: !100, size: 64, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!84, !68, !60, !68}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !78, file: !71, line: 50, baseType: !104, size: 64, offset: 256)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!84, !68, !60, !98}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !78, file: !71, line: 51, baseType: !108, size: 64, offset: 320)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!84, !68, !60, !111}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{null}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !78, file: !71, line: 52, baseType: !115, size: 64, offset: 384)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!84, !68, !60, !118}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!119 = !{!120}
!120 = !DISubrange(count: 1)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !70, file: !71, line: 76, baseType: !63, size: 64, offset: 512)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !70, file: !71, line: 77, baseType: !123, size: 32, offset: 576)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !40)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !70, file: !71, line: 78, baseType: !125, size: 64, offset: 640)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !126)
!126 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !70, file: !71, line: 78, baseType: !125, size: 64, offset: 704)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !70, file: !71, line: 78, baseType: !125, size: 64, offset: 768)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !70, file: !71, line: 78, baseType: !125, size: 64, offset: 832)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !70, file: !71, line: 79, baseType: !131, size: 64, offset: 896)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !134, line: 27, baseType: !135)
!134 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !136, line: 43, baseType: !137)
!136 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!137 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !70, file: !71, line: 80, baseType: !123, size: 32, offset: 960)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !70, file: !71, line: 81, baseType: !140, size: 32, offset: 992)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !40)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !70, file: !71, line: 82, baseType: !142, size: 64, offset: 1024)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !70, file: !71, line: 83, baseType: !146, size: 64, offset: 1088)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !70, file: !71, line: 84, baseType: !150, size: 64, offset: 1152)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !70, file: !71, line: 85, baseType: !150, size: 64, offset: 1216)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !70, file: !71, line: 86, baseType: !150, size: 64, offset: 1280)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !70, file: !71, line: 87, baseType: !150, size: 64, offset: 1344)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !70, file: !71, line: 88, baseType: !68, size: 64, offset: 1408)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !70, file: !71, line: 89, baseType: !131, size: 64, offset: 1472)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !70, file: !71, line: 90, baseType: !150, size: 64, offset: 1536)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !70, file: !71, line: 91, baseType: !150, size: 64, offset: 1600)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !70, file: !71, line: 92, baseType: !123, size: 32, offset: 1664)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !70, file: !71, line: 93, baseType: !67, size: 64, offset: 1728)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !70, file: !71, line: 94, baseType: !161, size: 64, offset: 1792)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !132)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !70, file: !71, line: 95, baseType: !123, size: 32, offset: 1856)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !70, file: !71, line: 95, baseType: !123, size: 32, offset: 1888)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !70, file: !71, line: 96, baseType: !165, size: 64, offset: 1920)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !70, file: !71, line: 96, baseType: !165, size: 64, offset: 1984)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !70, file: !71, line: 97, baseType: !168, size: 64, offset: 2048)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !70, file: !71, line: 97, baseType: !170, size: 64, offset: 2112)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !70, file: !71, line: 98, baseType: !123, size: 32, offset: 2176)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !70, file: !71, line: 98, baseType: !123, size: 32, offset: 2208)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !70, file: !71, line: 99, baseType: !165, size: 64, offset: 2240)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !70, file: !71, line: 99, baseType: !165, size: 64, offset: 2304)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !70, file: !71, line: 100, baseType: !176, size: 64, offset: 2368)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !126)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !70, file: !71, line: 100, baseType: !179, size: 64, offset: 2432)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !70, file: !71, line: 101, baseType: !123, size: 32, offset: 2496)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !70, file: !71, line: 101, baseType: !123, size: 32, offset: 2528)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !70, file: !71, line: 102, baseType: !165, size: 64, offset: 2560)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !70, file: !71, line: 102, baseType: !165, size: 64, offset: 2624)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !70, file: !71, line: 103, baseType: !185, size: 64, offset: 2688)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !177)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !70, file: !71, line: 103, baseType: !188, size: 64, offset: 2752)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !70, file: !71, line: 104, baseType: !118, size: 64, offset: 2816)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !70, file: !71, line: 105, baseType: !123, size: 32, offset: 2880)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !70, file: !71, line: 106, baseType: !192, size: 128, offset: 2944)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 128, elements: !199)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !71, line: 64, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !71, line: 61, size: 128, elements: !196)
!196 = !{!197, !198}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !195, file: !71, line: 62, baseType: !111, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !195, file: !71, line: 63, baseType: !67, size: 64, offset: 64)
!199 = !{!200}
!200 = !DISubrange(count: 2)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !70, file: !71, line: 107, baseType: !202, size: 64, offset: 3072)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 64, elements: !199)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !70, file: !71, line: 108, baseType: !67, size: 64, offset: 3136)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !70, file: !71, line: 109, baseType: !205, size: 64, offset: 3200)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!84, !67}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !70, file: !71, line: 111, baseType: !123, size: 32, offset: 3264)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !70, file: !71, line: 112, baseType: !210, size: 320, offset: 3328)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 320, elements: !256)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!84, !214, !68, !67}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !217)
!217 = !{!218, !219, !244, !245, !246, !247, !248, !249, !250, !251, !252}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !216, file: !10, line: 100, baseType: !123, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !216, file: !10, line: 101, baseType: !220, size: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !223)
!223 = !{!224, !225, !226, !227, !228, !231, !232, !233, !237, !239, !241, !242, !243}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !222, file: !10, line: 84, baseType: !150, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !222, file: !10, line: 85, baseType: !150, size: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !222, file: !10, line: 86, baseType: !67, size: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !222, file: !10, line: 87, baseType: !142, size: 64, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !222, file: !10, line: 88, baseType: !229, size: 64, offset: 256)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !222, file: !10, line: 89, baseType: !62, size: 8, offset: 320)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !222, file: !10, line: 90, baseType: !150, size: 64, offset: 384)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !222, file: !10, line: 91, baseType: !234, size: 64, offset: 448)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !235, line: 46, baseType: !236)
!235 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!236 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !222, file: !10, line: 92, baseType: !238, size: 32, offset: 512)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !222, file: !10, line: 93, baseType: !240, size: 32, offset: 544)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !222, file: !10, line: 94, baseType: !220, size: 64, offset: 576)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !222, file: !10, line: 95, baseType: !150, size: 64, offset: 640)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !222, file: !10, line: 96, baseType: !67, size: 64, offset: 704)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !216, file: !10, line: 102, baseType: !150, size: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !216, file: !10, line: 102, baseType: !150, size: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !216, file: !10, line: 103, baseType: !150, size: 64, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !216, file: !10, line: 104, baseType: !63, size: 64, offset: 320)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !216, file: !10, line: 105, baseType: !238, size: 32, offset: 384)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !216, file: !10, line: 105, baseType: !238, size: 32, offset: 416)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !216, file: !10, line: 105, baseType: !238, size: 32, offset: 448)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !216, file: !10, line: 106, baseType: !68, size: 64, offset: 512)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !216, file: !10, line: 107, baseType: !253, size: 64, offset: 576)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!256 = !{!257}
!257 = !DISubrange(count: 5)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !70, file: !71, line: 113, baseType: !259, size: 320, offset: 3648)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 320, elements: !256)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!84, !68, !67}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !70, file: !71, line: 114, baseType: !264, size: 320, offset: 3968)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 320, elements: !256)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !70, file: !71, line: 115, baseType: !238, size: 32, offset: 4288)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !70, file: !71, line: 120, baseType: !253, size: 64, offset: 4352)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !70, file: !71, line: 121, baseType: !238, size: 32, offset: 4416)
!268 = !{i32 7, !"Dwarf Version", i32 4}
!269 = !{i32 2, !"Debug Info Version", i32 3}
!270 = !{i32 1, !"wchar_size", i32 4}
!271 = !{i32 7, !"PIC Level", i32 2}
!272 = !{i32 7, !"uwtable", i32 1}
!273 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!274 = distinct !DISubprogram(name: "SNESLineSearchCreate_CP", scope: !275, file: !275, line: 163, type: !276, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !377)
!275 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/snes/linesearch/impls/cp/linesearchcp.c", directory: "/home/users/ndemeye/xSDK")
!276 = !DISubroutineType(types: !277)
!277 = !{!84, !278}
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearch", file: !25, line: 526, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_LineSearch", file: !281, line: 29, size: 8000, elements: !282)
!281 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/linesearchimpl.h", directory: "/home/users/ndemeye/xSDK")
!282 = !{!283, !285, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !344, !345, !346, !347, !348, !349, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !369, !375, !376}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !280, file: !281, line: 30, baseType: !284, size: 4480)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !71, line: 122, baseType: !70)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !280, file: !281, line: 30, baseType: !286, size: 704, offset: 4480)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 704, elements: !119)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LineSearchOps", file: !281, line: 13, size: 704, elements: !288)
!288 = !{!289, !293, !296, !305, !313, !318, !322, !326, !327, !328, !329}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !287, file: !281, line: 14, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!84, !278, !90}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !287, file: !281, line: 15, baseType: !294, size: 64, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchApplyFunc", file: !25, line: 554, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "precheck", scope: !287, file: !281, line: 16, baseType: !297, size: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!84, !278, !300, !300, !304, !67}
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !301, line: 21, baseType: !302)
!301 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !301, line: 21, flags: DIFlagFwdDecl)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "viproject", scope: !287, file: !281, line: 17, baseType: !306, size: 64, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchVIProjectFunc", file: !25, line: 552, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!84, !310, !300}
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !25, line: 18, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !25, line: 18, flags: DIFlagFwdDecl)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "vinorm", scope: !287, file: !281, line: 18, baseType: !314, size: 64, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchVINormFunc", file: !25, line: 553, baseType: !315)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!84, !310, !300, !300, !176}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "postcheck", scope: !287, file: !281, line: 19, baseType: !319, size: 64, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!84, !278, !300, !300, !300, !304, !304, !67}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !287, file: !281, line: 20, baseType: !323, size: 64, offset: 384)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!84, !214, !278}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !287, file: !281, line: 21, baseType: !295, size: 64, offset: 448)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !287, file: !281, line: 22, baseType: !295, size: 64, offset: 512)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !287, file: !281, line: 23, baseType: !295, size: 64, offset: 576)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "snesfunc", scope: !287, file: !281, line: 24, baseType: !330, size: 64, offset: 640)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{!84, !310, !300, !300}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "snes", scope: !280, file: !281, line: 32, baseType: !310, size: 64, offset: 5184)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !280, file: !281, line: 34, baseType: !67, size: 64, offset: 5248)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !280, file: !281, line: 36, baseType: !238, size: 32, offset: 5312)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !280, file: !281, line: 38, baseType: !300, size: 64, offset: 5376)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_new", scope: !280, file: !281, line: 39, baseType: !300, size: 64, offset: 5440)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !280, file: !281, line: 40, baseType: !300, size: 64, offset: 5504)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_new", scope: !280, file: !281, line: 41, baseType: !300, size: 64, offset: 5568)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "vec_update", scope: !280, file: !281, line: 42, baseType: !300, size: 64, offset: 5632)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !280, file: !281, line: 44, baseType: !123, size: 32, offset: 5696)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !280, file: !281, line: 45, baseType: !343, size: 64, offset: 5760)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !280, file: !281, line: 47, baseType: !177, size: 64, offset: 5824)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "norms", scope: !280, file: !281, line: 49, baseType: !238, size: 32, offset: 5888)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "fnorm", scope: !280, file: !281, line: 50, baseType: !177, size: 64, offset: 5952)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !280, file: !281, line: 51, baseType: !177, size: 64, offset: 6016)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !280, file: !281, line: 52, baseType: !177, size: 64, offset: 6080)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !280, file: !281, line: 53, baseType: !350, size: 32, offset: 6144)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchReason", file: !25, line: 621, baseType: !24)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "keeplambda", scope: !280, file: !281, line: 54, baseType: !238, size: 32, offset: 6176)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !280, file: !281, line: 56, baseType: !177, size: 64, offset: 6208)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "maxstep", scope: !280, file: !281, line: 57, baseType: !177, size: 64, offset: 6272)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "steptol", scope: !280, file: !281, line: 58, baseType: !177, size: 64, offset: 6336)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !280, file: !281, line: 59, baseType: !123, size: 32, offset: 6400)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !280, file: !281, line: 60, baseType: !177, size: 64, offset: 6464)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "atol", scope: !280, file: !281, line: 61, baseType: !177, size: 64, offset: 6528)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ltol", scope: !280, file: !281, line: 62, baseType: !177, size: 64, offset: 6592)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !280, file: !281, line: 63, baseType: !123, size: 32, offset: 6656)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !280, file: !281, line: 65, baseType: !177, size: 64, offset: 6720)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "precheckctx", scope: !280, file: !281, line: 67, baseType: !67, size: 64, offset: 6784)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "postcheckctx", scope: !280, file: !281, line: 68, baseType: !67, size: 64, offset: 6848)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !280, file: !281, line: 70, baseType: !90, size: 64, offset: 6912)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "monitorftns", scope: !280, file: !281, line: 71, baseType: !365, size: 320, offset: 6976)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 320, elements: !256)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!84, !278, !67}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !280, file: !281, line: 72, baseType: !370, size: 320, offset: 7296)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !371, size: 320, elements: !256)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!84, !374}
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !280, file: !281, line: 73, baseType: !264, size: 320, offset: 7616)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !280, file: !281, line: 74, baseType: !123, size: 32, offset: 7936)
!377 = !{!378}
!378 = !DILocalVariable(name: "linesearch", arg: 1, scope: !274, file: !275, line: 163, type: !278)
!379 = !DILocation(line: 0, scope: !274)
!380 = !DILocation(line: 165, column: 3, scope: !381)
!381 = distinct !DILexicalBlock(scope: !382, file: !275, line: 165, column: 3)
!382 = distinct !DILexicalBlock(scope: !383, file: !275, line: 165, column: 3)
!383 = distinct !DILexicalBlock(scope: !274, file: !275, line: 165, column: 3)
!384 = !{!385, !385, i64 0}
!385 = !{!"any pointer", !386, i64 0}
!386 = !{!"omnipotent char", !387, i64 0}
!387 = !{!"Simple C/C++ TBAA"}
!388 = !DILocation(line: 165, column: 3, scope: !382)
!389 = !DILocation(line: 165, column: 3, scope: !390)
!390 = distinct !DILexicalBlock(scope: !391, file: !275, line: 165, column: 3)
!391 = distinct !DILexicalBlock(scope: !381, file: !275, line: 165, column: 3)
!392 = !{!393, !394, i64 1536}
!393 = !{!"", !386, i64 0, !386, i64 512, !386, i64 1024, !386, i64 1280, !394, i64 1536, !394, i64 1540, !386, i64 1544}
!394 = !{!"int", !386, i64 0}
!395 = !DILocation(line: 165, column: 3, scope: !391)
!396 = !DILocation(line: 165, column: 3, scope: !397)
!397 = distinct !DILexicalBlock(scope: !390, file: !275, line: 165, column: 3)
!398 = !{!394, !394, i64 0}
!399 = !{!393, !394, i64 1540}
!400 = !DILocation(line: 175, column: 3, scope: !401)
!401 = distinct !DILexicalBlock(scope: !402, file: !275, line: 175, column: 3)
!402 = distinct !DILexicalBlock(scope: !403, file: !275, line: 175, column: 3)
!403 = distinct !DILexicalBlock(scope: !274, file: !275, line: 175, column: 3)
!404 = !DILocation(line: 166, column: 20, scope: !274)
!405 = !DILocation(line: 166, column: 35, scope: !274)
!406 = !{!407, !385, i64 8}
!407 = !{!"_LineSearchOps", !385, i64 0, !385, i64 8, !385, i64 16, !385, i64 24, !385, i64 32, !385, i64 40, !385, i64 48, !385, i64 56, !385, i64 64, !385, i64 72, !385, i64 80}
!408 = !DILocation(line: 168, column: 20, scope: !274)
!409 = !DILocation(line: 170, column: 20, scope: !274)
!410 = !DILocation(line: 170, column: 35, scope: !274)
!411 = !{!407, !385, i64 0}
!412 = !DILocation(line: 172, column: 15, scope: !274)
!413 = !DILocation(line: 172, column: 35, scope: !274)
!414 = !DILocation(line: 168, column: 35, scope: !274)
!415 = !{!416, !394, i64 832}
!416 = !{!"_p_LineSearch", !417, i64 0, !386, i64 560, !385, i64 648, !385, i64 656, !386, i64 664, !385, i64 672, !385, i64 680, !385, i64 688, !385, i64 696, !385, i64 704, !394, i64 712, !385, i64 720, !418, i64 728, !386, i64 736, !418, i64 744, !418, i64 752, !418, i64 760, !386, i64 768, !386, i64 772, !418, i64 776, !418, i64 784, !418, i64 792, !394, i64 800, !418, i64 808, !418, i64 816, !418, i64 824, !394, i64 832, !418, i64 840, !385, i64 848, !385, i64 856, !385, i64 864, !386, i64 872, !386, i64 912, !386, i64 952, !394, i64 992}
!417 = !{!"_p_PetscObject", !394, i64 0, !386, i64 8, !385, i64 64, !394, i64 72, !418, i64 80, !418, i64 88, !418, i64 96, !418, i64 104, !419, i64 112, !394, i64 120, !394, i64 124, !385, i64 128, !385, i64 136, !385, i64 144, !385, i64 152, !385, i64 160, !385, i64 168, !385, i64 176, !419, i64 184, !385, i64 192, !385, i64 200, !394, i64 208, !385, i64 216, !419, i64 224, !394, i64 232, !394, i64 236, !385, i64 240, !385, i64 248, !385, i64 256, !385, i64 264, !394, i64 272, !394, i64 276, !385, i64 280, !385, i64 288, !385, i64 296, !385, i64 304, !394, i64 312, !394, i64 316, !385, i64 320, !385, i64 328, !385, i64 336, !385, i64 344, !385, i64 352, !394, i64 360, !386, i64 368, !386, i64 384, !385, i64 392, !385, i64 400, !394, i64 408, !386, i64 416, !386, i64 456, !386, i64 496, !386, i64 536, !385, i64 544, !386, i64 552}
!418 = !{!"double", !386, i64 0}
!419 = !{!"long", !386, i64 0}
!420 = !DILocation(line: 174, column: 15, scope: !274)
!421 = !DILocation(line: 174, column: 23, scope: !274)
!422 = !{!416, !394, i64 800}
