; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/nasm/aspin.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/nasm/aspin.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Mat = type opaque
%struct._p_Vec = type opaque
%struct._p_PetscSF = type opaque
%struct._p_SNES = type { %struct._p_PetscObject, [1 x %struct._SNESOps], %struct._p_DM*, i32, %struct._p_SNES*, i32, i32, i8*, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Mat*, i8*, %struct._p_KSP*, %struct._p_LineSearch*, i32, i32, %struct._p_Vec*, %struct._p_Vec*, i8*, double, [5 x i32 (%struct._p_SNES*, i32, double, i8*)*], [5 x i32 (i8**)*], [5 x i8*], i32, i8*, i32, [5 x i32 (%struct._p_SNES*, i8*)*], [5 x i32 (i8**)*], [5 x i8*], i32, i32, i32, i8*, i32, i32, i32, i32, i32, double, double, double, double, double, double, double, double, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct._p_Vec**, i32, double*, i32*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, double, double, %struct._p_Vec**, i32, i32, i32, i32, double, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 }

!207 = !DIEnumerator(name: "MATOP_REAL_PART", value: 105, isUnsigned: true)
!208 = !DIEnumerator(name: "MATOP_IMAGINARY_PART", value: 106, isUnsigned: true)
!209 = !DIEnumerator(name: "MATOP_GET_ROW_UPPER_TRIANGULAR", value: 107, isUnsigned: true)
!210 = !DIEnumerator(name: "MATOP_RESTORE_ROW_UPPER_TRIANG", value: 108, isUnsigned: true)
!211 = !DIEnumerator(name: "MATOP_MAT_SOLVE", value: 109, isUnsigned: true)
!212 = !DIEnumerator(name: "MATOP_MAT_SOLVE_TRANSPOSE", value: 110, isUnsigned: true)
!213 = !DIEnumerator(name: "MATOP_GET_ROW_MIN", value: 111, isUnsigned: true)
!214 = !DIEnumerator(name: "MATOP_GET_COLUMN_VECTOR", value: 112, isUnsigned: true)
!215 = !DIEnumerator(name: "MATOP_MISSING_DIAGONAL", value: 113, isUnsigned: true)
!216 = !DIEnumerator(name: "MATOP_GET_SEQ_NONZERO_STRUCTUR", value: 114, isUnsigned: true)
!217 = !DIEnumerator(name: "MATOP_CREATE", value: 115, isUnsigned: true)
!218 = !DIEnumerator(name: "MATOP_GET_GHOSTS", value: 116, isUnsigned: true)
!219 = !DIEnumerator(name: "MATOP_GET_LOCAL_SUB_MATRIX", value: 117, isUnsigned: true)
!220 = !DIEnumerator(name: "MATOP_RESTORE_LOCALSUB_MATRIX", value: 118, isUnsigned: true)
!221 = !DIEnumerator(name: "MATOP_MULT_DIAGONAL_BLOCK", value: 119, isUnsigned: true)
!222 = !DIEnumerator(name: "MATOP_HERMITIAN_TRANSPOSE", value: 120, isUnsigned: true)
!223 = !DIEnumerator(name: "MATOP_MULT_HERMITIAN_TRANSPOSE", value: 121, isUnsigned: true)
!224 = !DIEnumerator(name: "MATOP_MULT_HERMITIAN_TRANS_ADD", value: 122, isUnsigned: true)
!225 = !DIEnumerator(name: "MATOP_GET_MULTI_PROC_BLOCK", value: 123, isUnsigned: true)
!226 = !DIEnumerator(name: "MATOP_FIND_NONZERO_ROWS", value: 124, isUnsigned: true)
!227 = !DIEnumerator(name: "MATOP_GET_COLUMN_NORMS", value: 125, isUnsigned: true)
!228 = !DIEnumerator(name: "MATOP_INVERT_BLOCK_DIAGONAL", value: 126, isUnsigned: true)
!229 = !DIEnumerator(name: "MATOP_CREATE_SUB_MATRICES_MPI", value: 128, isUnsigned: true)
!230 = !DIEnumerator(name: "MATOP_SET_VALUES_BATCH", value: 129, isUnsigned: true)
!231 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT", value: 130, isUnsigned: true)
!232 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_SYMBO", value: 131, isUnsigned: true)
!233 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_NUMER", value: 132, isUnsigned: true)
!234 = !DIEnumerator(name: "MATOP_TRANSPOSE_COLORING_CREAT", value: 133, isUnsigned: true)
!235 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_SPT", value: 134, isUnsigned: true)
!236 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_DEN", value: 135, isUnsigned: true)
!237 = !DIEnumerator(name: "MATOP_RART", value: 136, isUnsigned: true)
!238 = !DIEnumerator(name: "MATOP_RART_SYMBOLIC", value: 137, isUnsigned: true)
!239 = !DIEnumerator(name: "MATOP_RART_NUMERIC", value: 138, isUnsigned: true)
!240 = !DIEnumerator(name: "MATOP_SET_BLOCK_SIZES", value: 139, isUnsigned: true)
!241 = !DIEnumerator(name: "MATOP_AYPX", value: 140, isUnsigned: true)
!242 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!243 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!244 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!245 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!246 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!247 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!248 = !{!249, !253, !254, !276, !296, !307}
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !250, line: 330, baseType: !251)
!250 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !250, line: 330, flags: DIFlagFwdDecl)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !25, line: 18, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !257, line: 38, size: 11648, elements: !258)
!257 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/snesimpl.h", directory: "/home/users/ndemeye/xSDK")
!258 = !{!259, !464, !530, !535, !536, !537, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !553, !557, !558, !560, !561, !562, !563, !564, !569, !571, !572, !573, !574, !575, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !611, !613, !614, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !256, file: !257, line: 39, baseType: !260, size: 4480)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !261, line: 122, baseType: !262)
!261 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !261, line: 73, size: 4480, elements: !263)
!263 = !{!264, !266, !317, !318, !320, !323, !324, !325, !326, !334, !335, !337, !341, !345, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !358, !359, !360, !362, !363, !365, !367, !368, !369, !370, !371, !374, !376, !377, !378, !379, !380, !383, !385, !386, !387, !397, !399, !400, !404, !405, !454, !459, !461, !462, !463}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !262, file: !261, line: 74, baseType: !265, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !262, file: !261, line: 75, baseType: !267, size: 448, offset: 64)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 448, elements: !315)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !261, line: 53, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !261, line: 45, size: 448, elements: !270)
!270 = !{!271, !279, !287, !292, !299, !303, !310}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !269, file: !261, line: 46, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!275, !276, !278}
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !269, file: !261, line: 47, baseType: !280, size: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!275, !276, !283}
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !284, line: 16, baseType: !285)
!284 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !284, line: 16, flags: DIFlagFwdDecl)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !269, file: !261, line: 48, baseType: !288, size: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!275, !291}
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !269, file: !261, line: 49, baseType: !293, size: 64, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!275, !276, !296, !276}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !298)
!298 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !269, file: !261, line: 50, baseType: !300, size: 64, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!275, !276, !296, !291}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !269, file: !261, line: 51, baseType: !304, size: 64, offset: 320)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!275, !276, !296, !307}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{null}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !269, file: !261, line: 52, baseType: !311, size: 64, offset: 384)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!275, !276, !296, !314}
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!315 = !{!316}
!316 = !DISubrange(count: 1)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !262, file: !261, line: 76, baseType: !249, size: 64, offset: 512)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !262, file: !261, line: 77, baseType: !319, size: 32, offset: 576)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !262, file: !261, line: 78, baseType: !321, size: 64, offset: 640)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !322)
!322 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !262, file: !261, line: 78, baseType: !321, size: 64, offset: 704)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !262, file: !261, line: 78, baseType: !321, size: 64, offset: 768)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !262, file: !261, line: 78, baseType: !321, size: 64, offset: 832)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !262, file: !261, line: 79, baseType: !327, size: 64, offset: 896)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !330, line: 27, baseType: !331)
!330 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !332, line: 43, baseType: !333)
!332 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!333 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !262, file: !261, line: 80, baseType: !319, size: 32, offset: 960)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !262, file: !261, line: 81, baseType: !336, size: 32, offset: 992)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !262, file: !261, line: 82, baseType: !338, size: 64, offset: 1024)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !262, file: !261, line: 83, baseType: !342, size: 64, offset: 1088)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !262, file: !261, line: 84, baseType: !346, size: 64, offset: 1152)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !262, file: !261, line: 85, baseType: !346, size: 64, offset: 1216)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !262, file: !261, line: 86, baseType: !346, size: 64, offset: 1280)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !262, file: !261, line: 87, baseType: !346, size: 64, offset: 1344)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !262, file: !261, line: 88, baseType: !276, size: 64, offset: 1408)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !262, file: !261, line: 89, baseType: !327, size: 64, offset: 1472)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !262, file: !261, line: 90, baseType: !346, size: 64, offset: 1536)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !262, file: !261, line: 91, baseType: !346, size: 64, offset: 1600)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !262, file: !261, line: 92, baseType: !319, size: 32, offset: 1664)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !262, file: !261, line: 93, baseType: !253, size: 64, offset: 1728)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !262, file: !261, line: 94, baseType: !357, size: 64, offset: 1792)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !328)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !262, file: !261, line: 95, baseType: !319, size: 32, offset: 1856)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !262, file: !261, line: 95, baseType: !319, size: 32, offset: 1888)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !262, file: !261, line: 96, baseType: !361, size: 64, offset: 1920)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !262, file: !261, line: 96, baseType: !361, size: 64, offset: 1984)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !262, file: !261, line: 97, baseType: !364, size: 64, offset: 2048)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !262, file: !261, line: 97, baseType: !366, size: 64, offset: 2112)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !262, file: !261, line: 98, baseType: !319, size: 32, offset: 2176)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !262, file: !261, line: 98, baseType: !319, size: 32, offset: 2208)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !262, file: !261, line: 99, baseType: !361, size: 64, offset: 2240)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !262, file: !261, line: 99, baseType: !361, size: 64, offset: 2304)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !262, file: !261, line: 100, baseType: !372, size: 64, offset: 2368)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !322)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !262, file: !261, line: 100, baseType: !375, size: 64, offset: 2432)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !262, file: !261, line: 101, baseType: !319, size: 32, offset: 2496)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !262, file: !261, line: 101, baseType: !319, size: 32, offset: 2528)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !262, file: !261, line: 102, baseType: !361, size: 64, offset: 2560)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !262, file: !261, line: 102, baseType: !361, size: 64, offset: 2624)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !262, file: !261, line: 103, baseType: !381, size: 64, offset: 2688)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !373)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !262, file: !261, line: 103, baseType: !384, size: 64, offset: 2752)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !262, file: !261, line: 104, baseType: !314, size: 64, offset: 2816)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !262, file: !261, line: 105, baseType: !319, size: 32, offset: 2880)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !262, file: !261, line: 106, baseType: !388, size: 128, offset: 2944)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 128, elements: !395)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !261, line: 64, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !261, line: 61, size: 128, elements: !392)
!392 = !{!393, !394}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !391, file: !261, line: 62, baseType: !307, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !391, file: !261, line: 63, baseType: !253, size: 64, offset: 64)
!395 = !{!396}
!396 = !DISubrange(count: 2)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !262, file: !261, line: 107, baseType: !398, size: 64, offset: 3072)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !319, size: 64, elements: !395)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !262, file: !261, line: 108, baseType: !253, size: 64, offset: 3136)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !262, file: !261, line: 109, baseType: !401, size: 64, offset: 3200)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!275, !253}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !262, file: !261, line: 111, baseType: !319, size: 32, offset: 3264)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !262, file: !261, line: 112, baseType: !406, size: 320, offset: 3328)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 320, elements: !452)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!275, !410, !276, !253}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !413)
!413 = !{!414, !415, !440, !441, !442, !443, !444, !445, !446, !447, !448}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !412, file: !10, line: 100, baseType: !319, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !412, file: !10, line: 101, baseType: !416, size: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !417)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !419)
!419 = !{!420, !421, !422, !423, !424, !427, !428, !429, !433, !435, !437, !438, !439}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !418, file: !10, line: 84, baseType: !346, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !418, file: !10, line: 85, baseType: !346, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !418, file: !10, line: 86, baseType: !253, size: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !418, file: !10, line: 87, baseType: !338, size: 64, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !418, file: !10, line: 88, baseType: !425, size: 64, offset: 256)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !296)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !418, file: !10, line: 89, baseType: !298, size: 8, offset: 320)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !418, file: !10, line: 90, baseType: !346, size: 64, offset: 384)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !418, file: !10, line: 91, baseType: !430, size: 64, offset: 448)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !431, line: 46, baseType: !432)
!431 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!432 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !418, file: !10, line: 92, baseType: !434, size: 32, offset: 512)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !418, file: !10, line: 93, baseType: !436, size: 32, offset: 544)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !418, file: !10, line: 94, baseType: !416, size: 64, offset: 576)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !418, file: !10, line: 95, baseType: !346, size: 64, offset: 640)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !418, file: !10, line: 96, baseType: !253, size: 64, offset: 704)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !412, file: !10, line: 102, baseType: !346, size: 64, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !412, file: !10, line: 102, baseType: !346, size: 64, offset: 192)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !412, file: !10, line: 103, baseType: !346, size: 64, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !412, file: !10, line: 104, baseType: !249, size: 64, offset: 320)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !412, file: !10, line: 105, baseType: !434, size: 32, offset: 384)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !412, file: !10, line: 105, baseType: !434, size: 32, offset: 416)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !412, file: !10, line: 105, baseType: !434, size: 32, offset: 448)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !412, file: !10, line: 106, baseType: !276, size: 64, offset: 512)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !412, file: !10, line: 107, baseType: !449, size: 64, offset: 576)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !450)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!452 = !{!453}
!453 = !DISubrange(count: 5)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !262, file: !261, line: 113, baseType: !455, size: 320, offset: 3648)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 320, elements: !452)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{!275, !276, !253}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !262, file: !261, line: 114, baseType: !460, size: 320, offset: 3968)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 320, elements: !452)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !262, file: !261, line: 115, baseType: !434, size: 32, offset: 4288)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !262, file: !261, line: 120, baseType: !449, size: 64, offset: 4352)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !262, file: !261, line: 121, baseType: !434, size: 32, offset: 4416)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !256, file: !257, line: 39, baseType: !465, size: 1088, offset: 4480)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 1088, elements: !315)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SNESOps", file: !257, line: 12, size: 1088, elements: !467)
!467 = !{!468, !475, !479, !483, !489, !490, !494, !495, !499, !503, !504, !505, !510, !514, !518, !522, !529}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "computeinitialguess", scope: !466, file: !257, line: 13, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DISubroutineType(types: !471)
!471 = !{!275, !254, !472, !253}
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !90, line: 21, baseType: !473)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !90, line: 21, flags: DIFlagFwdDecl)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "computescaling", scope: !466, file: !257, line: 14, baseType: !476, size: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!275, !472, !472, !253}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !466, file: !257, line: 15, baseType: !480, size: 64, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!275, !254, !319}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !466, file: !257, line: 16, baseType: !484, size: 64, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!275, !254, !319, !373, !373, !373, !487, !253}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESConvergedReason", file: !25, line: 257, baseType: !24)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !466, file: !257, line: 17, baseType: !401, size: 64, offset: 256)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !466, file: !257, line: 18, baseType: !491, size: 64, offset: 320)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!275, !254}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !466, file: !257, line: 19, baseType: !491, size: 64, offset: 384)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !466, file: !257, line: 20, baseType: !496, size: 64, offset: 448)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{!275, !254, !283}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !466, file: !257, line: 21, baseType: !500, size: 64, offset: 512)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!275, !410, !254}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !466, file: !257, line: 22, baseType: !491, size: 64, offset: 576)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !466, file: !257, line: 23, baseType: !491, size: 64, offset: 640)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "usercompute", scope: !466, file: !257, line: 24, baseType: !506, size: 64, offset: 704)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!275, !254, !509}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "userdestroy", scope: !466, file: !257, line: 25, baseType: !511, size: 64, offset: 768)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{!275, !509}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !466, file: !257, line: 26, baseType: !515, size: 64, offset: 832)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{!275, !254, !472, !472}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "computepfunction", scope: !466, file: !257, line: 27, baseType: !519, size: 64, offset: 896)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{!275, !254, !472, !472, !253}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "computepjacobian", scope: !466, file: !257, line: 28, baseType: !523, size: 64, offset: 960)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!275, !254, !472, !526, !526, !253}
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !53, line: 16, baseType: !527)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !53, line: 16, flags: DIFlagFwdDecl)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !466, file: !257, line: 29, baseType: !496, size: 64, offset: 1024)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !256, file: !257, line: 40, baseType: !531, size: 64, offset: 5568)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !532, line: 14, baseType: !533)
!532 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !532, line: 14, flags: DIFlagFwdDecl)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !256, file: !257, line: 41, baseType: !434, size: 32, offset: 5632)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "npc", scope: !256, file: !257, line: 42, baseType: !254, size: 64, offset: 5696)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "npcside", scope: !256, file: !257, line: 43, baseType: !538, size: 32, offset: 5760)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !46, line: 85, baseType: !45)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "usesnpc", scope: !256, file: !257, line: 44, baseType: !434, size: 32, offset: 5792)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !256, file: !257, line: 47, baseType: !253, size: 64, offset: 5824)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !256, file: !257, line: 49, baseType: !472, size: 64, offset: 5888)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !256, file: !257, line: 50, baseType: !472, size: 64, offset: 5952)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !256, file: !257, line: 52, baseType: !472, size: 64, offset: 6016)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !256, file: !257, line: 54, baseType: !526, size: 64, offset: 6080)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !256, file: !257, line: 55, baseType: !526, size: 64, offset: 6144)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "picard", scope: !256, file: !257, line: 56, baseType: !526, size: 64, offset: 6208)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "initialguessP", scope: !256, file: !257, line: 57, baseType: !253, size: 64, offset: 6272)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !256, file: !257, line: 58, baseType: !549, size: 64, offset: 6336)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !550, line: 22, baseType: !551)
!550 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !550, line: 22, flags: DIFlagFwdDecl)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !256, file: !257, line: 59, baseType: !554, size: 64, offset: 6400)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearch", file: !25, line: 526, baseType: !555)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_LineSearch", file: !25, line: 526, flags: DIFlagFwdDecl)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "usesksp", scope: !256, file: !257, line: 60, baseType: !434, size: 32, offset: 6464)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "matstruct", scope: !256, file: !257, line: 61, baseType: !559, size: 32, offset: 6496)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !53, line: 285, baseType: !52)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_update", scope: !256, file: !257, line: 63, baseType: !472, size: 64, offset: 6528)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "scaling", scope: !256, file: !257, line: 65, baseType: !472, size: 64, offset: 6592)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "scaP", scope: !256, file: !257, line: 66, baseType: !253, size: 64, offset: 6656)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !256, file: !257, line: 68, baseType: !373, size: 64, offset: 6720)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !256, file: !257, line: 74, baseType: !565, size: 320, offset: 6784)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 320, elements: !452)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!275, !254, !319, !373, !253}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !256, file: !257, line: 75, baseType: !570, size: 320, offset: 7104)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !511, size: 320, elements: !452)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !256, file: !257, line: 76, baseType: !460, size: 320, offset: 7424)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !256, file: !257, line: 77, baseType: !319, size: 32, offset: 7744)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !256, file: !257, line: 78, baseType: !253, size: 64, offset: 7808)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !256, file: !257, line: 79, baseType: !488, size: 32, offset: 7872)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !256, file: !257, line: 80, baseType: !576, size: 320, offset: 7936)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !577, size: 320, elements: !452)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!275, !254, !253}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !256, file: !257, line: 81, baseType: !570, size: 320, offset: 8256)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !256, file: !257, line: 82, baseType: !460, size: 320, offset: 8576)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !256, file: !257, line: 83, baseType: !319, size: 32, offset: 8896)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !256, file: !257, line: 84, baseType: !434, size: 32, offset: 8928)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !256, file: !257, line: 88, baseType: !434, size: 32, offset: 8960)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !256, file: !257, line: 89, baseType: !253, size: 64, offset: 9024)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !256, file: !257, line: 93, baseType: !319, size: 32, offset: 9088)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !256, file: !257, line: 94, baseType: !319, size: 32, offset: 9120)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !256, file: !257, line: 95, baseType: !319, size: 32, offset: 9152)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !256, file: !257, line: 96, baseType: !319, size: 32, offset: 9184)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "linear_its", scope: !256, file: !257, line: 97, baseType: !319, size: 32, offset: 9216)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !256, file: !257, line: 98, baseType: !373, size: 64, offset: 9280)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !256, file: !257, line: 99, baseType: !373, size: 64, offset: 9344)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !256, file: !257, line: 100, baseType: !373, size: 64, offset: 9408)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !256, file: !257, line: 101, baseType: !373, size: 64, offset: 9472)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !256, file: !257, line: 102, baseType: !373, size: 64, offset: 9536)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !256, file: !257, line: 103, baseType: !373, size: 64, offset: 9600)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "stol", scope: !256, file: !257, line: 104, baseType: !373, size: 64, offset: 9664)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "deltatol", scope: !256, file: !257, line: 105, baseType: !373, size: 64, offset: 9728)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "forceiteration", scope: !256, file: !257, line: 106, baseType: !434, size: 32, offset: 9792)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "lagpreconditioner", scope: !256, file: !257, line: 107, baseType: !319, size: 32, offset: 9824)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "lagjacobian", scope: !256, file: !257, line: 108, baseType: !319, size: 32, offset: 9856)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "jac_iter", scope: !256, file: !257, line: 109, baseType: !319, size: 32, offset: 9888)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "lagjac_persist", scope: !256, file: !257, line: 110, baseType: !434, size: 32, offset: 9920)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "pre_iter", scope: !256, file: !257, line: 111, baseType: !319, size: 32, offset: 9952)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "lagpre_persist", scope: !256, file: !257, line: 112, baseType: !434, size: 32, offset: 9984)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "gridsequence", scope: !256, file: !257, line: 113, baseType: !319, size: 32, offset: 10016)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "tolerancesset", scope: !256, file: !257, line: 115, baseType: !434, size: 32, offset: 10048)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_init_set", scope: !256, file: !257, line: 117, baseType: !434, size: 32, offset: 10080)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "normschedule", scope: !256, file: !257, line: 119, baseType: !610, size: 32, offset: 10112)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESNormSchedule", file: !25, line: 411, baseType: !59)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !256, file: !257, line: 120, baseType: !612, size: 32, offset: 10144)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESFunctionType", file: !25, line: 495, baseType: !67)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !256, file: !257, line: 124, baseType: !319, size: 32, offset: 10176)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !256, file: !257, line: 125, baseType: !615, size: 64, offset: 10240)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !256, file: !257, line: 129, baseType: !319, size: 32, offset: 10304)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist", scope: !256, file: !257, line: 130, baseType: !372, size: 64, offset: 10368)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_its", scope: !256, file: !257, line: 132, baseType: !364, size: 64, offset: 10432)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_len", scope: !256, file: !257, line: 133, baseType: !319, size: 32, offset: 10496)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_max", scope: !256, file: !257, line: 134, baseType: !319, size: 32, offset: 10528)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_reset", scope: !256, file: !257, line: 135, baseType: !434, size: 32, offset: 10560)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_alloc", scope: !256, file: !257, line: 136, baseType: !434, size: 32, offset: 10592)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "counters_reset", scope: !256, file: !257, line: 137, baseType: !434, size: 32, offset: 10624)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "numFailures", scope: !256, file: !257, line: 140, baseType: !319, size: 32, offset: 10656)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "maxFailures", scope: !256, file: !257, line: 141, baseType: !319, size: 32, offset: 10688)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "numLinearSolveFailures", scope: !256, file: !257, line: 143, baseType: !319, size: 32, offset: 10720)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "maxLinearSolveFailures", scope: !256, file: !257, line: 144, baseType: !319, size: 32, offset: 10752)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "domainerror", scope: !256, file: !257, line: 146, baseType: !434, size: 32, offset: 10784)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "jacobiandomainerror", scope: !256, file: !257, line: 147, baseType: !434, size: 32, offset: 10816)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "checkjacdomainerror", scope: !256, file: !257, line: 148, baseType: !434, size: 32, offset: 10848)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_ewconv", scope: !256, file: !257, line: 150, baseType: !434, size: 32, offset: 10880)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "kspconvctx", scope: !256, file: !257, line: 151, baseType: !253, size: 64, offset: 10944)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !256, file: !257, line: 154, baseType: !373, size: 64, offset: 11008)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !256, file: !257, line: 155, baseType: !373, size: 64, offset: 11072)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "vwork", scope: !256, file: !257, line: 157, baseType: !615, size: 64, offset: 11136)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "nvwork", scope: !256, file: !257, line: 158, baseType: !319, size: 32, offset: 11200)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !256, file: !257, line: 160, baseType: !434, size: 32, offset: 11232)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "mf_operator", scope: !256, file: !257, line: 161, baseType: !434, size: 32, offset: 11264)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "mf_version", scope: !256, file: !257, line: 162, baseType: !319, size: 32, offset: 11296)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "vizerotolerance", scope: !256, file: !257, line: 164, baseType: !373, size: 64, offset: 11328)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "xl", scope: !256, file: !257, line: 165, baseType: !472, size: 64, offset: 11392)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "xu", scope: !256, file: !257, line: 165, baseType: !472, size: 64, offset: 11456)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ntruebounds", scope: !256, file: !257, line: 166, baseType: !319, size: 32, offset: 11520)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "usersetbounds", scope: !256, file: !257, line: 167, baseType: !434, size: 32, offset: 11552)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "alwayscomputesfinalresidual", scope: !256, file: !257, line: 169, baseType: !434, size: 32, offset: 11584)
!646 = !{i32 7, !"Dwarf Version", i32 4}
!647 = !{i32 2, !"Debug Info Version", i32 3}
!648 = !{i32 1, !"wchar_size", i32 4}
!649 = !{i32 7, !"PIC Level", i32 2}
!650 = !{i32 7, !"uwtable", i32 1}
!651 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!652 = distinct !DISubprogram(name: "MatMultASPIN", scope: !653, file: !653, line: 4, type: !654, scopeLine: 5, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !656)
!653 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/snes/impls/nasm/aspin.c", directory: "/home/users/ndemeye/xSDK")
!654 = !DISubroutineType(types: !655)
!655 = !{!275, !526, !472, !472}
!656 = !{!657, !658, !659, !660, !661, !662, !663, !664, !665, !672, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !685, !687, !689, !691, !695, !697, !699, !701, !703, !708, !713, !715, !717, !719, !721, !723, !725}
!657 = !DILocalVariable(name: "m", arg: 1, scope: !652, file: !653, line: 4, type: !526)
!658 = !DILocalVariable(name: "X", arg: 2, scope: !652, file: !653, line: 4, type: !472)
!659 = !DILocalVariable(name: "Y", arg: 3, scope: !652, file: !653, line: 4, type: !472)
!660 = !DILocalVariable(name: "ierr", scope: !652, file: !653, line: 6, type: !275)
!661 = !DILocalVariable(name: "ctx", scope: !652, file: !653, line: 7, type: !253)
!662 = !DILocalVariable(name: "snes", scope: !652, file: !653, line: 8, type: !254)
!663 = !DILocalVariable(name: "n", scope: !652, file: !653, line: 9, type: !319)
!664 = !DILocalVariable(name: "i", scope: !652, file: !653, line: 9, type: !319)
!665 = !DILocalVariable(name: "oscatter", scope: !652, file: !653, line: 10, type: !666)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !668, line: 59, baseType: !669)
!668 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !668, line: 15, baseType: !670)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !668, line: 15, flags: DIFlagFwdDecl)
!672 = !DILocalVariable(name: "subsnes", scope: !652, file: !653, line: 11, type: !673)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!674 = !DILocalVariable(name: "match", scope: !652, file: !653, line: 12, type: !434)
!675 = !DILocalVariable(name: "comm", scope: !652, file: !653, line: 13, type: !249)
!676 = !DILocalVariable(name: "ksp", scope: !652, file: !653, line: 14, type: !549)
!677 = !DILocalVariable(name: "x", scope: !652, file: !653, line: 15, type: !615)
!678 = !DILocalVariable(name: "b", scope: !652, file: !653, line: 15, type: !615)
!679 = !DILocalVariable(name: "W", scope: !652, file: !653, line: 16, type: !472)
!680 = !DILocalVariable(name: "npc", scope: !652, file: !653, line: 17, type: !254)
!681 = !DILocalVariable(name: "subJ", scope: !652, file: !653, line: 18, type: !526)
!682 = !DILocalVariable(name: "subpJ", scope: !652, file: !653, line: 18, type: !526)
!683 = !DILocalVariable(name: "ierr__", scope: !684, file: !653, line: 21, type: !275)
!684 = distinct !DILexicalBlock(scope: !652, file: !653, line: 21, column: 37)
!685 = !DILocalVariable(name: "ierr__", scope: !686, file: !653, line: 23, type: !275)
!686 = distinct !DILexicalBlock(scope: !652, file: !653, line: 23, column: 32)
!687 = !DILocalVariable(name: "ierr__", scope: !688, file: !653, line: 24, type: !275)
!688 = distinct !DILexicalBlock(scope: !652, file: !653, line: 24, column: 44)
!689 = !DILocalVariable(name: "ierr__", scope: !690, file: !653, line: 25, type: !275)
