; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/interface/drawreg.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/interface/drawreg.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._n_PetscFunctionList = type opaque
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!21 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!24 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!25 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 204, baseType: !7, size: 32, elements: !28)
!27 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdraw.h", directory: "/home/users/ndemeye/xSDK")
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36, !37}
!29 = !DIEnumerator(name: "PETSC_BUTTON_NONE", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "PETSC_BUTTON_LEFT", value: 1, isUnsigned: true)
!31 = !DIEnumerator(name: "PETSC_BUTTON_CENTER", value: 2, isUnsigned: true)
!32 = !DIEnumerator(name: "PETSC_BUTTON_RIGHT", value: 3, isUnsigned: true)
!33 = !DIEnumerator(name: "PETSC_BUTTON_WHEEL_UP", value: 4, isUnsigned: true)
!34 = !DIEnumerator(name: "PETSC_BUTTON_WHEEL_DOWN", value: 5, isUnsigned: true)
!35 = !DIEnumerator(name: "PETSC_BUTTON_LEFT_SHIFT", value: 6, isUnsigned: true)
!36 = !DIEnumerator(name: "PETSC_BUTTON_CENTER_SHIFT", value: 7, isUnsigned: true)
!37 = !DIEnumerator(name: "PETSC_BUTTON_RIGHT_SHIFT", value: 8, isUnsigned: true)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 141, baseType: !7, size: 32, elements: !39)
!39 = !{!40, !41, !42, !43}
!40 = !DIEnumerator(name: "PETSC_DRAW_MARKER_CROSS", value: 0, isUnsigned: true)
!41 = !DIEnumerator(name: "PETSC_DRAW_MARKER_POINT", value: 1, isUnsigned: true)
!42 = !DIEnumerator(name: "PETSC_DRAW_MARKER_PLUS", value: 2, isUnsigned: true)
!43 = !DIEnumerator(name: "PETSC_DRAW_MARKER_CIRCLE", value: 3, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 663, baseType: !7, size: 32, elements: !46)
!45 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!46 = !{!47, !48, !49}
!47 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!48 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!49 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !51)
!51 = !{!52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69}
!52 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!54 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!55 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!56 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!57 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!60 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!61 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!62 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!63 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!64 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!65 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!66 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!67 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!68 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!69 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !71, line: 624, baseType: !7, size: 32, elements: !72)
!71 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!72 = !{!73, !74, !75, !76}
!73 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!74 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!75 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!76 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!77 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 58, baseType: !7, size: 32, elements: !78)
!78 = !{!79}
!79 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!80 = !{!81, !84, !85, !171, !92, !121, !255, !289, !290, !291, !292, !294, !295}
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !71, line: 330, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !71, line: 330, flags: DIFlagFwdDecl)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !88, line: 73, size: 4480, elements: !89)
!88 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!89 = !{!90, !93, !142, !143, !145, !148, !149, !150, !151, !159, !160, !162, !166, !170, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !183, !184, !185, !187, !188, !190, !192, !193, !194, !195, !196, !199, !201, !202, !203, !204, !205, !208, !210, !211, !212, !222, !224, !225, !229, !230, !279, !284, !286, !287, !288}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !87, file: !88, line: 74, baseType: !91, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !92)
!92 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !87, file: !88, line: 75, baseType: !94, size: 448, offset: 64)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 448, elements: !140)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !88, line: 53, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !88, line: 45, size: 448, elements: !97)
!97 = !{!98, !104, !112, !117, !124, !128, !135}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !96, file: !88, line: 46, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!102, !85, !103}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !92)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !96, file: !88, line: 47, baseType: !105, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!102, !85, !108}
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !109, line: 16, baseType: !110)
!109 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !109, line: 16, flags: DIFlagFwdDecl)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !96, file: !88, line: 48, baseType: !113, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!102, !116}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !96, file: !88, line: 49, baseType: !118, size: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!102, !85, !121, !85}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !96, file: !88, line: 50, baseType: !125, size: 64, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!102, !85, !121, !116}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !96, file: !88, line: 51, baseType: !129, size: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!102, !85, !121, !132}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{null}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !96, file: !88, line: 52, baseType: !136, size: 64, offset: 384)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!102, !85, !121, !139}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!140 = !{!141}
!141 = !DISubrange(count: 1)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !87, file: !88, line: 76, baseType: !81, size: 64, offset: 512)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !87, file: !88, line: 77, baseType: !144, size: 32, offset: 576)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !92)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !87, file: !88, line: 78, baseType: !146, size: 64, offset: 640)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !147)
!147 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !87, file: !88, line: 78, baseType: !146, size: 64, offset: 704)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !87, file: !88, line: 78, baseType: !146, size: 64, offset: 768)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !87, file: !88, line: 78, baseType: !146, size: 64, offset: 832)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !87, file: !88, line: 79, baseType: !152, size: 64, offset: 896)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !155, line: 27, baseType: !156)
!155 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !157, line: 43, baseType: !158)
!157 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!158 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !87, file: !88, line: 80, baseType: !144, size: 32, offset: 960)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !87, file: !88, line: 81, baseType: !161, size: 32, offset: 992)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !92)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !87, file: !88, line: 82, baseType: !163, size: 64, offset: 1024)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !87, file: !88, line: 83, baseType: !167, size: 64, offset: 1088)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !87, file: !88, line: 84, baseType: !171, size: 64, offset: 1152)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !87, file: !88, line: 85, baseType: !171, size: 64, offset: 1216)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !87, file: !88, line: 86, baseType: !171, size: 64, offset: 1280)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !87, file: !88, line: 87, baseType: !171, size: 64, offset: 1344)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !87, file: !88, line: 88, baseType: !85, size: 64, offset: 1408)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !87, file: !88, line: 89, baseType: !152, size: 64, offset: 1472)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !87, file: !88, line: 90, baseType: !171, size: 64, offset: 1536)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !87, file: !88, line: 91, baseType: !171, size: 64, offset: 1600)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !87, file: !88, line: 92, baseType: !144, size: 32, offset: 1664)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !87, file: !88, line: 93, baseType: !84, size: 64, offset: 1728)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !87, file: !88, line: 94, baseType: !182, size: 64, offset: 1792)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !153)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !87, file: !88, line: 95, baseType: !144, size: 32, offset: 1856)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !87, file: !88, line: 95, baseType: !144, size: 32, offset: 1888)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !87, file: !88, line: 96, baseType: !186, size: 64, offset: 1920)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !87, file: !88, line: 96, baseType: !186, size: 64, offset: 1984)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !87, file: !88, line: 97, baseType: !189, size: 64, offset: 2048)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !87, file: !88, line: 97, baseType: !191, size: 64, offset: 2112)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !87, file: !88, line: 98, baseType: !144, size: 32, offset: 2176)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !87, file: !88, line: 98, baseType: !144, size: 32, offset: 2208)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !87, file: !88, line: 99, baseType: !186, size: 64, offset: 2240)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !87, file: !88, line: 99, baseType: !186, size: 64, offset: 2304)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !87, file: !88, line: 100, baseType: !197, size: 64, offset: 2368)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !147)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !87, file: !88, line: 100, baseType: !200, size: 64, offset: 2432)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !87, file: !88, line: 101, baseType: !144, size: 32, offset: 2496)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !87, file: !88, line: 101, baseType: !144, size: 32, offset: 2528)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !87, file: !88, line: 102, baseType: !186, size: 64, offset: 2560)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !87, file: !88, line: 102, baseType: !186, size: 64, offset: 2624)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !87, file: !88, line: 103, baseType: !206, size: 64, offset: 2688)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !198)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !87, file: !88, line: 103, baseType: !209, size: 64, offset: 2752)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !87, file: !88, line: 104, baseType: !139, size: 64, offset: 2816)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !87, file: !88, line: 105, baseType: !144, size: 32, offset: 2880)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !87, file: !88, line: 106, baseType: !213, size: 128, offset: 2944)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 128, elements: !220)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !88, line: 64, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !88, line: 61, size: 128, elements: !217)
!217 = !{!218, !219}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !216, file: !88, line: 62, baseType: !132, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !216, file: !88, line: 63, baseType: !84, size: 64, offset: 64)
!220 = !{!221}
!221 = !DISubrange(count: 2)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !87, file: !88, line: 107, baseType: !223, size: 64, offset: 3072)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 64, elements: !220)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !87, file: !88, line: 108, baseType: !84, size: 64, offset: 3136)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !87, file: !88, line: 109, baseType: !226, size: 64, offset: 3200)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!102, !84}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !87, file: !88, line: 111, baseType: !144, size: 32, offset: 3264)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !87, file: !88, line: 112, baseType: !231, size: 320, offset: 3328)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 320, elements: !277)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!102, !235, !85, !84}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !237)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !238)
!238 = !{!239, !240, !265, !266, !267, !268, !269, !270, !271, !272, !273}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !237, file: !12, line: 100, baseType: !144, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !237, file: !12, line: 101, baseType: !241, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !244)
!244 = !{!245, !246, !247, !248, !249, !252, !253, !254, !258, !260, !262, !263, !264}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !243, file: !12, line: 84, baseType: !171, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !243, file: !12, line: 85, baseType: !171, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !243, file: !12, line: 86, baseType: !84, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !243, file: !12, line: 87, baseType: !163, size: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !243, file: !12, line: 88, baseType: !250, size: 64, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !243, file: !12, line: 89, baseType: !123, size: 8, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !243, file: !12, line: 90, baseType: !171, size: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !243, file: !12, line: 91, baseType: !255, size: 64, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !256, line: 46, baseType: !257)
!256 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!257 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !243, file: !12, line: 92, baseType: !259, size: 32, offset: 512)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !243, file: !12, line: 93, baseType: !261, size: 32, offset: 544)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !243, file: !12, line: 94, baseType: !241, size: 64, offset: 576)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !243, file: !12, line: 95, baseType: !171, size: 64, offset: 640)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !243, file: !12, line: 96, baseType: !84, size: 64, offset: 704)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !237, file: !12, line: 102, baseType: !171, size: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !237, file: !12, line: 102, baseType: !171, size: 64, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !237, file: !12, line: 103, baseType: !171, size: 64, offset: 256)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !237, file: !12, line: 104, baseType: !81, size: 64, offset: 320)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !237, file: !12, line: 105, baseType: !259, size: 32, offset: 384)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !237, file: !12, line: 105, baseType: !259, size: 32, offset: 416)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !237, file: !12, line: 105, baseType: !259, size: 32, offset: 448)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !237, file: !12, line: 106, baseType: !85, size: 64, offset: 512)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !237, file: !12, line: 107, baseType: !274, size: 64, offset: 576)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!277 = !{!278}
!278 = !DISubrange(count: 5)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !87, file: !88, line: 113, baseType: !280, size: 320, offset: 3648)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 320, elements: !277)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!102, !85, !84}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !87, file: !88, line: 114, baseType: !285, size: 320, offset: 3968)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 320, elements: !277)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !87, file: !88, line: 115, baseType: !259, size: 32, offset: 4288)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !87, file: !88, line: 120, baseType: !274, size: 64, offset: 4352)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !87, file: !88, line: 121, baseType: !259, size: 32, offset: 4416)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectDestroyFunction", file: !88, line: 130, baseType: !113)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectViewFunction", file: !88, line: 131, baseType: !105)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !293, line: 1451, baseType: !132)
!293 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEnum", file: !6, line: 58, baseType: !77)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!296 = !{!0}
!297 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/interface/drawreg.c", directory: "/home/users/ndemeye/xSDK")
!298 = !{i32 7, !"Dwarf Version", i32 4}
!299 = !{i32 2, !"Debug Info Version", i32 3}
!300 = !{i32 1, !"wchar_size", i32 4}
!301 = !{i32 7, !"PIC Level", i32 2}
!302 = !{i32 7, !"uwtable", i32 1}
!303 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!304 = distinct !DISubprogram(name: "PetscDrawView", scope: !297, file: !297, line: 42, type: !305, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !466)
!305 = !DISubroutineType(types: !306)
!306 = !{!102, !307, !108}
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDraw", file: !308, line: 25, baseType: !309)
!308 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdrawtypes.h", directory: "/home/users/ndemeye/xSDK")
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDraw", file: !311, line: 53, size: 11072, elements: !312)
!311 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/drawimpl.h", directory: "/home/users/ndemeye/xSDK")
!312 = !{!313, !315, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !441, !442, !443, !444, !445, !446, !447, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !310, file: !311, line: 54, baseType: !314, size: 4480)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !88, line: 122, baseType: !87)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !310, file: !311, line: 54, baseType: !316, size: 2304, offset: 4480)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 2304, elements: !140)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscDrawOps", file: !311, line: 14, size: 2304, elements: !318)
!318 = !{!319, !323, !324, !328, !332, !336, !340, !341, !345, !346, !350, !354, !358, !359, !363, !367, !368, !374, !375, !376, !377, !382, !386, !387, !391, !392, !394, !395, !396, !397, !409, !410, !411, !416, !420, !424}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "setdoublebuffer", scope: !317, file: !311, line: 15, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!102, !307}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !317, file: !311, line: 16, baseType: !320, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !317, file: !311, line: 17, baseType: !325, size: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!102, !307, !198, !198, !198, !198, !92}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "linesetwidth", scope: !317, file: !311, line: 18, baseType: !329, size: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!102, !307, !198}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "linegetwidth", scope: !317, file: !311, line: 19, baseType: !333, size: 64, offset: 256)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!102, !307, !197}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "point", scope: !317, file: !311, line: 20, baseType: !337, size: 64, offset: 320)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!102, !307, !198, !198, !92}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "pointsetsize", scope: !317, file: !311, line: 21, baseType: !329, size: 64, offset: 384)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !317, file: !311, line: 22, baseType: !342, size: 64, offset: 448)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!102, !307, !198, !198, !92, !121}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "stringvertical", scope: !317, file: !311, line: 23, baseType: !342, size: 64, offset: 512)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "stringsetsize", scope: !317, file: !311, line: 24, baseType: !347, size: 64, offset: 576)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!102, !307, !198, !198}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "stringgetsize", scope: !317, file: !311, line: 25, baseType: !351, size: 64, offset: 640)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!102, !307, !197, !197}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "setviewport", scope: !317, file: !311, line: 26, baseType: !355, size: 64, offset: 704)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!102, !307, !198, !198, !198, !198}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "clear", scope: !317, file: !311, line: 27, baseType: !320, size: 64, offset: 768)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "rectangle", scope: !317, file: !311, line: 28, baseType: !360, size: 64, offset: 832)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!102, !307, !198, !198, !198, !198, !92, !92, !92, !92}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "triangle", scope: !317, file: !311, line: 29, baseType: !364, size: 64, offset: 896)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!102, !307, !198, !198, !198, !198, !198, !198, !92, !92, !92}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ellipse", scope: !317, file: !311, line: 30, baseType: !325, size: 64, offset: 960)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "getmousebutton", scope: !317, file: !311, line: 31, baseType: !369, size: 64, offset: 1024)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!102, !307, !372, !197, !197, !197, !197}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawButton", file: !27, line: 207, baseType: !26)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !317, file: !311, line: 32, baseType: !320, size: 64, offset: 1088)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "beginpage", scope: !317, file: !311, line: 33, baseType: !320, size: 64, offset: 1152)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "endpage", scope: !317, file: !311, line: 34, baseType: !320, size: 64, offset: 1216)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "getpopup", scope: !317, file: !311, line: 35, baseType: !378, size: 64, offset: 1280)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!102, !307, !381}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "settitle", scope: !317, file: !311, line: 36, baseType: !383, size: 64, offset: 1344)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!102, !307, !121}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "checkresizedwindow", scope: !317, file: !311, line: 37, baseType: !320, size: 64, offset: 1408)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "resizewindow", scope: !317, file: !311, line: 38, baseType: !388, size: 64, offset: 1472)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!102, !307, !92, !92}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !317, file: !311, line: 39, baseType: !320, size: 64, offset: 1536)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !317, file: !311, line: 40, baseType: !393, size: 64, offset: 1600)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "getsingleton", scope: !317, file: !311, line: 41, baseType: !378, size: 64, offset: 1664)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "restoresingleton", scope: !317, file: !311, line: 42, baseType: !378, size: 64, offset: 1728)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "save", scope: !317, file: !311, line: 43, baseType: !320, size: 64, offset: 1792)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "getimage", scope: !317, file: !311, line: 44, baseType: !398, size: 64, offset: 1856)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!102, !307, !401, !406, !406, !407}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !403, size: 24, elements: !404)
!403 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!404 = !{!405}
!405 = !DISubrange(count: 3)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "setcoordinates", scope: !317, file: !311, line: 45, baseType: !355, size: 64, offset: 1920)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "arrow", scope: !317, file: !311, line: 46, baseType: !325, size: 64, offset: 1984)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatetopixel", scope: !317, file: !311, line: 47, baseType: !412, size: 64, offset: 2048)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!102, !307, !198, !198, !415, !415}
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "pixeltocoordinate", scope: !317, file: !311, line: 48, baseType: !417, size: 64, offset: 2112)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!102, !307, !92, !92, !197, !197}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "pointpixel", scope: !317, file: !311, line: 49, baseType: !421, size: 64, offset: 2176)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!102, !307, !92, !92, !92}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "boxedstring", scope: !317, file: !311, line: 50, baseType: !425, size: 64, offset: 2240)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!102, !307, !198, !198, !92, !92, !121, !197, !197}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !310, file: !311, line: 55, baseType: !198, size: 64, offset: 6784)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "port_xl", scope: !310, file: !311, line: 56, baseType: !198, size: 64, offset: 6848)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "port_yl", scope: !310, file: !311, line: 56, baseType: !198, size: 64, offset: 6912)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "port_xr", scope: !310, file: !311, line: 56, baseType: !198, size: 64, offset: 6976)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "port_yr", scope: !310, file: !311, line: 56, baseType: !198, size: 64, offset: 7040)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "coor_xl", scope: !310, file: !311, line: 57, baseType: !198, size: 64, offset: 7104)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "coor_yl", scope: !310, file: !311, line: 57, baseType: !198, size: 64, offset: 7168)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "coor_xr", scope: !310, file: !311, line: 57, baseType: !198, size: 64, offset: 7232)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "coor_yr", scope: !310, file: !311, line: 57, baseType: !198, size: 64, offset: 7296)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "currentpoint_x", scope: !310, file: !311, line: 58, baseType: !438, size: 1280, offset: 7360)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 1280, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 20)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "currentpoint_y", scope: !310, file: !311, line: 58, baseType: !438, size: 1280, offset: 8640)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_xl", scope: !310, file: !311, line: 59, baseType: !198, size: 64, offset: 9920)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_yl", scope: !310, file: !311, line: 59, baseType: !198, size: 64, offset: 9984)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_xr", scope: !310, file: !311, line: 59, baseType: !198, size: 64, offset: 10048)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_yr", scope: !310, file: !311, line: 59, baseType: !198, size: 64, offset: 10112)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "currentpoint", scope: !310, file: !311, line: 60, baseType: !144, size: 32, offset: 10176)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "markertype", scope: !310, file: !311, line: 61, baseType: !448, size: 32, offset: 10208)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawMarkerType", file: !27, line: 141, baseType: !38)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !310, file: !311, line: 62, baseType: !171, size: 64, offset: 10240)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !310, file: !311, line: 63, baseType: !171, size: 64, offset: 10304)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "popup", scope: !310, file: !311, line: 64, baseType: !307, size: 64, offset: 10368)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !310, file: !311, line: 65, baseType: !92, size: 32, offset: 10432)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !310, file: !311, line: 65, baseType: !92, size: 32, offset: 10464)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !310, file: !311, line: 65, baseType: !92, size: 32, offset: 10496)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !310, file: !311, line: 65, baseType: !92, size: 32, offset: 10528)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "savefilename", scope: !310, file: !311, line: 66, baseType: !171, size: 64, offset: 10560)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "saveimageext", scope: !310, file: !311, line: 67, baseType: !171, size: 64, offset: 10624)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "savemovieext", scope: !310, file: !311, line: 68, baseType: !171, size: 64, offset: 10688)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "savefilecount", scope: !310, file: !311, line: 69, baseType: !144, size: 32, offset: 10752)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "savesinglefile", scope: !310, file: !311, line: 70, baseType: !259, size: 32, offset: 10784)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "savemoviefps", scope: !310, file: !311, line: 71, baseType: !144, size: 32, offset: 10816)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "savefinalfilename", scope: !310, file: !311, line: 72, baseType: !171, size: 64, offset: 10880)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "saveonclear", scope: !310, file: !311, line: 73, baseType: !259, size: 32, offset: 10944)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "saveonflush", scope: !310, file: !311, line: 74, baseType: !259, size: 32, offset: 10976)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !310, file: !311, line: 75, baseType: !84, size: 64, offset: 11008)
!466 = !{!467, !468, !469, !470, !471, !475, !477, !478, !480, !486, !487, !489, !491, !494, !498, !499, !500, !501, !502, !504, !506, !508, !510, !512, !514}
!467 = !DILocalVariable(name: "indraw", arg: 1, scope: !304, file: !297, line: 42, type: !307)
!468 = !DILocalVariable(name: "viewer", arg: 2, scope: !304, file: !297, line: 42, type: !108)
!469 = !DILocalVariable(name: "ierr", scope: !304, file: !297, line: 44, type: !102)
!470 = !DILocalVariable(name: "isdraw", scope: !304, file: !297, line: 45, type: !259)
!471 = !DILocalVariable(name: "ierr__", scope: !472, file: !297, line: 53, type: !102)
!472 = distinct !DILexicalBlock(scope: !473, file: !297, line: 53, column: 84)
!473 = distinct !DILexicalBlock(scope: !474, file: !297, line: 52, column: 16)
!474 = distinct !DILexicalBlock(scope: !304, file: !297, line: 52, column: 7)
!475 = !DILocalVariable(name: "_7_ierr", scope: !476, file: !297, line: 56, type: !102)
!476 = distinct !DILexicalBlock(scope: !304, file: !297, line: 56, column: 3)
!477 = !DILocalVariable(name: "_7_flag", scope: !476, file: !297, line: 56, type: !161)
!478 = !DILocalVariable(name: "_7_errorcode", scope: !479, file: !297, line: 56, type: !102)
!479 = distinct !DILexicalBlock(scope: !476, file: !297, line: 56, column: 3)
!480 = !DILocalVariable(name: "_7_errorstring", scope: !481, file: !297, line: 56, type: !483)
!481 = distinct !DILexicalBlock(scope: !482, file: !297, line: 56, column: 3)
!482 = distinct !DILexicalBlock(scope: !479, file: !297, line: 56, column: 3)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 2048, elements: !484)
!484 = !{!485}
!485 = !DISubrange(count: 256)
!486 = !DILocalVariable(name: "_7_resultlen", scope: !481, file: !297, line: 56, type: !161)
!487 = !DILocalVariable(name: "ierr__", scope: !488, file: !297, line: 58, type: !102)
!488 = distinct !DILexicalBlock(scope: !304, file: !297, line: 58, column: 74)
!489 = !DILocalVariable(name: "ierr__", scope: !490, file: !297, line: 59, type: !102)
!490 = distinct !DILexicalBlock(scope: !304, file: !297, line: 59, column: 78)
!491 = !DILocalVariable(name: "draw", scope: !492, file: !297, line: 64, type: !307)
!492 = distinct !DILexicalBlock(scope: !493, file: !297, line: 63, column: 15)
!493 = distinct !DILexicalBlock(scope: !304, file: !297, line: 63, column: 7)
!494 = !DILocalVariable(name: "str", scope: !492, file: !297, line: 65, type: !495)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 288, elements: !496)
!496 = !{!497}
!497 = !DISubrange(count: 36)
!498 = !DILocalVariable(name: "x", scope: !492, file: !297, line: 66, type: !198)
!499 = !DILocalVariable(name: "y", scope: !492, file: !297, line: 66, type: !198)
!500 = !DILocalVariable(name: "bottom", scope: !492, file: !297, line: 66, type: !198)
!501 = !DILocalVariable(name: "h", scope: !492, file: !297, line: 66, type: !198)
!502 = !DILocalVariable(name: "ierr__", scope: !503, file: !297, line: 68, type: !102)
!503 = distinct !DILexicalBlock(scope: !492, file: !297, line: 68, column: 51)
!504 = !DILocalVariable(name: "ierr__", scope: !505, file: !297, line: 69, type: !102)
!505 = distinct !DILexicalBlock(scope: !492, file: !297, line: 69, column: 49)
!506 = !DILocalVariable(name: "ierr__", scope: !507, file: !297, line: 70, type: !102)
!507 = distinct !DILexicalBlock(scope: !492, file: !297, line: 70, column: 58)
!508 = !DILocalVariable(name: "ierr__", scope: !509, file: !297, line: 71, type: !102)
!509 = distinct !DILexicalBlock(scope: !492, file: !297, line: 71, column: 77)
!510 = !DILocalVariable(name: "ierr__", scope: !511, file: !297, line: 72, type: !102)
!511 = distinct !DILexicalBlock(scope: !492, file: !297, line: 72, column: 89)
!512 = !DILocalVariable(name: "ierr__", scope: !513, file: !297, line: 74, type: !102)
!513 = distinct !DILexicalBlock(scope: !492, file: !297, line: 74, column: 53)
