; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/interface/snesob.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/interface/snesob.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!56 = !DIEnumerator(name: "SUBSET_NONZERO_PATTERN", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 406, baseType: !26, size: 32, elements: !60)
!60 = !{!61, !62, !63, !64, !65, !66}
!61 = !DIEnumerator(name: "SNES_NORM_DEFAULT", value: -1)
!62 = !DIEnumerator(name: "SNES_NORM_NONE", value: 0)
!63 = !DIEnumerator(name: "SNES_NORM_ALWAYS", value: 1)
!64 = !DIEnumerator(name: "SNES_NORM_INITIAL_ONLY", value: 2)
!65 = !DIEnumerator(name: "SNES_NORM_FINAL_ONLY", value: 3)
!66 = !DIEnumerator(name: "SNES_NORM_INITIAL_FINAL_ONLY", value: 4)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 493, baseType: !26, size: 32, elements: !68)
!68 = !{!69, !70, !71}
!69 = !DIEnumerator(name: "SNES_FUNCTION_DEFAULT", value: -1)
!70 = !DIEnumerator(name: "SNES_FUNCTION_UNPRECONDITIONED", value: 0)
!71 = !DIEnumerator(name: "SNES_FUNCTION_PRECONDITIONED", value: 1)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !73, line: 663, baseType: !5, size: 32, elements: !74)
!73 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!74 = !{!75, !76, !77}
!75 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !79)
!79 = !{!80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97}
!80 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!98 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !99, line: 155, baseType: !5, size: 32, elements: !100)
!99 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!100 = !{!101, !102, !103, !104, !105}
!101 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!102 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!103 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!104 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!105 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!106 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 580, baseType: !5, size: 32, elements: !107)
!107 = !{!108, !109, !110, !111, !112, !113, !114, !115, !116}
!108 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!109 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!110 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!111 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!112 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!113 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!114 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!115 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!116 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!117 = !{!118, !122, !123, !158, !208}
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !119, line: 330, baseType: !120)
!119 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !119, line: 330, flags: DIFlagFwdDecl)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !126, line: 73, size: 4480, elements: !127)
!126 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!127 = !{!128, !130, !179, !180, !182, !185, !186, !187, !188, !196, !197, !199, !203, !207, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !220, !221, !222, !224, !225, !227, !229, !230, !231, !232, !233, !236, !238, !239, !240, !241, !242, !245, !247, !248, !249, !259, !261, !262, !266, !267, !316, !321, !323, !324, !325}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !125, file: !126, line: 74, baseType: !129, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !125, file: !126, line: 75, baseType: !131, size: 448, offset: 64)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 448, elements: !177)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !126, line: 53, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !126, line: 45, size: 448, elements: !134)
!134 = !{!135, !141, !149, !154, !161, !165, !172}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !133, file: !126, line: 46, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!139, !123, !140}
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !133, file: !126, line: 47, baseType: !142, size: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!139, !123, !145}
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !146, line: 16, baseType: !147)
!146 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !146, line: 16, flags: DIFlagFwdDecl)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !133, file: !126, line: 48, baseType: !150, size: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!139, !153}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !133, file: !126, line: 49, baseType: !155, size: 64, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!139, !123, !158, !123}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!160 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !133, file: !126, line: 50, baseType: !162, size: 64, offset: 256)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!139, !123, !158, !153}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !133, file: !126, line: 51, baseType: !166, size: 64, offset: 320)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!139, !123, !158, !169}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{null}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !133, file: !126, line: 52, baseType: !173, size: 64, offset: 384)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!139, !123, !158, !176}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!177 = !{!178}
!178 = !DISubrange(count: 1)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !125, file: !126, line: 76, baseType: !118, size: 64, offset: 512)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !125, file: !126, line: 77, baseType: !181, size: 32, offset: 576)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !125, file: !126, line: 78, baseType: !183, size: 64, offset: 640)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !184)
!184 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !125, file: !126, line: 78, baseType: !183, size: 64, offset: 704)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !125, file: !126, line: 78, baseType: !183, size: 64, offset: 768)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !125, file: !126, line: 78, baseType: !183, size: 64, offset: 832)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !125, file: !126, line: 79, baseType: !189, size: 64, offset: 896)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !192, line: 27, baseType: !193)
!192 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !194, line: 43, baseType: !195)
!194 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!195 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !125, file: !126, line: 80, baseType: !181, size: 32, offset: 960)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !125, file: !126, line: 81, baseType: !198, size: 32, offset: 992)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !125, file: !126, line: 82, baseType: !200, size: 64, offset: 1024)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !125, file: !126, line: 83, baseType: !204, size: 64, offset: 1088)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !125, file: !126, line: 84, baseType: !208, size: 64, offset: 1152)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !125, file: !126, line: 85, baseType: !208, size: 64, offset: 1216)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !125, file: !126, line: 86, baseType: !208, size: 64, offset: 1280)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !125, file: !126, line: 87, baseType: !208, size: 64, offset: 1344)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !125, file: !126, line: 88, baseType: !123, size: 64, offset: 1408)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !125, file: !126, line: 89, baseType: !189, size: 64, offset: 1472)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !125, file: !126, line: 90, baseType: !208, size: 64, offset: 1536)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !125, file: !126, line: 91, baseType: !208, size: 64, offset: 1600)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !125, file: !126, line: 92, baseType: !181, size: 32, offset: 1664)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !125, file: !126, line: 93, baseType: !122, size: 64, offset: 1728)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !125, file: !126, line: 94, baseType: !219, size: 64, offset: 1792)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !190)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !125, file: !126, line: 95, baseType: !181, size: 32, offset: 1856)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !125, file: !126, line: 95, baseType: !181, size: 32, offset: 1888)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !125, file: !126, line: 96, baseType: !223, size: 64, offset: 1920)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !125, file: !126, line: 96, baseType: !223, size: 64, offset: 1984)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !125, file: !126, line: 97, baseType: !226, size: 64, offset: 2048)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !125, file: !126, line: 97, baseType: !228, size: 64, offset: 2112)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !125, file: !126, line: 98, baseType: !181, size: 32, offset: 2176)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !125, file: !126, line: 98, baseType: !181, size: 32, offset: 2208)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !125, file: !126, line: 99, baseType: !223, size: 64, offset: 2240)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !125, file: !126, line: 99, baseType: !223, size: 64, offset: 2304)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !125, file: !126, line: 100, baseType: !234, size: 64, offset: 2368)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !184)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !125, file: !126, line: 100, baseType: !237, size: 64, offset: 2432)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !125, file: !126, line: 101, baseType: !181, size: 32, offset: 2496)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !125, file: !126, line: 101, baseType: !181, size: 32, offset: 2528)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !125, file: !126, line: 102, baseType: !223, size: 64, offset: 2560)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !125, file: !126, line: 102, baseType: !223, size: 64, offset: 2624)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !125, file: !126, line: 103, baseType: !243, size: 64, offset: 2688)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !235)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !125, file: !126, line: 103, baseType: !246, size: 64, offset: 2752)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !125, file: !126, line: 104, baseType: !176, size: 64, offset: 2816)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !125, file: !126, line: 105, baseType: !181, size: 32, offset: 2880)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !125, file: !126, line: 106, baseType: !250, size: 128, offset: 2944)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 128, elements: !257)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !126, line: 64, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !126, line: 61, size: 128, elements: !254)
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !253, file: !126, line: 62, baseType: !169, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !253, file: !126, line: 63, baseType: !122, size: 64, offset: 64)
!257 = !{!258}
!258 = !DISubrange(count: 2)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !125, file: !126, line: 107, baseType: !260, size: 64, offset: 3072)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 64, elements: !257)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !125, file: !126, line: 108, baseType: !122, size: 64, offset: 3136)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !125, file: !126, line: 109, baseType: !263, size: 64, offset: 3200)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!139, !122}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !125, file: !126, line: 111, baseType: !181, size: 32, offset: 3264)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !125, file: !126, line: 112, baseType: !268, size: 320, offset: 3328)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !269, size: 320, elements: !314)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!139, !272, !123, !122}
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !275)
!275 = !{!276, !277, !302, !303, !304, !305, !306, !307, !308, !309, !310}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !274, file: !10, line: 100, baseType: !181, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !274, file: !10, line: 101, baseType: !278, size: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !281)
!281 = !{!282, !283, !284, !285, !286, !289, !290, !291, !295, !297, !299, !300, !301}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !280, file: !10, line: 84, baseType: !208, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !280, file: !10, line: 85, baseType: !208, size: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !280, file: !10, line: 86, baseType: !122, size: 64, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !280, file: !10, line: 87, baseType: !200, size: 64, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !280, file: !10, line: 88, baseType: !287, size: 64, offset: 256)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !280, file: !10, line: 89, baseType: !160, size: 8, offset: 320)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !280, file: !10, line: 90, baseType: !208, size: 64, offset: 384)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !280, file: !10, line: 91, baseType: !292, size: 64, offset: 448)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !293, line: 46, baseType: !294)
!293 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!294 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !280, file: !10, line: 92, baseType: !296, size: 32, offset: 512)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !280, file: !10, line: 93, baseType: !298, size: 32, offset: 544)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !280, file: !10, line: 94, baseType: !278, size: 64, offset: 576)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !280, file: !10, line: 95, baseType: !208, size: 64, offset: 640)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !280, file: !10, line: 96, baseType: !122, size: 64, offset: 704)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !274, file: !10, line: 102, baseType: !208, size: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !274, file: !10, line: 102, baseType: !208, size: 64, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !274, file: !10, line: 103, baseType: !208, size: 64, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !274, file: !10, line: 104, baseType: !118, size: 64, offset: 320)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !274, file: !10, line: 105, baseType: !296, size: 32, offset: 384)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !274, file: !10, line: 105, baseType: !296, size: 32, offset: 416)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !274, file: !10, line: 105, baseType: !296, size: 32, offset: 448)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !274, file: !10, line: 106, baseType: !123, size: 64, offset: 512)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !274, file: !10, line: 107, baseType: !311, size: 64, offset: 576)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!314 = !{!315}
!315 = !DISubrange(count: 5)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !125, file: !126, line: 113, baseType: !317, size: 320, offset: 3648)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !318, size: 320, elements: !314)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!139, !123, !122}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !125, file: !126, line: 114, baseType: !322, size: 320, offset: 3968)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 320, elements: !314)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !125, file: !126, line: 115, baseType: !296, size: 32, offset: 4288)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !125, file: !126, line: 120, baseType: !311, size: 64, offset: 4352)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !125, file: !126, line: 121, baseType: !296, size: 32, offset: 4416)
!326 = !{i32 7, !"Dwarf Version", i32 4}
!327 = !{i32 2, !"Debug Info Version", i32 3}
!328 = !{i32 1, !"wchar_size", i32 4}
!329 = !{i32 7, !"PIC Level", i32 2}
!330 = !{i32 7, !"uwtable", i32 1}
!331 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!332 = distinct !DISubprogram(name: "SNESSetObjective", scope: !333, file: !333, line: 40, type: !334, scopeLine: 41, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !528)
!333 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/snes/interface/snesob.c", directory: "/home/users/ndemeye/xSDK")
!334 = !DISubroutineType(types: !335)
!335 = !{!139, !336, !525, !122}
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !25, line: 18, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !339, line: 38, size: 11648, elements: !340)
!339 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/snesimpl.h", directory: "/home/users/ndemeye/xSDK")
!340 = !{!341, !343, !409, !414, !415, !416, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !432, !436, !437, !439, !440, !441, !442, !443, !448, !450, !451, !452, !453, !454, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !490, !492, !493, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !338, file: !339, line: 39, baseType: !342, size: 4480)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !126, line: 122, baseType: !125)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !338, file: !339, line: 39, baseType: !344, size: 1088, offset: 4480)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !345, size: 1088, elements: !177)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SNESOps", file: !339, line: 12, size: 1088, elements: !346)
!346 = !{!347, !354, !358, !362, !368, !369, !373, !374, !378, !382, !383, !384, !389, !393, !397, !401, !408}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "computeinitialguess", scope: !345, file: !339, line: 13, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!139, !336, !351, !122}
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !99, line: 21, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !99, line: 21, flags: DIFlagFwdDecl)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "computescaling", scope: !345, file: !339, line: 14, baseType: !355, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!139, !351, !351, !122}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !345, file: !339, line: 15, baseType: !359, size: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!139, !336, !181}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !345, file: !339, line: 16, baseType: !363, size: 64, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!139, !336, !181, !235, !235, !235, !366, !122}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESConvergedReason", file: !25, line: 257, baseType: !24)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !345, file: !339, line: 17, baseType: !263, size: 64, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !345, file: !339, line: 18, baseType: !370, size: 64, offset: 320)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!139, !336}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !345, file: !339, line: 19, baseType: !370, size: 64, offset: 384)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !345, file: !339, line: 20, baseType: !375, size: 64, offset: 448)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!139, !336, !145}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !345, file: !339, line: 21, baseType: !379, size: 64, offset: 512)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!139, !272, !336}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !345, file: !339, line: 22, baseType: !370, size: 64, offset: 576)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !345, file: !339, line: 23, baseType: !370, size: 64, offset: 640)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "usercompute", scope: !345, file: !339, line: 24, baseType: !385, size: 64, offset: 704)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!139, !336, !388}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "userdestroy", scope: !345, file: !339, line: 25, baseType: !390, size: 64, offset: 768)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!139, !388}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !345, file: !339, line: 26, baseType: !394, size: 64, offset: 832)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!139, !336, !351, !351}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "computepfunction", scope: !345, file: !339, line: 27, baseType: !398, size: 64, offset: 896)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!139, !336, !351, !351, !122}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "computepjacobian", scope: !345, file: !339, line: 28, baseType: !402, size: 64, offset: 960)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!139, !336, !351, !405, !405, !122}
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !53, line: 16, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !53, line: 16, flags: DIFlagFwdDecl)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !345, file: !339, line: 29, baseType: !375, size: 64, offset: 1024)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !338, file: !339, line: 40, baseType: !410, size: 64, offset: 5568)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !411, line: 14, baseType: !412)
!411 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !411, line: 14, flags: DIFlagFwdDecl)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !338, file: !339, line: 41, baseType: !296, size: 32, offset: 5632)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "npc", scope: !338, file: !339, line: 42, baseType: !336, size: 64, offset: 5696)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "npcside", scope: !338, file: !339, line: 43, baseType: !417, size: 32, offset: 5760)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !46, line: 85, baseType: !45)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "usesnpc", scope: !338, file: !339, line: 44, baseType: !296, size: 32, offset: 5792)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !338, file: !339, line: 47, baseType: !122, size: 64, offset: 5824)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !338, file: !339, line: 49, baseType: !351, size: 64, offset: 5888)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !338, file: !339, line: 50, baseType: !351, size: 64, offset: 5952)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !338, file: !339, line: 52, baseType: !351, size: 64, offset: 6016)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !338, file: !339, line: 54, baseType: !405, size: 64, offset: 6080)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !338, file: !339, line: 55, baseType: !405, size: 64, offset: 6144)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "picard", scope: !338, file: !339, line: 56, baseType: !405, size: 64, offset: 6208)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "initialguessP", scope: !338, file: !339, line: 57, baseType: !122, size: 64, offset: 6272)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !338, file: !339, line: 58, baseType: !428, size: 64, offset: 6336)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !429, line: 22, baseType: !430)
!429 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !429, line: 22, flags: DIFlagFwdDecl)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !338, file: !339, line: 59, baseType: !433, size: 64, offset: 6400)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearch", file: !25, line: 526, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_LineSearch", file: !25, line: 526, flags: DIFlagFwdDecl)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "usesksp", scope: !338, file: !339, line: 60, baseType: !296, size: 32, offset: 6464)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "matstruct", scope: !338, file: !339, line: 61, baseType: !438, size: 32, offset: 6496)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !53, line: 285, baseType: !52)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_update", scope: !338, file: !339, line: 63, baseType: !351, size: 64, offset: 6528)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "scaling", scope: !338, file: !339, line: 65, baseType: !351, size: 64, offset: 6592)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "scaP", scope: !338, file: !339, line: 66, baseType: !122, size: 64, offset: 6656)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !338, file: !339, line: 68, baseType: !235, size: 64, offset: 6720)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !338, file: !339, line: 74, baseType: !444, size: 320, offset: 6784)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 320, elements: !314)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!139, !336, !181, !235, !122}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !338, file: !339, line: 75, baseType: !449, size: 320, offset: 7104)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 320, elements: !314)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !338, file: !339, line: 76, baseType: !322, size: 320, offset: 7424)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !338, file: !339, line: 77, baseType: !181, size: 32, offset: 7744)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !338, file: !339, line: 78, baseType: !122, size: 64, offset: 7808)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !338, file: !339, line: 79, baseType: !367, size: 32, offset: 7872)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !338, file: !339, line: 80, baseType: !455, size: 320, offset: 7936)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 320, elements: !314)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{!139, !336, !122}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !338, file: !339, line: 81, baseType: !449, size: 320, offset: 8256)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !338, file: !339, line: 82, baseType: !322, size: 320, offset: 8576)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !338, file: !339, line: 83, baseType: !181, size: 32, offset: 8896)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !338, file: !339, line: 84, baseType: !296, size: 32, offset: 8928)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !338, file: !339, line: 88, baseType: !296, size: 32, offset: 8960)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !338, file: !339, line: 89, baseType: !122, size: 64, offset: 9024)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !338, file: !339, line: 93, baseType: !181, size: 32, offset: 9088)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !338, file: !339, line: 94, baseType: !181, size: 32, offset: 9120)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !338, file: !339, line: 95, baseType: !181, size: 32, offset: 9152)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !338, file: !339, line: 96, baseType: !181, size: 32, offset: 9184)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "linear_its", scope: !338, file: !339, line: 97, baseType: !181, size: 32, offset: 9216)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !338, file: !339, line: 98, baseType: !235, size: 64, offset: 9280)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !338, file: !339, line: 99, baseType: !235, size: 64, offset: 9344)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !338, file: !339, line: 100, baseType: !235, size: 64, offset: 9408)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !338, file: !339, line: 101, baseType: !235, size: 64, offset: 9472)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !338, file: !339, line: 102, baseType: !235, size: 64, offset: 9536)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !338, file: !339, line: 103, baseType: !235, size: 64, offset: 9600)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "stol", scope: !338, file: !339, line: 104, baseType: !235, size: 64, offset: 9664)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "deltatol", scope: !338, file: !339, line: 105, baseType: !235, size: 64, offset: 9728)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "forceiteration", scope: !338, file: !339, line: 106, baseType: !296, size: 32, offset: 9792)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "lagpreconditioner", scope: !338, file: !339, line: 107, baseType: !181, size: 32, offset: 9824)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "lagjacobian", scope: !338, file: !339, line: 108, baseType: !181, size: 32, offset: 9856)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "jac_iter", scope: !338, file: !339, line: 109, baseType: !181, size: 32, offset: 9888)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "lagjac_persist", scope: !338, file: !339, line: 110, baseType: !296, size: 32, offset: 9920)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "pre_iter", scope: !338, file: !339, line: 111, baseType: !181, size: 32, offset: 9952)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "lagpre_persist", scope: !338, file: !339, line: 112, baseType: !296, size: 32, offset: 9984)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "gridsequence", scope: !338, file: !339, line: 113, baseType: !181, size: 32, offset: 10016)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "tolerancesset", scope: !338, file: !339, line: 115, baseType: !296, size: 32, offset: 10048)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_init_set", scope: !338, file: !339, line: 117, baseType: !296, size: 32, offset: 10080)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "normschedule", scope: !338, file: !339, line: 119, baseType: !489, size: 32, offset: 10112)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESNormSchedule", file: !25, line: 411, baseType: !59)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !338, file: !339, line: 120, baseType: !491, size: 32, offset: 10144)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESFunctionType", file: !25, line: 495, baseType: !67)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !338, file: !339, line: 124, baseType: !181, size: 32, offset: 10176)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !338, file: !339, line: 125, baseType: !494, size: 64, offset: 10240)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !338, file: !339, line: 129, baseType: !181, size: 32, offset: 10304)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist", scope: !338, file: !339, line: 130, baseType: !234, size: 64, offset: 10368)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_its", scope: !338, file: !339, line: 132, baseType: !226, size: 64, offset: 10432)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_len", scope: !338, file: !339, line: 133, baseType: !181, size: 32, offset: 10496)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_max", scope: !338, file: !339, line: 134, baseType: !181, size: 32, offset: 10528)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_reset", scope: !338, file: !339, line: 135, baseType: !296, size: 32, offset: 10560)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_alloc", scope: !338, file: !339, line: 136, baseType: !296, size: 32, offset: 10592)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "counters_reset", scope: !338, file: !339, line: 137, baseType: !296, size: 32, offset: 10624)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "numFailures", scope: !338, file: !339, line: 140, baseType: !181, size: 32, offset: 10656)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "maxFailures", scope: !338, file: !339, line: 141, baseType: !181, size: 32, offset: 10688)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "numLinearSolveFailures", scope: !338, file: !339, line: 143, baseType: !181, size: 32, offset: 10720)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "maxLinearSolveFailures", scope: !338, file: !339, line: 144, baseType: !181, size: 32, offset: 10752)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "domainerror", scope: !338, file: !339, line: 146, baseType: !296, size: 32, offset: 10784)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "jacobiandomainerror", scope: !338, file: !339, line: 147, baseType: !296, size: 32, offset: 10816)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "checkjacdomainerror", scope: !338, file: !339, line: 148, baseType: !296, size: 32, offset: 10848)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_ewconv", scope: !338, file: !339, line: 150, baseType: !296, size: 32, offset: 10880)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "kspconvctx", scope: !338, file: !339, line: 151, baseType: !122, size: 64, offset: 10944)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !338, file: !339, line: 154, baseType: !235, size: 64, offset: 11008)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !338, file: !339, line: 155, baseType: !235, size: 64, offset: 11072)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "vwork", scope: !338, file: !339, line: 157, baseType: !494, size: 64, offset: 11136)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "nvwork", scope: !338, file: !339, line: 158, baseType: !181, size: 32, offset: 11200)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !338, file: !339, line: 160, baseType: !296, size: 32, offset: 11232)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "mf_operator", scope: !338, file: !339, line: 161, baseType: !296, size: 32, offset: 11264)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "mf_version", scope: !338, file: !339, line: 162, baseType: !181, size: 32, offset: 11296)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "vizerotolerance", scope: !338, file: !339, line: 164, baseType: !235, size: 64, offset: 11328)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "xl", scope: !338, file: !339, line: 165, baseType: !351, size: 64, offset: 11392)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "xu", scope: !338, file: !339, line: 165, baseType: !351, size: 64, offset: 11456)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ntruebounds", scope: !338, file: !339, line: 166, baseType: !181, size: 32, offset: 11520)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "usersetbounds", scope: !338, file: !339, line: 167, baseType: !296, size: 32, offset: 11552)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "alwayscomputesfinalresidual", scope: !338, file: !339, line: 169, baseType: !296, size: 32, offset: 11584)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!139, !336, !351, !234, !122}
!528 = !{!529, !530, !531, !532, !533, !534, !536}
!529 = !DILocalVariable(name: "snes", arg: 1, scope: !332, file: !333, line: 40, type: !336)
!530 = !DILocalVariable(name: "obj", arg: 2, scope: !332, file: !333, line: 40, type: !525)
!531 = !DILocalVariable(name: "ctx", arg: 3, scope: !332, file: !333, line: 40, type: !122)
!532 = !DILocalVariable(name: "ierr", scope: !332, file: !333, line: 42, type: !139)
!533 = !DILocalVariable(name: "dm", scope: !332, file: !333, line: 43, type: !410)
!534 = !DILocalVariable(name: "ierr__", scope: !535, file: !333, line: 47, type: !139)
!535 = distinct !DILexicalBlock(scope: !332, file: !333, line: 47, column: 30)
!536 = !DILocalVariable(name: "ierr__", scope: !537, file: !333, line: 48, type: !139)
!537 = distinct !DILexicalBlock(scope: !332, file: !333, line: 48, column: 41)
!538 = !DILocation(line: 0, scope: !332)
!539 = !DILocation(line: 43, column: 3, scope: !332)
!540 = !DILocation(line: 45, column: 3, scope: !541)
!541 = distinct !DILexicalBlock(scope: !542, file: !333, line: 45, column: 3)
!542 = distinct !DILexicalBlock(scope: !543, file: !333, line: 45, column: 3)
!543 = distinct !DILexicalBlock(scope: !332, file: !333, line: 45, column: 3)
!544 = !{!545, !545, i64 0}
!545 = !{!"any pointer", !546, i64 0}
!546 = !{!"omnipotent char", !547, i64 0}
!547 = !{!"Simple C/C++ TBAA"}
!548 = !DILocation(line: 45, column: 3, scope: !542)
!549 = !DILocation(line: 45, column: 3, scope: !550)
!550 = distinct !DILexicalBlock(scope: !551, file: !333, line: 45, column: 3)
!551 = distinct !DILexicalBlock(scope: !541, file: !333, line: 45, column: 3)
!552 = !{!553, !554, i64 1536}
!553 = !{!"", !546, i64 0, !546, i64 512, !546, i64 1024, !546, i64 1280, !554, i64 1536, !554, i64 1540, !546, i64 1544}
!554 = !{!"int", !546, i64 0}
!555 = !DILocation(line: 45, column: 3, scope: !551)
!556 = !DILocation(line: 45, column: 3, scope: !557)
!557 = distinct !DILexicalBlock(scope: !550, file: !333, line: 45, column: 3)
!558 = !{!554, !554, i64 0}
!559 = !{!553, !554, i64 1540}
!560 = !DILocation(line: 46, column: 3, scope: !561)
!561 = distinct !DILexicalBlock(scope: !562, file: !333, line: 46, column: 3)
!562 = distinct !DILexicalBlock(scope: !332, file: !333, line: 46, column: 3)
!563 = !DILocation(line: 46, column: 3, scope: !562)
!564 = !DILocation(line: 46, column: 3, scope: !565)
!565 = distinct !DILexicalBlock(scope: !562, file: !333, line: 46, column: 3)
!566 = !DILocation(line: 46, column: 3, scope: !567)
!567 = distinct !DILexicalBlock(scope: !562, file: !333, line: 46, column: 3)
!568 = !{!569, !554, i64 0}
!569 = !{!"_p_PetscObject", !554, i64 0, !546, i64 8, !545, i64 64, !554, i64 72, !570, i64 80, !570, i64 88, !570, i64 96, !570, i64 104, !571, i64 112, !554, i64 120, !554, i64 124, !545, i64 128, !545, i64 136, !545, i64 144, !545, i64 152, !545, i64 160, !545, i64 168, !545, i64 176, !571, i64 184, !545, i64 192, !545, i64 200, !554, i64 208, !545, i64 216, !571, i64 224, !554, i64 232, !554, i64 236, !545, i64 240, !545, i64 248, !545, i64 256, !545, i64 264, !554, i64 272, !554, i64 276, !545, i64 280, !545, i64 288, !545, i64 296, !545, i64 304, !554, i64 312, !554, i64 316, !545, i64 320, !545, i64 328, !545, i64 336, !545, i64 344, !545, i64 352, !554, i64 360, !546, i64 368, !546, i64 384, !545, i64 392, !545, i64 400, !554, i64 408, !546, i64 416, !546, i64 456, !546, i64 496, !546, i64 536, !545, i64 544, !546, i64 552}
!570 = !{!"double", !546, i64 0}
!571 = !{!"long", !546, i64 0}
!572 = !DILocation(line: 46, column: 3, scope: !573)
!573 = distinct !DILexicalBlock(scope: !574, file: !333, line: 46, column: 3)
!574 = distinct !DILexicalBlock(scope: !567, file: !333, line: 46, column: 3)
!575 = !DILocation(line: 46, column: 3, scope: !574)
!576 = !DILocation(line: 47, column: 10, scope: !332)
!577 = !DILocation(line: 0, scope: !535)
!578 = !DILocation(line: 47, column: 30, scope: !579)
!579 = distinct !DILexicalBlock(scope: !535, file: !333, line: 47, column: 30)
!580 = !DILocation(line: 47, column: 30, scope: !535)
!581 = !{!"branch_weights", i32 2000, i32 1}
!582 = !DILocation(line: 48, column: 29, scope: !332)
!583 = !DILocation(line: 48, column: 10, scope: !332)
!584 = !DILocation(line: 0, scope: !537)
!585 = !DILocation(line: 48, column: 41, scope: !586)
!586 = distinct !DILexicalBlock(scope: !537, file: !333, line: 48, column: 41)
!587 = !DILocation(line: 48, column: 41, scope: !537)
!588 = !DILocation(line: 49, column: 3, scope: !589)
!589 = distinct !DILexicalBlock(scope: !590, file: !333, line: 49, column: 3)
!590 = distinct !DILexicalBlock(scope: !591, file: !333, line: 49, column: 3)
!591 = distinct !DILexicalBlock(scope: !332, file: !333, line: 49, column: 3)
!592 = !DILocation(line: 49, column: 3, scope: !590)
!593 = !DILocation(line: 49, column: 3, scope: !594)
!594 = distinct !DILexicalBlock(scope: !595, file: !333, line: 49, column: 3)
!595 = distinct !DILexicalBlock(scope: !589, file: !333, line: 49, column: 3)
!596 = !DILocation(line: 49, column: 3, scope: !595)
!597 = !DILocation(line: 49, column: 3, scope: !598)
!598 = distinct !DILexicalBlock(scope: !599, file: !333, line: 49, column: 3)
!599 = distinct !DILexicalBlock(scope: !594, file: !333, line: 49, column: 3)
!600 = !{!553, !546, i64 1544}
!601 = !DILocation(line: 49, column: 3, scope: !599)
!602 = !DILocation(line: 49, column: 3, scope: !603)
!603 = distinct !DILexicalBlock(scope: !598, file: !333, line: 49, column: 3)
!604 = !DILocation(line: 49, column: 3, scope: !605)
!605 = distinct !DILexicalBlock(scope: !594, file: !333, line: 49, column: 3)
!606 = !DILocation(line: 49, column: 3, scope: !607)
!607 = distinct !DILexicalBlock(scope: !605, file: !333, line: 49, column: 3)
!608 = !DILocation(line: 49, column: 3, scope: !609)
!609 = distinct !DILexicalBlock(scope: !610, file: !333, line: 49, column: 3)
!610 = distinct !DILexicalBlock(scope: !607, file: !333, line: 49, column: 3)
!611 = !DILocation(line: 49, column: 3, scope: !610)
!612 = !DILocation(line: 49, column: 3, scope: !613)
!613 = distinct !DILexicalBlock(scope: !609, file: !333, line: 49, column: 3)
!614 = !DILocation(line: 50, column: 1, scope: !332)
!615 = !DISubprogram(name: "PetscError", scope: !73, file: !73, line: 668, type: !616, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !618)
!616 = !DISubroutineType(types: !617)
!617 = !{!139, !120, !26, !158, !158, !26, !72, !158, null}
!618 = !{}
!619 = !DISubprogram(name: "PetscCheckPointer", scope: !126, file: !126, line: 183, type: !620, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !618)
!620 = !DISubroutineType(types: !621)
!621 = !{!3, !622, !78}
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!624 = !DISubprogram(name: "SNESGetDM", scope: !25, file: !25, line: 672, type: !625, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !618)
!625 = !DISubroutineType(types: !626)
!626 = !{!26, !337, !627}
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!628 = !DISubprogram(name: "DMSNESSetObjective", scope: !25, file: !25, line: 698, type: !629, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !618)
!629 = !DISubroutineType(types: !630)
!630 = !{!26, !412, !631, !122}
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!26, !337, !352, !634, !122}
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!635 = distinct !DISubprogram(name: "SNESGetObjective", scope: !333, file: !333, line: 68, type: !636, scopeLine: 69, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !639)
!636 = !DISubroutineType(types: !637)
!637 = !{!139, !336, !638, !388}
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!639 = !{!640, !641, !642, !643, !644, !645, !647}
!640 = !DILocalVariable(name: "snes", arg: 1, scope: !635, file: !333, line: 68, type: !336)
!641 = !DILocalVariable(name: "obj", arg: 2, scope: !635, file: !333, line: 68, type: !638)
!642 = !DILocalVariable(name: "ctx", arg: 3, scope: !635, file: !333, line: 68, type: !388)
!643 = !DILocalVariable(name: "ierr", scope: !635, file: !333, line: 70, type: !139)
!644 = !DILocalVariable(name: "dm", scope: !635, file: !333, line: 71, type: !410)
!645 = !DILocalVariable(name: "ierr__", scope: !646, file: !333, line: 75, type: !139)
!646 = distinct !DILexicalBlock(scope: !635, file: !333, line: 75, column: 30)
!647 = !DILocalVariable(name: "ierr__", scope: !648, file: !333, line: 76, type: !139)
!648 = distinct !DILexicalBlock(scope: !635, file: !333, line: 76, column: 41)
!649 = !DILocation(line: 0, scope: !635)
!650 = !DILocation(line: 71, column: 3, scope: !635)
!651 = !DILocation(line: 73, column: 3, scope: !652)
!652 = distinct !DILexicalBlock(scope: !653, file: !333, line: 73, column: 3)
!653 = distinct !DILexicalBlock(scope: !654, file: !333, line: 73, column: 3)
!654 = distinct !DILexicalBlock(scope: !635, file: !333, line: 73, column: 3)
!655 = !DILocation(line: 73, column: 3, scope: !653)
!656 = !DILocation(line: 73, column: 3, scope: !657)
!657 = distinct !DILexicalBlock(scope: !658, file: !333, line: 73, column: 3)
!658 = distinct !DILexicalBlock(scope: !652, file: !333, line: 73, column: 3)
!659 = !DILocation(line: 73, column: 3, scope: !658)
!660 = !DILocation(line: 73, column: 3, scope: !661)
!661 = distinct !DILexicalBlock(scope: !657, file: !333, line: 73, column: 3)
!662 = !DILocation(line: 74, column: 3, scope: !663)
!663 = distinct !DILexicalBlock(scope: !664, file: !333, line: 74, column: 3)
!664 = distinct !DILexicalBlock(scope: !635, file: !333, line: 74, column: 3)
!665 = !DILocation(line: 74, column: 3, scope: !664)
!666 = !DILocation(line: 74, column: 3, scope: !667)
!667 = distinct !DILexicalBlock(scope: !664, file: !333, line: 74, column: 3)
!668 = !DILocation(line: 74, column: 3, scope: !669)
!669 = distinct !DILexicalBlock(scope: !664, file: !333, line: 74, column: 3)
!670 = !DILocation(line: 74, column: 3, scope: !671)
!671 = distinct !DILexicalBlock(scope: !672, file: !333, line: 74, column: 3)
!672 = distinct !DILexicalBlock(scope: !669, file: !333, line: 74, column: 3)
!673 = !DILocation(line: 74, column: 3, scope: !672)
!674 = !DILocation(line: 75, column: 10, scope: !635)
!675 = !DILocation(line: 0, scope: !646)
!676 = !DILocation(line: 75, column: 30, scope: !677)
!677 = distinct !DILexicalBlock(scope: !646, file: !333, line: 75, column: 30)
!678 = !DILocation(line: 75, column: 30, scope: !646)
!679 = !DILocation(line: 76, column: 29, scope: !635)
!680 = !DILocation(line: 76, column: 10, scope: !635)
!681 = !DILocation(line: 0, scope: !648)
!682 = !DILocation(line: 76, column: 41, scope: !683)
!683 = distinct !DILexicalBlock(scope: !648, file: !333, line: 76, column: 41)
!684 = !DILocation(line: 76, column: 41, scope: !648)
!685 = !DILocation(line: 77, column: 3, scope: !686)
!686 = distinct !DILexicalBlock(scope: !687, file: !333, line: 77, column: 3)
!687 = distinct !DILexicalBlock(scope: !688, file: !333, line: 77, column: 3)
!688 = distinct !DILexicalBlock(scope: !635, file: !333, line: 77, column: 3)
!689 = !DILocation(line: 77, column: 3, scope: !687)
!690 = !DILocation(line: 77, column: 3, scope: !691)
!691 = distinct !DILexicalBlock(scope: !692, file: !333, line: 77, column: 3)
!692 = distinct !DILexicalBlock(scope: !686, file: !333, line: 77, column: 3)
!693 = !DILocation(line: 77, column: 3, scope: !692)
!694 = !DILocation(line: 77, column: 3, scope: !695)
!695 = distinct !DILexicalBlock(scope: !696, file: !333, line: 77, column: 3)
!696 = distinct !DILexicalBlock(scope: !691, file: !333, line: 77, column: 3)
!697 = !DILocation(line: 77, column: 3, scope: !696)
!698 = !DILocation(line: 77, column: 3, scope: !699)
!699 = distinct !DILexicalBlock(scope: !695, file: !333, line: 77, column: 3)
!700 = !DILocation(line: 77, column: 3, scope: !701)
!701 = distinct !DILexicalBlock(scope: !691, file: !333, line: 77, column: 3)
!702 = !DILocation(line: 77, column: 3, scope: !703)
!703 = distinct !DILexicalBlock(scope: !701, file: !333, line: 77, column: 3)
!704 = !DILocation(line: 77, column: 3, scope: !705)
!705 = distinct !DILexicalBlock(scope: !706, file: !333, line: 77, column: 3)
!706 = distinct !DILexicalBlock(scope: !703, file: !333, line: 77, column: 3)
!707 = !DILocation(line: 77, column: 3, scope: !706)
!708 = !DILocation(line: 77, column: 3, scope: !709)
!709 = distinct !DILexicalBlock(scope: !705, file: !333, line: 77, column: 3)
!710 = !DILocation(line: 78, column: 1, scope: !635)
!711 = !DISubprogram(name: "DMSNESGetObjective", scope: !25, file: !25, line: 699, type: !712, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !618)
!712 = !DISubroutineType(types: !713)
!713 = !{!26, !412, !714, !388}
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!715 = distinct !DISubprogram(name: "SNESComputeObjective", scope: !333, file: !333, line: 96, type: !716, scopeLine: 97, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !718)
!716 = !DISubroutineType(types: !717)
!717 = !{!139, !336, !351, !234}
!718 = !{!719, !720, !721, !722, !723, !724, !757, !759, !761, !765, !767}
!719 = !DILocalVariable(name: "snes", arg: 1, scope: !715, file: !333, line: 96, type: !336)
!720 = !DILocalVariable(name: "X", arg: 2, scope: !715, file: !333, line: 96, type: !351)
!721 = !DILocalVariable(name: "ob", arg: 3, scope: !715, file: !333, line: 96, type: !234)
!722 = !DILocalVariable(name: "ierr", scope: !715, file: !333, line: 98, type: !139)
!723 = !DILocalVariable(name: "dm", scope: !715, file: !333, line: 99, type: !410)
!724 = !DILocalVariable(name: "sdm", scope: !715, file: !333, line: 100, type: !725)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSNES", file: !339, line: 176, baseType: !726)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMSNES", file: !339, line: 197, size: 5568, elements: !728)
!728 = !{!729, !730, !749, !750, !751, !752, !753, !754, !755, !756}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !727, file: !339, line: 198, baseType: !342, size: 4480)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !727, file: !339, line: 198, baseType: !731, size: 576, offset: 4480)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !732, size: 576, elements: !177)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMSNESOps", file: !339, line: 178, size: 576, elements: !733)
!733 = !{!734, !735, !736, !737, !738, !739, !740, !741, !745}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "computefunction", scope: !732, file: !339, line: 179, baseType: !398, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "computemffunction", scope: !732, file: !339, line: 180, baseType: !398, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobian", scope: !732, file: !339, line: 181, baseType: !402, size: 64, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !732, file: !339, line: 184, baseType: !525, size: 64, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "computepfunction", scope: !732, file: !339, line: 187, baseType: !398, size: 64, offset: 256)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "computepjacobian", scope: !732, file: !339, line: 188, baseType: !402, size: 64, offset: 320)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "computegs", scope: !732, file: !339, line: 191, baseType: !398, size: 64, offset: 384)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !732, file: !339, line: 193, baseType: !742, size: 64, offset: 448)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!139, !725}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !732, file: !339, line: 194, baseType: !746, size: 64, offset: 512)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!139, !725, !725}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "functionctx", scope: !727, file: !339, line: 199, baseType: !122, size: 64, offset: 5056)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "mffunctionctx", scope: !727, file: !339, line: 200, baseType: !122, size: 64, offset: 5120)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "gsctx", scope: !727, file: !339, line: 201, baseType: !122, size: 64, offset: 5184)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "pctx", scope: !727, file: !339, line: 202, baseType: !122, size: 64, offset: 5248)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "jacobianctx", scope: !727, file: !339, line: 203, baseType: !122, size: 64, offset: 5312)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "objectivectx", scope: !727, file: !339, line: 204, baseType: !122, size: 64, offset: 5376)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !727, file: !339, line: 206, baseType: !122, size: 64, offset: 5440)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "originaldm", scope: !727, file: !339, line: 215, baseType: !410, size: 64, offset: 5504)
!757 = !DILocalVariable(name: "ierr__", scope: !758, file: !333, line: 106, type: !139)
!758 = distinct !DILexicalBlock(scope: !715, file: !333, line: 106, column: 30)
!759 = !DILocalVariable(name: "ierr__", scope: !760, file: !333, line: 107, type: !139)
!760 = distinct !DILexicalBlock(scope: !715, file: !333, line: 107, column: 31)
!761 = !DILocalVariable(name: "ierr__", scope: !762, file: !333, line: 109, type: !139)
!762 = distinct !DILexicalBlock(scope: !763, file: !333, line: 109, column: 62)
!763 = distinct !DILexicalBlock(scope: !764, file: !333, line: 108, column: 35)
!764 = distinct !DILexicalBlock(scope: !715, file: !333, line: 108, column: 7)
!765 = !DILocalVariable(name: "ierr__", scope: !766, file: !333, line: 110, type: !139)
!766 = distinct !DILexicalBlock(scope: !763, file: !333, line: 110, column: 70)
!767 = !DILocalVariable(name: "ierr__", scope: !768, file: !333, line: 111, type: !139)
!768 = distinct !DILexicalBlock(scope: !763, file: !333, line: 111, column: 60)
!769 = !DILocation(line: 0, scope: !715)
!770 = !DILocation(line: 99, column: 3, scope: !715)
!771 = !DILocation(line: 100, column: 3, scope: !715)
!772 = !DILocation(line: 102, column: 3, scope: !773)
!773 = distinct !DILexicalBlock(scope: !774, file: !333, line: 102, column: 3)
!774 = distinct !DILexicalBlock(scope: !775, file: !333, line: 102, column: 3)
!775 = distinct !DILexicalBlock(scope: !715, file: !333, line: 102, column: 3)
!776 = !DILocation(line: 102, column: 3, scope: !774)
!777 = !DILocation(line: 102, column: 3, scope: !778)
!778 = distinct !DILexicalBlock(scope: !779, file: !333, line: 102, column: 3)
!779 = distinct !DILexicalBlock(scope: !773, file: !333, line: 102, column: 3)
!780 = !DILocation(line: 102, column: 3, scope: !779)
!781 = !DILocation(line: 102, column: 3, scope: !782)
!782 = distinct !DILexicalBlock(scope: !778, file: !333, line: 102, column: 3)
!783 = !DILocation(line: 103, column: 3, scope: !784)
!784 = distinct !DILexicalBlock(scope: !785, file: !333, line: 103, column: 3)
!785 = distinct !DILexicalBlock(scope: !715, file: !333, line: 103, column: 3)
!786 = !DILocation(line: 103, column: 3, scope: !785)
!787 = !DILocation(line: 103, column: 3, scope: !788)
!788 = distinct !DILexicalBlock(scope: !785, file: !333, line: 103, column: 3)
!789 = !DILocation(line: 103, column: 3, scope: !790)
!790 = distinct !DILexicalBlock(scope: !785, file: !333, line: 103, column: 3)
!791 = !DILocation(line: 103, column: 3, scope: !792)
!792 = distinct !DILexicalBlock(scope: !793, file: !333, line: 103, column: 3)
!793 = distinct !DILexicalBlock(scope: !790, file: !333, line: 103, column: 3)
!794 = !DILocation(line: 103, column: 3, scope: !793)
!795 = !DILocation(line: 104, column: 3, scope: !796)
!796 = distinct !DILexicalBlock(scope: !797, file: !333, line: 104, column: 3)
!797 = distinct !DILexicalBlock(scope: !715, file: !333, line: 104, column: 3)
!798 = !DILocation(line: 104, column: 3, scope: !797)
!799 = !DILocation(line: 104, column: 3, scope: !800)
!800 = distinct !DILexicalBlock(scope: !797, file: !333, line: 104, column: 3)
!801 = !DILocation(line: 104, column: 3, scope: !802)
!802 = distinct !DILexicalBlock(scope: !797, file: !333, line: 104, column: 3)
!803 = !DILocation(line: 104, column: 3, scope: !804)
!804 = distinct !DILexicalBlock(scope: !805, file: !333, line: 104, column: 3)
!805 = distinct !DILexicalBlock(scope: !802, file: !333, line: 104, column: 3)
!806 = !DILocation(line: 104, column: 3, scope: !805)
!807 = !DILocation(line: 105, column: 3, scope: !808)
!808 = distinct !DILexicalBlock(scope: !809, file: !333, line: 105, column: 3)
!809 = distinct !DILexicalBlock(scope: !715, file: !333, line: 105, column: 3)
!810 = !DILocation(line: 105, column: 3, scope: !809)
!811 = !DILocation(line: 105, column: 3, scope: !812)
!812 = distinct !DILexicalBlock(scope: !809, file: !333, line: 105, column: 3)
