; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/sell/seq/sell.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/sell/seq/sell.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.__jmp_buf_tag = type { [8 x i64], i32, %struct.__sigset_t }
%struct.__sigset_t = type { [16 x i64] }
%struct.ompi_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque

!317 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!318 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!319 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!320 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!321 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!322 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !323, line: 119, baseType: !7, size: 32, elements: !324)
!323 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewer.h", directory: "/home/users/ndemeye/xSDK")
!324 = !{!325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366}
!325 = !DIEnumerator(name: "PETSC_VIEWER_DEFAULT", value: 0, isUnsigned: true)
!326 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATLAB", value: 1, isUnsigned: true)
!327 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATHEMATICA", value: 2, isUnsigned: true)
!328 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!329 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!330 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!331 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!332 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!333 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!334 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!335 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!336 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!337 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!338 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!339 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!340 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!341 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!342 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!343 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!344 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!345 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!346 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!347 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!348 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!349 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!350 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!351 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!352 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!353 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!354 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!355 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!356 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!357 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!358 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!359 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!360 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!361 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!362 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!363 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!364 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!365 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!366 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!367 = !{!368, !372, !373, !576, !408, !579, !542, !434, !1396, !577, !617, !403, !1504, !458, !74, !605, !604, !485, !440, !431, !1062, !1507}
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !369, line: 330, baseType: !370)
!369 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !369, line: 330, flags: DIFlagFwdDecl)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !376, line: 73, size: 4480, elements: !377)
!376 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!377 = !{!378, !380, !429, !430, !432, !435, !436, !437, !438, !446, !447, !449, !453, !457, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !470, !471, !472, !474, !475, !477, !479, !480, !481, !482, !483, !486, !488, !489, !490, !491, !492, !495, !497, !498, !499, !509, !511, !512, !516, !517, !566, !571, !573, !574, !575}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !375, file: !376, line: 74, baseType: !379, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !74)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !375, file: !376, line: 75, baseType: !381, size: 448, offset: 64)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !382, size: 448, elements: !427)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !376, line: 53, baseType: !383)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !376, line: 45, size: 448, elements: !384)
!384 = !{!385, !391, !399, !404, !411, !415, !422}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !383, file: !376, line: 46, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!389, !373, !390}
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !74)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !383, file: !376, line: 47, baseType: !392, size: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!389, !373, !395}
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !396, line: 16, baseType: !397)
!396 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !396, line: 16, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !383, file: !376, line: 48, baseType: !400, size: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!389, !403}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !383, file: !376, line: 49, baseType: !405, size: 64, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!389, !373, !408, !373}
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !410)
!410 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !383, file: !376, line: 50, baseType: !412, size: 64, offset: 256)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!389, !373, !408, !403}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !383, file: !376, line: 51, baseType: !416, size: 64, offset: 320)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!389, !373, !408, !419}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{null}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !383, file: !376, line: 52, baseType: !423, size: 64, offset: 384)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!389, !373, !408, !426}
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!427 = !{!428}
!428 = !DISubrange(count: 1)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !375, file: !376, line: 76, baseType: !368, size: 64, offset: 512)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !375, file: !376, line: 77, baseType: !431, size: 32, offset: 576)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !74)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !375, file: !376, line: 78, baseType: !433, size: 64, offset: 640)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !434)
!434 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !375, file: !376, line: 78, baseType: !433, size: 64, offset: 704)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !375, file: !376, line: 78, baseType: !433, size: 64, offset: 768)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !375, file: !376, line: 78, baseType: !433, size: 64, offset: 832)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !375, file: !376, line: 79, baseType: !439, size: 64, offset: 896)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !441)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !442, line: 27, baseType: !443)
!442 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !444, line: 43, baseType: !445)
!444 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!445 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !375, file: !376, line: 80, baseType: !431, size: 32, offset: 960)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !375, file: !376, line: 81, baseType: !448, size: 32, offset: 992)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !74)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !375, file: !376, line: 82, baseType: !450, size: 64, offset: 1024)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !375, file: !376, line: 83, baseType: !454, size: 64, offset: 1088)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !375, file: !376, line: 84, baseType: !458, size: 64, offset: 1152)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !375, file: !376, line: 85, baseType: !458, size: 64, offset: 1216)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !375, file: !376, line: 86, baseType: !458, size: 64, offset: 1280)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !375, file: !376, line: 87, baseType: !458, size: 64, offset: 1344)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !375, file: !376, line: 88, baseType: !373, size: 64, offset: 1408)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !375, file: !376, line: 89, baseType: !439, size: 64, offset: 1472)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !375, file: !376, line: 90, baseType: !458, size: 64, offset: 1536)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !375, file: !376, line: 91, baseType: !458, size: 64, offset: 1600)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !375, file: !376, line: 92, baseType: !431, size: 32, offset: 1664)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !375, file: !376, line: 93, baseType: !372, size: 64, offset: 1728)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !375, file: !376, line: 94, baseType: !469, size: 64, offset: 1792)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !440)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !375, file: !376, line: 95, baseType: !431, size: 32, offset: 1856)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !375, file: !376, line: 95, baseType: !431, size: 32, offset: 1888)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !375, file: !376, line: 96, baseType: !473, size: 64, offset: 1920)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !375, file: !376, line: 96, baseType: !473, size: 64, offset: 1984)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !375, file: !376, line: 97, baseType: !476, size: 64, offset: 2048)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !375, file: !376, line: 97, baseType: !478, size: 64, offset: 2112)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !375, file: !376, line: 98, baseType: !431, size: 32, offset: 2176)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !375, file: !376, line: 98, baseType: !431, size: 32, offset: 2208)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !375, file: !376, line: 99, baseType: !473, size: 64, offset: 2240)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !375, file: !376, line: 99, baseType: !473, size: 64, offset: 2304)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !375, file: !376, line: 100, baseType: !484, size: 64, offset: 2368)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !434)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !375, file: !376, line: 100, baseType: !487, size: 64, offset: 2432)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !375, file: !376, line: 101, baseType: !431, size: 32, offset: 2496)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !375, file: !376, line: 101, baseType: !431, size: 32, offset: 2528)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !375, file: !376, line: 102, baseType: !473, size: 64, offset: 2560)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !375, file: !376, line: 102, baseType: !473, size: 64, offset: 2624)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !375, file: !376, line: 103, baseType: !493, size: 64, offset: 2688)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !485)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !375, file: !376, line: 103, baseType: !496, size: 64, offset: 2752)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !375, file: !376, line: 104, baseType: !426, size: 64, offset: 2816)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !375, file: !376, line: 105, baseType: !431, size: 32, offset: 2880)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !375, file: !376, line: 106, baseType: !500, size: 128, offset: 2944)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 128, elements: !507)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !376, line: 64, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !376, line: 61, size: 128, elements: !504)
!504 = !{!505, !506}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !503, file: !376, line: 62, baseType: !419, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !503, file: !376, line: 63, baseType: !372, size: 64, offset: 64)
!507 = !{!508}
!508 = !DISubrange(count: 2)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !375, file: !376, line: 107, baseType: !510, size: 64, offset: 3072)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 64, elements: !507)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !375, file: !376, line: 108, baseType: !372, size: 64, offset: 3136)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !375, file: !376, line: 109, baseType: !513, size: 64, offset: 3200)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!389, !372}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !375, file: !376, line: 111, baseType: !431, size: 32, offset: 3264)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !375, file: !376, line: 112, baseType: !518, size: 320, offset: 3328)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !519, size: 320, elements: !564)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{!389, !522, !373, !372}
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !525)
!525 = !{!526, !527, !552, !553, !554, !555, !556, !557, !558, !559, !560}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !524, file: !12, line: 100, baseType: !431, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !524, file: !12, line: 101, baseType: !528, size: 64, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !531)
!531 = !{!532, !533, !534, !535, !536, !539, !540, !541, !545, !547, !549, !550, !551}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !530, file: !12, line: 84, baseType: !458, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !530, file: !12, line: 85, baseType: !458, size: 64, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !530, file: !12, line: 86, baseType: !372, size: 64, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !530, file: !12, line: 87, baseType: !450, size: 64, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !530, file: !12, line: 88, baseType: !537, size: 64, offset: 256)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !408)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !530, file: !12, line: 89, baseType: !410, size: 8, offset: 320)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !530, file: !12, line: 90, baseType: !458, size: 64, offset: 384)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !530, file: !12, line: 91, baseType: !542, size: 64, offset: 448)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !543, line: 46, baseType: !544)
!543 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!544 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !530, file: !12, line: 92, baseType: !546, size: 32, offset: 512)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !530, file: !12, line: 93, baseType: !548, size: 32, offset: 544)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !530, file: !12, line: 94, baseType: !528, size: 64, offset: 576)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !530, file: !12, line: 95, baseType: !458, size: 64, offset: 640)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !530, file: !12, line: 96, baseType: !372, size: 64, offset: 704)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !524, file: !12, line: 102, baseType: !458, size: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !524, file: !12, line: 102, baseType: !458, size: 64, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !524, file: !12, line: 103, baseType: !458, size: 64, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !524, file: !12, line: 104, baseType: !368, size: 64, offset: 320)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !524, file: !12, line: 105, baseType: !546, size: 32, offset: 384)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !524, file: !12, line: 105, baseType: !546, size: 32, offset: 416)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !524, file: !12, line: 105, baseType: !546, size: 32, offset: 448)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !524, file: !12, line: 106, baseType: !373, size: 64, offset: 512)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !524, file: !12, line: 107, baseType: !561, size: 64, offset: 576)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !562)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!564 = !{!565}
!565 = !DISubrange(count: 5)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !375, file: !376, line: 113, baseType: !567, size: 320, offset: 3648)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 320, elements: !564)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!389, !373, !372}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !375, file: !376, line: 114, baseType: !572, size: 320, offset: 3968)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 320, elements: !564)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !375, file: !376, line: 115, baseType: !546, size: 32, offset: 4288)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !375, file: !376, line: 120, baseType: !561, size: 64, offset: 4352)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !375, file: !376, line: 121, baseType: !546, size: 32, offset: 4416)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !578, line: 1451, baseType: !419)
!578 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_SeqSELL", file: !581, line: 50, baseType: !582)
!581 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/sell/seq/sell.h", directory: "/home/users/ndemeye/xSDK")
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !581, line: 43, size: 1920, elements: !583)
!583 = !{!584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !607, !608, !613, !614, !615, !616, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "roworiented", scope: !582, file: !581, line: 44, baseType: !546, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "nonew", scope: !582, file: !581, line: 44, baseType: !431, size: 32, offset: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "nounused", scope: !582, file: !581, line: 44, baseType: !431, size: 32, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "singlemalloc", scope: !582, file: !581, line: 44, baseType: !546, size: 32, offset: 96)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "maxallocmat", scope: !582, file: !581, line: 44, baseType: !431, size: 32, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "maxallocrow", scope: !582, file: !581, line: 44, baseType: !431, size: 32, offset: 160)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "nz", scope: !582, file: !581, line: 44, baseType: !431, size: 32, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "rlenmax", scope: !582, file: !581, line: 44, baseType: !431, size: 32, offset: 224)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "rlen", scope: !582, file: !581, line: 44, baseType: !476, size: 64, offset: 256)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "free_rlen", scope: !582, file: !581, line: 44, baseType: !546, size: 32, offset: 320)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !582, file: !581, line: 44, baseType: !431, size: 32, offset: 352)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "keepnonzeropattern", scope: !582, file: !581, line: 44, baseType: !546, size: 32, offset: 384)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ignorezeroentries", scope: !582, file: !581, line: 44, baseType: !546, size: 32, offset: 416)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "free_colidx", scope: !582, file: !581, line: 44, baseType: !546, size: 32, offset: 448)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "free_val", scope: !582, file: !581, line: 44, baseType: !546, size: 32, offset: 480)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "colidx", scope: !582, file: !581, line: 44, baseType: !476, size: 64, offset: 512)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "diag", scope: !582, file: !581, line: 44, baseType: !476, size: 64, offset: 576)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerorowcnt", scope: !582, file: !581, line: 44, baseType: !431, size: 32, offset: 640)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "free_diag", scope: !582, file: !581, line: 44, baseType: !546, size: 32, offset: 672)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !582, file: !581, line: 44, baseType: !604, size: 64, offset: 704)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatScalar", file: !606, line: 799, baseType: !494)
!606 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmath.h", directory: "/home/users/ndemeye/xSDK")
!607 = !DIDerivedType(tag: DW_TAG_member, name: "solve_work", scope: !582, file: !581, line: 44, baseType: !493, size: 64, offset: 768)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !582, file: !581, line: 44, baseType: !609, size: 64, offset: 832)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !610, line: 11, baseType: !611)
!610 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !610, line: 11, flags: DIFlagFwdDecl)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !582, file: !581, line: 44, baseType: !609, size: 64, offset: 896)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "icol", scope: !582, file: !581, line: 44, baseType: !609, size: 64, offset: 960)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !582, file: !581, line: 44, baseType: !546, size: 32, offset: 1024)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !582, file: !581, line: 44, baseType: !617, size: 64, offset: 1088)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !38, line: 16, baseType: !618)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !620, line: 436, size: 23424, elements: !621)
!620 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!621 = !{!622, !624, !1127, !1147, !1148, !1149, !1151, !1152, !1153, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1280, !1281, !1297, !1298, !1299, !1300, !1301, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1336, !1356, !1357, !1359, !1360, !1361, !1362, !1363, !1364, !1382, !1383}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !619, file: !620, line: 437, baseType: !623, size: 4480)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !376, line: 122, baseType: !375)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !619, file: !620, line: 437, baseType: !625, size: 9472, offset: 4480)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !626, size: 9472, elements: !427)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !620, line: 32, size: 9472, elements: !627)
!627 = !{!628, !637, !641, !642, !649, !653, !654, !655, !656, !657, !658, !659, !679, !683, !688, !694, !713, !718, !722, !723, !728, !733, !734, !739, !743, !747, !751, !755, !759, !760, !761, !762, !763, !767, !768, !773, !774, !775, !776, !777, !782, !789, !794, !798, !802, !806, !810, !811, !815, !816, !823, !828, !829, !830, !831, !893, !901, !902, !906, !907, !911, !912, !916, !921, !922, !926, !930, !937, !938, !939, !940, !941, !942, !947, !948, !952, !956, !960, !961, !962, !966, !976, !977, !981, !982, !986, !987, !991, !992, !997, !998, !1002, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1016, !1017, !1018, !1019, !1020, !1021, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1036, !1040, !1041, !1042, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1056, !1057, !1058, !1063, !1067, !1068, !1072, !1073, !1074, !1075, !1101, !1105, !1106, !1107, !1108, !1109, !1113, !1114, !1115, !1116, !1117, !1121, !1125, !1126}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !626, file: !620, line: 34, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{!389, !617, !431, !632, !431, !632, !634, !636}
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !431)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !26)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !626, file: !620, line: 35, baseType: !638, size: 64, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!389, !617, !431, !476, !478, !496}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !626, file: !620, line: 36, baseType: !638, size: 64, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !626, file: !620, line: 37, baseType: !643, size: 64, offset: 192)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!389, !617, !646, !646}
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !62, line: 21, baseType: !647)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !62, line: 21, flags: DIFlagFwdDecl)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !626, file: !620, line: 38, baseType: !650, size: 64, offset: 256)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{!389, !617, !646, !646, !646}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !626, file: !620, line: 40, baseType: !643, size: 64, offset: 320)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !626, file: !620, line: 41, baseType: !650, size: 64, offset: 384)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !626, file: !620, line: 42, baseType: !643, size: 64, offset: 448)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !626, file: !620, line: 43, baseType: !650, size: 64, offset: 512)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !626, file: !620, line: 44, baseType: !643, size: 64, offset: 576)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !626, file: !620, line: 46, baseType: !650, size: 64, offset: 640)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !626, file: !620, line: 47, baseType: !660, size: 64, offset: 704)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!389, !617, !609, !609, !663}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !665)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !38, line: 1239, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 1226, size: 704, elements: !667)
!667 = !{!668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !666, file: !38, line: 1227, baseType: !485, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !666, file: !38, line: 1228, baseType: !485, size: 64, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !666, file: !38, line: 1229, baseType: !485, size: 64, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !666, file: !38, line: 1230, baseType: !485, size: 64, offset: 192)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !666, file: !38, line: 1231, baseType: !485, size: 64, offset: 256)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !666, file: !38, line: 1232, baseType: !485, size: 64, offset: 320)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !666, file: !38, line: 1233, baseType: !485, size: 64, offset: 384)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !666, file: !38, line: 1234, baseType: !485, size: 64, offset: 448)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !666, file: !38, line: 1236, baseType: !485, size: 64, offset: 512)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !666, file: !38, line: 1237, baseType: !485, size: 64, offset: 576)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !666, file: !38, line: 1238, baseType: !485, size: 64, offset: 640)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !626, file: !620, line: 48, baseType: !680, size: 64, offset: 768)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!389, !617, !609, !663}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !626, file: !620, line: 49, baseType: !684, size: 64, offset: 832)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!389, !617, !646, !485, !687, !485, !431, !431, !646}
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !38, line: 1291, baseType: !37)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !626, file: !620, line: 50, baseType: !689, size: 64, offset: 896)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!389, !617, !692, !693}
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !38, line: 238, baseType: !50)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !626, file: !620, line: 52, baseType: !695, size: 64, offset: 960)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{!389, !617, !698, !699}
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !38, line: 612, baseType: !56)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !38, line: 600, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 592, size: 640, elements: !702)
!702 = !{!703, !704, !705, !706, !707, !708, !709, !710, !711, !712}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !701, file: !38, line: 593, baseType: !433, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !701, file: !38, line: 594, baseType: !433, size: 64, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !701, file: !38, line: 594, baseType: !433, size: 64, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !701, file: !38, line: 594, baseType: !433, size: 64, offset: 192)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !701, file: !38, line: 595, baseType: !433, size: 64, offset: 256)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !701, file: !38, line: 596, baseType: !433, size: 64, offset: 320)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !701, file: !38, line: 597, baseType: !433, size: 64, offset: 384)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !701, file: !38, line: 598, baseType: !433, size: 64, offset: 448)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !701, file: !38, line: 598, baseType: !433, size: 64, offset: 512)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !701, file: !38, line: 599, baseType: !433, size: 64, offset: 576)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !626, file: !620, line: 53, baseType: !714, size: 64, offset: 1024)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!389, !617, !617, !717}
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !626, file: !620, line: 54, baseType: !719, size: 64, offset: 1088)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!389, !617, !646}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !626, file: !620, line: 55, baseType: !643, size: 64, offset: 1152)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !626, file: !620, line: 56, baseType: !724, size: 64, offset: 1216)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!389, !617, !727, !484}
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !62, line: 155, baseType: !61)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !626, file: !620, line: 58, baseType: !729, size: 64, offset: 1280)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!389, !617, !732}
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !38, line: 424, baseType: !69)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !626, file: !620, line: 59, baseType: !729, size: 64, offset: 1344)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !626, file: !620, line: 60, baseType: !735, size: 64, offset: 1408)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!389, !617, !738, !546}
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !38, line: 469, baseType: !73)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !626, file: !620, line: 61, baseType: !740, size: 64, offset: 1472)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{!389, !617}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !626, file: !620, line: 63, baseType: !744, size: 64, offset: 1536)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!389, !617, !431, !632, !494, !646, !646}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !626, file: !620, line: 64, baseType: !748, size: 64, offset: 1600)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{!389, !617, !617, !609, !609, !663}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !626, file: !620, line: 65, baseType: !752, size: 64, offset: 1664)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{!389, !617, !617, !663}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !626, file: !620, line: 66, baseType: !756, size: 64, offset: 1728)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!389, !617, !617, !609, !663}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !626, file: !620, line: 67, baseType: !752, size: 64, offset: 1792)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !626, file: !620, line: 69, baseType: !740, size: 64, offset: 1856)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !626, file: !620, line: 70, baseType: !748, size: 64, offset: 1920)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !626, file: !620, line: 71, baseType: !756, size: 64, offset: 1984)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !626, file: !620, line: 72, baseType: !764, size: 64, offset: 2048)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{!389, !617, !693}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !626, file: !620, line: 73, baseType: !740, size: 64, offset: 2112)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !626, file: !620, line: 75, baseType: !769, size: 64, offset: 2176)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{!389, !617, !772, !693}
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !38, line: 563, baseType: !104)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !626, file: !620, line: 76, baseType: !643, size: 64, offset: 2240)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !626, file: !620, line: 77, baseType: !643, size: 64, offset: 2304)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !626, file: !620, line: 78, baseType: !660, size: 64, offset: 2368)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !626, file: !620, line: 79, baseType: !680, size: 64, offset: 2432)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !626, file: !620, line: 81, baseType: !778, size: 64, offset: 2496)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!389, !617, !494, !617, !781}
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !38, line: 285, baseType: !109)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !626, file: !620, line: 82, baseType: !783, size: 64, offset: 2560)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{!389, !617, !431, !786, !786, !692, !788}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !609)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !626, file: !620, line: 83, baseType: !790, size: 64, offset: 2624)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{!389, !617, !431, !793, !431}
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !626, file: !620, line: 84, baseType: !795, size: 64, offset: 2688)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{!389, !617, !431, !632, !431, !632, !493}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !626, file: !620, line: 85, baseType: !799, size: 64, offset: 2752)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!389, !617, !617, !781}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !626, file: !620, line: 87, baseType: !803, size: 64, offset: 2816)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DISubroutineType(types: !805)
!805 = !{!389, !617, !646, !476}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !626, file: !620, line: 88, baseType: !807, size: 64, offset: 2880)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DISubroutineType(types: !809)
!809 = !{!389, !617, !494}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !626, file: !620, line: 89, baseType: !807, size: 64, offset: 2944)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !626, file: !620, line: 90, baseType: !812, size: 64, offset: 3008)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DISubroutineType(types: !814)
!814 = !{!389, !617, !646, !636}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !626, file: !620, line: 91, baseType: !744, size: 64, offset: 3072)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !626, file: !620, line: 93, baseType: !817, size: 64, offset: 3136)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{!389, !617, !820}
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !821)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !626, file: !620, line: 94, baseType: !824, size: 64, offset: 3200)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DISubroutineType(types: !826)
!826 = !{!389, !617, !431, !546, !546, !476, !827, !827, !717}
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !626, file: !620, line: 95, baseType: !824, size: 64, offset: 3264)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !626, file: !620, line: 96, baseType: !824, size: 64, offset: 3328)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !626, file: !620, line: 97, baseType: !824, size: 64, offset: 3392)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !626, file: !620, line: 99, baseType: !832, size: 64, offset: 3456)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DISubroutineType(types: !834)
!834 = !{!389, !617, !835, !838}
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !610, line: 51, baseType: !836)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !610, line: 51, flags: DIFlagFwdDecl)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !38, line: 1378, baseType: !839)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !620, line: 609, size: 6208, elements: !841)
!841 = !{!842, !843, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !862, !869, !870, !871, !872, !873, !874, !875, !876, !880, !881, !882, !883, !884, !886, !887, !888, !889, !890, !891, !892}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !840, file: !620, line: 610, baseType: !623, size: 4480)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !840, file: !620, line: 610, baseType: !844, size: 32, offset: 4480)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 32, elements: !427)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !840, file: !620, line: 611, baseType: !431, size: 32, offset: 4512)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !840, file: !620, line: 611, baseType: !431, size: 32, offset: 4544)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !840, file: !620, line: 611, baseType: !431, size: 32, offset: 4576)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !840, file: !620, line: 612, baseType: !431, size: 32, offset: 4608)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !840, file: !620, line: 613, baseType: !431, size: 32, offset: 4640)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !840, file: !620, line: 614, baseType: !476, size: 64, offset: 4672)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !840, file: !620, line: 615, baseType: !478, size: 64, offset: 4736)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !840, file: !620, line: 616, baseType: !793, size: 64, offset: 4800)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !840, file: !620, line: 617, baseType: !476, size: 64, offset: 4864)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !840, file: !620, line: 618, baseType: !855, size: 64, offset: 4928)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !620, line: 602, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !620, line: 598, size: 128, elements: !858)
!858 = !{!859, !860, !861}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !857, file: !620, line: 599, baseType: !431, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !857, file: !620, line: 600, baseType: !431, size: 32, offset: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !857, file: !620, line: 601, baseType: !493, size: 64, offset: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !840, file: !620, line: 619, baseType: !863, size: 64, offset: 4992)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !620, line: 607, baseType: !865)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !620, line: 604, size: 128, elements: !866)
!866 = !{!867, !868}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !865, file: !620, line: 605, baseType: !431, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !865, file: !620, line: 606, baseType: !493, size: 64, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !840, file: !620, line: 620, baseType: !493, size: 64, offset: 5056)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !840, file: !620, line: 621, baseType: !485, size: 64, offset: 5120)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !840, file: !620, line: 622, baseType: !485, size: 64, offset: 5184)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !840, file: !620, line: 623, baseType: !646, size: 64, offset: 5248)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !840, file: !620, line: 623, baseType: !646, size: 64, offset: 5312)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !840, file: !620, line: 623, baseType: !646, size: 64, offset: 5376)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !840, file: !620, line: 624, baseType: !546, size: 32, offset: 5440)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !840, file: !620, line: 625, baseType: !877, size: 64, offset: 5504)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DISubroutineType(types: !879)
!879 = !{!389}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !840, file: !620, line: 626, baseType: !372, size: 64, offset: 5568)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !840, file: !620, line: 627, baseType: !646, size: 64, offset: 5632)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !840, file: !620, line: 628, baseType: !431, size: 32, offset: 5696)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !840, file: !620, line: 629, baseType: !408, size: 64, offset: 5760)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !840, file: !620, line: 630, baseType: !885, size: 32, offset: 5824)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !116, line: 213, baseType: !115)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !840, file: !620, line: 631, baseType: !431, size: 32, offset: 5856)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !840, file: !620, line: 631, baseType: !431, size: 32, offset: 5888)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !840, file: !620, line: 632, baseType: !546, size: 32, offset: 5920)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !840, file: !620, line: 633, baseType: !546, size: 32, offset: 5952)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !840, file: !620, line: 634, baseType: !419, size: 64, offset: 6016)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !840, file: !620, line: 634, baseType: !372, size: 64, offset: 6080)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !840, file: !620, line: 635, baseType: !439, size: 64, offset: 6144)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !626, file: !620, line: 100, baseType: !894, size: 64, offset: 3520)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{!389, !617, !431, !431, !897, !900}
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !116, line: 215, baseType: !899)
!899 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !626, file: !620, line: 101, baseType: !740, size: 64, offset: 3584)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !626, file: !620, line: 102, baseType: !903, size: 64, offset: 3648)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{!389, !617, !609, !609, !693}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !626, file: !620, line: 103, baseType: !629, size: 64, offset: 3712)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !626, file: !620, line: 105, baseType: !908, size: 64, offset: 3776)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!389, !617, !609, !609, !692, !693}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !626, file: !620, line: 106, baseType: !740, size: 64, offset: 3840)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !626, file: !620, line: 107, baseType: !913, size: 64, offset: 3904)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{!389, !617, !395}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !626, file: !620, line: 108, baseType: !917, size: 64, offset: 3968)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{!389, !617, !920, !692, !693}
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !38, line: 25, baseType: !408)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !626, file: !620, line: 109, baseType: !877, size: 64, offset: 4032)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !626, file: !620, line: 111, baseType: !923, size: 64, offset: 4096)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{!389, !617, !617, !617, !485, !617}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !626, file: !620, line: 112, baseType: !927, size: 64, offset: 4160)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{!389, !617, !617, !617, !617}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !626, file: !620, line: 113, baseType: !931, size: 64, offset: 4224)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{!389, !617, !934, !934}
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !610, line: 30, baseType: !935)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !610, line: 30, flags: DIFlagFwdDecl)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !626, file: !620, line: 114, baseType: !629, size: 64, offset: 4288)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !626, file: !620, line: 115, baseType: !744, size: 64, offset: 4352)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !626, file: !620, line: 117, baseType: !803, size: 64, offset: 4416)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !626, file: !620, line: 118, baseType: !803, size: 64, offset: 4480)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !626, file: !620, line: 119, baseType: !917, size: 64, offset: 4544)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !626, file: !620, line: 120, baseType: !943, size: 64, offset: 4608)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!389, !617, !946, !717}
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !38, line: 1675, baseType: !120)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !626, file: !620, line: 121, baseType: !877, size: 64, offset: 4672)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !626, file: !620, line: 123, baseType: !949, size: 64, offset: 4736)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!389, !617, !431, !372}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !626, file: !620, line: 124, baseType: !953, size: 64, offset: 4800)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!389, !617, !838, !646, !372}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !626, file: !620, line: 125, baseType: !957, size: 64, offset: 4864)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!389, !522, !617}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !626, file: !620, line: 126, baseType: !643, size: 64, offset: 4928)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !626, file: !620, line: 127, baseType: !643, size: 64, offset: 4992)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !626, file: !620, line: 129, baseType: !963, size: 64, offset: 5056)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!389, !617, !793}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !626, file: !620, line: 130, baseType: !967, size: 64, offset: 5120)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!389, !617, !970, !970}
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !62, line: 654, baseType: !971)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !62, line: 653, size: 128, elements: !973)
!973 = !{!974, !975}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !972, file: !62, line: 653, baseType: !431, size: 32)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !972, file: !62, line: 653, baseType: !646, size: 64, offset: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !626, file: !620, line: 131, baseType: !967, size: 64, offset: 5184)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !626, file: !620, line: 132, baseType: !978, size: 64, offset: 5248)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!389, !617, !476, !476, !476}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !626, file: !620, line: 133, baseType: !913, size: 64, offset: 5312)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !626, file: !620, line: 135, baseType: !983, size: 64, offset: 5376)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!389, !617, !485, !717}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !626, file: !620, line: 136, baseType: !983, size: 64, offset: 5440)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !626, file: !620, line: 137, baseType: !988, size: 64, offset: 5504)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!389, !617, !717}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !626, file: !620, line: 138, baseType: !629, size: 64, offset: 5568)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !626, file: !620, line: 139, baseType: !993, size: 64, offset: 5632)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!389, !617, !996, !996}
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !626, file: !620, line: 141, baseType: !877, size: 64, offset: 5696)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !626, file: !620, line: 142, baseType: !999, size: 64, offset: 5760)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!389, !617, !617, !485, !617}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !626, file: !620, line: 143, baseType: !1003, size: 64, offset: 5824)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!389, !617, !617, !617}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !626, file: !620, line: 144, baseType: !877, size: 64, offset: 5888)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !626, file: !620, line: 145, baseType: !999, size: 64, offset: 5952)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !626, file: !620, line: 147, baseType: !1003, size: 64, offset: 6016)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !626, file: !620, line: 148, baseType: !877, size: 64, offset: 6080)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !626, file: !620, line: 149, baseType: !999, size: 64, offset: 6144)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !626, file: !620, line: 150, baseType: !1003, size: 64, offset: 6208)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !626, file: !620, line: 151, baseType: !1013, size: 64, offset: 6272)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!389, !617, !546}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !626, file: !620, line: 153, baseType: !740, size: 64, offset: 6336)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !626, file: !620, line: 154, baseType: !740, size: 64, offset: 6400)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !626, file: !620, line: 155, baseType: !740, size: 64, offset: 6464)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !626, file: !620, line: 156, baseType: !740, size: 64, offset: 6528)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !626, file: !620, line: 157, baseType: !913, size: 64, offset: 6592)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !626, file: !620, line: 159, baseType: !1022, size: 64, offset: 6656)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!389, !617, !431, !634}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !626, file: !620, line: 160, baseType: !740, size: 64, offset: 6720)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !626, file: !620, line: 161, baseType: !740, size: 64, offset: 6784)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !626, file: !620, line: 162, baseType: !740, size: 64, offset: 6848)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !626, file: !620, line: 163, baseType: !740, size: 64, offset: 6912)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !626, file: !620, line: 165, baseType: !1003, size: 64, offset: 6976)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !626, file: !620, line: 166, baseType: !1003, size: 64, offset: 7040)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !626, file: !620, line: 167, baseType: !803, size: 64, offset: 7104)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !626, file: !620, line: 168, baseType: !1033, size: 64, offset: 7168)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!389, !617, !646, !431}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !626, file: !620, line: 169, baseType: !1037, size: 64, offset: 7232)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!389, !617, !717, !476}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !626, file: !620, line: 171, baseType: !764, size: 64, offset: 7296)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !626, file: !620, line: 172, baseType: !740, size: 64, offset: 7360)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !626, file: !620, line: 173, baseType: !1043, size: 64, offset: 7424)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!389, !617, !476, !827}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !626, file: !620, line: 174, baseType: !903, size: 64, offset: 7488)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !626, file: !620, line: 175, baseType: !903, size: 64, offset: 7552)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !626, file: !620, line: 177, baseType: !643, size: 64, offset: 7616)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !626, file: !620, line: 178, baseType: !689, size: 64, offset: 7680)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !626, file: !620, line: 179, baseType: !643, size: 64, offset: 7744)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !626, file: !620, line: 180, baseType: !650, size: 64, offset: 7808)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !626, file: !620, line: 181, baseType: !1053, size: 64, offset: 7872)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!389, !617, !368, !692, !693}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !626, file: !620, line: 183, baseType: !963, size: 64, offset: 7936)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !626, file: !620, line: 184, baseType: !724, size: 64, offset: 8000)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !626, file: !620, line: 185, baseType: !1059, size: 64, offset: 8064)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!389, !617, !1062}
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !626, file: !620, line: 186, baseType: !1064, size: 64, offset: 8128)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!389, !617, !431, !632, !493}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !626, file: !620, line: 187, baseType: !783, size: 64, offset: 8192)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !626, file: !620, line: 189, baseType: !1069, size: 64, offset: 8256)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!389, !617, !431, !431, !476, !634}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !626, file: !620, line: 190, baseType: !877, size: 64, offset: 8320)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !626, file: !620, line: 191, baseType: !999, size: 64, offset: 8384)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !626, file: !620, line: 192, baseType: !1003, size: 64, offset: 8448)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !626, file: !620, line: 193, baseType: !1076, size: 64, offset: 8512)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!389, !617, !835, !1079}
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !38, line: 1401, baseType: !1080)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !620, line: 660, size: 5312, elements: !1082)
!1082 = !{!1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1081, file: !620, line: 661, baseType: !623, size: 4480)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1081, file: !620, line: 661, baseType: !844, size: 32, offset: 4480)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1081, file: !620, line: 662, baseType: !431, size: 32, offset: 4512)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1081, file: !620, line: 662, baseType: !431, size: 32, offset: 4544)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1081, file: !620, line: 662, baseType: !431, size: 32, offset: 4576)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1081, file: !620, line: 663, baseType: !431, size: 32, offset: 4608)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1081, file: !620, line: 664, baseType: !431, size: 32, offset: 4640)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1081, file: !620, line: 665, baseType: !476, size: 64, offset: 4672)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1081, file: !620, line: 666, baseType: !476, size: 64, offset: 4736)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1081, file: !620, line: 667, baseType: !431, size: 32, offset: 4800)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1081, file: !620, line: 668, baseType: !885, size: 32, offset: 4832)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1081, file: !620, line: 670, baseType: !476, size: 64, offset: 4864)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1081, file: !620, line: 670, baseType: !476, size: 64, offset: 4928)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1081, file: !620, line: 671, baseType: !476, size: 64, offset: 4992)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1081, file: !620, line: 672, baseType: !476, size: 64, offset: 5056)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1081, file: !620, line: 673, baseType: !476, size: 64, offset: 5120)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1081, file: !620, line: 674, baseType: !431, size: 32, offset: 5184)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1081, file: !620, line: 675, baseType: !476, size: 64, offset: 5248)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !626, file: !620, line: 195, baseType: !1102, size: 64, offset: 8576)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!389, !1079, !617, !617}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !626, file: !620, line: 196, baseType: !1102, size: 64, offset: 8640)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !626, file: !620, line: 197, baseType: !877, size: 64, offset: 8704)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !626, file: !620, line: 198, baseType: !999, size: 64, offset: 8768)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !626, file: !620, line: 199, baseType: !1003, size: 64, offset: 8832)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !626, file: !620, line: 201, baseType: !1110, size: 64, offset: 8896)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!389, !617, !431, !431}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !626, file: !620, line: 202, baseType: !778, size: 64, offset: 8960)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !626, file: !620, line: 203, baseType: !650, size: 64, offset: 9024)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !626, file: !620, line: 204, baseType: !832, size: 64, offset: 9088)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !626, file: !620, line: 205, baseType: !963, size: 64, offset: 9152)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !626, file: !620, line: 206, baseType: !1118, size: 64, offset: 9216)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!389, !368, !617, !431, !692, !693}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !626, file: !620, line: 208, baseType: !1122, size: 64, offset: 9280)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!389, !431, !788}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !626, file: !620, line: 209, baseType: !1003, size: 64, offset: 9344)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !626, file: !620, line: 210, baseType: !795, size: 64, offset: 9408)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !619, file: !620, line: 438, baseType: !1128, size: 64, offset: 13952)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !610, line: 60, baseType: !1129)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !116, line: 240, size: 640, elements: !1131)
!1131 = !{!1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1130, file: !116, line: 241, baseType: !368, size: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1130, file: !116, line: 242, baseType: !448, size: 32, offset: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1130, file: !116, line: 243, baseType: !431, size: 32, offset: 96)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1130, file: !116, line: 243, baseType: !431, size: 32, offset: 128)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1130, file: !116, line: 244, baseType: !431, size: 32, offset: 160)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1130, file: !116, line: 244, baseType: !431, size: 32, offset: 192)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1130, file: !116, line: 245, baseType: !476, size: 64, offset: 256)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1130, file: !116, line: 246, baseType: !546, size: 32, offset: 320)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1130, file: !116, line: 247, baseType: !431, size: 32, offset: 352)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1130, file: !116, line: 251, baseType: !431, size: 32, offset: 384)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1130, file: !116, line: 252, baseType: !934, size: 64, offset: 448)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1130, file: !116, line: 253, baseType: !546, size: 32, offset: 512)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1130, file: !116, line: 254, baseType: !431, size: 32, offset: 544)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1130, file: !116, line: 254, baseType: !431, size: 32, offset: 576)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1130, file: !116, line: 255, baseType: !431, size: 32, offset: 608)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !619, file: !620, line: 438, baseType: !1128, size: 64, offset: 14016)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !619, file: !620, line: 439, baseType: !372, size: 64, offset: 14080)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !619, file: !620, line: 440, baseType: !1150, size: 32, offset: 14144)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !38, line: 161, baseType: !265)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !619, file: !620, line: 441, baseType: !546, size: 32, offset: 14176)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !619, file: !620, line: 442, baseType: !546, size: 32, offset: 14208)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !619, file: !620, line: 443, baseType: !1154, size: 448, offset: 14272)
!1154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1155, size: 448, elements: !1156)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !38, line: 1159, baseType: !408)
!1156 = !{!1157}
!1157 = !DISubrange(count: 7)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !619, file: !620, line: 444, baseType: !546, size: 32, offset: 14720)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !619, file: !620, line: 445, baseType: !546, size: 32, offset: 14752)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !619, file: !620, line: 446, baseType: !431, size: 32, offset: 14784)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !619, file: !620, line: 447, baseType: !469, size: 64, offset: 14848)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !619, file: !620, line: 448, baseType: !469, size: 64, offset: 14912)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !619, file: !620, line: 449, baseType: !700, size: 640, offset: 14976)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !619, file: !620, line: 450, baseType: !636, size: 32, offset: 15616)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !619, file: !620, line: 451, baseType: !1166, size: 2880, offset: 15680)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !620, line: 318, baseType: !1167)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !620, line: 319, size: 2880, elements: !1168)
!1168 = !{!1169, !1170, !1171, !1172, !1173, !1174, !1175, !1188, !1189, !1194, !1199, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1214, !1215, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1247, !1248, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1271, !1272, !1273, !1277, !1278}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1167, file: !620, line: 320, baseType: !431, size: 32)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1167, file: !620, line: 321, baseType: !431, size: 32, offset: 32)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1167, file: !620, line: 322, baseType: !431, size: 32, offset: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1167, file: !620, line: 323, baseType: !431, size: 32, offset: 96)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1167, file: !620, line: 324, baseType: !431, size: 32, offset: 128)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1167, file: !620, line: 325, baseType: !431, size: 32, offset: 160)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1167, file: !620, line: 326, baseType: !1176, size: 64, offset: 192)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !620, line: 293, baseType: !1177)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !620, line: 295, size: 448, elements: !1179)
!1179 = !{!1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1178, file: !620, line: 296, baseType: !1176, size: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1178, file: !620, line: 297, baseType: !493, size: 64, offset: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1178, file: !620, line: 297, baseType: !493, size: 64, offset: 128)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1178, file: !620, line: 298, baseType: !476, size: 64, offset: 192)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1178, file: !620, line: 298, baseType: !476, size: 64, offset: 256)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1178, file: !620, line: 299, baseType: !431, size: 32, offset: 320)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1178, file: !620, line: 300, baseType: !431, size: 32, offset: 352)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1178, file: !620, line: 301, baseType: !431, size: 32, offset: 384)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1167, file: !620, line: 326, baseType: !1176, size: 64, offset: 256)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1167, file: !620, line: 328, baseType: !1190, size: 64, offset: 320)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1191 = !DISubroutineType(types: !1192)
!1192 = !{!389, !617, !1193, !476}
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1167, file: !620, line: 329, baseType: !1195, size: 64, offset: 384)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1196 = !DISubroutineType(types: !1197)
!1197 = !{!389, !1193, !1198, !478, !478, !496, !476}
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1167, file: !620, line: 330, baseType: !1200, size: 64, offset: 448)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DISubroutineType(types: !1202)
!1202 = !{!389, !1193}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1167, file: !620, line: 331, baseType: !1200, size: 64, offset: 512)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1167, file: !620, line: 334, baseType: !368, size: 64, offset: 576)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1167, file: !620, line: 335, baseType: !448, size: 32, offset: 640)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1167, file: !620, line: 335, baseType: !448, size: 32, offset: 672)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1167, file: !620, line: 336, baseType: !448, size: 32, offset: 704)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1167, file: !620, line: 336, baseType: !448, size: 32, offset: 736)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1167, file: !620, line: 337, baseType: !1210, size: 64, offset: 768)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !369, line: 339, baseType: !1212)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1213 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !369, line: 339, flags: DIFlagFwdDecl)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1167, file: !620, line: 338, baseType: !1210, size: 64, offset: 832)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1167, file: !620, line: 339, baseType: !1216, size: 64, offset: 896)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !369, line: 341, baseType: !1218)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !369, line: 351, size: 192, elements: !1219)
!1219 = !{!1220, !1221, !1222, !1223, !1224}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1218, file: !369, line: 354, baseType: !74, size: 32)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1218, file: !369, line: 355, baseType: !74, size: 32, offset: 32)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1218, file: !369, line: 356, baseType: !74, size: 32, offset: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1218, file: !369, line: 361, baseType: !74, size: 32, offset: 96)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1218, file: !369, line: 362, baseType: !542, size: 64, offset: 128)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1167, file: !620, line: 340, baseType: !431, size: 32, offset: 960)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1167, file: !620, line: 340, baseType: !431, size: 32, offset: 992)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1167, file: !620, line: 341, baseType: !493, size: 64, offset: 1024)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1167, file: !620, line: 342, baseType: !476, size: 64, offset: 1088)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1167, file: !620, line: 343, baseType: !496, size: 64, offset: 1152)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1167, file: !620, line: 344, baseType: !478, size: 64, offset: 1216)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1167, file: !620, line: 345, baseType: !431, size: 32, offset: 1280)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1167, file: !620, line: 346, baseType: !1198, size: 64, offset: 1344)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1167, file: !620, line: 347, baseType: !546, size: 32, offset: 1408)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1167, file: !620, line: 348, baseType: !431, size: 32, offset: 1440)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1167, file: !620, line: 351, baseType: !546, size: 32, offset: 1472)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1167, file: !620, line: 352, baseType: !546, size: 32, offset: 1504)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1167, file: !620, line: 353, baseType: !448, size: 32, offset: 1536)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1167, file: !620, line: 354, baseType: !448, size: 32, offset: 1568)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1167, file: !620, line: 355, baseType: !1198, size: 64, offset: 1600)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1167, file: !620, line: 356, baseType: !1198, size: 64, offset: 1664)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1167, file: !620, line: 357, baseType: !1242, size: 64, offset: 1728)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !620, line: 310, baseType: !1244)
!1244 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !620, line: 308, size: 32, elements: !1245)
!1245 = !{!1246}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1244, file: !620, line: 309, baseType: !431, size: 32)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1167, file: !620, line: 357, baseType: !1242, size: 64, offset: 1792)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1167, file: !620, line: 358, baseType: !1249, size: 64, offset: 1856)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !620, line: 316, baseType: !1251)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !620, line: 312, size: 128, elements: !1252)
!1252 = !{!1253, !1254, !1255}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1251, file: !620, line: 313, baseType: !372, size: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1251, file: !620, line: 314, baseType: !431, size: 32, offset: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1251, file: !620, line: 315, baseType: !410, size: 8, offset: 96)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1167, file: !620, line: 359, baseType: !1249, size: 64, offset: 1920)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1167, file: !620, line: 360, baseType: !1249, size: 64, offset: 1984)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1167, file: !620, line: 361, baseType: !431, size: 32, offset: 2048)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1167, file: !620, line: 362, baseType: !448, size: 32, offset: 2080)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1167, file: !620, line: 363, baseType: !431, size: 32, offset: 2112)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1167, file: !620, line: 364, baseType: !1198, size: 64, offset: 2176)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1167, file: !620, line: 365, baseType: !1216, size: 64, offset: 2240)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1167, file: !620, line: 366, baseType: !448, size: 32, offset: 2304)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1167, file: !620, line: 367, baseType: !448, size: 32, offset: 2336)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1167, file: !620, line: 368, baseType: !1210, size: 64, offset: 2368)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1167, file: !620, line: 369, baseType: !1210, size: 64, offset: 2432)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1167, file: !620, line: 370, baseType: !1268, size: 64, offset: 2496)
!1268 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !6, line: 678, baseType: !1269)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !6, line: 678, flags: DIFlagFwdDecl)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1167, file: !620, line: 371, baseType: !1268, size: 64, offset: 2560)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1167, file: !620, line: 372, baseType: !1268, size: 64, offset: 2624)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1167, file: !620, line: 373, baseType: !1274, size: 64, offset: 2688)
!1274 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !369, line: 331, baseType: !1275)
