; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/color/impls/jp/jp.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/color/impls/jp/jp.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!252 = !DIEnumerator(name: "MATOP_RART", value: 136, isUnsigned: true)
!253 = !DIEnumerator(name: "MATOP_RART_SYMBOLIC", value: 137, isUnsigned: true)
!254 = !DIEnumerator(name: "MATOP_RART_NUMERIC", value: 138, isUnsigned: true)
!255 = !DIEnumerator(name: "MATOP_SET_BLOCK_SIZES", value: 139, isUnsigned: true)
!256 = !DIEnumerator(name: "MATOP_AYPX", value: 140, isUnsigned: true)
!257 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!258 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!259 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!260 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!261 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!262 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 161, baseType: !5, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272}
!265 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1345, baseType: !5, size: 32, elements: !295)
!295 = !{!296, !297, !298, !299}
!296 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_RANDOM", value: 0, isUnsigned: true)
!297 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_LEXICAL", value: 1, isUnsigned: true)
!298 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_LF", value: 2, isUnsigned: true)
!299 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_SL", value: 3, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !301, line: 663, baseType: !5, size: 32, elements: !302)
!301 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!302 = !{!303, !304, !305}
!303 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!304 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!305 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!306 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !307)
!307 = !{!308, !309, !310}
!308 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!309 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!310 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!311 = !{!312, !315, !333, !414, !354, !520, !404, !72, !394, !536, !539, !542, !544, !1350, !5}
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !313, line: 46, baseType: !314)
!313 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!314 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !318, line: 73, size: 4480, elements: !319)
!318 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!319 = !{!320, !322, !375, !376, !378, !381, !382, !383, !384, !392, !393, !395, !399, !403, !405, !406, !407, !408, !409, !410, !411, !412, !413, !415, !417, !418, !419, !421, !422, !424, !426, !427, !428, !429, !430, !433, !435, !436, !437, !438, !439, !442, !444, !445, !446, !456, !458, !459, !463, !464, !510, !515, !517, !518, !519}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !317, file: !318, line: 74, baseType: !321, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !317, file: !318, line: 75, baseType: !323, size: 448, offset: 64)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 448, elements: !373)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !318, line: 53, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !318, line: 45, size: 448, elements: !326)
!326 = !{!327, !337, !345, !350, !357, !361, !368}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !325, file: !318, line: 46, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!331, !315, !332}
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !334, line: 330, baseType: !335)
!334 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !334, line: 330, flags: DIFlagFwdDecl)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !325, file: !318, line: 47, baseType: !338, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!331, !315, !341}
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !342, line: 16, baseType: !343)
!342 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !342, line: 16, flags: DIFlagFwdDecl)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !325, file: !318, line: 48, baseType: !346, size: 64, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!331, !349}
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !325, file: !318, line: 49, baseType: !351, size: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!331, !315, !354, !315}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !356)
!356 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !325, file: !318, line: 50, baseType: !358, size: 64, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!331, !315, !354, !349}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !325, file: !318, line: 51, baseType: !362, size: 64, offset: 320)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!331, !315, !354, !365}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{null}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !325, file: !318, line: 52, baseType: !369, size: 64, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!331, !315, !354, !372}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!373 = !{!374}
!374 = !DISubrange(count: 1)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !317, file: !318, line: 76, baseType: !333, size: 64, offset: 512)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !317, file: !318, line: 77, baseType: !377, size: 32, offset: 576)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !317, file: !318, line: 78, baseType: !379, size: 64, offset: 640)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !380)
!380 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !317, file: !318, line: 78, baseType: !379, size: 64, offset: 704)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !317, file: !318, line: 78, baseType: !379, size: 64, offset: 768)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !317, file: !318, line: 78, baseType: !379, size: 64, offset: 832)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !317, file: !318, line: 79, baseType: !385, size: 64, offset: 896)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !388, line: 27, baseType: !389)
!388 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !390, line: 43, baseType: !391)
!390 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!391 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !317, file: !318, line: 80, baseType: !377, size: 32, offset: 960)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !317, file: !318, line: 81, baseType: !394, size: 32, offset: 992)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !317, file: !318, line: 82, baseType: !396, size: 64, offset: 1024)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !317, file: !318, line: 83, baseType: !400, size: 64, offset: 1088)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !401)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !317, file: !318, line: 84, baseType: !404, size: 64, offset: 1152)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !317, file: !318, line: 85, baseType: !404, size: 64, offset: 1216)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !317, file: !318, line: 86, baseType: !404, size: 64, offset: 1280)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !317, file: !318, line: 87, baseType: !404, size: 64, offset: 1344)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !317, file: !318, line: 88, baseType: !315, size: 64, offset: 1408)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !317, file: !318, line: 89, baseType: !385, size: 64, offset: 1472)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !317, file: !318, line: 90, baseType: !404, size: 64, offset: 1536)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !317, file: !318, line: 91, baseType: !404, size: 64, offset: 1600)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !317, file: !318, line: 92, baseType: !377, size: 32, offset: 1664)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !317, file: !318, line: 93, baseType: !414, size: 64, offset: 1728)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !317, file: !318, line: 94, baseType: !416, size: 64, offset: 1792)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !386)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !317, file: !318, line: 95, baseType: !377, size: 32, offset: 1856)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !317, file: !318, line: 95, baseType: !377, size: 32, offset: 1888)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !317, file: !318, line: 96, baseType: !420, size: 64, offset: 1920)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !317, file: !318, line: 96, baseType: !420, size: 64, offset: 1984)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !317, file: !318, line: 97, baseType: !423, size: 64, offset: 2048)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !317, file: !318, line: 97, baseType: !425, size: 64, offset: 2112)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !317, file: !318, line: 98, baseType: !377, size: 32, offset: 2176)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !317, file: !318, line: 98, baseType: !377, size: 32, offset: 2208)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !317, file: !318, line: 99, baseType: !420, size: 64, offset: 2240)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !317, file: !318, line: 99, baseType: !420, size: 64, offset: 2304)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !317, file: !318, line: 100, baseType: !431, size: 64, offset: 2368)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !380)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !317, file: !318, line: 100, baseType: !434, size: 64, offset: 2432)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !317, file: !318, line: 101, baseType: !377, size: 32, offset: 2496)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !317, file: !318, line: 101, baseType: !377, size: 32, offset: 2528)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !317, file: !318, line: 102, baseType: !420, size: 64, offset: 2560)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !317, file: !318, line: 102, baseType: !420, size: 64, offset: 2624)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !317, file: !318, line: 103, baseType: !440, size: 64, offset: 2688)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !432)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !317, file: !318, line: 103, baseType: !443, size: 64, offset: 2752)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !317, file: !318, line: 104, baseType: !372, size: 64, offset: 2816)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !317, file: !318, line: 105, baseType: !377, size: 32, offset: 2880)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !317, file: !318, line: 106, baseType: !447, size: 128, offset: 2944)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 128, elements: !454)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !318, line: 64, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !318, line: 61, size: 128, elements: !451)
!451 = !{!452, !453}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !450, file: !318, line: 62, baseType: !365, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !450, file: !318, line: 63, baseType: !414, size: 64, offset: 64)
!454 = !{!455}
!455 = !DISubrange(count: 2)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !317, file: !318, line: 107, baseType: !457, size: 64, offset: 3072)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 64, elements: !454)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !317, file: !318, line: 108, baseType: !414, size: 64, offset: 3136)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !317, file: !318, line: 109, baseType: !460, size: 64, offset: 3200)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!331, !414}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !317, file: !318, line: 111, baseType: !377, size: 32, offset: 3264)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !317, file: !318, line: 112, baseType: !465, size: 320, offset: 3328)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 320, elements: !508)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!331, !469, !315, !414}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !472)
!472 = !{!473, !474, !496, !497, !498, !499, !500, !501, !502, !503, !504}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !471, file: !10, line: 100, baseType: !377, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !471, file: !10, line: 101, baseType: !475, size: 64, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !476)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !478)
!478 = !{!479, !480, !481, !482, !483, !486, !487, !488, !489, !491, !493, !494, !495}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !477, file: !10, line: 84, baseType: !404, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !477, file: !10, line: 85, baseType: !404, size: 64, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !477, file: !10, line: 86, baseType: !414, size: 64, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !477, file: !10, line: 87, baseType: !396, size: 64, offset: 192)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !477, file: !10, line: 88, baseType: !484, size: 64, offset: 256)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !354)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !477, file: !10, line: 89, baseType: !356, size: 8, offset: 320)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !477, file: !10, line: 90, baseType: !404, size: 64, offset: 384)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !477, file: !10, line: 91, baseType: !312, size: 64, offset: 448)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !477, file: !10, line: 92, baseType: !490, size: 32, offset: 512)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !477, file: !10, line: 93, baseType: !492, size: 32, offset: 544)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !477, file: !10, line: 94, baseType: !475, size: 64, offset: 576)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !477, file: !10, line: 95, baseType: !404, size: 64, offset: 640)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !477, file: !10, line: 96, baseType: !414, size: 64, offset: 704)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !471, file: !10, line: 102, baseType: !404, size: 64, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !471, file: !10, line: 102, baseType: !404, size: 64, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !471, file: !10, line: 103, baseType: !404, size: 64, offset: 256)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !471, file: !10, line: 104, baseType: !333, size: 64, offset: 320)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !471, file: !10, line: 105, baseType: !490, size: 32, offset: 384)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !471, file: !10, line: 105, baseType: !490, size: 32, offset: 416)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !471, file: !10, line: 105, baseType: !490, size: 32, offset: 448)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !471, file: !10, line: 106, baseType: !315, size: 64, offset: 512)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !471, file: !10, line: 107, baseType: !505, size: 64, offset: 576)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!508 = !{!509}
!509 = !DISubrange(count: 5)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !317, file: !318, line: 113, baseType: !511, size: 320, offset: 3648)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 320, elements: !508)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!331, !315, !414}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !317, file: !318, line: 114, baseType: !516, size: 320, offset: 3968)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 320, elements: !508)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !317, file: !318, line: 115, baseType: !490, size: 32, offset: 4288)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !317, file: !318, line: 120, baseType: !505, size: 64, offset: 4352)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !317, file: !318, line: 121, baseType: !490, size: 32, offset: 4416)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "MC_JP", file: !522, line: 10, baseType: !523)
!522 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/color/impls/jp/jp.c", directory: "/home/users/ndemeye/xSDK")
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !522, line: 5, size: 448, elements: !524)
!524 = !{!525, !530, !531, !532, !533, !534, !535}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !523, file: !522, line: 6, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !527, line: 15, baseType: !528)
!527 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !527, line: 15, flags: DIFlagFwdDecl)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "dwts", scope: !523, file: !522, line: 7, baseType: !431, size: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "owts", scope: !523, file: !522, line: 7, baseType: !431, size: 64, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "dmask", scope: !523, file: !522, line: 8, baseType: !423, size: 64, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "omask", scope: !523, file: !522, line: 8, baseType: !423, size: 64, offset: 256)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "cmask", scope: !523, file: !522, line: 8, baseType: !423, size: 64, offset: 320)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !523, file: !522, line: 9, baseType: !490, size: 32, offset: 384)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !334, line: 331, baseType: !537)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !334, line: 331, flags: DIFlagFwdDecl)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !334, line: 338, baseType: !540)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !334, line: 338, flags: DIFlagFwdDecl)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !543)
!543 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_MPIAIJ", file: !546, line: 70, baseType: !547)
!546 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/aij/mpi/mpiaij.h", directory: "/home/users/ndemeye/xSDK")
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !546, line: 34, size: 1344, elements: !548)
!548 = !{!549, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1339, !1340, !1341, !1342, !1344, !1345, !1346, !1347, !1348, !1349}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !547, file: !546, line: 35, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !551)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !553, line: 436, size: 23424, elements: !554)
!553 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!554 = !{!555, !557, !1062, !1082, !1083, !1084, !1086, !1087, !1088, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1212, !1213, !1229, !1230, !1231, !1232, !1233, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1268, !1288, !1289, !1291, !1292, !1293, !1294, !1295, !1296, !1314, !1315}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !552, file: !553, line: 437, baseType: !556, size: 4480)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !318, line: 122, baseType: !317)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !552, file: !553, line: 437, baseType: !558, size: 9472, offset: 4480)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 9472, elements: !373)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !553, line: 32, size: 9472, elements: !560)
!560 = !{!561, !570, !574, !575, !582, !586, !587, !588, !589, !590, !591, !592, !616, !620, !625, !631, !650, !655, !659, !660, !665, !670, !671, !676, !680, !684, !688, !692, !696, !697, !698, !699, !700, !704, !705, !710, !711, !712, !713, !714, !719, !726, !731, !735, !739, !743, !747, !748, !752, !753, !760, !765, !766, !767, !768, !830, !836, !837, !841, !842, !846, !847, !851, !856, !857, !861, !865, !872, !873, !874, !875, !876, !877, !882, !883, !887, !891, !895, !896, !897, !901, !911, !912, !916, !917, !921, !922, !926, !927, !932, !933, !937, !941, !942, !943, !944, !945, !946, !947, !951, !952, !953, !954, !955, !956, !960, !961, !962, !963, !964, !965, !966, !967, !971, !975, !976, !977, !981, !982, !983, !984, !985, !986, !987, !991, !992, !993, !998, !1002, !1003, !1007, !1008, !1009, !1010, !1036, !1040, !1041, !1042, !1043, !1044, !1048, !1049, !1050, !1051, !1052, !1056, !1060, !1061}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !559, file: !553, line: 34, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!331, !550, !377, !565, !377, !565, !567, !569}
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !377)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !441)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !559, file: !553, line: 35, baseType: !571, size: 64, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{!331, !550, !377, !423, !425, !443}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !559, file: !553, line: 36, baseType: !571, size: 64, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !559, file: !553, line: 37, baseType: !576, size: 64, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!331, !550, !579, !579}
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !580)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !559, file: !553, line: 38, baseType: !583, size: 64, offset: 256)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!331, !550, !579, !579, !579}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !559, file: !553, line: 40, baseType: !576, size: 64, offset: 320)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !559, file: !553, line: 41, baseType: !583, size: 64, offset: 384)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !559, file: !553, line: 42, baseType: !576, size: 64, offset: 448)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !559, file: !553, line: 43, baseType: !583, size: 64, offset: 512)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !559, file: !553, line: 44, baseType: !576, size: 64, offset: 576)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !559, file: !553, line: 46, baseType: !583, size: 64, offset: 640)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !559, file: !553, line: 47, baseType: !593, size: 64, offset: 704)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{!331, !550, !596, !596, !600}
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !597, line: 11, baseType: !598)
!597 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !597, line: 11, flags: DIFlagFwdDecl)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !604)
!604 = !{!605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !603, file: !36, line: 1227, baseType: !432, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !603, file: !36, line: 1228, baseType: !432, size: 64, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !603, file: !36, line: 1229, baseType: !432, size: 64, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !603, file: !36, line: 1230, baseType: !432, size: 64, offset: 192)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !603, file: !36, line: 1231, baseType: !432, size: 64, offset: 256)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !603, file: !36, line: 1232, baseType: !432, size: 64, offset: 320)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !603, file: !36, line: 1233, baseType: !432, size: 64, offset: 384)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !603, file: !36, line: 1234, baseType: !432, size: 64, offset: 448)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !603, file: !36, line: 1236, baseType: !432, size: 64, offset: 512)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !603, file: !36, line: 1237, baseType: !432, size: 64, offset: 576)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !603, file: !36, line: 1238, baseType: !432, size: 64, offset: 640)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !559, file: !553, line: 48, baseType: !617, size: 64, offset: 768)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{!331, !550, !596, !600}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !559, file: !553, line: 49, baseType: !621, size: 64, offset: 832)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!331, !550, !579, !432, !624, !432, !377, !377, !579}
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !559, file: !553, line: 50, baseType: !626, size: 64, offset: 896)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!331, !550, !629, !630}
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !559, file: !553, line: 52, baseType: !632, size: 64, offset: 960)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DISubroutineType(types: !634)
!634 = !{!331, !550, !635, !636}
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !638)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !639)
!639 = !{!640, !641, !642, !643, !644, !645, !646, !647, !648, !649}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !638, file: !36, line: 593, baseType: !379, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !638, file: !36, line: 594, baseType: !379, size: 64, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !638, file: !36, line: 594, baseType: !379, size: 64, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !638, file: !36, line: 594, baseType: !379, size: 64, offset: 192)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !638, file: !36, line: 595, baseType: !379, size: 64, offset: 256)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !638, file: !36, line: 596, baseType: !379, size: 64, offset: 320)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !638, file: !36, line: 597, baseType: !379, size: 64, offset: 384)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !638, file: !36, line: 598, baseType: !379, size: 64, offset: 448)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !638, file: !36, line: 598, baseType: !379, size: 64, offset: 512)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !638, file: !36, line: 599, baseType: !379, size: 64, offset: 576)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !559, file: !553, line: 53, baseType: !651, size: 64, offset: 1024)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!331, !550, !550, !654}
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !559, file: !553, line: 54, baseType: !656, size: 64, offset: 1088)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!331, !550, !579}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !559, file: !553, line: 55, baseType: !576, size: 64, offset: 1152)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !559, file: !553, line: 56, baseType: !661, size: 64, offset: 1216)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!331, !550, !664, !431}
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !559, file: !553, line: 58, baseType: !666, size: 64, offset: 1280)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!331, !550, !669}
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !559, file: !553, line: 59, baseType: !666, size: 64, offset: 1344)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !559, file: !553, line: 60, baseType: !672, size: 64, offset: 1408)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!331, !550, !675, !490}
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !559, file: !553, line: 61, baseType: !677, size: 64, offset: 1472)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!331, !550}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !559, file: !553, line: 63, baseType: !681, size: 64, offset: 1536)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!331, !550, !377, !565, !441, !579, !579}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !559, file: !553, line: 64, baseType: !685, size: 64, offset: 1600)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DISubroutineType(types: !687)
!687 = !{!331, !550, !550, !596, !596, !600}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !559, file: !553, line: 65, baseType: !689, size: 64, offset: 1664)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!331, !550, !550, !600}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !559, file: !553, line: 66, baseType: !693, size: 64, offset: 1728)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{!331, !550, !550, !596, !600}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !559, file: !553, line: 67, baseType: !689, size: 64, offset: 1792)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !559, file: !553, line: 69, baseType: !677, size: 64, offset: 1856)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !559, file: !553, line: 70, baseType: !685, size: 64, offset: 1920)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !559, file: !553, line: 71, baseType: !693, size: 64, offset: 1984)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !559, file: !553, line: 72, baseType: !701, size: 64, offset: 2048)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!331, !550, !630}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !559, file: !553, line: 73, baseType: !677, size: 64, offset: 2112)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !559, file: !553, line: 75, baseType: !706, size: 64, offset: 2176)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!331, !550, !709, !630}
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !559, file: !553, line: 76, baseType: !576, size: 64, offset: 2240)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !559, file: !553, line: 77, baseType: !576, size: 64, offset: 2304)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !559, file: !553, line: 78, baseType: !593, size: 64, offset: 2368)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !559, file: !553, line: 79, baseType: !617, size: 64, offset: 2432)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !559, file: !553, line: 81, baseType: !715, size: 64, offset: 2496)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!331, !550, !441, !550, !718}
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !559, file: !553, line: 82, baseType: !720, size: 64, offset: 2560)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!331, !550, !377, !723, !723, !629, !725}
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !596)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !559, file: !553, line: 83, baseType: !727, size: 64, offset: 2624)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{!331, !550, !377, !730, !377}
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !559, file: !553, line: 84, baseType: !732, size: 64, offset: 2688)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!331, !550, !377, !565, !377, !565, !440}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !559, file: !553, line: 85, baseType: !736, size: 64, offset: 2752)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!331, !550, !550, !718}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !559, file: !553, line: 87, baseType: !740, size: 64, offset: 2816)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{!331, !550, !579, !423}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !559, file: !553, line: 88, baseType: !744, size: 64, offset: 2880)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!331, !550, !441}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !559, file: !553, line: 89, baseType: !744, size: 64, offset: 2944)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !559, file: !553, line: 90, baseType: !749, size: 64, offset: 3008)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!331, !550, !579, !569}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !559, file: !553, line: 91, baseType: !681, size: 64, offset: 3072)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !559, file: !553, line: 93, baseType: !754, size: 64, offset: 3136)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{!331, !550, !757}
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !758)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !559, file: !553, line: 94, baseType: !761, size: 64, offset: 3200)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!331, !550, !377, !490, !490, !423, !764, !764, !654}
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !559, file: !553, line: 95, baseType: !761, size: 64, offset: 3264)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !559, file: !553, line: 96, baseType: !761, size: 64, offset: 3328)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !559, file: !553, line: 97, baseType: !761, size: 64, offset: 3392)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !559, file: !553, line: 99, baseType: !769, size: 64, offset: 3456)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{!331, !550, !772, !775}
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !597, line: 51, baseType: !773)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !597, line: 51, flags: DIFlagFwdDecl)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !776)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !553, line: 609, size: 6208, elements: !778)
!778 = !{!779, !780, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !799, !806, !807, !808, !809, !810, !811, !812, !813, !817, !818, !819, !820, !821, !823, !824, !825, !826, !827, !828, !829}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !777, file: !553, line: 610, baseType: !556, size: 4480)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !777, file: !553, line: 610, baseType: !781, size: 32, offset: 4480)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !373)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !777, file: !553, line: 611, baseType: !377, size: 32, offset: 4512)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !777, file: !553, line: 611, baseType: !377, size: 32, offset: 4544)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !777, file: !553, line: 611, baseType: !377, size: 32, offset: 4576)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !777, file: !553, line: 612, baseType: !377, size: 32, offset: 4608)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !777, file: !553, line: 613, baseType: !377, size: 32, offset: 4640)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !777, file: !553, line: 614, baseType: !423, size: 64, offset: 4672)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !777, file: !553, line: 615, baseType: !425, size: 64, offset: 4736)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !777, file: !553, line: 616, baseType: !730, size: 64, offset: 4800)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !777, file: !553, line: 617, baseType: !423, size: 64, offset: 4864)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !777, file: !553, line: 618, baseType: !792, size: 64, offset: 4928)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !553, line: 602, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !553, line: 598, size: 128, elements: !795)
!795 = !{!796, !797, !798}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !794, file: !553, line: 599, baseType: !377, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !794, file: !553, line: 600, baseType: !377, size: 32, offset: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !794, file: !553, line: 601, baseType: !440, size: 64, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !777, file: !553, line: 619, baseType: !800, size: 64, offset: 4992)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !553, line: 607, baseType: !802)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !553, line: 604, size: 128, elements: !803)
!803 = !{!804, !805}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !802, file: !553, line: 605, baseType: !377, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !802, file: !553, line: 606, baseType: !440, size: 64, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !777, file: !553, line: 620, baseType: !440, size: 64, offset: 5056)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !777, file: !553, line: 621, baseType: !432, size: 64, offset: 5120)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !777, file: !553, line: 622, baseType: !432, size: 64, offset: 5184)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !777, file: !553, line: 623, baseType: !579, size: 64, offset: 5248)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !777, file: !553, line: 623, baseType: !579, size: 64, offset: 5312)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !777, file: !553, line: 623, baseType: !579, size: 64, offset: 5376)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !777, file: !553, line: 624, baseType: !490, size: 32, offset: 5440)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !777, file: !553, line: 625, baseType: !814, size: 64, offset: 5504)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{!331}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !777, file: !553, line: 626, baseType: !414, size: 64, offset: 5568)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !777, file: !553, line: 627, baseType: !579, size: 64, offset: 5632)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !777, file: !553, line: 628, baseType: !377, size: 32, offset: 5696)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !777, file: !553, line: 629, baseType: !354, size: 64, offset: 5760)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !777, file: !553, line: 630, baseType: !822, size: 32, offset: 5824)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !777, file: !553, line: 631, baseType: !377, size: 32, offset: 5856)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !777, file: !553, line: 631, baseType: !377, size: 32, offset: 5888)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !777, file: !553, line: 632, baseType: !490, size: 32, offset: 5920)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !777, file: !553, line: 633, baseType: !490, size: 32, offset: 5952)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !777, file: !553, line: 634, baseType: !365, size: 64, offset: 6016)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !777, file: !553, line: 634, baseType: !414, size: 64, offset: 6080)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !777, file: !553, line: 635, baseType: !385, size: 64, offset: 6144)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !559, file: !553, line: 100, baseType: !831, size: 64, offset: 3520)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{!331, !550, !377, !377, !834, !835}
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !559, file: !553, line: 101, baseType: !677, size: 64, offset: 3584)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !559, file: !553, line: 102, baseType: !838, size: 64, offset: 3648)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!331, !550, !596, !596, !630}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !559, file: !553, line: 103, baseType: !562, size: 64, offset: 3712)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !559, file: !553, line: 105, baseType: !843, size: 64, offset: 3776)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DISubroutineType(types: !845)
!845 = !{!331, !550, !596, !596, !629, !630}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !559, file: !553, line: 106, baseType: !677, size: 64, offset: 3840)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !559, file: !553, line: 107, baseType: !848, size: 64, offset: 3904)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DISubroutineType(types: !850)
!850 = !{!331, !550, !341}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !559, file: !553, line: 108, baseType: !852, size: 64, offset: 3968)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{!331, !550, !855, !629, !630}
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !354)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !559, file: !553, line: 109, baseType: !814, size: 64, offset: 4032)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !559, file: !553, line: 111, baseType: !858, size: 64, offset: 4096)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{!331, !550, !550, !550, !432, !550}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !559, file: !553, line: 112, baseType: !862, size: 64, offset: 4160)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DISubroutineType(types: !864)
!864 = !{!331, !550, !550, !550, !550}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !559, file: !553, line: 113, baseType: !866, size: 64, offset: 4224)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DISubroutineType(types: !868)
!868 = !{!331, !550, !869, !869}
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !597, line: 30, baseType: !870)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !597, line: 30, flags: DIFlagFwdDecl)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !559, file: !553, line: 114, baseType: !562, size: 64, offset: 4288)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !559, file: !553, line: 115, baseType: !681, size: 64, offset: 4352)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !559, file: !553, line: 117, baseType: !740, size: 64, offset: 4416)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !559, file: !553, line: 118, baseType: !740, size: 64, offset: 4480)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !559, file: !553, line: 119, baseType: !852, size: 64, offset: 4544)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !559, file: !553, line: 120, baseType: !878, size: 64, offset: 4608)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DISubroutineType(types: !880)
!880 = !{!331, !550, !881, !654}
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !559, file: !553, line: 121, baseType: !814, size: 64, offset: 4672)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !559, file: !553, line: 123, baseType: !884, size: 64, offset: 4736)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{!331, !550, !377, !414}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !559, file: !553, line: 124, baseType: !888, size: 64, offset: 4800)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DISubroutineType(types: !890)
!890 = !{!331, !550, !775, !579, !414}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !559, file: !553, line: 125, baseType: !892, size: 64, offset: 4864)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DISubroutineType(types: !894)
!894 = !{!331, !469, !550}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !559, file: !553, line: 126, baseType: !576, size: 64, offset: 4928)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !559, file: !553, line: 127, baseType: !576, size: 64, offset: 4992)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !559, file: !553, line: 129, baseType: !898, size: 64, offset: 5056)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{!331, !550, !730}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !559, file: !553, line: 130, baseType: !902, size: 64, offset: 5120)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{!331, !550, !905, !905}
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !906)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !908)
!908 = !{!909, !910}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !907, file: !60, line: 653, baseType: !377, size: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !907, file: !60, line: 653, baseType: !579, size: 64, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !559, file: !553, line: 131, baseType: !902, size: 64, offset: 5184)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !559, file: !553, line: 132, baseType: !913, size: 64, offset: 5248)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{!331, !550, !423, !423, !423}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !559, file: !553, line: 133, baseType: !848, size: 64, offset: 5312)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !559, file: !553, line: 135, baseType: !918, size: 64, offset: 5376)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{!331, !550, !432, !654}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !559, file: !553, line: 136, baseType: !918, size: 64, offset: 5440)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !559, file: !553, line: 137, baseType: !923, size: 64, offset: 5504)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{!331, !550, !654}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !559, file: !553, line: 138, baseType: !562, size: 64, offset: 5568)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !559, file: !553, line: 139, baseType: !928, size: 64, offset: 5632)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!331, !550, !931, !931}
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !559, file: !553, line: 141, baseType: !814, size: 64, offset: 5696)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !559, file: !553, line: 142, baseType: !934, size: 64, offset: 5760)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!331, !550, !550, !432, !550}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !559, file: !553, line: 143, baseType: !938, size: 64, offset: 5824)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!331, !550, !550, !550}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !559, file: !553, line: 144, baseType: !814, size: 64, offset: 5888)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !559, file: !553, line: 145, baseType: !934, size: 64, offset: 5952)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !559, file: !553, line: 147, baseType: !938, size: 64, offset: 6016)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !559, file: !553, line: 148, baseType: !814, size: 64, offset: 6080)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !559, file: !553, line: 149, baseType: !934, size: 64, offset: 6144)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !559, file: !553, line: 150, baseType: !938, size: 64, offset: 6208)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !559, file: !553, line: 151, baseType: !948, size: 64, offset: 6272)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{!331, !550, !490}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !559, file: !553, line: 153, baseType: !677, size: 64, offset: 6336)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !559, file: !553, line: 154, baseType: !677, size: 64, offset: 6400)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !559, file: !553, line: 155, baseType: !677, size: 64, offset: 6464)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !559, file: !553, line: 156, baseType: !677, size: 64, offset: 6528)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !559, file: !553, line: 157, baseType: !848, size: 64, offset: 6592)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !559, file: !553, line: 159, baseType: !957, size: 64, offset: 6656)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!331, !550, !377, !567}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !559, file: !553, line: 160, baseType: !677, size: 64, offset: 6720)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !559, file: !553, line: 161, baseType: !677, size: 64, offset: 6784)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !559, file: !553, line: 162, baseType: !677, size: 64, offset: 6848)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !559, file: !553, line: 163, baseType: !677, size: 64, offset: 6912)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !559, file: !553, line: 165, baseType: !938, size: 64, offset: 6976)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !559, file: !553, line: 166, baseType: !938, size: 64, offset: 7040)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !559, file: !553, line: 167, baseType: !740, size: 64, offset: 7104)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !559, file: !553, line: 168, baseType: !968, size: 64, offset: 7168)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!331, !550, !579, !377}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !559, file: !553, line: 169, baseType: !972, size: 64, offset: 7232)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!331, !550, !654, !423}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !559, file: !553, line: 171, baseType: !701, size: 64, offset: 7296)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !559, file: !553, line: 172, baseType: !677, size: 64, offset: 7360)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !559, file: !553, line: 173, baseType: !978, size: 64, offset: 7424)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!331, !550, !423, !764}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !559, file: !553, line: 174, baseType: !838, size: 64, offset: 7488)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !559, file: !553, line: 175, baseType: !838, size: 64, offset: 7552)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !559, file: !553, line: 177, baseType: !576, size: 64, offset: 7616)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !559, file: !553, line: 178, baseType: !626, size: 64, offset: 7680)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !559, file: !553, line: 179, baseType: !576, size: 64, offset: 7744)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !559, file: !553, line: 180, baseType: !583, size: 64, offset: 7808)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !559, file: !553, line: 181, baseType: !988, size: 64, offset: 7872)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!331, !550, !333, !629, !630}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !559, file: !553, line: 183, baseType: !898, size: 64, offset: 7936)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !559, file: !553, line: 184, baseType: !661, size: 64, offset: 8000)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !559, file: !553, line: 185, baseType: !994, size: 64, offset: 8064)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!331, !550, !997}
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !559, file: !553, line: 186, baseType: !999, size: 64, offset: 8128)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!331, !550, !377, !565, !440}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !559, file: !553, line: 187, baseType: !720, size: 64, offset: 8192)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !559, file: !553, line: 189, baseType: !1004, size: 64, offset: 8256)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!331, !550, !377, !377, !423, !567}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !559, file: !553, line: 190, baseType: !814, size: 64, offset: 8320)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !559, file: !553, line: 191, baseType: !934, size: 64, offset: 8384)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !559, file: !553, line: 192, baseType: !938, size: 64, offset: 8448)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !559, file: !553, line: 193, baseType: !1011, size: 64, offset: 8512)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!331, !550, !772, !1014}
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1015)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !553, line: 660, size: 5312, elements: !1017)
!1017 = !{!1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1016, file: !553, line: 661, baseType: !556, size: 4480)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1016, file: !553, line: 661, baseType: !781, size: 32, offset: 4480)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1016, file: !553, line: 662, baseType: !377, size: 32, offset: 4512)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1016, file: !553, line: 662, baseType: !377, size: 32, offset: 4544)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1016, file: !553, line: 662, baseType: !377, size: 32, offset: 4576)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1016, file: !553, line: 663, baseType: !377, size: 32, offset: 4608)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1016, file: !553, line: 664, baseType: !377, size: 32, offset: 4640)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1016, file: !553, line: 665, baseType: !423, size: 64, offset: 4672)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1016, file: !553, line: 666, baseType: !423, size: 64, offset: 4736)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1016, file: !553, line: 667, baseType: !377, size: 32, offset: 4800)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1016, file: !553, line: 668, baseType: !822, size: 32, offset: 4832)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1016, file: !553, line: 670, baseType: !423, size: 64, offset: 4864)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1016, file: !553, line: 670, baseType: !423, size: 64, offset: 4928)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1016, file: !553, line: 671, baseType: !423, size: 64, offset: 4992)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1016, file: !553, line: 672, baseType: !423, size: 64, offset: 5056)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1016, file: !553, line: 673, baseType: !423, size: 64, offset: 5120)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1016, file: !553, line: 674, baseType: !377, size: 32, offset: 5184)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1016, file: !553, line: 675, baseType: !423, size: 64, offset: 5248)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !559, file: !553, line: 195, baseType: !1037, size: 64, offset: 8576)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!331, !1014, !550, !550}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !559, file: !553, line: 196, baseType: !1037, size: 64, offset: 8640)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !559, file: !553, line: 197, baseType: !814, size: 64, offset: 8704)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !559, file: !553, line: 198, baseType: !934, size: 64, offset: 8768)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !559, file: !553, line: 199, baseType: !938, size: 64, offset: 8832)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !559, file: !553, line: 201, baseType: !1045, size: 64, offset: 8896)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!331, !550, !377, !377}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !559, file: !553, line: 202, baseType: !715, size: 64, offset: 8960)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !559, file: !553, line: 203, baseType: !583, size: 64, offset: 9024)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !559, file: !553, line: 204, baseType: !769, size: 64, offset: 9088)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !559, file: !553, line: 205, baseType: !898, size: 64, offset: 9152)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !559, file: !553, line: 206, baseType: !1053, size: 64, offset: 9216)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!331, !333, !550, !377, !629, !630}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !559, file: !553, line: 208, baseType: !1057, size: 64, offset: 9280)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!331, !377, !725}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !559, file: !553, line: 209, baseType: !938, size: 64, offset: 9344)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !559, file: !553, line: 210, baseType: !732, size: 64, offset: 9408)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !552, file: !553, line: 438, baseType: !1063, size: 64, offset: 13952)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !597, line: 60, baseType: !1064)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1066)
!1066 = !{!1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1065, file: !114, line: 241, baseType: !333, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1065, file: !114, line: 242, baseType: !394, size: 32, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1065, file: !114, line: 243, baseType: !377, size: 32, offset: 96)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1065, file: !114, line: 243, baseType: !377, size: 32, offset: 128)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1065, file: !114, line: 244, baseType: !377, size: 32, offset: 160)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1065, file: !114, line: 244, baseType: !377, size: 32, offset: 192)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1065, file: !114, line: 245, baseType: !423, size: 64, offset: 256)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1065, file: !114, line: 246, baseType: !490, size: 32, offset: 320)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1065, file: !114, line: 247, baseType: !377, size: 32, offset: 352)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1065, file: !114, line: 251, baseType: !377, size: 32, offset: 384)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1065, file: !114, line: 252, baseType: !869, size: 64, offset: 448)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1065, file: !114, line: 253, baseType: !490, size: 32, offset: 512)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1065, file: !114, line: 254, baseType: !377, size: 32, offset: 544)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1065, file: !114, line: 254, baseType: !377, size: 32, offset: 576)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1065, file: !114, line: 255, baseType: !377, size: 32, offset: 608)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !552, file: !553, line: 438, baseType: !1063, size: 64, offset: 14016)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !552, file: !553, line: 439, baseType: !414, size: 64, offset: 14080)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !552, file: !553, line: 440, baseType: !1085, size: 32, offset: 14144)
!1085 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !552, file: !553, line: 441, baseType: !490, size: 32, offset: 14176)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !552, file: !553, line: 442, baseType: !490, size: 32, offset: 14208)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !552, file: !553, line: 443, baseType: !1089, size: 448, offset: 14272)
!1089 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1090, size: 448, elements: !1091)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !354)
!1091 = !{!1092}
!1092 = !DISubrange(count: 7)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !552, file: !553, line: 444, baseType: !490, size: 32, offset: 14720)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !552, file: !553, line: 445, baseType: !490, size: 32, offset: 14752)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !552, file: !553, line: 446, baseType: !377, size: 32, offset: 14784)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !552, file: !553, line: 447, baseType: !416, size: 64, offset: 14848)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !552, file: !553, line: 448, baseType: !416, size: 64, offset: 14912)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !552, file: !553, line: 449, baseType: !637, size: 640, offset: 14976)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !552, file: !553, line: 450, baseType: !569, size: 32, offset: 15616)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !552, file: !553, line: 451, baseType: !1101, size: 2880, offset: 15680)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !553, line: 318, baseType: !1102)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !553, line: 319, size: 2880, elements: !1103)
!1103 = !{!1104, !1105, !1106, !1107, !1108, !1109, !1110, !1123, !1124, !1129, !1134, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1149, !1150, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1182, !1183, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1206, !1207, !1208, !1209, !1210}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1102, file: !553, line: 320, baseType: !377, size: 32)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1102, file: !553, line: 321, baseType: !377, size: 32, offset: 32)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1102, file: !553, line: 322, baseType: !377, size: 32, offset: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1102, file: !553, line: 323, baseType: !377, size: 32, offset: 96)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1102, file: !553, line: 324, baseType: !377, size: 32, offset: 128)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1102, file: !553, line: 325, baseType: !377, size: 32, offset: 160)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1102, file: !553, line: 326, baseType: !1111, size: 64, offset: 192)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !553, line: 293, baseType: !1112)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !553, line: 295, size: 448, elements: !1114)
!1114 = !{!1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1113, file: !553, line: 296, baseType: !1111, size: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1113, file: !553, line: 297, baseType: !440, size: 64, offset: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1113, file: !553, line: 297, baseType: !440, size: 64, offset: 128)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1113, file: !553, line: 298, baseType: !423, size: 64, offset: 192)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1113, file: !553, line: 298, baseType: !423, size: 64, offset: 256)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1113, file: !553, line: 299, baseType: !377, size: 32, offset: 320)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1113, file: !553, line: 300, baseType: !377, size: 32, offset: 352)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1113, file: !553, line: 301, baseType: !377, size: 32, offset: 384)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1102, file: !553, line: 326, baseType: !1111, size: 64, offset: 256)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1102, file: !553, line: 328, baseType: !1125, size: 64, offset: 320)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!331, !550, !1128, !423}
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1102, file: !553, line: 329, baseType: !1130, size: 64, offset: 384)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!331, !1128, !1133, !425, !425, !443, !423}
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1102, file: !553, line: 330, baseType: !1135, size: 64, offset: 448)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{!331, !1128}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1102, file: !553, line: 331, baseType: !1135, size: 64, offset: 512)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1102, file: !553, line: 334, baseType: !333, size: 64, offset: 576)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1102, file: !553, line: 335, baseType: !394, size: 32, offset: 640)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1102, file: !553, line: 335, baseType: !394, size: 32, offset: 672)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1102, file: !553, line: 336, baseType: !394, size: 32, offset: 704)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1102, file: !553, line: 336, baseType: !394, size: 32, offset: 736)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1102, file: !553, line: 337, baseType: !1145, size: 64, offset: 768)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !334, line: 339, baseType: !1147)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64)
!1148 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !334, line: 339, flags: DIFlagFwdDecl)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1102, file: !553, line: 338, baseType: !1145, size: 64, offset: 832)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1102, file: !553, line: 339, baseType: !1151, size: 64, offset: 896)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !334, line: 341, baseType: !1153)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !334, line: 351, size: 192, elements: !1154)
!1154 = !{!1155, !1156, !1157, !1158, !1159}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1153, file: !334, line: 354, baseType: !72, size: 32)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1153, file: !334, line: 355, baseType: !72, size: 32, offset: 32)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1153, file: !334, line: 356, baseType: !72, size: 32, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1153, file: !334, line: 361, baseType: !72, size: 32, offset: 96)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1153, file: !334, line: 362, baseType: !312, size: 64, offset: 128)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1102, file: !553, line: 340, baseType: !377, size: 32, offset: 960)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1102, file: !553, line: 340, baseType: !377, size: 32, offset: 992)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1102, file: !553, line: 341, baseType: !440, size: 64, offset: 1024)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1102, file: !553, line: 342, baseType: !423, size: 64, offset: 1088)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1102, file: !553, line: 343, baseType: !443, size: 64, offset: 1152)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1102, file: !553, line: 344, baseType: !425, size: 64, offset: 1216)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1102, file: !553, line: 345, baseType: !377, size: 32, offset: 1280)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1102, file: !553, line: 346, baseType: !1133, size: 64, offset: 1344)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1102, file: !553, line: 347, baseType: !490, size: 32, offset: 1408)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1102, file: !553, line: 348, baseType: !377, size: 32, offset: 1440)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1102, file: !553, line: 351, baseType: !490, size: 32, offset: 1472)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1102, file: !553, line: 352, baseType: !490, size: 32, offset: 1504)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1102, file: !553, line: 353, baseType: !394, size: 32, offset: 1536)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1102, file: !553, line: 354, baseType: !394, size: 32, offset: 1568)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1102, file: !553, line: 355, baseType: !1133, size: 64, offset: 1600)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1102, file: !553, line: 356, baseType: !1133, size: 64, offset: 1664)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1102, file: !553, line: 357, baseType: !1177, size: 64, offset: 1728)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !553, line: 310, baseType: !1179)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !553, line: 308, size: 32, elements: !1180)
!1180 = !{!1181}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1179, file: !553, line: 309, baseType: !377, size: 32)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1102, file: !553, line: 357, baseType: !1177, size: 64, offset: 1792)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1102, file: !553, line: 358, baseType: !1184, size: 64, offset: 1856)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !553, line: 316, baseType: !1186)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !553, line: 312, size: 128, elements: !1187)
!1187 = !{!1188, !1189, !1190}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1186, file: !553, line: 313, baseType: !414, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1186, file: !553, line: 314, baseType: !377, size: 32, offset: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1186, file: !553, line: 315, baseType: !356, size: 8, offset: 96)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1102, file: !553, line: 359, baseType: !1184, size: 64, offset: 1920)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1102, file: !553, line: 360, baseType: !1184, size: 64, offset: 1984)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1102, file: !553, line: 361, baseType: !377, size: 32, offset: 2048)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1102, file: !553, line: 362, baseType: !394, size: 32, offset: 2080)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1102, file: !553, line: 363, baseType: !377, size: 32, offset: 2112)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1102, file: !553, line: 364, baseType: !1133, size: 64, offset: 2176)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1102, file: !553, line: 365, baseType: !1151, size: 64, offset: 2240)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1102, file: !553, line: 366, baseType: !394, size: 32, offset: 2304)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1102, file: !553, line: 367, baseType: !394, size: 32, offset: 2336)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1102, file: !553, line: 368, baseType: !1145, size: 64, offset: 2368)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1102, file: !553, line: 369, baseType: !1145, size: 64, offset: 2432)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1102, file: !553, line: 370, baseType: !1203, size: 64, offset: 2496)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1204)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1102, file: !553, line: 371, baseType: !1203, size: 64, offset: 2560)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1102, file: !553, line: 372, baseType: !1203, size: 64, offset: 2624)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1102, file: !553, line: 373, baseType: !536, size: 64, offset: 2688)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1102, file: !553, line: 374, baseType: !312, size: 64, offset: 2752)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1102, file: !553, line: 375, baseType: !1211, size: 64, offset: 2816)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !552, file: !553, line: 451, baseType: !1101, size: 2880, offset: 18560)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !552, file: !553, line: 452, baseType: !1214, size: 64, offset: 21440)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1215)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !553, line: 681, size: 4864, elements: !1217)
!1217 = !{!1218, !1219, !1220, !1221, !1222, !1223, !1224, !1228}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1216, file: !553, line: 682, baseType: !556, size: 4480)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1216, file: !553, line: 682, baseType: !781, size: 32, offset: 4480)
