; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/dt/interface/dt.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/dt/interface/dt.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!58 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewer.h", directory: "/home/users/ndemeye/xSDK")
!59 = !{!60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101}
!60 = !DIEnumerator(name: "PETSC_VIEWER_DEFAULT", value: 0, isUnsigned: true)
!61 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATLAB", value: 1, isUnsigned: true)
!62 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATHEMATICA", value: 2, isUnsigned: true)
!63 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!64 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!65 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!66 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!67 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!68 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!69 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!70 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!72 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!102 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 726, baseType: !7, size: 32, elements: !103)
!103 = !{!104, !105}
!104 = !DIEnumerator(name: "PETSC_FP_TRAP_OFF", value: 0, isUnsigned: true)
!105 = !DIEnumerator(name: "PETSC_FP_TRAP_ON", value: 1, isUnsigned: true)
!106 = !{!107, !111, !112, !115, !316, !317, !151, !177, !286, !228, !201, !227, !174, !318}
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !108, line: 330, baseType: !109)
!108 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !108, line: 330, flags: DIFlagFwdDecl)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !113, line: 46, baseType: !114)
!113 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!114 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !118, line: 73, size: 4480, elements: !119)
!118 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!119 = !{!120, !123, !172, !173, !175, !178, !179, !180, !181, !189, !190, !192, !196, !200, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !213, !214, !215, !217, !218, !220, !222, !223, !224, !225, !226, !229, !231, !232, !233, !234, !235, !238, !240, !241, !242, !252, !254, !255, !259, !260, !306, !311, !313, !314, !315}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !117, file: !118, line: 74, baseType: !121, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !122)
!122 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !117, file: !118, line: 75, baseType: !124, size: 448, offset: 64)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 448, elements: !170)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !118, line: 53, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !118, line: 45, size: 448, elements: !127)
!127 = !{!128, !134, !142, !147, !154, !158, !165}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !126, file: !118, line: 46, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!132, !115, !133}
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !122)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !126, file: !118, line: 47, baseType: !135, size: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!132, !115, !138}
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !139, line: 16, baseType: !140)
!139 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !139, line: 16, flags: DIFlagFwdDecl)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !126, file: !118, line: 48, baseType: !143, size: 64, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!132, !146}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !126, file: !118, line: 49, baseType: !148, size: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!132, !115, !151, !115}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!153 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !126, file: !118, line: 50, baseType: !155, size: 64, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!132, !115, !151, !146}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !126, file: !118, line: 51, baseType: !159, size: 64, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!132, !115, !151, !162}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{null}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !126, file: !118, line: 52, baseType: !166, size: 64, offset: 384)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!132, !115, !151, !169}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!170 = !{!171}
!171 = !DISubrange(count: 1)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !117, file: !118, line: 76, baseType: !107, size: 64, offset: 512)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !117, file: !118, line: 77, baseType: !174, size: 32, offset: 576)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !122)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !117, file: !118, line: 78, baseType: !176, size: 64, offset: 640)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !177)
!177 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !117, file: !118, line: 78, baseType: !176, size: 64, offset: 704)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !117, file: !118, line: 78, baseType: !176, size: 64, offset: 768)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !117, file: !118, line: 78, baseType: !176, size: 64, offset: 832)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !117, file: !118, line: 79, baseType: !182, size: 64, offset: 896)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !185, line: 27, baseType: !186)
!185 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !187, line: 43, baseType: !188)
!187 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!188 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !117, file: !118, line: 80, baseType: !174, size: 32, offset: 960)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !117, file: !118, line: 81, baseType: !191, size: 32, offset: 992)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !122)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !117, file: !118, line: 82, baseType: !193, size: 64, offset: 1024)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !117, file: !118, line: 83, baseType: !197, size: 64, offset: 1088)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !117, file: !118, line: 84, baseType: !201, size: 64, offset: 1152)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !117, file: !118, line: 85, baseType: !201, size: 64, offset: 1216)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !117, file: !118, line: 86, baseType: !201, size: 64, offset: 1280)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !117, file: !118, line: 87, baseType: !201, size: 64, offset: 1344)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !117, file: !118, line: 88, baseType: !115, size: 64, offset: 1408)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !117, file: !118, line: 89, baseType: !182, size: 64, offset: 1472)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !117, file: !118, line: 90, baseType: !201, size: 64, offset: 1536)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !117, file: !118, line: 91, baseType: !201, size: 64, offset: 1600)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !117, file: !118, line: 92, baseType: !174, size: 32, offset: 1664)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !117, file: !118, line: 93, baseType: !111, size: 64, offset: 1728)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !117, file: !118, line: 94, baseType: !212, size: 64, offset: 1792)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !183)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !117, file: !118, line: 95, baseType: !174, size: 32, offset: 1856)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !117, file: !118, line: 95, baseType: !174, size: 32, offset: 1888)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !117, file: !118, line: 96, baseType: !216, size: 64, offset: 1920)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !117, file: !118, line: 96, baseType: !216, size: 64, offset: 1984)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !117, file: !118, line: 97, baseType: !219, size: 64, offset: 2048)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !117, file: !118, line: 97, baseType: !221, size: 64, offset: 2112)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !117, file: !118, line: 98, baseType: !174, size: 32, offset: 2176)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !117, file: !118, line: 98, baseType: !174, size: 32, offset: 2208)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !117, file: !118, line: 99, baseType: !216, size: 64, offset: 2240)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !117, file: !118, line: 99, baseType: !216, size: 64, offset: 2304)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !117, file: !118, line: 100, baseType: !227, size: 64, offset: 2368)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !177)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !117, file: !118, line: 100, baseType: !230, size: 64, offset: 2432)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !117, file: !118, line: 101, baseType: !174, size: 32, offset: 2496)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !117, file: !118, line: 101, baseType: !174, size: 32, offset: 2528)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !117, file: !118, line: 102, baseType: !216, size: 64, offset: 2560)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !117, file: !118, line: 102, baseType: !216, size: 64, offset: 2624)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !117, file: !118, line: 103, baseType: !236, size: 64, offset: 2688)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !228)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !117, file: !118, line: 103, baseType: !239, size: 64, offset: 2752)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !117, file: !118, line: 104, baseType: !169, size: 64, offset: 2816)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !117, file: !118, line: 105, baseType: !174, size: 32, offset: 2880)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !117, file: !118, line: 106, baseType: !243, size: 128, offset: 2944)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 128, elements: !250)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !118, line: 64, baseType: !246)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !118, line: 61, size: 128, elements: !247)
!247 = !{!248, !249}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !246, file: !118, line: 62, baseType: !162, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !246, file: !118, line: 63, baseType: !111, size: 64, offset: 64)
!250 = !{!251}
!251 = !DISubrange(count: 2)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !117, file: !118, line: 107, baseType: !253, size: 64, offset: 3072)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 64, elements: !250)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !117, file: !118, line: 108, baseType: !111, size: 64, offset: 3136)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !117, file: !118, line: 109, baseType: !256, size: 64, offset: 3200)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!132, !111}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !117, file: !118, line: 111, baseType: !174, size: 32, offset: 3264)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !117, file: !118, line: 112, baseType: !261, size: 320, offset: 3328)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 320, elements: !304)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!132, !265, !115, !111}
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !268)
!268 = !{!269, !270, !292, !293, !294, !295, !296, !297, !298, !299, !300}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !267, file: !12, line: 100, baseType: !174, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !267, file: !12, line: 101, baseType: !271, size: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !274)
!274 = !{!275, !276, !277, !278, !279, !282, !283, !284, !285, !287, !289, !290, !291}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !273, file: !12, line: 84, baseType: !201, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !273, file: !12, line: 85, baseType: !201, size: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !273, file: !12, line: 86, baseType: !111, size: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !273, file: !12, line: 87, baseType: !193, size: 64, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !273, file: !12, line: 88, baseType: !280, size: 64, offset: 256)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !273, file: !12, line: 89, baseType: !153, size: 8, offset: 320)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !273, file: !12, line: 90, baseType: !201, size: 64, offset: 384)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !273, file: !12, line: 91, baseType: !112, size: 64, offset: 448)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !273, file: !12, line: 92, baseType: !286, size: 32, offset: 512)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !273, file: !12, line: 93, baseType: !288, size: 32, offset: 544)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !273, file: !12, line: 94, baseType: !271, size: 64, offset: 576)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !273, file: !12, line: 95, baseType: !201, size: 64, offset: 640)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !273, file: !12, line: 96, baseType: !111, size: 64, offset: 704)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !267, file: !12, line: 102, baseType: !201, size: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !267, file: !12, line: 102, baseType: !201, size: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !267, file: !12, line: 103, baseType: !201, size: 64, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !267, file: !12, line: 104, baseType: !107, size: 64, offset: 320)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !267, file: !12, line: 105, baseType: !286, size: 32, offset: 384)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !267, file: !12, line: 105, baseType: !286, size: 32, offset: 416)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !267, file: !12, line: 105, baseType: !286, size: 32, offset: 448)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !267, file: !12, line: 106, baseType: !115, size: 64, offset: 512)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !267, file: !12, line: 107, baseType: !301, size: 64, offset: 576)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!304 = !{!305}
!305 = !DISubrange(count: 5)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !117, file: !118, line: 113, baseType: !307, size: 320, offset: 3648)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 320, elements: !304)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!132, !115, !111}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !117, file: !118, line: 114, baseType: !312, size: 320, offset: 3968)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 320, elements: !304)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !117, file: !118, line: 115, baseType: !286, size: 32, offset: 4288)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !117, file: !118, line: 120, baseType: !301, size: 64, offset: 4352)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !117, file: !118, line: 121, baseType: !286, size: 32, offset: 4416)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectDestroyFunction", file: !118, line: 130, baseType: !143)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectViewFunction", file: !118, line: 131, baseType: !135)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBLASInt", file: !6, line: 140, baseType: !122)
!319 = !{!0, !320, !326, !328, !330, !335, !337}
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "GolubWelschCitation", scope: !2, file: !322, line: 18, type: !323, isLocal: false, isDefinition: true)
!322 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/dm/dt/interface/dt.c", directory: "/home/users/ndemeye/xSDK")
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 1720, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 215)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "PetscDTGaussQuadratureNewton_Internal", scope: !2, file: !322, line: 36, type: !286, isLocal: false, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "PETSCQUADRATURE_CLASSID", scope: !2, file: !322, line: 38, type: !121, isLocal: false, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "PKDCitation", scope: !2, file: !322, line: 962, type: !332, isLocal: false, isDefinition: true)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 2368, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 296)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "PKDCite", scope: !2, file: !322, line: 961, type: !286, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "GolubWelschCite", scope: !2, file: !322, line: 17, type: !286, isLocal: true, isDefinition: true)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 320, elements: !304)
!340 = !{i32 7, !"Dwarf Version", i32 4}
!341 = !{i32 2, !"Debug Info Version", i32 3}
!342 = !{i32 1, !"wchar_size", i32 4}
!343 = !{i32 7, !"PIC Level", i32 2}
!344 = !{i32 7, !"uwtable", i32 1}
!345 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!346 = distinct !DISubprogram(name: "PetscQuadratureCreate", scope: !322, file: !322, line: 55, type: !347, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !367)
!347 = !DISubroutineType(types: !348)
!348 = !{!132, !107, !349}
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscQuadrature", file: !53, line: 18, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscQuadrature", file: !353, line: 6, size: 4800, elements: !354)
!353 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/dtimpl.h", directory: "/home/users/ndemeye/xSDK")
!354 = !{!355, !357, !359, !360, !361, !362, !363, !366}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !352, file: !353, line: 7, baseType: !356, size: 4480)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !118, line: 122, baseType: !117)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !352, file: !353, line: 7, baseType: !358, size: 32, offset: 4480)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 32, elements: !170)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !352, file: !353, line: 8, baseType: !174, size: 32, offset: 4512)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !352, file: !353, line: 9, baseType: !174, size: 32, offset: 4544)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !352, file: !353, line: 10, baseType: !174, size: 32, offset: 4576)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "numPoints", scope: !352, file: !353, line: 11, baseType: !174, size: 32, offset: 4608)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !352, file: !353, line: 12, baseType: !364, size: 64, offset: 4672)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !228)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "weights", scope: !352, file: !353, line: 13, baseType: !364, size: 64, offset: 4736)
!367 = !{!368, !369, !370, !371, !373}
!368 = !DILocalVariable(name: "comm", arg: 1, scope: !346, file: !322, line: 55, type: !107)
!369 = !DILocalVariable(name: "q", arg: 2, scope: !346, file: !322, line: 55, type: !349)
!370 = !DILocalVariable(name: "ierr", scope: !346, file: !322, line: 57, type: !132)
!371 = !DILocalVariable(name: "ierr__", scope: !372, file: !322, line: 61, type: !132)
!372 = distinct !DILexicalBlock(scope: !346, file: !322, line: 61, column: 32)
!373 = !DILocalVariable(name: "ierr__", scope: !374, file: !322, line: 62, type: !132)
!374 = distinct !DILexicalBlock(scope: !346, file: !322, line: 62, column: 140)
!375 = !DILocation(line: 0, scope: !346)
!376 = !DILocation(line: 59, column: 3, scope: !377)
!377 = distinct !DILexicalBlock(scope: !378, file: !322, line: 59, column: 3)
!378 = distinct !DILexicalBlock(scope: !379, file: !322, line: 59, column: 3)
!379 = distinct !DILexicalBlock(scope: !346, file: !322, line: 59, column: 3)
!380 = !{!381, !381, i64 0}
!381 = !{!"any pointer", !382, i64 0}
!382 = !{!"omnipotent char", !383, i64 0}
!383 = !{!"Simple C/C++ TBAA"}
!384 = !DILocation(line: 59, column: 3, scope: !378)
!385 = !DILocation(line: 59, column: 3, scope: !386)
!386 = distinct !DILexicalBlock(scope: !387, file: !322, line: 59, column: 3)
!387 = distinct !DILexicalBlock(scope: !377, file: !322, line: 59, column: 3)
!388 = !{!389, !390, i64 1536}
!389 = !{!"", !382, i64 0, !382, i64 512, !382, i64 1024, !382, i64 1280, !390, i64 1536, !390, i64 1540, !382, i64 1544}
!390 = !{!"int", !382, i64 0}
!391 = !DILocation(line: 59, column: 3, scope: !387)
!392 = !DILocation(line: 59, column: 3, scope: !393)
!393 = distinct !DILexicalBlock(scope: !386, file: !322, line: 59, column: 3)
!394 = !{!390, !390, i64 0}
!395 = !{!389, !390, i64 1540}
!396 = !DILocation(line: 60, column: 3, scope: !397)
!397 = distinct !DILexicalBlock(scope: !398, file: !322, line: 60, column: 3)
!398 = distinct !DILexicalBlock(scope: !346, file: !322, line: 60, column: 3)
!399 = !DILocation(line: 60, column: 3, scope: !398)
!400 = !DILocation(line: 60, column: 3, scope: !401)
!401 = distinct !DILexicalBlock(scope: !398, file: !322, line: 60, column: 3)
!402 = !DILocation(line: 61, column: 10, scope: !346)
!403 = !DILocation(line: 0, scope: !372)
!404 = !DILocation(line: 61, column: 32, scope: !405)
!405 = distinct !DILexicalBlock(scope: !372, file: !322, line: 61, column: 32)
!406 = !DILocation(line: 61, column: 32, scope: !372)
!407 = !{!"branch_weights", i32 2000, i32 1}
!408 = !DILocation(line: 62, column: 10, scope: !346)
!409 = !{!"branch_weights", i32 2146410443, i32 1073205}
!410 = !DILocation(line: 0, scope: !374)
!411 = !DILocation(line: 62, column: 140, scope: !374)
!412 = !DILocation(line: 62, column: 140, scope: !413)
!413 = distinct !DILexicalBlock(scope: !374, file: !322, line: 62, column: 140)
!414 = !DILocation(line: 63, column: 4, scope: !346)
!415 = !DILocation(line: 63, column: 9, scope: !346)
!416 = !DILocation(line: 63, column: 19, scope: !346)
!417 = !DILocation(line: 67, column: 9, scope: !346)
!418 = !DILocation(line: 67, column: 19, scope: !346)
!419 = !{!420, !381, i64 584}
!420 = !{!"_p_PetscQuadrature", !421, i64 0, !382, i64 560, !390, i64 564, !390, i64 568, !390, i64 572, !390, i64 576, !381, i64 584, !381, i64 592}
