; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/interface/dmouse.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/interface/dmouse.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_datatype_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct._p_PetscDraw = type { %struct._p_PetscObject, [1 x %struct._PetscDrawOps], double, double, double, double, double, double, double, double, double, [20 x double], [20 x double], double, double, double, double, i32, i32, i8*, i8*, %struct._p_PetscDraw*, i32, i32, i32, i32, i8*, i8*, i8*, i32, i32, i32, i8*, i32, i32, i8* }

!12 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 204, baseType: !5, size: 32, elements: !26)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdraw.h", directory: "/home/users/ndemeye/xSDK")
!26 = !{!27, !28, !29, !30, !31, !32, !33, !34, !35}
!27 = !DIEnumerator(name: "PETSC_BUTTON_NONE", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "PETSC_BUTTON_LEFT", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "PETSC_BUTTON_CENTER", value: 2, isUnsigned: true)
!30 = !DIEnumerator(name: "PETSC_BUTTON_RIGHT", value: 3, isUnsigned: true)
!31 = !DIEnumerator(name: "PETSC_BUTTON_WHEEL_UP", value: 4, isUnsigned: true)
!32 = !DIEnumerator(name: "PETSC_BUTTON_WHEEL_DOWN", value: 5, isUnsigned: true)
!33 = !DIEnumerator(name: "PETSC_BUTTON_LEFT_SHIFT", value: 6, isUnsigned: true)
!34 = !DIEnumerator(name: "PETSC_BUTTON_CENTER_SHIFT", value: 7, isUnsigned: true)
!35 = !DIEnumerator(name: "PETSC_BUTTON_RIGHT_SHIFT", value: 8, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 141, baseType: !5, size: 32, elements: !37)
!37 = !{!38, !39, !40, !41}
!38 = !DIEnumerator(name: "PETSC_DRAW_MARKER_CROSS", value: 0, isUnsigned: true)
!39 = !DIEnumerator(name: "PETSC_DRAW_MARKER_POINT", value: 1, isUnsigned: true)
!40 = !DIEnumerator(name: "PETSC_DRAW_MARKER_PLUS", value: 2, isUnsigned: true)
!41 = !DIEnumerator(name: "PETSC_DRAW_MARKER_CIRCLE", value: 3, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 663, baseType: !5, size: 32, elements: !44)
!43 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!44 = !{!45, !46, !47}
!45 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!46 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!47 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !49)
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67}
!50 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!51 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!52 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!54 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!55 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!56 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!57 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!60 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!61 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!62 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!63 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!64 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!65 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!66 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!67 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 58, baseType: !5, size: 32, elements: !69)
!69 = !{!70}
!70 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!71 = !{!72, !76, !77, !113, !281, !163, !84, !283}
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !73, line: 330, baseType: !74)
!73 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !73, line: 330, flags: DIFlagFwdDecl)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !80, line: 73, size: 4480, elements: !81)
!80 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!81 = !{!82, !85, !134, !135, !137, !140, !141, !142, !143, !151, !152, !154, !158, !162, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !175, !176, !177, !179, !180, !182, !184, !185, !186, !187, !188, !191, !193, !194, !195, !196, !197, !200, !202, !203, !204, !214, !216, !217, !221, !222, !271, !276, !278, !279, !280}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !79, file: !80, line: 74, baseType: !83, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !84)
!84 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !79, file: !80, line: 75, baseType: !86, size: 448, offset: 64)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 448, elements: !132)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !80, line: 53, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !80, line: 45, size: 448, elements: !89)
!89 = !{!90, !96, !104, !109, !116, !120, !127}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !88, file: !80, line: 46, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!94, !77, !95}
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !84)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !88, file: !80, line: 47, baseType: !97, size: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!94, !77, !100}
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !101, line: 16, baseType: !102)
!101 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !101, line: 16, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !88, file: !80, line: 48, baseType: !105, size: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!94, !108}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !88, file: !80, line: 49, baseType: !110, size: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!94, !77, !113, !77}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!115 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !88, file: !80, line: 50, baseType: !117, size: 64, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!94, !77, !113, !108}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !88, file: !80, line: 51, baseType: !121, size: 64, offset: 320)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!94, !77, !113, !124}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{null}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !88, file: !80, line: 52, baseType: !128, size: 64, offset: 384)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!94, !77, !113, !131}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!132 = !{!133}
!133 = !DISubrange(count: 1)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !79, file: !80, line: 76, baseType: !72, size: 64, offset: 512)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !79, file: !80, line: 77, baseType: !136, size: 32, offset: 576)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !84)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !79, file: !80, line: 78, baseType: !138, size: 64, offset: 640)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !139)
!139 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !79, file: !80, line: 78, baseType: !138, size: 64, offset: 704)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !79, file: !80, line: 78, baseType: !138, size: 64, offset: 768)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !79, file: !80, line: 78, baseType: !138, size: 64, offset: 832)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !79, file: !80, line: 79, baseType: !144, size: 64, offset: 896)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !147, line: 27, baseType: !148)
!147 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !149, line: 43, baseType: !150)
!149 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!150 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !79, file: !80, line: 80, baseType: !136, size: 32, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !79, file: !80, line: 81, baseType: !153, size: 32, offset: 992)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !84)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !79, file: !80, line: 82, baseType: !155, size: 64, offset: 1024)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !79, file: !80, line: 83, baseType: !159, size: 64, offset: 1088)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !79, file: !80, line: 84, baseType: !163, size: 64, offset: 1152)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !79, file: !80, line: 85, baseType: !163, size: 64, offset: 1216)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !79, file: !80, line: 86, baseType: !163, size: 64, offset: 1280)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !79, file: !80, line: 87, baseType: !163, size: 64, offset: 1344)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !79, file: !80, line: 88, baseType: !77, size: 64, offset: 1408)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !79, file: !80, line: 89, baseType: !144, size: 64, offset: 1472)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !79, file: !80, line: 90, baseType: !163, size: 64, offset: 1536)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !79, file: !80, line: 91, baseType: !163, size: 64, offset: 1600)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !79, file: !80, line: 92, baseType: !136, size: 32, offset: 1664)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !79, file: !80, line: 93, baseType: !76, size: 64, offset: 1728)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !79, file: !80, line: 94, baseType: !174, size: 64, offset: 1792)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !145)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !79, file: !80, line: 95, baseType: !136, size: 32, offset: 1856)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !79, file: !80, line: 95, baseType: !136, size: 32, offset: 1888)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !79, file: !80, line: 96, baseType: !178, size: 64, offset: 1920)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !79, file: !80, line: 96, baseType: !178, size: 64, offset: 1984)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !79, file: !80, line: 97, baseType: !181, size: 64, offset: 2048)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !79, file: !80, line: 97, baseType: !183, size: 64, offset: 2112)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !79, file: !80, line: 98, baseType: !136, size: 32, offset: 2176)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !79, file: !80, line: 98, baseType: !136, size: 32, offset: 2208)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !79, file: !80, line: 99, baseType: !178, size: 64, offset: 2240)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !79, file: !80, line: 99, baseType: !178, size: 64, offset: 2304)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !79, file: !80, line: 100, baseType: !189, size: 64, offset: 2368)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !139)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !79, file: !80, line: 100, baseType: !192, size: 64, offset: 2432)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !79, file: !80, line: 101, baseType: !136, size: 32, offset: 2496)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !79, file: !80, line: 101, baseType: !136, size: 32, offset: 2528)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !79, file: !80, line: 102, baseType: !178, size: 64, offset: 2560)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !79, file: !80, line: 102, baseType: !178, size: 64, offset: 2624)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !79, file: !80, line: 103, baseType: !198, size: 64, offset: 2688)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !190)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !79, file: !80, line: 103, baseType: !201, size: 64, offset: 2752)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !79, file: !80, line: 104, baseType: !131, size: 64, offset: 2816)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !79, file: !80, line: 105, baseType: !136, size: 32, offset: 2880)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !79, file: !80, line: 106, baseType: !205, size: 128, offset: 2944)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 128, elements: !212)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !80, line: 64, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !80, line: 61, size: 128, elements: !209)
!209 = !{!210, !211}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !208, file: !80, line: 62, baseType: !124, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !208, file: !80, line: 63, baseType: !76, size: 64, offset: 64)
!212 = !{!213}
!213 = !DISubrange(count: 2)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !79, file: !80, line: 107, baseType: !215, size: 64, offset: 3072)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 64, elements: !212)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !79, file: !80, line: 108, baseType: !76, size: 64, offset: 3136)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !79, file: !80, line: 109, baseType: !218, size: 64, offset: 3200)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!94, !76}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !79, file: !80, line: 111, baseType: !136, size: 32, offset: 3264)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !79, file: !80, line: 112, baseType: !223, size: 320, offset: 3328)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 320, elements: !269)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!94, !227, !77, !76}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !230)
!230 = !{!231, !232, !257, !258, !259, !260, !261, !262, !263, !264, !265}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !229, file: !10, line: 100, baseType: !136, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !229, file: !10, line: 101, baseType: !233, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !236)
!236 = !{!237, !238, !239, !240, !241, !244, !245, !246, !250, !252, !254, !255, !256}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !235, file: !10, line: 84, baseType: !163, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !235, file: !10, line: 85, baseType: !163, size: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !235, file: !10, line: 86, baseType: !76, size: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !235, file: !10, line: 87, baseType: !155, size: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !235, file: !10, line: 88, baseType: !242, size: 64, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !235, file: !10, line: 89, baseType: !115, size: 8, offset: 320)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !235, file: !10, line: 90, baseType: !163, size: 64, offset: 384)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !235, file: !10, line: 91, baseType: !247, size: 64, offset: 448)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !248, line: 46, baseType: !249)
!248 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!249 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !235, file: !10, line: 92, baseType: !251, size: 32, offset: 512)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !235, file: !10, line: 93, baseType: !253, size: 32, offset: 544)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !235, file: !10, line: 94, baseType: !233, size: 64, offset: 576)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !235, file: !10, line: 95, baseType: !163, size: 64, offset: 640)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !235, file: !10, line: 96, baseType: !76, size: 64, offset: 704)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !229, file: !10, line: 102, baseType: !163, size: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !229, file: !10, line: 102, baseType: !163, size: 64, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !229, file: !10, line: 103, baseType: !163, size: 64, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !229, file: !10, line: 104, baseType: !72, size: 64, offset: 320)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !229, file: !10, line: 105, baseType: !251, size: 32, offset: 384)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !229, file: !10, line: 105, baseType: !251, size: 32, offset: 416)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !229, file: !10, line: 105, baseType: !251, size: 32, offset: 448)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !229, file: !10, line: 106, baseType: !77, size: 64, offset: 512)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !229, file: !10, line: 107, baseType: !266, size: 64, offset: 576)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!269 = !{!270}
!270 = !DISubrange(count: 5)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !79, file: !80, line: 113, baseType: !272, size: 320, offset: 3648)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 320, elements: !269)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!94, !77, !76}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !79, file: !80, line: 114, baseType: !277, size: 320, offset: 3968)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 320, elements: !269)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !79, file: !80, line: 115, baseType: !251, size: 32, offset: 4288)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !79, file: !80, line: 120, baseType: !266, size: 64, offset: 4352)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !79, file: !80, line: 121, baseType: !251, size: 32, offset: 4416)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEnum", file: !4, line: 58, baseType: !68)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !73, line: 331, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !73, line: 331, flags: DIFlagFwdDecl)
!286 = !{i32 7, !"Dwarf Version", i32 4}
!287 = !{i32 2, !"Debug Info Version", i32 3}
!288 = !{i32 1, !"wchar_size", i32 4}
!289 = !{i32 7, !"PIC Level", i32 2}
!290 = !{i32 7, !"uwtable", i32 1}
!291 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!292 = distinct !DISubprogram(name: "PetscDrawGetMouseButton", scope: !293, file: !293, line: 26, type: !294, scopeLine: 27, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !455)
!293 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/classes/draw/interface/dmouse.c", directory: "/home/users/ndemeye/xSDK")
!294 = !DISubroutineType(types: !295)
!295 = !{!94, !296, !453, !189, !189, !189, !189}
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDraw", file: !297, line: 25, baseType: !298)
!297 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdrawtypes.h", directory: "/home/users/ndemeye/xSDK")
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDraw", file: !300, line: 53, size: 11072, elements: !301)
!300 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/drawimpl.h", directory: "/home/users/ndemeye/xSDK")
!301 = !{!302, !304, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !428, !429, !430, !431, !432, !433, !434, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !299, file: !300, line: 54, baseType: !303, size: 4480)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !80, line: 122, baseType: !79)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !299, file: !300, line: 54, baseType: !305, size: 2304, offset: 4480)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !306, size: 2304, elements: !132)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscDrawOps", file: !300, line: 14, size: 2304, elements: !307)
!307 = !{!308, !312, !313, !317, !321, !325, !329, !330, !334, !335, !339, !343, !347, !348, !352, !356, !357, !359, !360, !361, !362, !367, !371, !372, !376, !377, !381, !382, !383, !384, !396, !397, !398, !403, !407, !411}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "setdoublebuffer", scope: !306, file: !300, line: 15, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!94, !296}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !306, file: !300, line: 16, baseType: !309, size: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !306, file: !300, line: 17, baseType: !314, size: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!94, !296, !190, !190, !190, !190, !84}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "linesetwidth", scope: !306, file: !300, line: 18, baseType: !318, size: 64, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!94, !296, !190}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "linegetwidth", scope: !306, file: !300, line: 19, baseType: !322, size: 64, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!94, !296, !189}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "point", scope: !306, file: !300, line: 20, baseType: !326, size: 64, offset: 320)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!94, !296, !190, !190, !84}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pointsetsize", scope: !306, file: !300, line: 21, baseType: !318, size: 64, offset: 384)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !306, file: !300, line: 22, baseType: !331, size: 64, offset: 448)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!94, !296, !190, !190, !84, !113}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "stringvertical", scope: !306, file: !300, line: 23, baseType: !331, size: 64, offset: 512)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "stringsetsize", scope: !306, file: !300, line: 24, baseType: !336, size: 64, offset: 576)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!94, !296, !190, !190}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "stringgetsize", scope: !306, file: !300, line: 25, baseType: !340, size: 64, offset: 640)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!94, !296, !189, !189}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "setviewport", scope: !306, file: !300, line: 26, baseType: !344, size: 64, offset: 704)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!94, !296, !190, !190, !190, !190}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "clear", scope: !306, file: !300, line: 27, baseType: !309, size: 64, offset: 768)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "rectangle", scope: !306, file: !300, line: 28, baseType: !349, size: 64, offset: 832)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{!94, !296, !190, !190, !190, !190, !84, !84, !84, !84}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "triangle", scope: !306, file: !300, line: 29, baseType: !353, size: 64, offset: 896)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!94, !296, !190, !190, !190, !190, !190, !190, !84, !84, !84}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ellipse", scope: !306, file: !300, line: 30, baseType: !314, size: 64, offset: 960)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "getmousebutton", scope: !306, file: !300, line: 31, baseType: !358, size: 64, offset: 1024)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !306, file: !300, line: 32, baseType: !309, size: 64, offset: 1088)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "beginpage", scope: !306, file: !300, line: 33, baseType: !309, size: 64, offset: 1152)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "endpage", scope: !306, file: !300, line: 34, baseType: !309, size: 64, offset: 1216)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "getpopup", scope: !306, file: !300, line: 35, baseType: !363, size: 64, offset: 1280)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!94, !296, !366}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "settitle", scope: !306, file: !300, line: 36, baseType: !368, size: 64, offset: 1344)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!94, !296, !113}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "checkresizedwindow", scope: !306, file: !300, line: 37, baseType: !309, size: 64, offset: 1408)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "resizewindow", scope: !306, file: !300, line: 38, baseType: !373, size: 64, offset: 1472)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!94, !296, !84, !84}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !306, file: !300, line: 39, baseType: !309, size: 64, offset: 1536)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !306, file: !300, line: 40, baseType: !378, size: 64, offset: 1600)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!94, !296, !100}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "getsingleton", scope: !306, file: !300, line: 41, baseType: !363, size: 64, offset: 1664)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "restoresingleton", scope: !306, file: !300, line: 42, baseType: !363, size: 64, offset: 1728)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "save", scope: !306, file: !300, line: 43, baseType: !309, size: 64, offset: 1792)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "getimage", scope: !306, file: !300, line: 44, baseType: !385, size: 64, offset: 1856)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!94, !296, !388, !393, !393, !394}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 24, elements: !391)
!390 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!391 = !{!392}
!392 = !DISubrange(count: 3)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "setcoordinates", scope: !306, file: !300, line: 45, baseType: !344, size: 64, offset: 1920)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "arrow", scope: !306, file: !300, line: 46, baseType: !314, size: 64, offset: 1984)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatetopixel", scope: !306, file: !300, line: 47, baseType: !399, size: 64, offset: 2048)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!94, !296, !190, !190, !402, !402}
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "pixeltocoordinate", scope: !306, file: !300, line: 48, baseType: !404, size: 64, offset: 2112)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!94, !296, !84, !84, !189, !189}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "pointpixel", scope: !306, file: !300, line: 49, baseType: !408, size: 64, offset: 2176)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!94, !296, !84, !84, !84}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "boxedstring", scope: !306, file: !300, line: 50, baseType: !412, size: 64, offset: 2240)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!94, !296, !190, !190, !84, !84, !113, !189, !189}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !299, file: !300, line: 55, baseType: !190, size: 64, offset: 6784)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "port_xl", scope: !299, file: !300, line: 56, baseType: !190, size: 64, offset: 6848)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "port_yl", scope: !299, file: !300, line: 56, baseType: !190, size: 64, offset: 6912)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "port_xr", scope: !299, file: !300, line: 56, baseType: !190, size: 64, offset: 6976)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "port_yr", scope: !299, file: !300, line: 56, baseType: !190, size: 64, offset: 7040)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "coor_xl", scope: !299, file: !300, line: 57, baseType: !190, size: 64, offset: 7104)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "coor_yl", scope: !299, file: !300, line: 57, baseType: !190, size: 64, offset: 7168)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "coor_xr", scope: !299, file: !300, line: 57, baseType: !190, size: 64, offset: 7232)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "coor_yr", scope: !299, file: !300, line: 57, baseType: !190, size: 64, offset: 7296)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "currentpoint_x", scope: !299, file: !300, line: 58, baseType: !425, size: 1280, offset: 7360)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 1280, elements: !426)
!426 = !{!427}
!427 = !DISubrange(count: 20)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "currentpoint_y", scope: !299, file: !300, line: 58, baseType: !425, size: 1280, offset: 8640)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_xl", scope: !299, file: !300, line: 59, baseType: !190, size: 64, offset: 9920)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_yl", scope: !299, file: !300, line: 59, baseType: !190, size: 64, offset: 9984)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_xr", scope: !299, file: !300, line: 59, baseType: !190, size: 64, offset: 10048)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "boundbox_yr", scope: !299, file: !300, line: 59, baseType: !190, size: 64, offset: 10112)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "currentpoint", scope: !299, file: !300, line: 60, baseType: !136, size: 32, offset: 10176)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "markertype", scope: !299, file: !300, line: 61, baseType: !435, size: 32, offset: 10208)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawMarkerType", file: !25, line: 141, baseType: !36)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !299, file: !300, line: 62, baseType: !163, size: 64, offset: 10240)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !299, file: !300, line: 63, baseType: !163, size: 64, offset: 10304)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "popup", scope: !299, file: !300, line: 64, baseType: !296, size: 64, offset: 10368)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !299, file: !300, line: 65, baseType: !84, size: 32, offset: 10432)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !299, file: !300, line: 65, baseType: !84, size: 32, offset: 10464)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !299, file: !300, line: 65, baseType: !84, size: 32, offset: 10496)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !299, file: !300, line: 65, baseType: !84, size: 32, offset: 10528)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "savefilename", scope: !299, file: !300, line: 66, baseType: !163, size: 64, offset: 10560)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "saveimageext", scope: !299, file: !300, line: 67, baseType: !163, size: 64, offset: 10624)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "savemovieext", scope: !299, file: !300, line: 68, baseType: !163, size: 64, offset: 10688)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "savefilecount", scope: !299, file: !300, line: 69, baseType: !136, size: 32, offset: 10752)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "savesinglefile", scope: !299, file: !300, line: 70, baseType: !251, size: 32, offset: 10784)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "savemoviefps", scope: !299, file: !300, line: 71, baseType: !136, size: 32, offset: 10816)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "savefinalfilename", scope: !299, file: !300, line: 72, baseType: !163, size: 64, offset: 10880)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "saveonclear", scope: !299, file: !300, line: 73, baseType: !251, size: 32, offset: 10944)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "saveonflush", scope: !299, file: !300, line: 74, baseType: !251, size: 32, offset: 10976)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !299, file: !300, line: 75, baseType: !76, size: 64, offset: 11008)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawButton", file: !25, line: 207, baseType: !24)
!455 = !{!456, !457, !458, !459, !460, !461, !462, !466, !467, !469, !471, !477, !478, !480, !483}
!456 = !DILocalVariable(name: "draw", arg: 1, scope: !292, file: !293, line: 26, type: !296)
!457 = !DILocalVariable(name: "button", arg: 2, scope: !292, file: !293, line: 26, type: !453)
!458 = !DILocalVariable(name: "x_user", arg: 3, scope: !292, file: !293, line: 26, type: !189)
!459 = !DILocalVariable(name: "y_user", arg: 4, scope: !292, file: !293, line: 26, type: !189)
!460 = !DILocalVariable(name: "x_phys", arg: 5, scope: !292, file: !293, line: 26, type: !189)
!461 = !DILocalVariable(name: "y_phys", arg: 6, scope: !292, file: !293, line: 26, type: !189)
!462 = !DILocalVariable(name: "bcast", scope: !292, file: !293, line: 28, type: !463)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 256, elements: !464)
!464 = !{!465}
!465 = !DISubrange(count: 4)
!466 = !DILocalVariable(name: "ierr", scope: !292, file: !293, line: 29, type: !94)
!467 = !DILocalVariable(name: "ierr__", scope: !468, file: !293, line: 37, type: !94)
!468 = distinct !DILexicalBlock(scope: !292, file: !293, line: 37, column: 80)
!469 = !DILocalVariable(name: "_7_errorcode", scope: !470, file: !293, line: 39, type: !94)
!470 = distinct !DILexicalBlock(scope: !292, file: !293, line: 39, column: 89)
!471 = !DILocalVariable(name: "_7_errorstring", scope: !472, file: !293, line: 39, type: !474)
!472 = distinct !DILexicalBlock(scope: !473, file: !293, line: 39, column: 89)
!473 = distinct !DILexicalBlock(scope: !470, file: !293, line: 39, column: 89)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 2048, elements: !475)
!475 = !{!476}
!476 = !DISubrange(count: 256)
!477 = !DILocalVariable(name: "_7_resultlen", scope: !472, file: !293, line: 39, type: !153)
!478 = !DILocalVariable(name: "_7_errorcode", scope: !479, file: !293, line: 44, type: !94)
!479 = distinct !DILexicalBlock(scope: !292, file: !293, line: 44, column: 76)
!480 = !DILocalVariable(name: "_7_errorstring", scope: !481, file: !293, line: 44, type: !474)
!481 = distinct !DILexicalBlock(scope: !482, file: !293, line: 44, column: 76)
!482 = distinct !DILexicalBlock(scope: !479, file: !293, line: 44, column: 76)
!483 = !DILocalVariable(name: "_7_resultlen", scope: !481, file: !293, line: 44, type: !153)
!484 = !DILocation(line: 0, scope: !292)
!485 = !DILocation(line: 28, column: 3, scope: !292)
!486 = !DILocation(line: 28, column: 18, scope: !292)
!487 = !DILocation(line: 31, column: 3, scope: !488)
!488 = distinct !DILexicalBlock(scope: !489, file: !293, line: 31, column: 3)
!489 = distinct !DILexicalBlock(scope: !490, file: !293, line: 31, column: 3)
!490 = distinct !DILexicalBlock(scope: !292, file: !293, line: 31, column: 3)
!491 = !{!492, !492, i64 0}
!492 = !{!"any pointer", !493, i64 0}
!493 = !{!"omnipotent char", !494, i64 0}
!494 = !{!"Simple C/C++ TBAA"}
!495 = !DILocation(line: 31, column: 3, scope: !489)
!496 = !DILocation(line: 31, column: 3, scope: !497)
!497 = distinct !DILexicalBlock(scope: !498, file: !293, line: 31, column: 3)
!498 = distinct !DILexicalBlock(scope: !488, file: !293, line: 31, column: 3)
!499 = !{!500, !501, i64 1536}
!500 = !{!"", !493, i64 0, !493, i64 512, !493, i64 1024, !493, i64 1280, !501, i64 1536, !501, i64 1540, !493, i64 1544}
!501 = !{!"int", !493, i64 0}
!502 = !DILocation(line: 31, column: 3, scope: !498)
!503 = !DILocation(line: 31, column: 3, scope: !504)
!504 = distinct !DILexicalBlock(scope: !497, file: !293, line: 31, column: 3)
!505 = !{!501, !501, i64 0}
!506 = !{!500, !501, i64 1540}
!507 = !DILocation(line: 32, column: 3, scope: !508)
!508 = distinct !DILexicalBlock(scope: !509, file: !293, line: 32, column: 3)
