; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/shell/ftn-custom/zshellpcf.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/shell/ftn-custom/zshellpcf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PC = type opaque
%struct._p_Vec = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !44, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/shell/ftn-custom/zshellpcf.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!2 = !{!3, !9, !24, !32, !38}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 170, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 81, baseType: !5, size: 32, elements: !11)
!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!12 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 85, baseType: !26, size: 32, elements: !27)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpctypes.h", directory: "/home/users/ndemeye/xSDK")
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "PC_SIDE_DEFAULT", value: -1)
!29 = !DIEnumerator(name: "PC_LEFT", value: 0)
!30 = !DIEnumerator(name: "PC_RIGHT", value: 1)
!31 = !DIEnumerator(name: "PC_SYMMETRIC", value: 2)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 98, baseType: !26, size: 32, elements: !33)
!33 = !{!34, !35, !36, !37}
!34 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_RTOL", value: 2)
!35 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_ATOL", value: 3)
!36 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_ITS", value: 4)
!37 = !DIEnumerator(name: "PCRICHARDSON_DIVERGED_DTOL", value: -4)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 663, baseType: !5, size: 32, elements: !40)
!39 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!40 = !{!41, !42, !43}
!41 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!42 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!43 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!44 = !{!45, !253, !254, !219, !144, !63, !134, !256, !269, !272, !277, !283, !286, !289, !292, !295, !303}
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !48, line: 73, size: 4480, elements: !49)
!48 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!49 = !{!50, !52, !105, !106, !108, !111, !112, !113, !114, !122, !123, !125, !129, !133, !135, !136, !137, !138, !139, !140, !141, !142, !143, !145, !147, !148, !149, !151, !152, !154, !156, !157, !158, !159, !160, !163, !165, !166, !167, !168, !169, !172, !174, !175, !176, !186, !188, !189, !193, !194, !243, !248, !250, !251, !252}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !47, file: !48, line: 74, baseType: !51, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !47, file: !48, line: 75, baseType: !53, size: 448, offset: 64)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 448, elements: !103)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !48, line: 53, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !48, line: 45, size: 448, elements: !56)
!56 = !{!57, !67, !75, !80, !87, !91, !98}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !55, file: !48, line: 46, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!61, !45, !62}
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !64, line: 330, baseType: !65)
!64 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !64, line: 330, flags: DIFlagFwdDecl)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !55, file: !48, line: 47, baseType: !68, size: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!61, !45, !71}
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !72, line: 16, baseType: !73)
!72 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !72, line: 16, flags: DIFlagFwdDecl)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !55, file: !48, line: 48, baseType: !76, size: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!61, !79}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !55, file: !48, line: 49, baseType: !81, size: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{!61, !45, !84, !45}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!86 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !55, file: !48, line: 50, baseType: !88, size: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!61, !45, !84, !79}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !55, file: !48, line: 51, baseType: !92, size: 64, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!61, !45, !84, !95}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{null}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !55, file: !48, line: 52, baseType: !99, size: 64, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!61, !45, !84, !102}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!103 = !{!104}
!104 = !DISubrange(count: 1)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !47, file: !48, line: 76, baseType: !63, size: 64, offset: 512)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !47, file: !48, line: 77, baseType: !107, size: 32, offset: 576)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !47, file: !48, line: 78, baseType: !109, size: 64, offset: 640)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !110)
!110 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !47, file: !48, line: 78, baseType: !109, size: 64, offset: 704)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !47, file: !48, line: 78, baseType: !109, size: 64, offset: 768)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !47, file: !48, line: 78, baseType: !109, size: 64, offset: 832)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !47, file: !48, line: 79, baseType: !115, size: 64, offset: 896)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !118, line: 27, baseType: !119)
!118 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !120, line: 43, baseType: !121)
!120 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!121 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !47, file: !48, line: 80, baseType: !107, size: 32, offset: 960)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !47, file: !48, line: 81, baseType: !124, size: 32, offset: 992)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !47, file: !48, line: 82, baseType: !126, size: 64, offset: 1024)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !47, file: !48, line: 83, baseType: !130, size: 64, offset: 1088)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !47, file: !48, line: 84, baseType: !134, size: 64, offset: 1152)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !47, file: !48, line: 85, baseType: !134, size: 64, offset: 1216)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !47, file: !48, line: 86, baseType: !134, size: 64, offset: 1280)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !47, file: !48, line: 87, baseType: !134, size: 64, offset: 1344)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !47, file: !48, line: 88, baseType: !45, size: 64, offset: 1408)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !47, file: !48, line: 89, baseType: !115, size: 64, offset: 1472)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !47, file: !48, line: 90, baseType: !134, size: 64, offset: 1536)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !47, file: !48, line: 91, baseType: !134, size: 64, offset: 1600)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !47, file: !48, line: 92, baseType: !107, size: 32, offset: 1664)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !47, file: !48, line: 93, baseType: !144, size: 64, offset: 1728)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !47, file: !48, line: 94, baseType: !146, size: 64, offset: 1792)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !116)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !47, file: !48, line: 95, baseType: !107, size: 32, offset: 1856)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !47, file: !48, line: 95, baseType: !107, size: 32, offset: 1888)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !47, file: !48, line: 96, baseType: !150, size: 64, offset: 1920)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !47, file: !48, line: 96, baseType: !150, size: 64, offset: 1984)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !47, file: !48, line: 97, baseType: !153, size: 64, offset: 2048)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !47, file: !48, line: 97, baseType: !155, size: 64, offset: 2112)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !47, file: !48, line: 98, baseType: !107, size: 32, offset: 2176)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !47, file: !48, line: 98, baseType: !107, size: 32, offset: 2208)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !47, file: !48, line: 99, baseType: !150, size: 64, offset: 2240)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !47, file: !48, line: 99, baseType: !150, size: 64, offset: 2304)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !47, file: !48, line: 100, baseType: !161, size: 64, offset: 2368)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !110)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !47, file: !48, line: 100, baseType: !164, size: 64, offset: 2432)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !47, file: !48, line: 101, baseType: !107, size: 32, offset: 2496)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !47, file: !48, line: 101, baseType: !107, size: 32, offset: 2528)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !47, file: !48, line: 102, baseType: !150, size: 64, offset: 2560)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !47, file: !48, line: 102, baseType: !150, size: 64, offset: 2624)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !47, file: !48, line: 103, baseType: !170, size: 64, offset: 2688)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !162)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !47, file: !48, line: 103, baseType: !173, size: 64, offset: 2752)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !47, file: !48, line: 104, baseType: !102, size: 64, offset: 2816)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !47, file: !48, line: 105, baseType: !107, size: 32, offset: 2880)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !47, file: !48, line: 106, baseType: !177, size: 128, offset: 2944)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 128, elements: !184)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !48, line: 64, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !48, line: 61, size: 128, elements: !181)
!181 = !{!182, !183}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !180, file: !48, line: 62, baseType: !95, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !180, file: !48, line: 63, baseType: !144, size: 64, offset: 64)
!184 = !{!185}
!185 = !DISubrange(count: 2)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !47, file: !48, line: 107, baseType: !187, size: 64, offset: 3072)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 64, elements: !184)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !47, file: !48, line: 108, baseType: !144, size: 64, offset: 3136)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !47, file: !48, line: 109, baseType: !190, size: 64, offset: 3200)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!61, !144}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !47, file: !48, line: 111, baseType: !107, size: 32, offset: 3264)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !47, file: !48, line: 112, baseType: !195, size: 320, offset: 3328)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 320, elements: !241)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!61, !199, !45, !144}
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !202)
!202 = !{!203, !204, !229, !230, !231, !232, !233, !234, !235, !236, !237}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !201, file: !10, line: 100, baseType: !107, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !201, file: !10, line: 101, baseType: !205, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !208)
!208 = !{!209, !210, !211, !212, !213, !216, !217, !218, !222, !224, !226, !227, !228}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !207, file: !10, line: 84, baseType: !134, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !207, file: !10, line: 85, baseType: !134, size: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !207, file: !10, line: 86, baseType: !144, size: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !207, file: !10, line: 87, baseType: !126, size: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !207, file: !10, line: 88, baseType: !214, size: 64, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !207, file: !10, line: 89, baseType: !86, size: 8, offset: 320)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !207, file: !10, line: 90, baseType: !134, size: 64, offset: 384)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !207, file: !10, line: 91, baseType: !219, size: 64, offset: 448)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !220, line: 46, baseType: !221)
!220 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!221 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !207, file: !10, line: 92, baseType: !223, size: 32, offset: 512)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !207, file: !10, line: 93, baseType: !225, size: 32, offset: 544)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !207, file: !10, line: 94, baseType: !205, size: 64, offset: 576)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !207, file: !10, line: 95, baseType: !134, size: 64, offset: 640)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !207, file: !10, line: 96, baseType: !144, size: 64, offset: 704)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !201, file: !10, line: 102, baseType: !134, size: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !201, file: !10, line: 102, baseType: !134, size: 64, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !201, file: !10, line: 103, baseType: !134, size: 64, offset: 256)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !201, file: !10, line: 104, baseType: !63, size: 64, offset: 320)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !201, file: !10, line: 105, baseType: !223, size: 32, offset: 384)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !201, file: !10, line: 105, baseType: !223, size: 32, offset: 416)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !201, file: !10, line: 105, baseType: !223, size: 32, offset: 448)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !201, file: !10, line: 106, baseType: !45, size: 64, offset: 512)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !201, file: !10, line: 107, baseType: !238, size: 64, offset: 576)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!241 = !{!242}
!242 = !DISubrange(count: 5)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !47, file: !48, line: 113, baseType: !244, size: 320, offset: 3648)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 320, elements: !241)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!61, !45, !144}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !47, file: !48, line: 114, baseType: !249, size: 320, offset: 3968)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 320, elements: !241)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !47, file: !48, line: 115, baseType: !223, size: 32, offset: 4288)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !47, file: !48, line: 120, baseType: !238, size: 64, offset: 4352)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !47, file: !48, line: 121, baseType: !223, size: 32, offset: 4416)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !255, line: 1451, baseType: !95)
!255 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{null, !259, !263, !263, !268}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !25, line: 11, flags: DIFlagFwdDecl)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !265, line: 21, baseType: !266)
!265 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !265, line: 21, flags: DIFlagFwdDecl)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{null, !259, !144, !263, !263, !268}
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{null, !259, !275, !263, !263, !263, !268}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !24)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{null, !259, !263, !263, !263, !161, !161, !161, !153, !280, !153, !281, !268}
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCRichardsonConvergedReason", file: !25, line: 102, baseType: !32)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{null, !144, !263, !263, !268}
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !259, !144, !268}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{null, !259, !268}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{null, !144, !268}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !259, !298, !263, !263, !268}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !300, line: 22, baseType: !301)
!300 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !300, line: 22, flags: DIFlagFwdDecl)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !259, !306, !268}
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!307 = !{i32 7, !"Dwarf Version", i32 4}
!308 = !{i32 2, !"Debug Info Version", i32 3}
!309 = !{i32 1, !"wchar_size", i32 4}
