; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/interface/ftn-auto/vectorf.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/interface/ftn-auto/vectorf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._p_Vec = type opaque
%struct._p_ISLocalToGlobalMapping = type opaque
%struct._p_PetscRandom = type opaque
%struct._p_PetscViewer = type opaque
%struct._n_PetscLayout = type { %struct.ompi_communicator_t*, i32, i32, i32, i32, i32, i32*, i32, i32, i32, %struct._p_ISLocalToGlobalMapping*, i32, i32, i32, i32 }
%struct.ompi_communicator_t = type opaque

; Function Attrs: nounwind uwtable
define void @vecstashgetinfo_(%struct._p_Vec* nocapture readonly %0, i32* %1, i32* %2, i32* %3, i32* %4, i32* nocapture %5) local_unnamed_addr #0 !dbg !78 {
  call void @llvm.dbg.value(metadata %struct._p_Vec* %0, metadata !84, metadata !DIExpression()), !dbg !90
  call void @llvm.dbg.value(metadata i32* %1, metadata !85, metadata !DIExpression()), !dbg !90
  call void @llvm.dbg.value(metadata i32* %2, metadata !86, metadata !DIExpression()), !dbg !90
  call void @llvm.dbg.value(metadata i32* %3, metadata !87, metadata !DIExpression()), !dbg !90
  call void @llvm.dbg.value(metadata i32* %4, metadata !88, metadata !DIExpression()), !dbg !90
  call void @llvm.dbg.value(metadata i32* %5, metadata !89, metadata !DIExpression()), !dbg !90

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !22, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/interface/ftn-auto/vectorf.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!2 = !{!3, !10, !15}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 475, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "VEC_IGNORE_OFF_PROC_ENTRIES", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "VEC_IGNORE_NEGATIVE_INDICES", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "VEC_SUBSET_OFF_PROC_ENTRIES", value: 2, isUnsigned: true)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !11, line: 170, baseType: !5, size: 32, elements: !12)
!11 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!12 = !{!13, !14}
!13 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!14 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 472, baseType: !5, size: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21}
!17 = !DIEnumerator(name: "PETSC_OFFLOAD_UNALLOCATED", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "PETSC_OFFLOAD_CPU", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "PETSC_OFFLOAD_GPU", value: 2, isUnsigned: true)
!20 = !DIEnumerator(name: "PETSC_OFFLOAD_BOTH", value: 3, isUnsigned: true)
!21 = !DIEnumerator(name: "PETSC_OFFLOAD_VECKOKKOS", value: 256, isUnsigned: true)
!22 = !{!23, !26, !32, !36, !39, !43}
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !4, line: 21, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !4, line: 21, flags: DIFlagFwdDecl)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranAddr", file: !28, line: 135, baseType: !29)
!28 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/fortranimpl.h", directory: "/home/users/ndemeye/xSDK")
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !30, line: 100, baseType: !31)
!30 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!31 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !33, line: 30, baseType: !34)
!33 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !33, line: 30, flags: DIFlagFwdDecl)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !11, line: 523, baseType: !37)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !11, line: 523, flags: DIFlagFwdDecl)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !40, line: 16, baseType: !41)
!40 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !40, line: 16, flags: DIFlagFwdDecl)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !33, line: 60, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !46, line: 240, size: 640, elements: !47)
!46 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!47 = !{!48, !53, !56, !58, !59, !60, !61, !63, !65, !66, !67, !68, !69, !70, !71}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !45, file: !46, line: 241, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !50, line: 330, baseType: !51)
!50 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !50, line: 330, flags: DIFlagFwdDecl)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !45, file: !46, line: 242, baseType: !54, size: 32, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !11, line: 49, baseType: !55)
!55 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !45, file: !46, line: 243, baseType: !57, size: 32, offset: 96)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !11, line: 102, baseType: !55)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !45, file: !46, line: 243, baseType: !57, size: 32, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !45, file: !46, line: 244, baseType: !57, size: 32, offset: 160)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !45, file: !46, line: 244, baseType: !57, size: 32, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !45, file: !46, line: 245, baseType: !62, size: 64, offset: 256)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !45, file: !46, line: 246, baseType: !64, size: 32, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !11, line: 170, baseType: !10)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !45, file: !46, line: 247, baseType: !57, size: 32, offset: 352)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !45, file: !46, line: 251, baseType: !57, size: 32, offset: 384)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !45, file: !46, line: 252, baseType: !32, size: 64, offset: 448)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !45, file: !46, line: 253, baseType: !64, size: 32, offset: 512)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !45, file: !46, line: 254, baseType: !57, size: 32, offset: 544)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !45, file: !46, line: 254, baseType: !57, size: 32, offset: 576)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !45, file: !46, line: 255, baseType: !57, size: 32, offset: 608)
!72 = !{i32 7, !"Dwarf Version", i32 4}
!73 = !{i32 2, !"Debug Info Version", i32 3}
!74 = !{i32 1, !"wchar_size", i32 4}
!75 = !{i32 7, !"PIC Level", i32 2}
!76 = !{i32 7, !"uwtable", i32 1}
!77 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!78 = distinct !DISubprogram(name: "vecstashgetinfo_", scope: !79, file: !79, line: 197, type: !80, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !83)
!79 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/vec/interface/ftn-auto/vectorf.c", directory: "/home/users/ndemeye/xSDK")
!80 = !DISubroutineType(types: !81)
!81 = !{null, !23, !62, !62, !62, !62, !82}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!83 = !{!84, !85, !86, !87, !88, !89}
!84 = !DILocalVariable(name: "vec", arg: 1, scope: !78, file: !79, line: 197, type: !23)
!85 = !DILocalVariable(name: "nstash", arg: 2, scope: !78, file: !79, line: 197, type: !62)
!86 = !DILocalVariable(name: "reallocs", arg: 3, scope: !78, file: !79, line: 197, type: !62)
!87 = !DILocalVariable(name: "bnstash", arg: 4, scope: !78, file: !79, line: 197, type: !62)
!88 = !DILocalVariable(name: "breallocs", arg: 5, scope: !78, file: !79, line: 197, type: !62)
!89 = !DILocalVariable(name: "__ierr", arg: 6, scope: !78, file: !79, line: 197, type: !82)
!90 = !DILocation(line: 0, scope: !78)
!91 = !DILocation(line: 200, column: 7, scope: !78)
!92 = !{!93, !93, i64 0}
!93 = !{!"long", !94, i64 0}
!94 = !{!"omnipotent char", !95, i64 0}
!95 = !{!"Simple C/C++ TBAA"}
!96 = !DILocation(line: 200, column: 2, scope: !78)
!97 = !DILocation(line: 199, column: 11, scope: !78)
!98 = !DILocation(line: 199, column: 9, scope: !78)
!99 = !{!100, !100, i64 0}
!100 = !{!"int", !94, i64 0}
!101 = !DILocation(line: 201, column: 1, scope: !78)
!102 = !DISubprogram(name: "VecStashGetInfo", scope: !4, file: !4, line: 277, type: !103, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !105)
!103 = !DISubroutineType(types: !104)
!104 = !{!55, !24, !82, !82, !82, !82}
!105 = !{}
!106 = distinct !DISubprogram(name: "vecsetlocaltoglobalmapping_", scope: !79, file: !79, line: 202, type: !107, scopeLine: 203, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !109)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !23, !32, !82}
!109 = !{!110, !111, !112}
!110 = !DILocalVariable(name: "x", arg: 1, scope: !106, file: !79, line: 202, type: !23)
!111 = !DILocalVariable(name: "mapping", arg: 2, scope: !106, file: !79, line: 202, type: !32)
!112 = !DILocalVariable(name: "__ierr", arg: 3, scope: !106, file: !79, line: 202, type: !82)
!113 = !DILocation(line: 0, scope: !106)
!114 = !DILocation(line: 205, column: 7, scope: !106)
!115 = !DILocation(line: 205, column: 2, scope: !106)
!116 = !DILocation(line: 206, column: 26, scope: !106)
!117 = !DILocation(line: 206, column: 2, scope: !106)
!118 = !DILocation(line: 204, column: 11, scope: !106)
!119 = !DILocation(line: 204, column: 9, scope: !106)
!120 = !DILocation(line: 207, column: 1, scope: !106)
!121 = !DISubprogram(name: "VecSetLocalToGlobalMapping", scope: !4, file: !4, line: 373, type: !122, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !105)
!122 = !DISubroutineType(types: !123)
!123 = !{!55, !24, !34}
!124 = distinct !DISubprogram(name: "vecgetlocaltoglobalmapping_", scope: !79, file: !79, line: 208, type: !125, scopeLine: 209, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !128)
!125 = !DISubroutineType(types: !126)
!126 = !{null, !23, !127, !82}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!128 = !{!129, !130, !131}
