; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/dt/interface/dtds.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/dt/interface/dtds.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._n_PetscFunctionList = type opaque
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111}
!70 = !DIEnumerator(name: "PETSC_VIEWER_DEFAULT", value: 0, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATLAB", value: 1, isUnsigned: true)
!72 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATHEMATICA", value: 2, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!103 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!104 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!105 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!106 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!107 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!108 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!109 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!110 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!111 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!112 = !{!113, !118, !122, !123, !126, !324, !290, !325, !329, !333, !334, !196, !335, !338, !206, !133, !341, !241, !182, !7}
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !114, line: 1451, baseType: !115)
!114 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{null}
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !119, line: 330, baseType: !120)
!119 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !119, line: 330, flags: DIFlagFwdDecl)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!125 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !129, line: 73, size: 4480, elements: !130)
!129 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!130 = !{!131, !134, !177, !178, !180, !183, !184, !185, !186, !194, !195, !197, !201, !205, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !218, !219, !220, !222, !223, !225, !227, !228, !229, !230, !231, !234, !236, !237, !238, !239, !240, !243, !245, !246, !247, !257, !259, !260, !264, !265, !314, !319, !321, !322, !323}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !128, file: !129, line: 74, baseType: !132, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !133)
!133 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !128, file: !129, line: 75, baseType: !135, size: 448, offset: 64)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 448, elements: !175)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !129, line: 53, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !129, line: 45, size: 448, elements: !138)
!138 = !{!139, !145, !153, !158, !162, !166, !170}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !137, file: !129, line: 46, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!143, !126, !144}
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !133)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !137, file: !129, line: 47, baseType: !146, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!143, !126, !149}
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !150, line: 16, baseType: !151)
!150 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !150, line: 16, flags: DIFlagFwdDecl)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !137, file: !129, line: 48, baseType: !154, size: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!143, !157}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !137, file: !129, line: 49, baseType: !159, size: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!143, !126, !123, !126}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !137, file: !129, line: 50, baseType: !163, size: 64, offset: 256)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!143, !126, !123, !157}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !137, file: !129, line: 51, baseType: !167, size: 64, offset: 320)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!143, !126, !123, !115}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !137, file: !129, line: 52, baseType: !171, size: 64, offset: 384)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!143, !126, !123, !174}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!175 = !{!176}
!176 = !DISubrange(count: 1)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !128, file: !129, line: 76, baseType: !118, size: 64, offset: 512)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !128, file: !129, line: 77, baseType: !179, size: 32, offset: 576)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !133)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !128, file: !129, line: 78, baseType: !181, size: 64, offset: 640)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !182)
!182 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !128, file: !129, line: 78, baseType: !181, size: 64, offset: 704)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !128, file: !129, line: 78, baseType: !181, size: 64, offset: 768)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !128, file: !129, line: 78, baseType: !181, size: 64, offset: 832)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !128, file: !129, line: 79, baseType: !187, size: 64, offset: 896)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !190, line: 27, baseType: !191)
!190 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !192, line: 43, baseType: !193)
!192 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!193 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !128, file: !129, line: 80, baseType: !179, size: 32, offset: 960)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !128, file: !129, line: 81, baseType: !196, size: 32, offset: 992)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !133)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !128, file: !129, line: 82, baseType: !198, size: 64, offset: 1024)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !128, file: !129, line: 83, baseType: !202, size: 64, offset: 1088)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !128, file: !129, line: 84, baseType: !206, size: 64, offset: 1152)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !128, file: !129, line: 85, baseType: !206, size: 64, offset: 1216)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !128, file: !129, line: 86, baseType: !206, size: 64, offset: 1280)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !128, file: !129, line: 87, baseType: !206, size: 64, offset: 1344)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !128, file: !129, line: 88, baseType: !126, size: 64, offset: 1408)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !128, file: !129, line: 89, baseType: !187, size: 64, offset: 1472)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !128, file: !129, line: 90, baseType: !206, size: 64, offset: 1536)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !128, file: !129, line: 91, baseType: !206, size: 64, offset: 1600)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !128, file: !129, line: 92, baseType: !179, size: 32, offset: 1664)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !128, file: !129, line: 93, baseType: !122, size: 64, offset: 1728)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !128, file: !129, line: 94, baseType: !217, size: 64, offset: 1792)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !188)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !128, file: !129, line: 95, baseType: !179, size: 32, offset: 1856)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !128, file: !129, line: 95, baseType: !179, size: 32, offset: 1888)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !128, file: !129, line: 96, baseType: !221, size: 64, offset: 1920)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !128, file: !129, line: 96, baseType: !221, size: 64, offset: 1984)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !128, file: !129, line: 97, baseType: !224, size: 64, offset: 2048)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !128, file: !129, line: 97, baseType: !226, size: 64, offset: 2112)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !128, file: !129, line: 98, baseType: !179, size: 32, offset: 2176)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !128, file: !129, line: 98, baseType: !179, size: 32, offset: 2208)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !128, file: !129, line: 99, baseType: !221, size: 64, offset: 2240)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !128, file: !129, line: 99, baseType: !221, size: 64, offset: 2304)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !128, file: !129, line: 100, baseType: !232, size: 64, offset: 2368)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !182)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !128, file: !129, line: 100, baseType: !235, size: 64, offset: 2432)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !128, file: !129, line: 101, baseType: !179, size: 32, offset: 2496)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !128, file: !129, line: 101, baseType: !179, size: 32, offset: 2528)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !128, file: !129, line: 102, baseType: !221, size: 64, offset: 2560)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !128, file: !129, line: 102, baseType: !221, size: 64, offset: 2624)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !128, file: !129, line: 103, baseType: !241, size: 64, offset: 2688)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !233)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !128, file: !129, line: 103, baseType: !244, size: 64, offset: 2752)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !128, file: !129, line: 104, baseType: !174, size: 64, offset: 2816)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !128, file: !129, line: 105, baseType: !179, size: 32, offset: 2880)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !128, file: !129, line: 106, baseType: !248, size: 128, offset: 2944)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 128, elements: !255)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !129, line: 64, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !129, line: 61, size: 128, elements: !252)
!252 = !{!253, !254}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !251, file: !129, line: 62, baseType: !115, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !251, file: !129, line: 63, baseType: !122, size: 64, offset: 64)
!255 = !{!256}
!256 = !DISubrange(count: 2)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !128, file: !129, line: 107, baseType: !258, size: 64, offset: 3072)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 64, elements: !255)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !128, file: !129, line: 108, baseType: !122, size: 64, offset: 3136)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !128, file: !129, line: 109, baseType: !261, size: 64, offset: 3200)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{!143, !122}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !128, file: !129, line: 111, baseType: !179, size: 32, offset: 3264)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !128, file: !129, line: 112, baseType: !266, size: 320, offset: 3328)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 320, elements: !312)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!143, !270, !126, !122}
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !273)
!273 = !{!274, !275, !300, !301, !302, !303, !304, !305, !306, !307, !308}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !272, file: !12, line: 100, baseType: !179, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !272, file: !12, line: 101, baseType: !276, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !279)
!279 = !{!280, !281, !282, !283, !284, !287, !288, !289, !293, !295, !297, !298, !299}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !278, file: !12, line: 84, baseType: !206, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !278, file: !12, line: 85, baseType: !206, size: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !278, file: !12, line: 86, baseType: !122, size: 64, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !278, file: !12, line: 87, baseType: !198, size: 64, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !278, file: !12, line: 88, baseType: !285, size: 64, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !278, file: !12, line: 89, baseType: !125, size: 8, offset: 320)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !278, file: !12, line: 90, baseType: !206, size: 64, offset: 384)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !278, file: !12, line: 91, baseType: !290, size: 64, offset: 448)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !291, line: 46, baseType: !292)
!291 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!292 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !278, file: !12, line: 92, baseType: !294, size: 32, offset: 512)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !278, file: !12, line: 93, baseType: !296, size: 32, offset: 544)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !278, file: !12, line: 94, baseType: !276, size: 64, offset: 576)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !278, file: !12, line: 95, baseType: !206, size: 64, offset: 640)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !278, file: !12, line: 96, baseType: !122, size: 64, offset: 704)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !272, file: !12, line: 102, baseType: !206, size: 64, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !272, file: !12, line: 102, baseType: !206, size: 64, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !272, file: !12, line: 103, baseType: !206, size: 64, offset: 256)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !272, file: !12, line: 104, baseType: !118, size: 64, offset: 320)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !272, file: !12, line: 105, baseType: !294, size: 32, offset: 384)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !272, file: !12, line: 105, baseType: !294, size: 32, offset: 416)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !272, file: !12, line: 105, baseType: !294, size: 32, offset: 448)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !272, file: !12, line: 106, baseType: !126, size: 64, offset: 512)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !272, file: !12, line: 107, baseType: !309, size: 64, offset: 576)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!312 = !{!313}
!313 = !DISubrange(count: 5)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !128, file: !129, line: 113, baseType: !315, size: 320, offset: 3648)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 320, elements: !312)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!143, !126, !122}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !128, file: !129, line: 114, baseType: !320, size: 320, offset: 3968)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 320, elements: !312)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !128, file: !129, line: 115, baseType: !294, size: 32, offset: 4288)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !128, file: !129, line: 120, baseType: !309, size: 64, offset: 4352)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !128, file: !129, line: 121, baseType: !294, size: 32, offset: 4416)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFE", file: !326, line: 76, baseType: !327)
!326 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscfetypes.h", directory: "/home/users/ndemeye/xSDK")
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscFE", file: !326, line: 76, flags: DIFlagFwdDecl)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFV", file: !330, line: 20, baseType: !331)
!330 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscfvtypes.h", directory: "/home/users/ndemeye/xSDK")
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscFV", file: !330, line: 20, flags: DIFlagFwdDecl)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectDestroyFunction", file: !129, line: 130, baseType: !154)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectViewFunction", file: !129, line: 131, baseType: !146)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !119, line: 331, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !119, line: 331, flags: DIFlagFwdDecl)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !119, line: 338, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !119, line: 338, flags: DIFlagFwdDecl)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!342 = !{!0, !343, !346}
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "PetscDSList", scope: !2, file: !345, line: 5, type: !198, isLocal: false, isDefinition: true)
!345 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/dm/dt/interface/dtds.c", directory: "/home/users/ndemeye/xSDK")
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "PetscDSRegisterAllCalled", scope: !2, file: !345, line: 6, type: !294, isLocal: false, isDefinition: true)
!348 = !{i32 7, !"Dwarf Version", i32 4}
!349 = !{i32 2, !"Debug Info Version", i32 3}
!350 = !{i32 1, !"wchar_size", i32 4}
!351 = !{i32 7, !"PIC Level", i32 2}
!352 = !{i32 7, !"uwtable", i32 1}
!353 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!354 = distinct !DISubprogram(name: "PetscDSRegister", scope: !345, file: !345, line: 55, type: !355, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !539)
!355 = !DISubroutineType(types: !356)
!356 = !{!143, !123, !357}
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!143, !360}
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDS", file: !361, line: 13, baseType: !362)
!361 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdstypes.h", directory: "/home/users/ndemeye/xSDK")
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDS", file: !364, line: 98, size: 7232, elements: !365)
!364 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscdsimpl.h", directory: "/home/users/ndemeye/xSDK")
!365 = !{!366, !368, !379, !380, !382, !383, !384, !385, !386, !387, !474, !475, !477, !478, !479, !491, !497, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !363, file: !364, line: 99, baseType: !367, size: 4480)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !129, line: 122, baseType: !128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !363, file: !364, line: 99, baseType: !369, size: 256, offset: 4480)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 256, elements: !175)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscDSOps", file: !364, line: 91, size: 256, elements: !371)
!371 = !{!372, !373, !374, !378}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !370, file: !364, line: 92, baseType: !357, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !370, file: !364, line: 93, baseType: !357, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !370, file: !364, line: 94, baseType: !375, size: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!143, !360, !149}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !370, file: !364, line: 95, baseType: !357, size: 64, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !363, file: !364, line: 100, baseType: !122, size: 64, offset: 4736)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "subprobs", scope: !363, file: !364, line: 101, baseType: !381, size: 64, offset: 4800)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !363, file: !364, line: 102, baseType: !294, size: 32, offset: 4864)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "isHybrid", scope: !363, file: !364, line: 103, baseType: !294, size: 32, offset: 4896)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !363, file: !364, line: 104, baseType: !179, size: 32, offset: 4928)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !363, file: !364, line: 105, baseType: !179, size: 32, offset: 4960)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !363, file: !364, line: 106, baseType: !157, size: 64, offset: 4992)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !363, file: !364, line: 108, baseType: !388, size: 64, offset: 5056)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSBoundary", file: !364, line: 11, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DSBoundary", file: !364, line: 13, size: 832, elements: !391)
!391 = !{!392, !393, !398, !399, !400, !401, !465, !467, !468, !469, !470, !471, !472, !473}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !390, file: !364, line: 14, baseType: !123, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !390, file: !364, line: 15, baseType: !394, size: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabel", file: !395, line: 12, baseType: !396)
!395 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmlabel.h", directory: "/home/users/ndemeye/xSDK")
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMLabel", file: !395, line: 12, flags: DIFlagFwdDecl)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "lname", scope: !390, file: !364, line: 16, baseType: !123, size: 64, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "Nv", scope: !390, file: !364, line: 17, baseType: !179, size: 32, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !390, file: !364, line: 18, baseType: !224, size: 64, offset: 256)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "wf", scope: !390, file: !364, line: 19, baseType: !402, size: 64, offset: 320)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscWeakForm", file: !361, line: 22, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscWeakForm", file: !364, line: 81, size: 4992, elements: !405)
!405 = !{!406, !407, !421, !422, !423, !432}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !404, file: !364, line: 82, baseType: !367, size: 4480)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !404, file: !364, line: 82, baseType: !408, size: 256, offset: 4480)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !409, size: 256, elements: !175)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscWeakFormOps", file: !364, line: 74, size: 256, elements: !410)
!410 = !{!411, !415, !416, !420}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !409, file: !364, line: 75, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!143, !402}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !409, file: !364, line: 76, baseType: !412, size: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !409, file: !364, line: 77, baseType: !417, size: 64, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!143, !402, !149}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !409, file: !364, line: 78, baseType: !412, size: 64, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !404, file: !364, line: 83, baseType: !122, size: 64, offset: 4736)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !404, file: !364, line: 85, baseType: !179, size: 32, offset: 4800)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !404, file: !364, line: 86, baseType: !424, size: 64, offset: 4864)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunkBuffer", file: !364, line: 41, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !364, line: 36, size: 256, elements: !427)
!427 = !{!428, !429, !430, !431}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !426, file: !364, line: 37, baseType: !290, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !426, file: !364, line: 38, baseType: !290, size: 64, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "unitbytes", scope: !426, file: !364, line: 39, baseType: !290, size: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !426, file: !364, line: 40, baseType: !206, size: 64, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "form", scope: !404, file: !364, line: 87, baseType: !433, size: 64, offset: 4928)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapForm", file: !364, line: 54, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapForm_t", file: !364, line: 54, baseType: !437)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapForm_s", file: !364, line: 54, size: 320, elements: !438)
!438 = !{!439, !443, !444, !445, !446, !448, !457}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !437, file: !364, line: 54, baseType: !440, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !441, line: 166, baseType: !442)
!441 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/khash/khash.h", directory: "/home/users/ndemeye/xSDK")
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !441, line: 139, baseType: !7)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !437, file: !364, line: 54, baseType: !440, size: 32, offset: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !437, file: !364, line: 54, baseType: !440, size: 32, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !437, file: !364, line: 54, baseType: !440, size: 32, offset: 96)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !437, file: !364, line: 54, baseType: !447, size: 64, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !437, file: !364, line: 54, baseType: !449, size: 64, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFormKey", file: !361, line: 41, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscFormKey", file: !361, line: 35, size: 192, elements: !452)
!452 = !{!453, !454, !455, !456}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !451, file: !361, line: 37, baseType: !394, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !451, file: !361, line: 38, baseType: !179, size: 32, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !451, file: !361, line: 39, baseType: !179, size: 32, offset: 96)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !451, file: !361, line: 40, baseType: !179, size: 32, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !437, file: !364, line: 54, baseType: !458, size: 64, offset: 256)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunk", file: !364, line: 34, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !364, line: 30, size: 96, elements: !461)
!461 = !{!462, !463, !464}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !460, file: !364, line: 31, baseType: !179, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !460, file: !364, line: 32, baseType: !179, size: 32, offset: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !460, file: !364, line: 33, baseType: !179, size: 32, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !390, file: !364, line: 20, baseType: !466, size: 32, offset: 384)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryConditionType", file: !27, line: 60, baseType: !26)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !390, file: !364, line: 21, baseType: !179, size: 32, offset: 416)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !390, file: !364, line: 22, baseType: !179, size: 32, offset: 448)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "comps", scope: !390, file: !364, line: 23, baseType: !224, size: 64, offset: 512)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !390, file: !364, line: 24, baseType: !115, size: 64, offset: 576)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "func_t", scope: !390, file: !364, line: 25, baseType: !115, size: 64, offset: 640)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !390, file: !364, line: 26, baseType: !122, size: 64, offset: 704)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !390, file: !364, line: 27, baseType: !388, size: 64, offset: 768)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "useJacPre", scope: !363, file: !364, line: 109, baseType: !294, size: 32, offset: 5120)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "implicit", scope: !363, file: !364, line: 110, baseType: !476, size: 64, offset: 5184)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "jetDegree", scope: !363, file: !364, line: 111, baseType: !224, size: 64, offset: 5248)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "wf", scope: !363, file: !364, line: 112, baseType: !402, size: 64, offset: 5312)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !363, file: !364, line: 113, baseType: !480, size: 64, offset: 5376)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscPointFunc", file: !62, line: 563, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{null, !179, !179, !179, !485, !485, !487, !487, !487, !485, !485, !487, !487, !487, !233, !489, !179, !487, !241}
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !242)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "exactSol", scope: !363, file: !364, line: 114, baseType: !492, size: 64, offset: 5440)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSimplePointFunc", file: !62, line: 580, baseType: !494)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{!143, !179, !233, !489, !179, !241, !122}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "exactCtx", scope: !363, file: !364, line: 115, baseType: !498, size: 64, offset: 5504)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "exactSol_t", scope: !363, file: !364, line: 116, baseType: !492, size: 64, offset: 5568)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "exactCtx_t", scope: !363, file: !364, line: 117, baseType: !498, size: 64, offset: 5632)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "numConstants", scope: !363, file: !364, line: 118, baseType: !179, size: 32, offset: 5696)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "constants", scope: !363, file: !364, line: 119, baseType: !241, size: 64, offset: 5760)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !363, file: !364, line: 120, baseType: !498, size: 64, offset: 5824)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "totDim", scope: !363, file: !364, line: 122, baseType: !179, size: 32, offset: 5888)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "totComp", scope: !363, file: !364, line: 123, baseType: !179, size: 32, offset: 5920)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !363, file: !364, line: 124, baseType: !224, size: 64, offset: 5952)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "Nb", scope: !363, file: !364, line: 125, baseType: !224, size: 64, offset: 6016)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !363, file: !364, line: 126, baseType: !224, size: 64, offset: 6080)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "offDer", scope: !363, file: !364, line: 127, baseType: !224, size: 64, offset: 6144)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !363, file: !364, line: 128, baseType: !511, size: 64, offset: 6208)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscTabulation", file: !513, line: 481, baseType: !514)
!513 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdt.h", directory: "/home/users/ndemeye/xSDK")
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscTabulation", file: !513, line: 469, size: 256, elements: !516)
!516 = !{!517, !518, !519, !520, !521, !522, !523}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "K", scope: !515, file: !513, line: 470, baseType: !179, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "Nr", scope: !515, file: !513, line: 471, baseType: !179, size: 32, offset: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "Np", scope: !515, file: !513, line: 472, baseType: !179, size: 32, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "Nb", scope: !515, file: !513, line: 473, baseType: !179, size: 32, offset: 96)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !515, file: !513, line: 474, baseType: !179, size: 32, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "cdim", scope: !515, file: !513, line: 475, baseType: !179, size: 32, offset: 160)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !515, file: !513, line: 476, baseType: !235, size: 64, offset: 192)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "Tf", scope: !363, file: !364, line: 129, baseType: !511, size: 64, offset: 6272)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !363, file: !364, line: 131, baseType: !241, size: 64, offset: 6336)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "u_t", scope: !363, file: !364, line: 132, baseType: !241, size: 64, offset: 6400)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "u_x", scope: !363, file: !364, line: 133, baseType: !241, size: 64, offset: 6464)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "basisReal", scope: !363, file: !364, line: 134, baseType: !241, size: 64, offset: 6528)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "basisDerReal", scope: !363, file: !364, line: 135, baseType: !241, size: 64, offset: 6592)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "testReal", scope: !363, file: !364, line: 136, baseType: !241, size: 64, offset: 6656)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "testDerReal", scope: !363, file: !364, line: 137, baseType: !241, size: 64, offset: 6720)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !363, file: !364, line: 138, baseType: !232, size: 64, offset: 6784)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "f0", scope: !363, file: !364, line: 139, baseType: !241, size: 64, offset: 6848)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !363, file: !364, line: 139, baseType: !241, size: 64, offset: 6912)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "g0", scope: !363, file: !364, line: 140, baseType: !241, size: 64, offset: 6976)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "g1", scope: !363, file: !364, line: 140, baseType: !241, size: 64, offset: 7040)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "g2", scope: !363, file: !364, line: 140, baseType: !241, size: 64, offset: 7104)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "g3", scope: !363, file: !364, line: 140, baseType: !241, size: 64, offset: 7168)
!539 = !{!540, !541, !542, !543}
!540 = !DILocalVariable(name: "sname", arg: 1, scope: !354, file: !345, line: 55, type: !123)
!541 = !DILocalVariable(name: "function", arg: 2, scope: !354, file: !345, line: 55, type: !357)
!542 = !DILocalVariable(name: "ierr", scope: !354, file: !345, line: 57, type: !143)
!543 = !DILocalVariable(name: "ierr__", scope: !544, file: !345, line: 60, type: !143)
!544 = distinct !DILexicalBlock(scope: !354, file: !345, line: 60, column: 62)
!545 = !DILocation(line: 0, scope: !354)
!546 = !DILocation(line: 59, column: 3, scope: !547)
!547 = distinct !DILexicalBlock(scope: !548, file: !345, line: 59, column: 3)
!548 = distinct !DILexicalBlock(scope: !549, file: !345, line: 59, column: 3)
!549 = distinct !DILexicalBlock(scope: !354, file: !345, line: 59, column: 3)
!550 = !{!551, !551, i64 0}
!551 = !{!"any pointer", !552, i64 0}
!552 = !{!"omnipotent char", !553, i64 0}
!553 = !{!"Simple C/C++ TBAA"}
!554 = !DILocation(line: 59, column: 3, scope: !548)
!555 = !DILocation(line: 59, column: 3, scope: !556)
!556 = distinct !DILexicalBlock(scope: !557, file: !345, line: 59, column: 3)
!557 = distinct !DILexicalBlock(scope: !547, file: !345, line: 59, column: 3)
!558 = !{!559, !560, i64 1536}
!559 = !{!"", !552, i64 0, !552, i64 512, !552, i64 1024, !552, i64 1280, !560, i64 1536, !560, i64 1540, !552, i64 1544}
!560 = !{!"int", !552, i64 0}
!561 = !DILocation(line: 59, column: 3, scope: !557)
!562 = !DILocation(line: 59, column: 3, scope: !563)
!563 = distinct !DILexicalBlock(scope: !556, file: !345, line: 59, column: 3)
!564 = !{!560, !560, i64 0}
!565 = !{!559, !560, i64 1540}
!566 = !DILocation(line: 60, column: 10, scope: !354)
!567 = !DILocation(line: 0, scope: !544)
!568 = !DILocation(line: 60, column: 62, scope: !569)
!569 = distinct !DILexicalBlock(scope: !544, file: !345, line: 60, column: 62)
!570 = !DILocation(line: 60, column: 62, scope: !544)
!571 = !{!"branch_weights", i32 2000, i32 1}
!572 = !DILocation(line: 61, column: 3, scope: !573)
!573 = distinct !DILexicalBlock(scope: !574, file: !345, line: 61, column: 3)
!574 = distinct !DILexicalBlock(scope: !575, file: !345, line: 61, column: 3)
!575 = distinct !DILexicalBlock(scope: !354, file: !345, line: 61, column: 3)
!576 = !DILocation(line: 61, column: 3, scope: !574)
!577 = !DILocation(line: 61, column: 3, scope: !578)
!578 = distinct !DILexicalBlock(scope: !579, file: !345, line: 61, column: 3)
!579 = distinct !DILexicalBlock(scope: !573, file: !345, line: 61, column: 3)
!580 = !DILocation(line: 61, column: 3, scope: !579)
!581 = !DILocation(line: 61, column: 3, scope: !582)
!582 = distinct !DILexicalBlock(scope: !583, file: !345, line: 61, column: 3)
!583 = distinct !DILexicalBlock(scope: !578, file: !345, line: 61, column: 3)
!584 = !{!559, !552, i64 1544}
!585 = !DILocation(line: 61, column: 3, scope: !583)
!586 = !DILocation(line: 61, column: 3, scope: !587)
!587 = distinct !DILexicalBlock(scope: !582, file: !345, line: 61, column: 3)
!588 = !DILocation(line: 61, column: 3, scope: !589)
!589 = distinct !DILexicalBlock(scope: !578, file: !345, line: 61, column: 3)
!590 = !DILocation(line: 61, column: 3, scope: !591)
!591 = distinct !DILexicalBlock(scope: !589, file: !345, line: 61, column: 3)
!592 = !DILocation(line: 61, column: 3, scope: !593)
!593 = distinct !DILexicalBlock(scope: !594, file: !345, line: 61, column: 3)
!594 = distinct !DILexicalBlock(scope: !591, file: !345, line: 61, column: 3)
!595 = !DILocation(line: 61, column: 3, scope: !594)
!596 = !DILocation(line: 61, column: 3, scope: !597)
!597 = distinct !DILexicalBlock(scope: !593, file: !345, line: 61, column: 3)
!598 = !DILocation(line: 62, column: 1, scope: !354)
!599 = !DISubprogram(name: "PetscFunctionListAdd_Private", scope: !114, file: !114, line: 1564, type: !600, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !603)
