; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/color/interface/matcoloringregi.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/color/interface/matcoloringregi.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct._p_MatColoring = type { %struct._p_PetscObject, [1 x %struct._MatColoringOps], %struct._p_Mat*, i32, i32, i8*, i32, i32, double*, i32*, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!385 = distinct !DILexicalBlock(scope: !386, file: !322, line: 32, column: 37)
!386 = distinct !DILexicalBlock(scope: !383, file: !322, line: 32, column: 37)
!387 = !DILocation(line: 32, column: 37, scope: !386)
!388 = !DILocation(line: 32, column: 37, scope: !389)
!389 = distinct !DILexicalBlock(scope: !385, file: !322, line: 32, column: 37)
!390 = !DILocation(line: 33, column: 32, scope: !321)
!391 = !DILocation(line: 34, column: 10, scope: !321)
!392 = !DILocation(line: 0, scope: !321)
!393 = !DILocation(line: 0, scope: !329)
!394 = !DILocation(line: 34, column: 66, scope: !395)
!395 = distinct !DILexicalBlock(scope: !329, file: !322, line: 34, column: 66)
!396 = !DILocation(line: 34, column: 66, scope: !329)
!397 = !{!"branch_weights", i32 2000, i32 1}
!398 = !DILocation(line: 35, column: 10, scope: !321)
!399 = !DILocation(line: 0, scope: !331)
!400 = !DILocation(line: 35, column: 74, scope: !401)
!401 = distinct !DILexicalBlock(scope: !331, file: !322, line: 35, column: 74)
!402 = !DILocation(line: 35, column: 74, scope: !331)
!403 = !DILocation(line: 36, column: 10, scope: !321)
!404 = !DILocation(line: 0, scope: !333)
!405 = !DILocation(line: 36, column: 72, scope: !406)
!406 = distinct !DILexicalBlock(scope: !333, file: !322, line: 36, column: 72)
!407 = !DILocation(line: 36, column: 72, scope: !333)
!408 = !DILocation(line: 37, column: 10, scope: !321)
!409 = !DILocation(line: 0, scope: !335)
!410 = !DILocation(line: 37, column: 76, scope: !411)
!411 = distinct !DILexicalBlock(scope: !335, file: !322, line: 37, column: 76)
!412 = !DILocation(line: 37, column: 76, scope: !335)
!413 = !DILocation(line: 38, column: 10, scope: !321)
!414 = !DILocation(line: 0, scope: !337)
!415 = !DILocation(line: 38, column: 66, scope: !416)
!416 = distinct !DILexicalBlock(scope: !337, file: !322, line: 38, column: 66)
!417 = !DILocation(line: 38, column: 66, scope: !337)
!418 = !DILocation(line: 39, column: 10, scope: !321)
!419 = !DILocation(line: 0, scope: !339)
!420 = !DILocation(line: 39, column: 66, scope: !421)
!421 = distinct !DILexicalBlock(scope: !339, file: !322, line: 39, column: 66)
!422 = !DILocation(line: 39, column: 66, scope: !339)
!423 = !DILocation(line: 40, column: 10, scope: !321)
!424 = !DILocation(line: 0, scope: !341)
!425 = !DILocation(line: 40, column: 66, scope: !426)
!426 = distinct !DILexicalBlock(scope: !341, file: !322, line: 40, column: 66)
!427 = !DILocation(line: 40, column: 66, scope: !341)
!428 = !DILocation(line: 41, column: 3, scope: !429)
!429 = distinct !DILexicalBlock(scope: !430, file: !322, line: 41, column: 3)
!430 = distinct !DILexicalBlock(scope: !431, file: !322, line: 41, column: 3)
!431 = distinct !DILexicalBlock(scope: !321, file: !322, line: 41, column: 3)
!432 = !DILocation(line: 41, column: 3, scope: !430)
!433 = !DILocation(line: 41, column: 3, scope: !434)
!434 = distinct !DILexicalBlock(scope: !435, file: !322, line: 41, column: 3)
!435 = distinct !DILexicalBlock(scope: !429, file: !322, line: 41, column: 3)
!436 = !DILocation(line: 41, column: 3, scope: !435)
!437 = !DILocation(line: 41, column: 3, scope: !438)
!438 = distinct !DILexicalBlock(scope: !439, file: !322, line: 41, column: 3)
!439 = distinct !DILexicalBlock(scope: !434, file: !322, line: 41, column: 3)
!440 = !DILocation(line: 41, column: 3, scope: !439)
!441 = !DILocation(line: 41, column: 3, scope: !442)
!442 = distinct !DILexicalBlock(scope: !438, file: !322, line: 41, column: 3)
!443 = !DILocation(line: 41, column: 3, scope: !444)
!444 = distinct !DILexicalBlock(scope: !434, file: !322, line: 41, column: 3)
!445 = !DILocation(line: 41, column: 3, scope: !446)
!446 = distinct !DILexicalBlock(scope: !444, file: !322, line: 41, column: 3)
!447 = !DILocation(line: 41, column: 3, scope: !448)
!448 = distinct !DILexicalBlock(scope: !449, file: !322, line: 41, column: 3)
!449 = distinct !DILexicalBlock(scope: !446, file: !322, line: 41, column: 3)
!450 = !DILocation(line: 41, column: 3, scope: !449)
!451 = !DILocation(line: 41, column: 3, scope: !452)
!452 = distinct !DILexicalBlock(scope: !448, file: !322, line: 41, column: 3)
!453 = !DILocation(line: 42, column: 1, scope: !321)
!454 = !DISubprogram(name: "MatColoringRegister", scope: !36, file: !36, line: 1358, type: !455, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1467)
!455 = !DISubroutineType(types: !456)
!456 = !{!72, !307, !457}
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!72, !460}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatColoring", file: !462, line: 647, size: 5248, elements: !463)
!462 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!463 = !{!464, !665, !695, !1458, !1459, !1460, !1461, !1462, !1464, !1465, !1466}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !461, file: !462, line: 648, baseType: !465, size: 4480)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !466, line: 122, baseType: !467)
!466 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !466, line: 73, size: 4480, elements: !468)
!468 = !{!469, !471, !518, !519, !521, !524, !525, !526, !527, !535, !536, !538, !542, !546, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !559, !560, !561, !563, !564, !566, !568, !569, !570, !571, !572, !575, !577, !578, !579, !580, !581, !584, !586, !587, !588, !598, !600, !601, !605, !606, !655, !660, !662, !663, !664}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !467, file: !466, line: 74, baseType: !470, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !467, file: !466, line: 75, baseType: !472, size: 448, offset: 64)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 448, elements: !516)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !466, line: 53, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !466, line: 45, size: 448, elements: !475)
!475 = !{!476, !483, !491, !496, !500, !504, !511}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !474, file: !466, line: 46, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!325, !480, !482}
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !481)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !474, file: !466, line: 47, baseType: !484, size: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!325, !480, !487}
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !488, line: 16, baseType: !489)
!488 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !488, line: 16, flags: DIFlagFwdDecl)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !474, file: !466, line: 48, baseType: !492, size: 64, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!325, !495}
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !474, file: !466, line: 49, baseType: !497, size: 64, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{!325, !480, !307, !480}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !474, file: !466, line: 50, baseType: !501, size: 64, offset: 256)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!325, !480, !307, !495}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !474, file: !466, line: 51, baseType: !505, size: 64, offset: 320)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{!325, !480, !307, !508}
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{null}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !474, file: !466, line: 52, baseType: !512, size: 64, offset: 384)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!325, !480, !307, !515}
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!516 = !{!517}
!517 = !DISubrange(count: 1)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !467, file: !466, line: 76, baseType: !310, size: 64, offset: 512)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !467, file: !466, line: 77, baseType: !520, size: 32, offset: 576)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !467, file: !466, line: 78, baseType: !522, size: 64, offset: 640)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !523)
!523 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !467, file: !466, line: 78, baseType: !522, size: 64, offset: 704)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !467, file: !466, line: 78, baseType: !522, size: 64, offset: 768)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !467, file: !466, line: 78, baseType: !522, size: 64, offset: 832)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !467, file: !466, line: 79, baseType: !528, size: 64, offset: 896)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !531, line: 27, baseType: !532)
!531 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !533, line: 43, baseType: !534)
!533 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!534 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !467, file: !466, line: 80, baseType: !520, size: 32, offset: 960)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !467, file: !466, line: 81, baseType: !537, size: 32, offset: 992)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !467, file: !466, line: 82, baseType: !539, size: 64, offset: 1024)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !540)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !467, file: !466, line: 83, baseType: !543, size: 64, offset: 1088)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !544)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !467, file: !466, line: 84, baseType: !547, size: 64, offset: 1152)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !467, file: !466, line: 85, baseType: !547, size: 64, offset: 1216)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !467, file: !466, line: 86, baseType: !547, size: 64, offset: 1280)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !467, file: !466, line: 87, baseType: !547, size: 64, offset: 1344)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !467, file: !466, line: 88, baseType: !480, size: 64, offset: 1408)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !467, file: !466, line: 89, baseType: !528, size: 64, offset: 1472)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !467, file: !466, line: 90, baseType: !547, size: 64, offset: 1536)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !467, file: !466, line: 91, baseType: !547, size: 64, offset: 1600)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !467, file: !466, line: 92, baseType: !520, size: 32, offset: 1664)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !467, file: !466, line: 93, baseType: !314, size: 64, offset: 1728)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !467, file: !466, line: 94, baseType: !558, size: 64, offset: 1792)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !529)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !467, file: !466, line: 95, baseType: !520, size: 32, offset: 1856)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !467, file: !466, line: 95, baseType: !520, size: 32, offset: 1888)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !467, file: !466, line: 96, baseType: !562, size: 64, offset: 1920)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !467, file: !466, line: 96, baseType: !562, size: 64, offset: 1984)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !467, file: !466, line: 97, baseType: !565, size: 64, offset: 2048)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !467, file: !466, line: 97, baseType: !567, size: 64, offset: 2112)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !467, file: !466, line: 98, baseType: !520, size: 32, offset: 2176)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !467, file: !466, line: 98, baseType: !520, size: 32, offset: 2208)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !467, file: !466, line: 99, baseType: !562, size: 64, offset: 2240)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !467, file: !466, line: 99, baseType: !562, size: 64, offset: 2304)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !467, file: !466, line: 100, baseType: !573, size: 64, offset: 2368)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !523)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !467, file: !466, line: 100, baseType: !576, size: 64, offset: 2432)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !467, file: !466, line: 101, baseType: !520, size: 32, offset: 2496)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !467, file: !466, line: 101, baseType: !520, size: 32, offset: 2528)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !467, file: !466, line: 102, baseType: !562, size: 64, offset: 2560)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !467, file: !466, line: 102, baseType: !562, size: 64, offset: 2624)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !467, file: !466, line: 103, baseType: !582, size: 64, offset: 2688)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !574)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !467, file: !466, line: 103, baseType: !585, size: 64, offset: 2752)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !467, file: !466, line: 104, baseType: !515, size: 64, offset: 2816)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !467, file: !466, line: 105, baseType: !520, size: 32, offset: 2880)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !467, file: !466, line: 106, baseType: !589, size: 128, offset: 2944)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 128, elements: !596)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !466, line: 64, baseType: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !466, line: 61, size: 128, elements: !593)
!593 = !{!594, !595}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !592, file: !466, line: 62, baseType: !508, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !592, file: !466, line: 63, baseType: !314, size: 64, offset: 64)
!596 = !{!597}
!597 = !DISubrange(count: 2)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !467, file: !466, line: 107, baseType: !599, size: 64, offset: 3072)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !520, size: 64, elements: !596)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !467, file: !466, line: 108, baseType: !314, size: 64, offset: 3136)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !467, file: !466, line: 109, baseType: !602, size: 64, offset: 3200)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!325, !314}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !467, file: !466, line: 111, baseType: !520, size: 32, offset: 3264)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !467, file: !466, line: 112, baseType: !607, size: 320, offset: 3328)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !608, size: 320, elements: !653)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!325, !611, !480, !314}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !614)
!614 = !{!615, !616, !641, !642, !643, !644, !645, !646, !647, !648, !649}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !613, file: !10, line: 100, baseType: !520, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !613, file: !10, line: 101, baseType: !617, size: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !618)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !620)
!620 = !{!621, !622, !623, !624, !625, !628, !629, !630, !634, !636, !638, !639, !640}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !619, file: !10, line: 84, baseType: !547, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !619, file: !10, line: 85, baseType: !547, size: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !619, file: !10, line: 86, baseType: !314, size: 64, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !619, file: !10, line: 87, baseType: !539, size: 64, offset: 192)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !619, file: !10, line: 88, baseType: !626, size: 64, offset: 256)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !307)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !619, file: !10, line: 89, baseType: !309, size: 8, offset: 320)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !619, file: !10, line: 90, baseType: !547, size: 64, offset: 384)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !619, file: !10, line: 91, baseType: !631, size: 64, offset: 448)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !632, line: 46, baseType: !633)
!632 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!633 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !619, file: !10, line: 92, baseType: !635, size: 32, offset: 512)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !619, file: !10, line: 93, baseType: !637, size: 32, offset: 544)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !619, file: !10, line: 94, baseType: !617, size: 64, offset: 576)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !619, file: !10, line: 95, baseType: !547, size: 64, offset: 640)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !619, file: !10, line: 96, baseType: !314, size: 64, offset: 704)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !613, file: !10, line: 102, baseType: !547, size: 64, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !613, file: !10, line: 102, baseType: !547, size: 64, offset: 192)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !613, file: !10, line: 103, baseType: !547, size: 64, offset: 256)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !613, file: !10, line: 104, baseType: !310, size: 64, offset: 320)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !613, file: !10, line: 105, baseType: !635, size: 32, offset: 384)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !613, file: !10, line: 105, baseType: !635, size: 32, offset: 416)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !613, file: !10, line: 105, baseType: !635, size: 32, offset: 448)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !613, file: !10, line: 106, baseType: !480, size: 64, offset: 512)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !613, file: !10, line: 107, baseType: !650, size: 64, offset: 576)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !651)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!653 = !{!654}
!654 = !DISubrange(count: 5)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !467, file: !466, line: 113, baseType: !656, size: 320, offset: 3648)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !657, size: 320, elements: !653)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!325, !480, !314}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !467, file: !466, line: 114, baseType: !661, size: 320, offset: 3968)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 320, elements: !653)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !467, file: !466, line: 115, baseType: !635, size: 32, offset: 4288)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !467, file: !466, line: 120, baseType: !650, size: 64, offset: 4352)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !467, file: !466, line: 121, baseType: !635, size: 32, offset: 4416)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !461, file: !462, line: 648, baseType: !666, size: 320, offset: 4480)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !667, size: 320, elements: !516)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatColoringOps", file: !462, line: 639, size: 320, elements: !668)
!668 = !{!669, !674, !678, !682, !691}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !667, file: !462, line: 640, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!325, !673}
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatColoring", file: !36, line: 1312, baseType: !460)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !667, file: !462, line: 641, baseType: !675, size: 64, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!325, !611, !673}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !667, file: !462, line: 642, baseType: !679, size: 64, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!325, !673, !487}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !667, file: !462, line: 643, baseType: !683, size: 64, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{!325, !673, !686}
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !688, line: 51, baseType: !689)
!688 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !688, line: 51, flags: DIFlagFwdDecl)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "weights", scope: !667, file: !462, line: 644, baseType: !692, size: 64, offset: 256)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!325, !673, !576, !567}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !461, file: !462, line: 649, baseType: !696, size: 64, offset: 4800)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !697)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !462, line: 436, size: 23424, elements: !699)
!699 = !{!700, !701, !1201, !1221, !1222, !1223, !1225, !1226, !1227, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1354, !1355, !1371, !1372, !1373, !1374, !1375, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1410, !1430, !1431, !1433, !1434, !1435, !1436, !1437, !1438, !1456, !1457}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !698, file: !462, line: 437, baseType: !465, size: 4480)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !698, file: !462, line: 437, baseType: !702, size: 9472, offset: 4480)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !703, size: 9472, elements: !516)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !462, line: 32, size: 9472, elements: !704)
!704 = !{!705, !714, !718, !719, !726, !730, !731, !732, !733, !734, !735, !736, !759, !763, !768, !774, !793, !798, !802, !803, !808, !813, !814, !819, !823, !827, !831, !835, !839, !840, !841, !842, !843, !847, !848, !853, !854, !855, !856, !857, !862, !869, !874, !878, !882, !886, !890, !891, !895, !896, !903, !908, !909, !910, !911, !968, !975, !976, !980, !981, !985, !986, !990, !995, !996, !1000, !1004, !1011, !1012, !1013, !1014, !1015, !1016, !1021, !1022, !1026, !1030, !1034, !1035, !1036, !1040, !1050, !1051, !1055, !1056, !1060, !1061, !1065, !1066, !1071, !1072, !1076, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1090, !1091, !1092, !1093, !1094, !1095, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1110, !1114, !1115, !1116, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1130, !1131, !1132, !1137, !1141, !1142, !1146, !1147, !1148, !1149, !1175, !1179, !1180, !1181, !1182, !1183, !1187, !1188, !1189, !1190, !1191, !1195, !1199, !1200}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !703, file: !462, line: 34, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!325, !696, !520, !709, !520, !709, !711, !713}
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !520)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !583)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !703, file: !462, line: 35, baseType: !715, size: 64, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!325, !696, !520, !565, !567, !585}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !703, file: !462, line: 36, baseType: !715, size: 64, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !703, file: !462, line: 37, baseType: !720, size: 64, offset: 192)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!325, !696, !723, !723}
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !724)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !703, file: !462, line: 38, baseType: !727, size: 64, offset: 256)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{!325, !696, !723, !723, !723}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !703, file: !462, line: 40, baseType: !720, size: 64, offset: 320)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !703, file: !462, line: 41, baseType: !727, size: 64, offset: 384)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !703, file: !462, line: 42, baseType: !720, size: 64, offset: 448)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !703, file: !462, line: 43, baseType: !727, size: 64, offset: 512)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !703, file: !462, line: 44, baseType: !720, size: 64, offset: 576)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !703, file: !462, line: 46, baseType: !727, size: 64, offset: 640)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !703, file: !462, line: 47, baseType: !737, size: 64, offset: 704)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!325, !696, !740, !740, !743}
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !688, line: 11, baseType: !741)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !688, line: 11, flags: DIFlagFwdDecl)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !745)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !747)
!747 = !{!748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !746, file: !36, line: 1227, baseType: !574, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !746, file: !36, line: 1228, baseType: !574, size: 64, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !746, file: !36, line: 1229, baseType: !574, size: 64, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !746, file: !36, line: 1230, baseType: !574, size: 64, offset: 192)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !746, file: !36, line: 1231, baseType: !574, size: 64, offset: 256)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !746, file: !36, line: 1232, baseType: !574, size: 64, offset: 320)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !746, file: !36, line: 1233, baseType: !574, size: 64, offset: 384)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !746, file: !36, line: 1234, baseType: !574, size: 64, offset: 448)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !746, file: !36, line: 1236, baseType: !574, size: 64, offset: 512)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !746, file: !36, line: 1237, baseType: !574, size: 64, offset: 576)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !746, file: !36, line: 1238, baseType: !574, size: 64, offset: 640)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !703, file: !462, line: 48, baseType: !760, size: 64, offset: 768)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!325, !696, !740, !743}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !703, file: !462, line: 49, baseType: !764, size: 64, offset: 832)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{!325, !696, !723, !574, !767, !574, !520, !520, !723}
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !703, file: !462, line: 50, baseType: !769, size: 64, offset: 896)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{!325, !696, !772, !773}
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !703, file: !462, line: 52, baseType: !775, size: 64, offset: 960)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{!325, !696, !778, !779}
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !781)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !782)
!782 = !{!783, !784, !785, !786, !787, !788, !789, !790, !791, !792}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !781, file: !36, line: 593, baseType: !522, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !781, file: !36, line: 594, baseType: !522, size: 64, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !781, file: !36, line: 594, baseType: !522, size: 64, offset: 128)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !781, file: !36, line: 594, baseType: !522, size: 64, offset: 192)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !781, file: !36, line: 595, baseType: !522, size: 64, offset: 256)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !781, file: !36, line: 596, baseType: !522, size: 64, offset: 320)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !781, file: !36, line: 597, baseType: !522, size: 64, offset: 384)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !781, file: !36, line: 598, baseType: !522, size: 64, offset: 448)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !781, file: !36, line: 598, baseType: !522, size: 64, offset: 512)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !781, file: !36, line: 599, baseType: !522, size: 64, offset: 576)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !703, file: !462, line: 53, baseType: !794, size: 64, offset: 1024)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{!325, !696, !696, !797}
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !703, file: !462, line: 54, baseType: !799, size: 64, offset: 1088)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!325, !696, !723}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !703, file: !462, line: 55, baseType: !720, size: 64, offset: 1152)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !703, file: !462, line: 56, baseType: !804, size: 64, offset: 1216)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!325, !696, !807, !573}
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !703, file: !462, line: 58, baseType: !809, size: 64, offset: 1280)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!325, !696, !812}
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !703, file: !462, line: 59, baseType: !809, size: 64, offset: 1344)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !703, file: !462, line: 60, baseType: !815, size: 64, offset: 1408)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DISubroutineType(types: !817)
!817 = !{!325, !696, !818, !635}
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !703, file: !462, line: 61, baseType: !820, size: 64, offset: 1472)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{!325, !696}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !703, file: !462, line: 63, baseType: !824, size: 64, offset: 1536)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DISubroutineType(types: !826)
!826 = !{!325, !696, !520, !709, !583, !723, !723}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !703, file: !462, line: 64, baseType: !828, size: 64, offset: 1600)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DISubroutineType(types: !830)
!830 = !{!325, !696, !696, !740, !740, !743}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !703, file: !462, line: 65, baseType: !832, size: 64, offset: 1664)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DISubroutineType(types: !834)
!834 = !{!325, !696, !696, !743}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !703, file: !462, line: 66, baseType: !836, size: 64, offset: 1728)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{!325, !696, !696, !740, !743}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !703, file: !462, line: 67, baseType: !832, size: 64, offset: 1792)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !703, file: !462, line: 69, baseType: !820, size: 64, offset: 1856)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !703, file: !462, line: 70, baseType: !828, size: 64, offset: 1920)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !703, file: !462, line: 71, baseType: !836, size: 64, offset: 1984)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !703, file: !462, line: 72, baseType: !844, size: 64, offset: 2048)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DISubroutineType(types: !846)
!846 = !{!325, !696, !773}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !703, file: !462, line: 73, baseType: !820, size: 64, offset: 2112)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !703, file: !462, line: 75, baseType: !849, size: 64, offset: 2176)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DISubroutineType(types: !851)
!851 = !{!325, !696, !852, !773}
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !703, file: !462, line: 76, baseType: !720, size: 64, offset: 2240)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !703, file: !462, line: 77, baseType: !720, size: 64, offset: 2304)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !703, file: !462, line: 78, baseType: !737, size: 64, offset: 2368)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !703, file: !462, line: 79, baseType: !760, size: 64, offset: 2432)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !703, file: !462, line: 81, baseType: !858, size: 64, offset: 2496)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{!325, !696, !583, !696, !861}
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !703, file: !462, line: 82, baseType: !863, size: 64, offset: 2560)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{!325, !696, !520, !866, !866, !772, !868}
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !740)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !703, file: !462, line: 83, baseType: !870, size: 64, offset: 2624)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DISubroutineType(types: !872)
!872 = !{!325, !696, !520, !873, !520}
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !703, file: !462, line: 84, baseType: !875, size: 64, offset: 2688)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!325, !696, !520, !709, !520, !709, !582}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !703, file: !462, line: 85, baseType: !879, size: 64, offset: 2752)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{!325, !696, !696, !861}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !703, file: !462, line: 87, baseType: !883, size: 64, offset: 2816)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DISubroutineType(types: !885)
!885 = !{!325, !696, !723, !565}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !703, file: !462, line: 88, baseType: !887, size: 64, offset: 2880)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{!325, !696, !583}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !703, file: !462, line: 89, baseType: !887, size: 64, offset: 2944)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !703, file: !462, line: 90, baseType: !892, size: 64, offset: 3008)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DISubroutineType(types: !894)
!894 = !{!325, !696, !723, !713}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !703, file: !462, line: 91, baseType: !824, size: 64, offset: 3072)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !703, file: !462, line: 93, baseType: !897, size: 64, offset: 3136)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DISubroutineType(types: !899)
!899 = !{!325, !696, !900}
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !901)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !703, file: !462, line: 94, baseType: !904, size: 64, offset: 3200)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{!325, !696, !520, !635, !635, !565, !907, !907, !797}
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !703, file: !462, line: 95, baseType: !904, size: 64, offset: 3264)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !703, file: !462, line: 96, baseType: !904, size: 64, offset: 3328)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !703, file: !462, line: 97, baseType: !904, size: 64, offset: 3392)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !703, file: !462, line: 99, baseType: !912, size: 64, offset: 3456)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{!325, !696, !687, !915}
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !916)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !462, line: 609, size: 6208, elements: !918)
!918 = !{!919, !920, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !939, !946, !947, !948, !949, !950, !951, !952, !953, !955, !956, !957, !958, !959, !961, !962, !963, !964, !965, !966, !967}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !917, file: !462, line: 610, baseType: !465, size: 4480)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !917, file: !462, line: 610, baseType: !921, size: 32, offset: 4480)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !516)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !917, file: !462, line: 611, baseType: !520, size: 32, offset: 4512)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !917, file: !462, line: 611, baseType: !520, size: 32, offset: 4544)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !917, file: !462, line: 611, baseType: !520, size: 32, offset: 4576)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !917, file: !462, line: 612, baseType: !520, size: 32, offset: 4608)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !917, file: !462, line: 613, baseType: !520, size: 32, offset: 4640)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !917, file: !462, line: 614, baseType: !565, size: 64, offset: 4672)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !917, file: !462, line: 615, baseType: !567, size: 64, offset: 4736)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !917, file: !462, line: 616, baseType: !873, size: 64, offset: 4800)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !917, file: !462, line: 617, baseType: !565, size: 64, offset: 4864)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !917, file: !462, line: 618, baseType: !932, size: 64, offset: 4928)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !462, line: 602, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !462, line: 598, size: 128, elements: !935)
!935 = !{!936, !937, !938}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !934, file: !462, line: 599, baseType: !520, size: 32)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !934, file: !462, line: 600, baseType: !520, size: 32, offset: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !934, file: !462, line: 601, baseType: !582, size: 64, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !917, file: !462, line: 619, baseType: !940, size: 64, offset: 4992)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !462, line: 607, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !462, line: 604, size: 128, elements: !943)
!943 = !{!944, !945}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !942, file: !462, line: 605, baseType: !520, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !942, file: !462, line: 606, baseType: !582, size: 64, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !917, file: !462, line: 620, baseType: !582, size: 64, offset: 5056)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !917, file: !462, line: 621, baseType: !574, size: 64, offset: 5120)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !917, file: !462, line: 622, baseType: !574, size: 64, offset: 5184)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !917, file: !462, line: 623, baseType: !723, size: 64, offset: 5248)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !917, file: !462, line: 623, baseType: !723, size: 64, offset: 5312)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !917, file: !462, line: 623, baseType: !723, size: 64, offset: 5376)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !917, file: !462, line: 624, baseType: !635, size: 32, offset: 5440)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !917, file: !462, line: 625, baseType: !954, size: 64, offset: 5504)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !917, file: !462, line: 626, baseType: !314, size: 64, offset: 5568)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !917, file: !462, line: 627, baseType: !723, size: 64, offset: 5632)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !917, file: !462, line: 628, baseType: !520, size: 32, offset: 5696)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !917, file: !462, line: 629, baseType: !307, size: 64, offset: 5760)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !917, file: !462, line: 630, baseType: !960, size: 32, offset: 5824)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !917, file: !462, line: 631, baseType: !520, size: 32, offset: 5856)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !917, file: !462, line: 631, baseType: !520, size: 32, offset: 5888)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !917, file: !462, line: 632, baseType: !635, size: 32, offset: 5920)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !917, file: !462, line: 633, baseType: !635, size: 32, offset: 5952)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !917, file: !462, line: 634, baseType: !508, size: 64, offset: 6016)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !917, file: !462, line: 634, baseType: !314, size: 64, offset: 6080)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !917, file: !462, line: 635, baseType: !528, size: 64, offset: 6144)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !703, file: !462, line: 100, baseType: !969, size: 64, offset: 3520)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!325, !696, !520, !520, !972, !686}
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !974)
!974 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !703, file: !462, line: 101, baseType: !820, size: 64, offset: 3584)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !703, file: !462, line: 102, baseType: !977, size: 64, offset: 3648)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!325, !696, !740, !740, !773}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !703, file: !462, line: 103, baseType: !706, size: 64, offset: 3712)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !703, file: !462, line: 105, baseType: !982, size: 64, offset: 3776)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!325, !696, !740, !740, !772, !773}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !703, file: !462, line: 106, baseType: !820, size: 64, offset: 3840)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !703, file: !462, line: 107, baseType: !987, size: 64, offset: 3904)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!325, !696, !487}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !703, file: !462, line: 108, baseType: !991, size: 64, offset: 3968)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!325, !696, !994, !772, !773}
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !307)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !703, file: !462, line: 109, baseType: !954, size: 64, offset: 4032)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !703, file: !462, line: 111, baseType: !997, size: 64, offset: 4096)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!325, !696, !696, !696, !574, !696}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !703, file: !462, line: 112, baseType: !1001, size: 64, offset: 4160)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!325, !696, !696, !696, !696}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !703, file: !462, line: 113, baseType: !1005, size: 64, offset: 4224)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!325, !696, !1008, !1008}
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !688, line: 30, baseType: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !688, line: 30, flags: DIFlagFwdDecl)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !703, file: !462, line: 114, baseType: !706, size: 64, offset: 4288)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !703, file: !462, line: 115, baseType: !824, size: 64, offset: 4352)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !703, file: !462, line: 117, baseType: !883, size: 64, offset: 4416)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !703, file: !462, line: 118, baseType: !883, size: 64, offset: 4480)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !703, file: !462, line: 119, baseType: !991, size: 64, offset: 4544)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !703, file: !462, line: 120, baseType: !1017, size: 64, offset: 4608)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!325, !696, !1020, !797}
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !703, file: !462, line: 121, baseType: !954, size: 64, offset: 4672)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !703, file: !462, line: 123, baseType: !1023, size: 64, offset: 4736)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!325, !696, !520, !314}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !703, file: !462, line: 124, baseType: !1027, size: 64, offset: 4800)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!325, !696, !915, !723, !314}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !703, file: !462, line: 125, baseType: !1031, size: 64, offset: 4864)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!325, !611, !696}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !703, file: !462, line: 126, baseType: !720, size: 64, offset: 4928)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !703, file: !462, line: 127, baseType: !720, size: 64, offset: 4992)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !703, file: !462, line: 129, baseType: !1037, size: 64, offset: 5056)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!325, !696, !873}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !703, file: !462, line: 130, baseType: !1041, size: 64, offset: 5120)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!325, !696, !1044, !1044}
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !1045)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !1047)
!1047 = !{!1048, !1049}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1046, file: !60, line: 653, baseType: !520, size: 32)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1046, file: !60, line: 653, baseType: !723, size: 64, offset: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !703, file: !462, line: 131, baseType: !1041, size: 64, offset: 5184)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !703, file: !462, line: 132, baseType: !1052, size: 64, offset: 5248)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!325, !696, !565, !565, !565}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !703, file: !462, line: 133, baseType: !987, size: 64, offset: 5312)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !703, file: !462, line: 135, baseType: !1057, size: 64, offset: 5376)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!325, !696, !574, !797}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !703, file: !462, line: 136, baseType: !1057, size: 64, offset: 5440)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !703, file: !462, line: 137, baseType: !1062, size: 64, offset: 5504)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!325, !696, !797}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !703, file: !462, line: 138, baseType: !706, size: 64, offset: 5568)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !703, file: !462, line: 139, baseType: !1067, size: 64, offset: 5632)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!325, !696, !1070, !1070}
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !703, file: !462, line: 141, baseType: !954, size: 64, offset: 5696)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !703, file: !462, line: 142, baseType: !1073, size: 64, offset: 5760)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!325, !696, !696, !574, !696}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !703, file: !462, line: 143, baseType: !1077, size: 64, offset: 5824)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!325, !696, !696, !696}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !703, file: !462, line: 144, baseType: !954, size: 64, offset: 5888)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !703, file: !462, line: 145, baseType: !1073, size: 64, offset: 5952)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !703, file: !462, line: 147, baseType: !1077, size: 64, offset: 6016)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !703, file: !462, line: 148, baseType: !954, size: 64, offset: 6080)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !703, file: !462, line: 149, baseType: !1073, size: 64, offset: 6144)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !703, file: !462, line: 150, baseType: !1077, size: 64, offset: 6208)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !703, file: !462, line: 151, baseType: !1087, size: 64, offset: 6272)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!325, !696, !635}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !703, file: !462, line: 153, baseType: !820, size: 64, offset: 6336)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !703, file: !462, line: 154, baseType: !820, size: 64, offset: 6400)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !703, file: !462, line: 155, baseType: !820, size: 64, offset: 6464)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !703, file: !462, line: 156, baseType: !820, size: 64, offset: 6528)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !703, file: !462, line: 157, baseType: !987, size: 64, offset: 6592)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !703, file: !462, line: 159, baseType: !1096, size: 64, offset: 6656)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!325, !696, !520, !711}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !703, file: !462, line: 160, baseType: !820, size: 64, offset: 6720)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !703, file: !462, line: 161, baseType: !820, size: 64, offset: 6784)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !703, file: !462, line: 162, baseType: !820, size: 64, offset: 6848)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !703, file: !462, line: 163, baseType: !820, size: 64, offset: 6912)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !703, file: !462, line: 165, baseType: !1077, size: 64, offset: 6976)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !703, file: !462, line: 166, baseType: !1077, size: 64, offset: 7040)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !703, file: !462, line: 167, baseType: !883, size: 64, offset: 7104)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !703, file: !462, line: 168, baseType: !1107, size: 64, offset: 7168)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{!325, !696, !723, !520}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !703, file: !462, line: 169, baseType: !1111, size: 64, offset: 7232)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!325, !696, !797, !565}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !703, file: !462, line: 171, baseType: !844, size: 64, offset: 7296)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !703, file: !462, line: 172, baseType: !820, size: 64, offset: 7360)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !703, file: !462, line: 173, baseType: !1117, size: 64, offset: 7424)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!325, !696, !565, !907}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !703, file: !462, line: 174, baseType: !977, size: 64, offset: 7488)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !703, file: !462, line: 175, baseType: !977, size: 64, offset: 7552)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !703, file: !462, line: 177, baseType: !720, size: 64, offset: 7616)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !703, file: !462, line: 178, baseType: !769, size: 64, offset: 7680)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !703, file: !462, line: 179, baseType: !720, size: 64, offset: 7744)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !703, file: !462, line: 180, baseType: !727, size: 64, offset: 7808)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !703, file: !462, line: 181, baseType: !1127, size: 64, offset: 7872)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!325, !696, !310, !772, !773}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !703, file: !462, line: 183, baseType: !1037, size: 64, offset: 7936)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !703, file: !462, line: 184, baseType: !804, size: 64, offset: 8000)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !703, file: !462, line: 185, baseType: !1133, size: 64, offset: 8064)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{!325, !696, !1136}
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !703, file: !462, line: 186, baseType: !1138, size: 64, offset: 8128)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!325, !696, !520, !709, !582}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !703, file: !462, line: 187, baseType: !863, size: 64, offset: 8192)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !703, file: !462, line: 189, baseType: !1143, size: 64, offset: 8256)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!325, !696, !520, !520, !565, !711}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !703, file: !462, line: 190, baseType: !954, size: 64, offset: 8320)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !703, file: !462, line: 191, baseType: !1073, size: 64, offset: 8384)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !703, file: !462, line: 192, baseType: !1077, size: 64, offset: 8448)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !703, file: !462, line: 193, baseType: !1150, size: 64, offset: 8512)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!325, !696, !687, !1153}
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1154)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !462, line: 660, size: 5312, elements: !1156)
!1156 = !{!1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1155, file: !462, line: 661, baseType: !465, size: 4480)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1155, file: !462, line: 661, baseType: !921, size: 32, offset: 4480)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1155, file: !462, line: 662, baseType: !520, size: 32, offset: 4512)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1155, file: !462, line: 662, baseType: !520, size: 32, offset: 4544)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1155, file: !462, line: 662, baseType: !520, size: 32, offset: 4576)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1155, file: !462, line: 663, baseType: !520, size: 32, offset: 4608)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1155, file: !462, line: 664, baseType: !520, size: 32, offset: 4640)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1155, file: !462, line: 665, baseType: !565, size: 64, offset: 4672)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1155, file: !462, line: 666, baseType: !565, size: 64, offset: 4736)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1155, file: !462, line: 667, baseType: !520, size: 32, offset: 4800)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1155, file: !462, line: 668, baseType: !960, size: 32, offset: 4832)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1155, file: !462, line: 670, baseType: !565, size: 64, offset: 4864)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1155, file: !462, line: 670, baseType: !565, size: 64, offset: 4928)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1155, file: !462, line: 671, baseType: !565, size: 64, offset: 4992)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1155, file: !462, line: 672, baseType: !565, size: 64, offset: 5056)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1155, file: !462, line: 673, baseType: !565, size: 64, offset: 5120)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1155, file: !462, line: 674, baseType: !520, size: 32, offset: 5184)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1155, file: !462, line: 675, baseType: !565, size: 64, offset: 5248)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !703, file: !462, line: 195, baseType: !1176, size: 64, offset: 8576)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = !DISubroutineType(types: !1178)
!1178 = !{!325, !1153, !696, !696}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !703, file: !462, line: 196, baseType: !1176, size: 64, offset: 8640)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !703, file: !462, line: 197, baseType: !954, size: 64, offset: 8704)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !703, file: !462, line: 198, baseType: !1073, size: 64, offset: 8768)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !703, file: !462, line: 199, baseType: !1077, size: 64, offset: 8832)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !703, file: !462, line: 201, baseType: !1184, size: 64, offset: 8896)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{!325, !696, !520, !520}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !703, file: !462, line: 202, baseType: !858, size: 64, offset: 8960)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !703, file: !462, line: 203, baseType: !727, size: 64, offset: 9024)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !703, file: !462, line: 204, baseType: !912, size: 64, offset: 9088)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !703, file: !462, line: 205, baseType: !1037, size: 64, offset: 9152)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !703, file: !462, line: 206, baseType: !1192, size: 64, offset: 9216)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1193 = !DISubroutineType(types: !1194)
!1194 = !{!325, !310, !696, !520, !772, !773}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !703, file: !462, line: 208, baseType: !1196, size: 64, offset: 9280)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{!325, !520, !868}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !703, file: !462, line: 209, baseType: !1077, size: 64, offset: 9344)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !703, file: !462, line: 210, baseType: !875, size: 64, offset: 9408)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !698, file: !462, line: 438, baseType: !1202, size: 64, offset: 13952)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !688, line: 60, baseType: !1203)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1205)
!1205 = !{!1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1204, file: !114, line: 241, baseType: !310, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1204, file: !114, line: 242, baseType: !537, size: 32, offset: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1204, file: !114, line: 243, baseType: !520, size: 32, offset: 96)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1204, file: !114, line: 243, baseType: !520, size: 32, offset: 128)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1204, file: !114, line: 244, baseType: !520, size: 32, offset: 160)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1204, file: !114, line: 244, baseType: !520, size: 32, offset: 192)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1204, file: !114, line: 245, baseType: !565, size: 64, offset: 256)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1204, file: !114, line: 246, baseType: !635, size: 32, offset: 320)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1204, file: !114, line: 247, baseType: !520, size: 32, offset: 352)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1204, file: !114, line: 251, baseType: !520, size: 32, offset: 384)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1204, file: !114, line: 252, baseType: !1008, size: 64, offset: 448)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1204, file: !114, line: 253, baseType: !635, size: 32, offset: 512)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1204, file: !114, line: 254, baseType: !520, size: 32, offset: 544)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1204, file: !114, line: 254, baseType: !520, size: 32, offset: 576)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1204, file: !114, line: 255, baseType: !520, size: 32, offset: 608)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !698, file: !462, line: 438, baseType: !1202, size: 64, offset: 14016)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !698, file: !462, line: 439, baseType: !314, size: 64, offset: 14080)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !698, file: !462, line: 440, baseType: !1224, size: 32, offset: 14144)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !698, file: !462, line: 441, baseType: !635, size: 32, offset: 14176)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !698, file: !462, line: 442, baseType: !635, size: 32, offset: 14208)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !698, file: !462, line: 443, baseType: !1228, size: 448, offset: 14272)
!1228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1229, size: 448, elements: !1230)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !307)
!1230 = !{!1231}
!1231 = !DISubrange(count: 7)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !698, file: !462, line: 444, baseType: !635, size: 32, offset: 14720)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !698, file: !462, line: 445, baseType: !635, size: 32, offset: 14752)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !698, file: !462, line: 446, baseType: !520, size: 32, offset: 14784)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !698, file: !462, line: 447, baseType: !558, size: 64, offset: 14848)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !698, file: !462, line: 448, baseType: !558, size: 64, offset: 14912)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !698, file: !462, line: 449, baseType: !780, size: 640, offset: 14976)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !698, file: !462, line: 450, baseType: !713, size: 32, offset: 15616)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !698, file: !462, line: 451, baseType: !1240, size: 2880, offset: 15680)
!1240 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !462, line: 318, baseType: !1241)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !462, line: 319, size: 2880, elements: !1242)
!1242 = !{!1243, !1244, !1245, !1246, !1247, !1248, !1249, !1262, !1263, !1268, !1273, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1288, !1289, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1321, !1322, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1345, !1346, !1347, !1351, !1352}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1241, file: !462, line: 320, baseType: !520, size: 32)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1241, file: !462, line: 321, baseType: !520, size: 32, offset: 32)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1241, file: !462, line: 322, baseType: !520, size: 32, offset: 64)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1241, file: !462, line: 323, baseType: !520, size: 32, offset: 96)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1241, file: !462, line: 324, baseType: !520, size: 32, offset: 128)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1241, file: !462, line: 325, baseType: !520, size: 32, offset: 160)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1241, file: !462, line: 326, baseType: !1250, size: 64, offset: 192)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !462, line: 293, baseType: !1251)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !462, line: 295, size: 448, elements: !1253)
!1253 = !{!1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1252, file: !462, line: 296, baseType: !1250, size: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1252, file: !462, line: 297, baseType: !582, size: 64, offset: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1252, file: !462, line: 297, baseType: !582, size: 64, offset: 128)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1252, file: !462, line: 298, baseType: !565, size: 64, offset: 192)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1252, file: !462, line: 298, baseType: !565, size: 64, offset: 256)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1252, file: !462, line: 299, baseType: !520, size: 32, offset: 320)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1252, file: !462, line: 300, baseType: !520, size: 32, offset: 352)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1252, file: !462, line: 301, baseType: !520, size: 32, offset: 384)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1241, file: !462, line: 326, baseType: !1250, size: 64, offset: 256)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1241, file: !462, line: 328, baseType: !1264, size: 64, offset: 320)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64)
!1265 = !DISubroutineType(types: !1266)
!1266 = !{!325, !696, !1267, !565}
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1241, file: !462, line: 329, baseType: !1269, size: 64, offset: 384)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = !DISubroutineType(types: !1271)
!1271 = !{!325, !1267, !1272, !567, !567, !585, !565}
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1241, file: !462, line: 330, baseType: !1274, size: 64, offset: 448)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64)
!1275 = !DISubroutineType(types: !1276)
!1276 = !{!325, !1267}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1241, file: !462, line: 331, baseType: !1274, size: 64, offset: 512)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1241, file: !462, line: 334, baseType: !310, size: 64, offset: 576)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1241, file: !462, line: 335, baseType: !537, size: 32, offset: 640)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1241, file: !462, line: 335, baseType: !537, size: 32, offset: 672)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1241, file: !462, line: 336, baseType: !537, size: 32, offset: 704)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1241, file: !462, line: 336, baseType: !537, size: 32, offset: 736)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1241, file: !462, line: 337, baseType: !1284, size: 64, offset: 768)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64)
!1285 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !311, line: 339, baseType: !1286)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64)
!1287 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !311, line: 339, flags: DIFlagFwdDecl)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1241, file: !462, line: 338, baseType: !1284, size: 64, offset: 832)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1241, file: !462, line: 339, baseType: !1290, size: 64, offset: 896)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64)
!1291 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !311, line: 341, baseType: !1292)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !311, line: 351, size: 192, elements: !1293)
!1293 = !{!1294, !1295, !1296, !1297, !1298}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1292, file: !311, line: 354, baseType: !72, size: 32)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1292, file: !311, line: 355, baseType: !72, size: 32, offset: 32)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1292, file: !311, line: 356, baseType: !72, size: 32, offset: 64)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1292, file: !311, line: 361, baseType: !72, size: 32, offset: 96)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1292, file: !311, line: 362, baseType: !631, size: 64, offset: 128)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1241, file: !462, line: 340, baseType: !520, size: 32, offset: 960)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1241, file: !462, line: 340, baseType: !520, size: 32, offset: 992)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1241, file: !462, line: 341, baseType: !582, size: 64, offset: 1024)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1241, file: !462, line: 342, baseType: !565, size: 64, offset: 1088)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1241, file: !462, line: 343, baseType: !585, size: 64, offset: 1152)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1241, file: !462, line: 344, baseType: !567, size: 64, offset: 1216)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1241, file: !462, line: 345, baseType: !520, size: 32, offset: 1280)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1241, file: !462, line: 346, baseType: !1272, size: 64, offset: 1344)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1241, file: !462, line: 347, baseType: !635, size: 32, offset: 1408)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1241, file: !462, line: 348, baseType: !520, size: 32, offset: 1440)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1241, file: !462, line: 351, baseType: !635, size: 32, offset: 1472)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1241, file: !462, line: 352, baseType: !635, size: 32, offset: 1504)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1241, file: !462, line: 353, baseType: !537, size: 32, offset: 1536)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1241, file: !462, line: 354, baseType: !537, size: 32, offset: 1568)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1241, file: !462, line: 355, baseType: !1272, size: 64, offset: 1600)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1241, file: !462, line: 356, baseType: !1272, size: 64, offset: 1664)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1241, file: !462, line: 357, baseType: !1316, size: 64, offset: 1728)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64)
!1317 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !462, line: 310, baseType: !1318)
!1318 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !462, line: 308, size: 32, elements: !1319)
!1319 = !{!1320}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1318, file: !462, line: 309, baseType: !520, size: 32)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1241, file: !462, line: 357, baseType: !1316, size: 64, offset: 1792)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1241, file: !462, line: 358, baseType: !1323, size: 64, offset: 1856)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64)
!1324 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !462, line: 316, baseType: !1325)
!1325 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !462, line: 312, size: 128, elements: !1326)
!1326 = !{!1327, !1328, !1329}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1325, file: !462, line: 313, baseType: !314, size: 64)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1325, file: !462, line: 314, baseType: !520, size: 32, offset: 64)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1325, file: !462, line: 315, baseType: !309, size: 8, offset: 96)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1241, file: !462, line: 359, baseType: !1323, size: 64, offset: 1920)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1241, file: !462, line: 360, baseType: !1323, size: 64, offset: 1984)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1241, file: !462, line: 361, baseType: !520, size: 32, offset: 2048)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1241, file: !462, line: 362, baseType: !537, size: 32, offset: 2080)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1241, file: !462, line: 363, baseType: !520, size: 32, offset: 2112)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1241, file: !462, line: 364, baseType: !1272, size: 64, offset: 2176)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1241, file: !462, line: 365, baseType: !1290, size: 64, offset: 2240)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1241, file: !462, line: 366, baseType: !537, size: 32, offset: 2304)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1241, file: !462, line: 367, baseType: !537, size: 32, offset: 2336)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1241, file: !462, line: 368, baseType: !1284, size: 64, offset: 2368)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1241, file: !462, line: 369, baseType: !1284, size: 64, offset: 2432)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1241, file: !462, line: 370, baseType: !1342, size: 64, offset: 2496)
!1342 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1343)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64)
!1344 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1241, file: !462, line: 371, baseType: !1342, size: 64, offset: 2560)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1241, file: !462, line: 372, baseType: !1342, size: 64, offset: 2624)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1241, file: !462, line: 373, baseType: !1348, size: 64, offset: 2688)
!1348 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !311, line: 331, baseType: !1349)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64)
!1350 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !311, line: 331, flags: DIFlagFwdDecl)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1241, file: !462, line: 374, baseType: !631, size: 64, offset: 2752)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1241, file: !462, line: 375, baseType: !1353, size: 64, offset: 2816)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !698, file: !462, line: 451, baseType: !1240, size: 2880, offset: 18560)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !698, file: !462, line: 452, baseType: !1356, size: 64, offset: 21440)
!1356 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1357)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64)
!1358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !462, line: 681, size: 4864, elements: !1359)
!1359 = !{!1360, !1361, !1362, !1363, !1364, !1365, !1366, !1370}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1358, file: !462, line: 682, baseType: !465, size: 4480)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1358, file: !462, line: 682, baseType: !921, size: 32, offset: 4480)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1358, file: !462, line: 683, baseType: !635, size: 32, offset: 4512)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1358, file: !462, line: 684, baseType: !520, size: 32, offset: 4544)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1358, file: !462, line: 685, baseType: !1070, size: 64, offset: 4608)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1358, file: !462, line: 686, baseType: !582, size: 64, offset: 4672)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1358, file: !462, line: 687, baseType: !1367, size: 64, offset: 4736)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64)
!1368 = !DISubroutineType(types: !1369)
!1369 = !{!325, !1356, !723, !314}
