; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/scatter/mscatter.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/scatter/mscatter.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque

!315 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !316, line: 663, baseType: !7, size: 32, elements: !317)
!316 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!317 = !{!318, !319, !320}
!318 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!319 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!320 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!321 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !322)
!322 = !{!323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340}
!323 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!324 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!325 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!326 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!327 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!328 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!329 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!330 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!331 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!332 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!333 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!334 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!335 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!336 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!337 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!338 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!339 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!340 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!341 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !38, line: 30, baseType: !7, size: 32, elements: !342)
!342 = !{!343, !344, !345, !346, !347}
!343 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!344 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!345 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!346 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!347 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!348 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !349, line: 77, baseType: !7, size: 32, elements: !350)
!349 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsf.h", directory: "/home/users/ndemeye/xSDK")
!350 = !{!351, !352, !353}
!351 = !DIEnumerator(name: "PETSCSF_DUPLICATE_CONFONLY", value: 0, isUnsigned: true)
!352 = !DIEnumerator(name: "PETSCSF_DUPLICATE_RANKS", value: 1, isUnsigned: true)
!353 = !DIEnumerator(name: "PETSCSF_DUPLICATE_GRAPH", value: 2, isUnsigned: true)
!354 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !349, line: 35, baseType: !7, size: 32, elements: !355)
!355 = !{!356, !357, !358, !359}
!356 = !DIEnumerator(name: "PETSCSF_PATTERN_GENERAL", value: 0, isUnsigned: true)
!357 = !DIEnumerator(name: "PETSCSF_PATTERN_ALLGATHER", value: 1, isUnsigned: true)
!358 = !DIEnumerator(name: "PETSCSF_PATTERN_GATHER", value: 2, isUnsigned: true)
!359 = !DIEnumerator(name: "PETSCSF_PATTERN_ALLTOALL", value: 3, isUnsigned: true)
!360 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !361, line: 37, baseType: !7, size: 32, elements: !362)
!361 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sfimpl.h", directory: "/home/users/ndemeye/xSDK")
!362 = !{!363, !364, !365, !366}
!363 = !DIEnumerator(name: "PETSCSF_BACKEND_INVALID", value: 0, isUnsigned: true)
!364 = !DIEnumerator(name: "PETSCSF_BACKEND_CUDA", value: 1, isUnsigned: true)
!365 = !DIEnumerator(name: "PETSCSF_BACKEND_HIP", value: 2, isUnsigned: true)
!366 = !DIEnumerator(name: "PETSCSF_BACKEND_KOKKOS", value: 3, isUnsigned: true)
!367 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !368, line: 624, baseType: !7, size: 32, elements: !369)
!368 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!369 = !{!370, !371, !372, !373}
!370 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!371 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!372 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!373 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!374 = !{!375, !378, !379, !582, !414, !548, !464, !93}
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !368, line: 330, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !368, line: 330, flags: DIFlagFwdDecl)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !382, line: 73, size: 4480, elements: !383)
!382 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!383 = !{!384, !386, !435, !436, !438, !441, !442, !443, !444, !452, !453, !455, !459, !463, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !476, !477, !478, !480, !481, !483, !485, !486, !487, !488, !489, !492, !494, !495, !496, !497, !498, !501, !503, !504, !505, !515, !517, !518, !522, !523, !572, !577, !579, !580, !581}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !381, file: !382, line: 74, baseType: !385, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !93)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !381, file: !382, line: 75, baseType: !387, size: 448, offset: 64)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 448, elements: !433)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !382, line: 53, baseType: !389)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !382, line: 45, size: 448, elements: !390)
!390 = !{!391, !397, !405, !410, !417, !421, !428}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !389, file: !382, line: 46, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!395, !379, !396}
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !93)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !389, file: !382, line: 47, baseType: !398, size: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!395, !379, !401}
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !402, line: 16, baseType: !403)
!402 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !402, line: 16, flags: DIFlagFwdDecl)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !389, file: !382, line: 48, baseType: !406, size: 64, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!395, !409}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !389, file: !382, line: 49, baseType: !411, size: 64, offset: 192)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!395, !379, !414, !379}
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !416)
!416 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !389, file: !382, line: 50, baseType: !418, size: 64, offset: 256)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!395, !379, !414, !409}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !389, file: !382, line: 51, baseType: !422, size: 64, offset: 320)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!395, !379, !414, !425}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{null}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !389, file: !382, line: 52, baseType: !429, size: 64, offset: 384)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!395, !379, !414, !432}
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!433 = !{!434}
!434 = !DISubrange(count: 1)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !381, file: !382, line: 76, baseType: !375, size: 64, offset: 512)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !381, file: !382, line: 77, baseType: !437, size: 32, offset: 576)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !93)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !381, file: !382, line: 78, baseType: !439, size: 64, offset: 640)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !440)
!440 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !381, file: !382, line: 78, baseType: !439, size: 64, offset: 704)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !381, file: !382, line: 78, baseType: !439, size: 64, offset: 768)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !381, file: !382, line: 78, baseType: !439, size: 64, offset: 832)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !381, file: !382, line: 79, baseType: !445, size: 64, offset: 896)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !447)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !448, line: 27, baseType: !449)
!448 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !450, line: 43, baseType: !451)
!450 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!451 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !381, file: !382, line: 80, baseType: !437, size: 32, offset: 960)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !381, file: !382, line: 81, baseType: !454, size: 32, offset: 992)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !93)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !381, file: !382, line: 82, baseType: !456, size: 64, offset: 1024)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !457)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !381, file: !382, line: 83, baseType: !460, size: 64, offset: 1088)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !381, file: !382, line: 84, baseType: !464, size: 64, offset: 1152)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !381, file: !382, line: 85, baseType: !464, size: 64, offset: 1216)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !381, file: !382, line: 86, baseType: !464, size: 64, offset: 1280)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !381, file: !382, line: 87, baseType: !464, size: 64, offset: 1344)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !381, file: !382, line: 88, baseType: !379, size: 64, offset: 1408)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !381, file: !382, line: 89, baseType: !445, size: 64, offset: 1472)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !381, file: !382, line: 90, baseType: !464, size: 64, offset: 1536)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !381, file: !382, line: 91, baseType: !464, size: 64, offset: 1600)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !381, file: !382, line: 92, baseType: !437, size: 32, offset: 1664)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !381, file: !382, line: 93, baseType: !378, size: 64, offset: 1728)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !381, file: !382, line: 94, baseType: !475, size: 64, offset: 1792)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !446)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !381, file: !382, line: 95, baseType: !437, size: 32, offset: 1856)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !381, file: !382, line: 95, baseType: !437, size: 32, offset: 1888)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !381, file: !382, line: 96, baseType: !479, size: 64, offset: 1920)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !381, file: !382, line: 96, baseType: !479, size: 64, offset: 1984)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !381, file: !382, line: 97, baseType: !482, size: 64, offset: 2048)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !381, file: !382, line: 97, baseType: !484, size: 64, offset: 2112)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !381, file: !382, line: 98, baseType: !437, size: 32, offset: 2176)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !381, file: !382, line: 98, baseType: !437, size: 32, offset: 2208)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !381, file: !382, line: 99, baseType: !479, size: 64, offset: 2240)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !381, file: !382, line: 99, baseType: !479, size: 64, offset: 2304)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !381, file: !382, line: 100, baseType: !490, size: 64, offset: 2368)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !440)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !381, file: !382, line: 100, baseType: !493, size: 64, offset: 2432)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !381, file: !382, line: 101, baseType: !437, size: 32, offset: 2496)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !381, file: !382, line: 101, baseType: !437, size: 32, offset: 2528)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !381, file: !382, line: 102, baseType: !479, size: 64, offset: 2560)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !381, file: !382, line: 102, baseType: !479, size: 64, offset: 2624)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !381, file: !382, line: 103, baseType: !499, size: 64, offset: 2688)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !491)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !381, file: !382, line: 103, baseType: !502, size: 64, offset: 2752)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !381, file: !382, line: 104, baseType: !432, size: 64, offset: 2816)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !381, file: !382, line: 105, baseType: !437, size: 32, offset: 2880)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !381, file: !382, line: 106, baseType: !506, size: 128, offset: 2944)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 128, elements: !513)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !382, line: 64, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !382, line: 61, size: 128, elements: !510)
!510 = !{!511, !512}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !509, file: !382, line: 62, baseType: !425, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !509, file: !382, line: 63, baseType: !378, size: 64, offset: 64)
!513 = !{!514}
!514 = !DISubrange(count: 2)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !381, file: !382, line: 107, baseType: !516, size: 64, offset: 3072)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !437, size: 64, elements: !513)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !381, file: !382, line: 108, baseType: !378, size: 64, offset: 3136)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !381, file: !382, line: 109, baseType: !519, size: 64, offset: 3200)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{!395, !378}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !381, file: !382, line: 111, baseType: !437, size: 32, offset: 3264)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !381, file: !382, line: 112, baseType: !524, size: 320, offset: 3328)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !525, size: 320, elements: !570)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!395, !528, !379, !378}
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !531)
!531 = !{!532, !533, !558, !559, !560, !561, !562, !563, !564, !565, !566}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !530, file: !12, line: 100, baseType: !437, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !530, file: !12, line: 101, baseType: !534, size: 64, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !535)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !537)
!537 = !{!538, !539, !540, !541, !542, !545, !546, !547, !551, !553, !555, !556, !557}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !536, file: !12, line: 84, baseType: !464, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !536, file: !12, line: 85, baseType: !464, size: 64, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !536, file: !12, line: 86, baseType: !378, size: 64, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !536, file: !12, line: 87, baseType: !456, size: 64, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !536, file: !12, line: 88, baseType: !543, size: 64, offset: 256)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !414)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !536, file: !12, line: 89, baseType: !416, size: 8, offset: 320)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !536, file: !12, line: 90, baseType: !464, size: 64, offset: 384)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !536, file: !12, line: 91, baseType: !548, size: 64, offset: 448)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !549, line: 46, baseType: !550)
!549 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!550 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !536, file: !12, line: 92, baseType: !552, size: 32, offset: 512)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !536, file: !12, line: 93, baseType: !554, size: 32, offset: 544)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !536, file: !12, line: 94, baseType: !534, size: 64, offset: 576)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !536, file: !12, line: 95, baseType: !464, size: 64, offset: 640)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !536, file: !12, line: 96, baseType: !378, size: 64, offset: 704)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !530, file: !12, line: 102, baseType: !464, size: 64, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !530, file: !12, line: 102, baseType: !464, size: 64, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !530, file: !12, line: 103, baseType: !464, size: 64, offset: 256)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !530, file: !12, line: 104, baseType: !375, size: 64, offset: 320)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !530, file: !12, line: 105, baseType: !552, size: 32, offset: 384)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !530, file: !12, line: 105, baseType: !552, size: 32, offset: 416)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !530, file: !12, line: 105, baseType: !552, size: 32, offset: 448)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !530, file: !12, line: 106, baseType: !379, size: 64, offset: 512)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !530, file: !12, line: 107, baseType: !567, size: 64, offset: 576)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !568)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!570 = !{!571}
!571 = !DISubrange(count: 5)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !381, file: !382, line: 113, baseType: !573, size: 320, offset: 3648)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 320, elements: !570)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!395, !379, !378}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !381, file: !382, line: 114, baseType: !578, size: 320, offset: 3968)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 320, elements: !570)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !381, file: !382, line: 115, baseType: !552, size: 32, offset: 4288)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !381, file: !382, line: 120, baseType: !567, size: 64, offset: 4352)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !381, file: !382, line: 121, baseType: !552, size: 32, offset: 4416)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_Scatter", file: !584, line: 11, baseType: !585)
!584 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/impls/scatter/mscatter.c", directory: "/home/users/ndemeye/xSDK")
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !584, line: 9, size: 64, elements: !586)
!586 = !{!587}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "scatter", scope: !585, file: !584, line: 10, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !589, line: 59, baseType: !590)
!589 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !589, line: 15, baseType: !591)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !361, line: 66, size: 8640, elements: !593)
!593 = !{!594, !596, !695, !710, !711, !712, !713, !714, !715, !716, !718, !719, !720, !721, !723, !724, !725, !727, !728, !730, !731, !736, !737, !738, !739, !740, !741, !742, !743, !744, !748, !749, !750, !751, !752, !754, !755, !779, !780, !781, !782, !783, !785}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !592, file: !361, line: 67, baseType: !595, size: 4480)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !382, line: 122, baseType: !381)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !592, file: !361, line: 67, baseType: !597, size: 1344, offset: 4480)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !598, size: 1344, elements: !433)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSFOps", file: !361, line: 39, size: 1344, elements: !599)
!599 = !{!600, !604, !605, !606, !610, !614, !619, !632, !636, !637, !638, !642, !646, !650, !660, !664, !669, !681, !685, !686, !691}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !598, file: !361, line: 40, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!395, !590}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy", scope: !598, file: !361, line: 41, baseType: !601, size: 64, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "SetUp", scope: !598, file: !361, line: 42, baseType: !601, size: 64, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "SetFromOptions", scope: !598, file: !361, line: 43, baseType: !607, size: 64, offset: 192)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{!395, !528, !590}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "View", scope: !598, file: !361, line: 44, baseType: !611, size: 64, offset: 256)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!395, !590, !401}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "Duplicate", scope: !598, file: !361, line: 45, baseType: !615, size: 64, offset: 320)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!395, !590, !618, !590}
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFDuplicateOption", file: !349, line: 77, baseType: !348)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "BcastBegin", scope: !598, file: !361, line: 46, baseType: !620, size: 64, offset: 384)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!395, !590, !623, !626, !627, !626, !378, !629}
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !368, line: 331, baseType: !624)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !368, line: 331, flags: DIFlagFwdDecl)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !6, line: 701, baseType: !50)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !368, line: 338, baseType: !630)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !368, line: 338, flags: DIFlagFwdDecl)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "BcastEnd", scope: !598, file: !361, line: 47, baseType: !633, size: 64, offset: 448)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{!395, !590, !623, !627, !378, !629}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ReduceBegin", scope: !598, file: !361, line: 48, baseType: !620, size: 64, offset: 512)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ReduceEnd", scope: !598, file: !361, line: 49, baseType: !633, size: 64, offset: 576)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "FetchAndOpBegin", scope: !598, file: !361, line: 50, baseType: !639, size: 64, offset: 640)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!395, !590, !623, !626, !378, !626, !627, !378, !629}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "FetchAndOpEnd", scope: !598, file: !361, line: 51, baseType: !643, size: 64, offset: 704)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!395, !590, !623, !378, !627, !378, !629}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "BcastToZero", scope: !598, file: !361, line: 52, baseType: !647, size: 64, offset: 768)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!395, !590, !623, !626, !627, !626, !378}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "GetRootRanks", scope: !598, file: !361, line: 53, baseType: !651, size: 64, offset: 832)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!395, !590, !482, !654, !657, !657, !657}
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !454)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !437)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "GetLeafRanks", scope: !598, file: !361, line: 54, baseType: !661, size: 64, offset: 896)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!395, !590, !482, !654, !657, !657}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "CreateLocalSF", scope: !598, file: !361, line: 55, baseType: !665, size: 64, offset: 960)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!395, !590, !668}
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "GetGraph", scope: !598, file: !361, line: 56, baseType: !670, size: 64, offset: 1024)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!395, !590, !482, !482, !657, !673}
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !676)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFNode", file: !589, line: 49, baseType: !677)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !589, line: 46, size: 64, elements: !678)
!678 = !{!679, !680}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !677, file: !589, line: 47, baseType: !437, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !677, file: !589, line: 48, baseType: !437, size: 32, offset: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEmbeddedRootSF", scope: !598, file: !361, line: 57, baseType: !682, size: 64, offset: 1088)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!395, !590, !437, !658, !668}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEmbeddedLeafSF", scope: !598, file: !361, line: 58, baseType: !682, size: 64, offset: 1152)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "Malloc", scope: !598, file: !361, line: 60, baseType: !687, size: 64, offset: 1216)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{!395, !626, !548, !690}
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "Free", scope: !598, file: !361, line: 61, baseType: !692, size: 64, offset: 1280)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!395, !626, !378}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "vscat", scope: !592, file: !361, line: 78, baseType: !696, size: 512, offset: 5824)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !592, file: !361, line: 68, size: 512, elements: !697)
!697 = !{!698, !699, !700, !701, !702, !705, !706, !707, !708, !709}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "from_n", scope: !696, file: !361, line: 69, baseType: !437, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "to_n", scope: !696, file: !361, line: 69, baseType: !437, size: 32, offset: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "beginandendtogether", scope: !696, file: !361, line: 70, baseType: !552, size: 32, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "packongpu", scope: !696, file: !361, line: 71, baseType: !552, size: 32, offset: 96)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "xdata", scope: !696, file: !361, line: 72, baseType: !703, size: 64, offset: 128)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !500)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ydata", scope: !696, file: !361, line: 73, baseType: !499, size: 64, offset: 192)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "lsf", scope: !696, file: !361, line: 74, baseType: !590, size: 64, offset: 256)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !696, file: !361, line: 75, baseType: !437, size: 32, offset: 320)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !696, file: !361, line: 76, baseType: !623, size: 64, offset: 384)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "logging", scope: !696, file: !361, line: 77, baseType: !552, size: 32, offset: 448)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "nroots", scope: !592, file: !361, line: 81, baseType: !437, size: 32, offset: 6336)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "nleaves", scope: !592, file: !361, line: 82, baseType: !437, size: 32, offset: 6368)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "mine", scope: !592, file: !361, line: 83, baseType: !482, size: 64, offset: 6400)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "mine_alloc", scope: !592, file: !361, line: 84, baseType: !482, size: 64, offset: 6464)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "minleaf", scope: !592, file: !361, line: 85, baseType: !437, size: 32, offset: 6528)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "maxleaf", scope: !592, file: !361, line: 85, baseType: !437, size: 32, offset: 6560)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "remote", scope: !592, file: !361, line: 86, baseType: !717, size: 64, offset: 6592)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "remote_alloc", scope: !592, file: !361, line: 87, baseType: !717, size: 64, offset: 6656)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "nranks", scope: !592, file: !361, line: 88, baseType: !437, size: 32, offset: 6720)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ndranks", scope: !592, file: !361, line: 89, baseType: !437, size: 32, offset: 6752)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ranks", scope: !592, file: !361, line: 90, baseType: !722, size: 64, offset: 6784)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "roffset", scope: !592, file: !361, line: 91, baseType: !482, size: 64, offset: 6848)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "rmine", scope: !592, file: !361, line: 92, baseType: !482, size: 64, offset: 6912)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "rmine_d", scope: !592, file: !361, line: 93, baseType: !726, size: 128, offset: 6976)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !482, size: 128, elements: !513)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "leafbuflen", scope: !592, file: !361, line: 96, baseType: !516, size: 64, offset: 7104)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "leafcontig", scope: !592, file: !361, line: 97, baseType: !729, size: 64, offset: 7168)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 64, elements: !513)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "leafstart", scope: !592, file: !361, line: 98, baseType: !516, size: 64, offset: 7232)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "leafpackopt", scope: !592, file: !361, line: 99, baseType: !732, size: 128, offset: 7296)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !733, size: 128, elements: !513)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFPackOpt", file: !361, line: 64, baseType: !734)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSFPackOpt", file: !361, line: 64, flags: DIFlagFwdDecl)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "leafpackopt_d", scope: !592, file: !361, line: 100, baseType: !732, size: 128, offset: 7424)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "leafdups", scope: !592, file: !361, line: 101, baseType: !729, size: 64, offset: 7552)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "nleafreqs", scope: !592, file: !361, line: 103, baseType: !437, size: 32, offset: 7616)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "rremote", scope: !592, file: !361, line: 104, baseType: !482, size: 64, offset: 7680)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "degreeknown", scope: !592, file: !361, line: 105, baseType: !552, size: 32, offset: 7744)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "degree", scope: !592, file: !361, line: 106, baseType: !482, size: 64, offset: 7808)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "degreetmp", scope: !592, file: !361, line: 107, baseType: !482, size: 64, offset: 7872)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "rankorder", scope: !592, file: !361, line: 108, baseType: !552, size: 32, offset: 7936)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "ingroup", scope: !592, file: !361, line: 109, baseType: !745, size: 64, offset: 8000)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Group", file: !368, line: 336, baseType: !746)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_group_t", file: !368, line: 336, flags: DIFlagFwdDecl)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "outgroup", scope: !592, file: !361, line: 110, baseType: !745, size: 64, offset: 8064)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "multi", scope: !592, file: !361, line: 111, baseType: !590, size: 64, offset: 8128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "graphset", scope: !592, file: !361, line: 112, baseType: !552, size: 32, offset: 8192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !592, file: !361, line: 113, baseType: !552, size: 32, offset: 8224)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !592, file: !361, line: 114, baseType: !753, size: 32, offset: 8256)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFPattern", file: !349, line: 35, baseType: !354)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "persistent", scope: !592, file: !361, line: 115, baseType: !552, size: 32, offset: 8288)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !592, file: !361, line: 116, baseType: !756, size: 64, offset: 8320)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !757, line: 60, baseType: !758)
!757 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !135, line: 240, size: 640, elements: !760)
!760 = !{!761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !775, !776, !777, !778}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !759, file: !135, line: 241, baseType: !375, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !759, file: !135, line: 242, baseType: !454, size: 32, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !759, file: !135, line: 243, baseType: !437, size: 32, offset: 96)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !759, file: !135, line: 243, baseType: !437, size: 32, offset: 128)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !759, file: !135, line: 244, baseType: !437, size: 32, offset: 160)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !759, file: !135, line: 244, baseType: !437, size: 32, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !759, file: !135, line: 245, baseType: !482, size: 64, offset: 256)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !759, file: !135, line: 246, baseType: !552, size: 32, offset: 320)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !759, file: !135, line: 247, baseType: !437, size: 32, offset: 352)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !759, file: !135, line: 251, baseType: !437, size: 32, offset: 384)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !759, file: !135, line: 252, baseType: !772, size: 64, offset: 448)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !757, line: 30, baseType: !773)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !757, line: 30, flags: DIFlagFwdDecl)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !759, file: !135, line: 253, baseType: !552, size: 32, offset: 512)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !759, file: !135, line: 254, baseType: !437, size: 32, offset: 544)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !759, file: !135, line: 254, baseType: !437, size: 32, offset: 576)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !759, file: !135, line: 255, baseType: !437, size: 32, offset: 608)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_input_stream", scope: !592, file: !361, line: 117, baseType: !552, size: 32, offset: 8384)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "use_gpu_aware_mpi", scope: !592, file: !361, line: 118, baseType: !552, size: 32, offset: 8416)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "use_stream_aware_mpi", scope: !592, file: !361, line: 119, baseType: !552, size: 32, offset: 8448)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "maxResidentThreadsPerGPU", scope: !592, file: !361, line: 120, baseType: !437, size: 32, offset: 8480)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "backend", scope: !592, file: !361, line: 121, baseType: !784, size: 32, offset: 8512)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSFBackend", file: !361, line: 37, baseType: !360)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !592, file: !361, line: 122, baseType: !378, size: 64, offset: 8576)
!786 = !{!0}
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !788, line: 32, size: 9472, elements: !789)
!788 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!789 = !{!790, !1312, !1316, !1317, !1321, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1351, !1355, !1360, !1365, !1371, !1376, !1380, !1381, !1385, !1390, !1391, !1396, !1400, !1404, !1408, !1412, !1416, !1417, !1418, !1419, !1420, !1424, !1425, !1430, !1431, !1432, !1433, !1434, !1439, !1446, !1450, !1454, !1458, !1462, !1466, !1467, !1471, !1472, !1476, !1480, !1481, !1482, !1483, !1544, !1552, !1553, !1557, !1558, !1562, !1563, !1564, !1569, !1570, !1574, !1578, !1582, !1583, !1584, !1585, !1586, !1587, !1592, !1593, !1597, !1601, !1605, !1606, !1607, !1611, !1621, !1622, !1626, !1627, !1631, !1632, !1636, !1637, !1641, !1642, !1646, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1660, !1661, !1662, !1663, !1664, !1665, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1680, !1684, !1685, !1686, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1700, !1701, !1702, !1706, !1710, !1711, !1715, !1716, !1717, !1718, !1744, !1748, !1749, !1750, !1751, !1752, !1756, !1757, !1758, !1759, !1760, !1764, !1768, !1769}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !787, file: !788, line: 34, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!395, !794, !437, !658, !437, !658, !703, !833}
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !65, line: 16, baseType: !795)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !788, line: 436, size: 23424, elements: !797)
!797 = !{!798, !799, !801, !802, !803, !804, !806, !807, !808, !813, !814, !815, !816, !817, !818, !832, !834, !945, !946, !1221, !1222, !1223, !1224, !1225, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1260, !1281, !1282, !1284, !1285, !1286, !1287, !1288, !1289, !1310, !1311}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !796, file: !788, line: 437, baseType: !595, size: 4480)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !796, file: !788, line: 437, baseType: !800, size: 9472, offset: 4480)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !787, size: 9472, elements: !433)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !796, file: !788, line: 438, baseType: !756, size: 64, offset: 13952)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !796, file: !788, line: 438, baseType: !756, size: 64, offset: 14016)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !796, file: !788, line: 439, baseType: !378, size: 64, offset: 14080)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !796, file: !788, line: 440, baseType: !805, size: 32, offset: 14144)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !65, line: 161, baseType: !284)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !796, file: !788, line: 441, baseType: !552, size: 32, offset: 14176)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !796, file: !788, line: 442, baseType: !552, size: 32, offset: 14208)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !796, file: !788, line: 443, baseType: !809, size: 448, offset: 14272)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !810, size: 448, elements: !811)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !65, line: 1159, baseType: !414)
!811 = !{!812}
!812 = !DISubrange(count: 7)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !796, file: !788, line: 444, baseType: !552, size: 32, offset: 14720)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !796, file: !788, line: 445, baseType: !552, size: 32, offset: 14752)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !796, file: !788, line: 446, baseType: !437, size: 32, offset: 14784)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !796, file: !788, line: 447, baseType: !475, size: 64, offset: 14848)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !796, file: !788, line: 448, baseType: !475, size: 64, offset: 14912)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !796, file: !788, line: 449, baseType: !819, size: 640, offset: 14976)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !65, line: 600, baseType: !820)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !65, line: 592, size: 640, elements: !821)
!821 = !{!822, !823, !824, !825, !826, !827, !828, !829, !830, !831}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !820, file: !65, line: 593, baseType: !439, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !820, file: !65, line: 594, baseType: !439, size: 64, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !820, file: !65, line: 594, baseType: !439, size: 64, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !820, file: !65, line: 594, baseType: !439, size: 64, offset: 192)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !820, file: !65, line: 595, baseType: !439, size: 64, offset: 256)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !820, file: !65, line: 596, baseType: !439, size: 64, offset: 320)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !820, file: !65, line: 597, baseType: !439, size: 64, offset: 384)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !820, file: !65, line: 598, baseType: !439, size: 64, offset: 448)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !820, file: !65, line: 598, baseType: !439, size: 64, offset: 512)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !820, file: !65, line: 599, baseType: !439, size: 64, offset: 576)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !796, file: !788, line: 450, baseType: !833, size: 32, offset: 15616)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !26)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !796, file: !788, line: 451, baseType: !835, size: 2880, offset: 15680)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !788, line: 318, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !788, line: 319, size: 2880, elements: !837)
!837 = !{!838, !839, !840, !841, !842, !843, !844, !857, !858, !863, !867, !871, !872, !873, !874, !875, !876, !877, !882, !883, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !915, !916, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !939, !940, !941, !942, !943}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !836, file: !788, line: 320, baseType: !437, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !836, file: !788, line: 321, baseType: !437, size: 32, offset: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !836, file: !788, line: 322, baseType: !437, size: 32, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !836, file: !788, line: 323, baseType: !437, size: 32, offset: 96)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !836, file: !788, line: 324, baseType: !437, size: 32, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !836, file: !788, line: 325, baseType: !437, size: 32, offset: 160)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !836, file: !788, line: 326, baseType: !845, size: 64, offset: 192)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !788, line: 293, baseType: !846)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !788, line: 295, size: 448, elements: !848)
!848 = !{!849, !850, !851, !852, !853, !854, !855, !856}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !847, file: !788, line: 296, baseType: !845, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !847, file: !788, line: 297, baseType: !499, size: 64, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !847, file: !788, line: 297, baseType: !499, size: 64, offset: 128)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !847, file: !788, line: 298, baseType: !482, size: 64, offset: 192)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !847, file: !788, line: 298, baseType: !482, size: 64, offset: 256)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !847, file: !788, line: 299, baseType: !437, size: 32, offset: 320)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !847, file: !788, line: 300, baseType: !437, size: 32, offset: 352)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !847, file: !788, line: 301, baseType: !437, size: 32, offset: 384)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !836, file: !788, line: 326, baseType: !845, size: 64, offset: 256)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !836, file: !788, line: 328, baseType: !859, size: 64, offset: 320)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!395, !794, !862, !482}
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !836, file: !788, line: 329, baseType: !864, size: 64, offset: 384)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{!395, !862, !722, !484, !484, !502, !482}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !836, file: !788, line: 330, baseType: !868, size: 64, offset: 448)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!395, !862}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !836, file: !788, line: 331, baseType: !868, size: 64, offset: 512)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !836, file: !788, line: 334, baseType: !375, size: 64, offset: 576)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !836, file: !788, line: 335, baseType: !454, size: 32, offset: 640)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !836, file: !788, line: 335, baseType: !454, size: 32, offset: 672)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !836, file: !788, line: 336, baseType: !454, size: 32, offset: 704)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !836, file: !788, line: 336, baseType: !454, size: 32, offset: 736)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !836, file: !788, line: 337, baseType: !878, size: 64, offset: 768)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !368, line: 339, baseType: !880)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !368, line: 339, flags: DIFlagFwdDecl)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !836, file: !788, line: 338, baseType: !878, size: 64, offset: 832)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !836, file: !788, line: 339, baseType: !884, size: 64, offset: 896)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !368, line: 341, baseType: !886)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !368, line: 351, size: 192, elements: !887)
!887 = !{!888, !889, !890, !891, !892}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !886, file: !368, line: 354, baseType: !93, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !886, file: !368, line: 355, baseType: !93, size: 32, offset: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !886, file: !368, line: 356, baseType: !93, size: 32, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !886, file: !368, line: 361, baseType: !93, size: 32, offset: 96)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !886, file: !368, line: 362, baseType: !548, size: 64, offset: 128)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !836, file: !788, line: 340, baseType: !437, size: 32, offset: 960)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !836, file: !788, line: 340, baseType: !437, size: 32, offset: 992)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !836, file: !788, line: 341, baseType: !499, size: 64, offset: 1024)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !836, file: !788, line: 342, baseType: !482, size: 64, offset: 1088)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !836, file: !788, line: 343, baseType: !502, size: 64, offset: 1152)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !836, file: !788, line: 344, baseType: !484, size: 64, offset: 1216)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !836, file: !788, line: 345, baseType: !437, size: 32, offset: 1280)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !836, file: !788, line: 346, baseType: !722, size: 64, offset: 1344)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !836, file: !788, line: 347, baseType: !552, size: 32, offset: 1408)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !836, file: !788, line: 348, baseType: !437, size: 32, offset: 1440)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !836, file: !788, line: 351, baseType: !552, size: 32, offset: 1472)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !836, file: !788, line: 352, baseType: !552, size: 32, offset: 1504)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !836, file: !788, line: 353, baseType: !454, size: 32, offset: 1536)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !836, file: !788, line: 354, baseType: !454, size: 32, offset: 1568)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !836, file: !788, line: 355, baseType: !722, size: 64, offset: 1600)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !836, file: !788, line: 356, baseType: !722, size: 64, offset: 1664)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !836, file: !788, line: 357, baseType: !910, size: 64, offset: 1728)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !788, line: 310, baseType: !912)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !788, line: 308, size: 32, elements: !913)
!913 = !{!914}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !912, file: !788, line: 309, baseType: !437, size: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !836, file: !788, line: 357, baseType: !910, size: 64, offset: 1792)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !836, file: !788, line: 358, baseType: !917, size: 64, offset: 1856)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !788, line: 316, baseType: !919)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !788, line: 312, size: 128, elements: !920)
!920 = !{!921, !922, !923}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !919, file: !788, line: 313, baseType: !378, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !919, file: !788, line: 314, baseType: !437, size: 32, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !919, file: !788, line: 315, baseType: !416, size: 8, offset: 96)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !836, file: !788, line: 359, baseType: !917, size: 64, offset: 1920)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !836, file: !788, line: 360, baseType: !917, size: 64, offset: 1984)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !836, file: !788, line: 361, baseType: !437, size: 32, offset: 2048)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !836, file: !788, line: 362, baseType: !454, size: 32, offset: 2080)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !836, file: !788, line: 363, baseType: !437, size: 32, offset: 2112)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !836, file: !788, line: 364, baseType: !722, size: 64, offset: 2176)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !836, file: !788, line: 365, baseType: !884, size: 64, offset: 2240)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !836, file: !788, line: 366, baseType: !454, size: 32, offset: 2304)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !836, file: !788, line: 367, baseType: !454, size: 32, offset: 2336)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !836, file: !788, line: 368, baseType: !878, size: 64, offset: 2368)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !836, file: !788, line: 369, baseType: !878, size: 64, offset: 2432)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !836, file: !788, line: 370, baseType: !936, size: 64, offset: 2496)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !6, line: 678, baseType: !937)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !6, line: 678, flags: DIFlagFwdDecl)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !836, file: !788, line: 371, baseType: !936, size: 64, offset: 2560)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !836, file: !788, line: 372, baseType: !936, size: 64, offset: 2624)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !836, file: !788, line: 373, baseType: !623, size: 64, offset: 2688)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !836, file: !788, line: 374, baseType: !548, size: 64, offset: 2752)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !836, file: !788, line: 375, baseType: !944, size: 64, offset: 2816)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !796, file: !788, line: 451, baseType: !835, size: 2880, offset: 18560)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !796, file: !788, line: 452, baseType: !947, size: 64, offset: 21440)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !65, line: 1723, baseType: !948)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !788, line: 681, size: 4864, elements: !950)
!950 = !{!951, !952, !954, !955, !956, !1215, !1216, !1220}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !949, file: !788, line: 682, baseType: !595, size: 4480)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !949, file: !788, line: 682, baseType: !953, size: 32, offset: 4480)
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 32, elements: !433)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !949, file: !788, line: 683, baseType: !552, size: 32, offset: 4512)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !949, file: !788, line: 684, baseType: !437, size: 32, offset: 4544)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !949, file: !788, line: 685, baseType: !957, size: 64, offset: 4608)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !38, line: 21, baseType: !959)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !961, line: 142, size: 12800, elements: !962)
!961 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!962 = !{!963, !964, !1173, !1174, !1175, !1176, !1209, !1210, !1211, !1212, !1214}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !960, file: !961, line: 143, baseType: !595, size: 4480)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !960, file: !961, line: 143, baseType: !965, size: 5248, offset: 4480)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !966, size: 5248, elements: !433)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !961, line: 23, size: 5248, elements: !967)
!967 = !{!968, !972, !977, !981, !985, !991, !996, !997, !998, !1002, !1006, !1007, !1008, !1012, !1016, !1020, !1021, !1025, !1029, !1033, !1034, !1038, !1042, !1043, !1047, !1051, !1052, !1053, !1057, !1058, !1065, !1070, !1071, !1072, !1076, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1093, !1094, !1095, !1099, !1103, !1104, !1105, !1106, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1120, !1121, !1125, !1132, !1133, !1138, !1139, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1154, !1155, !1156, !1161, !1165, !1166, !1167}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !966, file: !961, line: 24, baseType: !969, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!395, !958, !957}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !966, file: !961, line: 25, baseType: !973, size: 64, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!395, !958, !437, !976}
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !966, file: !961, line: 26, baseType: !978, size: 64, offset: 128)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!395, !437, !957}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !966, file: !961, line: 27, baseType: !982, size: 64, offset: 192)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!395, !958, !958, !499}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !966, file: !961, line: 28, baseType: !986, size: 64, offset: 256)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!395, !958, !437, !989, !499}
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !966, file: !961, line: 29, baseType: !992, size: 64, offset: 320)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!395, !958, !995, !490}
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !38, line: 155, baseType: !37)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !966, file: !961, line: 30, baseType: !982, size: 64, offset: 384)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !966, file: !961, line: 31, baseType: !986, size: 64, offset: 448)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !966, file: !961, line: 32, baseType: !999, size: 64, offset: 512)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!395, !958, !500}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !966, file: !961, line: 33, baseType: !1003, size: 64, offset: 576)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!395, !958, !958}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !966, file: !961, line: 34, baseType: !999, size: 64, offset: 640)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !966, file: !961, line: 35, baseType: !1003, size: 64, offset: 704)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !966, file: !961, line: 36, baseType: !1009, size: 64, offset: 768)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!395, !958, !500, !958}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !966, file: !961, line: 37, baseType: !1013, size: 64, offset: 832)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!395, !958, !500, !500, !958}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !966, file: !961, line: 38, baseType: !1017, size: 64, offset: 896)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!395, !958, !437, !703, !957}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !966, file: !961, line: 39, baseType: !1009, size: 64, offset: 960)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !966, file: !961, line: 40, baseType: !1022, size: 64, offset: 1024)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!395, !958, !500, !958, !958}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !966, file: !961, line: 41, baseType: !1026, size: 64, offset: 1088)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!395, !958, !500, !500, !500, !958, !958}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !966, file: !961, line: 42, baseType: !1030, size: 64, offset: 1152)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!395, !958, !958, !958}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !966, file: !961, line: 43, baseType: !1030, size: 64, offset: 1216)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !966, file: !961, line: 44, baseType: !1035, size: 64, offset: 1280)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!395, !958, !437, !658, !703, !833}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !966, file: !961, line: 45, baseType: !1039, size: 64, offset: 1344)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!395, !958}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !966, file: !961, line: 46, baseType: !1039, size: 64, offset: 1408)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !966, file: !961, line: 47, baseType: !1044, size: 64, offset: 1472)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!395, !958, !502}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !966, file: !961, line: 48, baseType: !1048, size: 64, offset: 1536)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!395, !958, !482}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !966, file: !961, line: 49, baseType: !1048, size: 64, offset: 1600)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !966, file: !961, line: 50, baseType: !1044, size: 64, offset: 1664)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !966, file: !961, line: 51, baseType: !1054, size: 64, offset: 1728)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!395, !958, !482, !490}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !966, file: !961, line: 52, baseType: !1054, size: 64, offset: 1792)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !966, file: !961, line: 53, baseType: !1059, size: 64, offset: 1856)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!395, !958, !1062}
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !1063)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !966, file: !961, line: 54, baseType: !1066, size: 64, offset: 1920)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!395, !958, !1069, !552}
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !38, line: 475, baseType: !45)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !966, file: !961, line: 55, baseType: !1035, size: 64, offset: 1984)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !966, file: !961, line: 56, baseType: !1039, size: 64, offset: 2048)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !966, file: !961, line: 57, baseType: !1073, size: 64, offset: 2112)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!395, !958, !401}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !966, file: !961, line: 58, baseType: !1077, size: 64, offset: 2176)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!395, !958, !703}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !966, file: !961, line: 59, baseType: !1077, size: 64, offset: 2240)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !966, file: !961, line: 60, baseType: !982, size: 64, offset: 2304)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !966, file: !961, line: 61, baseType: !982, size: 64, offset: 2368)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !966, file: !961, line: 62, baseType: !992, size: 64, offset: 2432)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !966, file: !961, line: 63, baseType: !986, size: 64, offset: 2496)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !966, file: !961, line: 64, baseType: !986, size: 64, offset: 2560)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !966, file: !961, line: 65, baseType: !1073, size: 64, offset: 2624)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !966, file: !961, line: 66, baseType: !1039, size: 64, offset: 2688)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !966, file: !961, line: 67, baseType: !1039, size: 64, offset: 2752)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !966, file: !961, line: 68, baseType: !1090, size: 64, offset: 2816)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!395, !958, !772}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !966, file: !961, line: 69, baseType: !1035, size: 64, offset: 2880)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !966, file: !961, line: 70, baseType: !1039, size: 64, offset: 2944)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !966, file: !961, line: 71, baseType: !1096, size: 64, offset: 3008)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!395, !528, !958}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !966, file: !961, line: 72, baseType: !1100, size: 64, offset: 3072)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{!395, !958, !958, !490}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !966, file: !961, line: 73, baseType: !1030, size: 64, offset: 3136)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !966, file: !961, line: 74, baseType: !1030, size: 64, offset: 3200)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !966, file: !961, line: 75, baseType: !1030, size: 64, offset: 3264)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !966, file: !961, line: 76, baseType: !1107, size: 64, offset: 3328)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{!395, !958, !437, !658, !499}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !966, file: !961, line: 77, baseType: !1039, size: 64, offset: 3392)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !966, file: !961, line: 78, baseType: !1039, size: 64, offset: 3456)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !966, file: !961, line: 79, baseType: !1039, size: 64, offset: 3520)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !966, file: !961, line: 80, baseType: !1039, size: 64, offset: 3584)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !966, file: !961, line: 81, baseType: !999, size: 64, offset: 3648)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !966, file: !961, line: 82, baseType: !1039, size: 64, offset: 3712)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !966, file: !961, line: 83, baseType: !1117, size: 64, offset: 3776)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!395, !958, !437, !958, !833}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !966, file: !961, line: 84, baseType: !1117, size: 64, offset: 3840)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !966, file: !961, line: 85, baseType: !1122, size: 64, offset: 3904)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!395, !958, !958, !499, !499}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !966, file: !961, line: 86, baseType: !1126, size: 64, offset: 3968)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!395, !958, !1129, !957}
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !757, line: 11, baseType: !1130)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !757, line: 11, flags: DIFlagFwdDecl)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !966, file: !961, line: 87, baseType: !1126, size: 64, offset: 4032)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !966, file: !961, line: 88, baseType: !1134, size: 64, offset: 4096)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!395, !958, !1137}
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !966, file: !961, line: 89, baseType: !1134, size: 64, offset: 4160)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !966, file: !961, line: 90, baseType: !1140, size: 64, offset: 4224)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!395, !958, !437, !658, !658, !958, !833}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !966, file: !961, line: 91, baseType: !1140, size: 64, offset: 4288)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !966, file: !961, line: 92, baseType: !1073, size: 64, offset: 4352)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !966, file: !961, line: 93, baseType: !1073, size: 64, offset: 4416)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !966, file: !961, line: 94, baseType: !1003, size: 64, offset: 4480)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !966, file: !961, line: 95, baseType: !1003, size: 64, offset: 4544)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !966, file: !961, line: 96, baseType: !1003, size: 64, offset: 4608)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !966, file: !961, line: 97, baseType: !1003, size: 64, offset: 4672)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !966, file: !961, line: 98, baseType: !1151, size: 64, offset: 4736)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{!395, !958, !552}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !966, file: !961, line: 99, baseType: !1044, size: 64, offset: 4800)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !966, file: !961, line: 100, baseType: !1044, size: 64, offset: 4864)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !966, file: !961, line: 101, baseType: !1157, size: 64, offset: 4928)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!395, !958, !502, !1160}
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !966, file: !961, line: 102, baseType: !1162, size: 64, offset: 4992)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!395, !958, !1137, !1160}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !966, file: !961, line: 103, baseType: !1044, size: 64, offset: 5056)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !966, file: !961, line: 104, baseType: !1134, size: 64, offset: 5120)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !966, file: !961, line: 105, baseType: !1168, size: 64, offset: 5184)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = !DISubroutineType(types: !1170)
!1170 = !{!395, !437, !989, !957, !1171}
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !960, file: !961, line: 144, baseType: !756, size: 64, offset: 9728)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !960, file: !961, line: 145, baseType: !378, size: 64, offset: 9792)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !960, file: !961, line: 146, baseType: !552, size: 32, offset: 9856)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !960, file: !961, line: 147, baseType: !1177, size: 1344, offset: 9920)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !961, line: 140, baseType: !1178)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !961, line: 114, size: 1344, elements: !1179)
!1179 = !{!1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1178, file: !961, line: 115, baseType: !437, size: 32)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1178, file: !961, line: 116, baseType: !437, size: 32, offset: 32)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1178, file: !961, line: 117, baseType: !437, size: 32, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1178, file: !961, line: 118, baseType: !437, size: 32, offset: 96)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1178, file: !961, line: 119, baseType: !437, size: 32, offset: 128)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1178, file: !961, line: 120, baseType: !437, size: 32, offset: 160)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1178, file: !961, line: 121, baseType: !482, size: 64, offset: 192)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !1178, file: !961, line: 122, baseType: !499, size: 64, offset: 256)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1178, file: !961, line: 124, baseType: !375, size: 64, offset: 320)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1178, file: !961, line: 125, baseType: !454, size: 32, offset: 384)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1178, file: !961, line: 125, baseType: !454, size: 32, offset: 416)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1178, file: !961, line: 126, baseType: !454, size: 32, offset: 448)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1178, file: !961, line: 126, baseType: !454, size: 32, offset: 480)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1178, file: !961, line: 127, baseType: !878, size: 64, offset: 512)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1178, file: !961, line: 128, baseType: !878, size: 64, offset: 576)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1178, file: !961, line: 129, baseType: !884, size: 64, offset: 640)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1178, file: !961, line: 130, baseType: !437, size: 32, offset: 704)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1178, file: !961, line: 130, baseType: !437, size: 32, offset: 736)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1178, file: !961, line: 131, baseType: !499, size: 64, offset: 768)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1178, file: !961, line: 131, baseType: !499, size: 64, offset: 832)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1178, file: !961, line: 132, baseType: !482, size: 64, offset: 896)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1178, file: !961, line: 132, baseType: !482, size: 64, offset: 960)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !1178, file: !961, line: 133, baseType: !437, size: 32, offset: 1024)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !1178, file: !961, line: 134, baseType: !482, size: 64, offset: 1088)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1178, file: !961, line: 135, baseType: !437, size: 32, offset: 1152)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !1178, file: !961, line: 136, baseType: !552, size: 32, offset: 1184)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !1178, file: !961, line: 137, baseType: !552, size: 32, offset: 1216)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1178, file: !961, line: 138, baseType: !833, size: 32, offset: 1248)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !1178, file: !961, line: 139, baseType: !482, size: 64, offset: 1280)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !960, file: !961, line: 147, baseType: !1177, size: 1344, offset: 11264)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !960, file: !961, line: 148, baseType: !552, size: 32, offset: 12608)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !960, file: !961, line: 149, baseType: !437, size: 32, offset: 12640)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !960, file: !961, line: 150, baseType: !1213, size: 32, offset: 12672)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !38, line: 472, baseType: !57)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !960, file: !961, line: 157, baseType: !464, size: 64, offset: 12736)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !949, file: !788, line: 686, baseType: !499, size: 64, offset: 4672)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !949, file: !788, line: 687, baseType: !1217, size: 64, offset: 4736)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64)
!1218 = !DISubroutineType(types: !1219)
!1219 = !{!395, !947, !958, !378}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !949, file: !788, line: 688, baseType: !378, size: 64, offset: 4800)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !796, file: !788, line: 453, baseType: !947, size: 64, offset: 21504)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !796, file: !788, line: 454, baseType: !947, size: 64, offset: 21568)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !796, file: !788, line: 455, baseType: !437, size: 32, offset: 21632)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "preallocated", scope: !796, file: !788, line: 456, baseType: !552, size: 32, offset: 21664)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !796, file: !788, line: 457, baseType: !1226, size: 320, offset: 21696)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStencilInfo", file: !788, line: 399, baseType: !1227)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !788, line: 394, size: 320, elements: !1228)
!1228 = !{!1229, !1230, !1234, !1235}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !1227, file: !788, line: 395, baseType: !437, size: 32)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "dims", scope: !1227, file: !788, line: 396, baseType: !1231, size: 128, offset: 32)
!1231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !437, size: 128, elements: !1232)
!1232 = !{!1233}
!1233 = !DISubrange(count: 4)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "starts", scope: !1227, file: !788, line: 397, baseType: !1231, size: 128, offset: 160)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "noc", scope: !1227, file: !788, line: 398, baseType: !552, size: 32, offset: 288)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric", scope: !796, file: !788, line: 458, baseType: !552, size: 32, offset: 22016)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "hermitian", scope: !796, file: !788, line: 458, baseType: !552, size: 32, offset: 22048)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "structurally_symmetric", scope: !796, file: !788, line: 458, baseType: !552, size: 32, offset: 22080)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "spd", scope: !796, file: !788, line: 458, baseType: !552, size: 32, offset: 22112)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric_set", scope: !796, file: !788, line: 459, baseType: !552, size: 32, offset: 22144)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "hermitian_set", scope: !796, file: !788, line: 459, baseType: !552, size: 32, offset: 22176)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "structurally_symmetric_set", scope: !796, file: !788, line: 459, baseType: !552, size: 32, offset: 22208)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "spd_set", scope: !796, file: !788, line: 459, baseType: !552, size: 32, offset: 22240)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric_eternal", scope: !796, file: !788, line: 460, baseType: !552, size: 32, offset: 22272)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "nooffprocentries", scope: !796, file: !788, line: 461, baseType: !552, size: 32, offset: 22304)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "nooffproczerorows", scope: !796, file: !788, line: 461, baseType: !552, size: 32, offset: 22336)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "assembly_subset", scope: !796, file: !788, line: 462, baseType: !552, size: 32, offset: 22368)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "submat_singleis", scope: !796, file: !788, line: 463, baseType: !552, size: 32, offset: 22400)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "structure_only", scope: !796, file: !788, line: 464, baseType: !552, size: 32, offset: 22432)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "sortedfull", scope: !796, file: !788, line: 465, baseType: !552, size: 32, offset: 22464)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "force_diagonals", scope: !796, file: !788, line: 466, baseType: !552, size: 32, offset: 22496)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "spptr", scope: !796, file: !788, line: 471, baseType: !378, size: 64, offset: 22528)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "solvertype", scope: !796, file: !788, line: 472, baseType: !464, size: 64, offset: 22592)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "checksymmetryonassembly", scope: !796, file: !788, line: 473, baseType: !552, size: 32, offset: 22656)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "checknullspaceonassembly", scope: !796, file: !788, line: 473, baseType: !552, size: 32, offset: 22688)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "checksymmetrytol", scope: !796, file: !788, line: 474, baseType: !491, size: 64, offset: 22720)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "schur", scope: !796, file: !788, line: 475, baseType: !794, size: 64, offset: 22784)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "schur_status", scope: !796, file: !788, line: 476, baseType: !1259, size: 32, offset: 22848)
!1259 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorSchurStatus", file: !65, line: 1265, baseType: !294)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "redundant", scope: !796, file: !788, line: 477, baseType: !1261, size: 64, offset: 22912)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_Redundant", file: !788, line: 418, baseType: !1263)
!1263 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !788, line: 410, size: 896, elements: !1264)
!1264 = !{!1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279}
