; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/vpbjacobi/vpbjacobi.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/vpbjacobi/vpbjacobi.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PC = type { %struct._p_PetscObject, [1 x %struct._PCOps], %struct._p_DM*, i32, i64, i64, i32, i32, i32, i32, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 (%struct._p_PC*, i32, %struct._p_IS**, %struct._p_IS**, %struct._p_Mat**, i8*)*, i8*, i8*, i32, i8*, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 170, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 81, baseType: !5, size: 32, elements: !11)
!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!12 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 98, baseType: !26, size: 32, elements: !27)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpctypes.h", directory: "/home/users/ndemeye/xSDK")
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_RTOL", value: 2)
!29 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_ATOL", value: 3)
!30 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_ITS", value: 4)
!31 = !DIEnumerator(name: "PCRICHARDSON_DIVERGED_DTOL", value: -4)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 85, baseType: !26, size: 32, elements: !33)
!33 = !{!34, !35, !36, !37}
!34 = !DIEnumerator(name: "PC_SIDE_DEFAULT", value: -1)
!35 = !DIEnumerator(name: "PC_LEFT", value: 0)
!36 = !DIEnumerator(name: "PC_RIGHT", value: 1)
!37 = !DIEnumerator(name: "PC_SYMMETRIC", value: 2)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 285, baseType: !5, size: 32, elements: !40)
!39 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!40 = !{!41, !42, !43, !44}
!41 = !DIEnumerator(name: "DIFFERENT_NONZERO_PATTERN", value: 0, isUnsigned: true)
!42 = !DIEnumerator(name: "SUBSET_NONZERO_PATTERN", value: 1, isUnsigned: true)
!43 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!44 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 395, baseType: !26, size: 32, elements: !46)
!46 = !{!47, !48, !49, !50, !51, !52, !53}
!47 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!48 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!49 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!50 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!51 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!52 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!53 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !55, line: 663, baseType: !5, size: 32, elements: !56)
!55 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!56 = !{!57, !58, !59}
!57 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 1203, baseType: !5, size: 32, elements: !61)
!61 = !{!62, !63, !64, !65, !66}
!62 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!63 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!65 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!66 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!67 = !{!68, !71, !89, !170, !110, !276, !285}
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !69, line: 46, baseType: !70)
!69 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!70 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !74, line: 73, size: 4480, elements: !75)
!74 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!75 = !{!76, !78, !131, !132, !134, !137, !138, !139, !140, !148, !149, !151, !155, !159, !161, !162, !163, !164, !165, !166, !167, !168, !169, !171, !173, !174, !175, !177, !178, !180, !182, !183, !184, !185, !186, !189, !191, !192, !193, !194, !195, !198, !200, !201, !202, !212, !214, !215, !219, !220, !266, !271, !273, !274, !275}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !73, file: !74, line: 74, baseType: !77, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !73, file: !74, line: 75, baseType: !79, size: 448, offset: 64)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 448, elements: !129)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !74, line: 53, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !74, line: 45, size: 448, elements: !82)
!82 = !{!83, !93, !101, !106, !113, !117, !124}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !81, file: !74, line: 46, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{!87, !71, !88}
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !90, line: 330, baseType: !91)
!90 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !90, line: 330, flags: DIFlagFwdDecl)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !81, file: !74, line: 47, baseType: !94, size: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{!87, !71, !97}
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !98, line: 16, baseType: !99)
!98 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !98, line: 16, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !81, file: !74, line: 48, baseType: !102, size: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!87, !105}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !81, file: !74, line: 49, baseType: !107, size: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!87, !71, !110, !71}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!112 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !81, file: !74, line: 50, baseType: !114, size: 64, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!87, !71, !110, !105}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !81, file: !74, line: 51, baseType: !118, size: 64, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!87, !71, !110, !121}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{null}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !81, file: !74, line: 52, baseType: !125, size: 64, offset: 384)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!87, !71, !110, !128}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!129 = !{!130}
!130 = !DISubrange(count: 1)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !73, file: !74, line: 76, baseType: !89, size: 64, offset: 512)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !73, file: !74, line: 77, baseType: !133, size: 32, offset: 576)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !73, file: !74, line: 78, baseType: !135, size: 64, offset: 640)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !136)
!136 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !73, file: !74, line: 78, baseType: !135, size: 64, offset: 704)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !73, file: !74, line: 78, baseType: !135, size: 64, offset: 768)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !73, file: !74, line: 78, baseType: !135, size: 64, offset: 832)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !73, file: !74, line: 79, baseType: !141, size: 64, offset: 896)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !144, line: 27, baseType: !145)
!144 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !146, line: 43, baseType: !147)
!146 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!147 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !73, file: !74, line: 80, baseType: !133, size: 32, offset: 960)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !73, file: !74, line: 81, baseType: !150, size: 32, offset: 992)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !73, file: !74, line: 82, baseType: !152, size: 64, offset: 1024)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !73, file: !74, line: 83, baseType: !156, size: 64, offset: 1088)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !73, file: !74, line: 84, baseType: !160, size: 64, offset: 1152)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !73, file: !74, line: 85, baseType: !160, size: 64, offset: 1216)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !73, file: !74, line: 86, baseType: !160, size: 64, offset: 1280)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !73, file: !74, line: 87, baseType: !160, size: 64, offset: 1344)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !73, file: !74, line: 88, baseType: !71, size: 64, offset: 1408)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !73, file: !74, line: 89, baseType: !141, size: 64, offset: 1472)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !73, file: !74, line: 90, baseType: !160, size: 64, offset: 1536)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !73, file: !74, line: 91, baseType: !160, size: 64, offset: 1600)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !73, file: !74, line: 92, baseType: !133, size: 32, offset: 1664)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !73, file: !74, line: 93, baseType: !170, size: 64, offset: 1728)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !73, file: !74, line: 94, baseType: !172, size: 64, offset: 1792)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !142)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !73, file: !74, line: 95, baseType: !133, size: 32, offset: 1856)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !73, file: !74, line: 95, baseType: !133, size: 32, offset: 1888)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !73, file: !74, line: 96, baseType: !176, size: 64, offset: 1920)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !73, file: !74, line: 96, baseType: !176, size: 64, offset: 1984)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !73, file: !74, line: 97, baseType: !179, size: 64, offset: 2048)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !73, file: !74, line: 97, baseType: !181, size: 64, offset: 2112)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !73, file: !74, line: 98, baseType: !133, size: 32, offset: 2176)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !73, file: !74, line: 98, baseType: !133, size: 32, offset: 2208)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !73, file: !74, line: 99, baseType: !176, size: 64, offset: 2240)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !73, file: !74, line: 99, baseType: !176, size: 64, offset: 2304)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !73, file: !74, line: 100, baseType: !187, size: 64, offset: 2368)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !136)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !73, file: !74, line: 100, baseType: !190, size: 64, offset: 2432)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !73, file: !74, line: 101, baseType: !133, size: 32, offset: 2496)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !73, file: !74, line: 101, baseType: !133, size: 32, offset: 2528)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !73, file: !74, line: 102, baseType: !176, size: 64, offset: 2560)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !73, file: !74, line: 102, baseType: !176, size: 64, offset: 2624)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !73, file: !74, line: 103, baseType: !196, size: 64, offset: 2688)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !188)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !73, file: !74, line: 103, baseType: !199, size: 64, offset: 2752)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !73, file: !74, line: 104, baseType: !128, size: 64, offset: 2816)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !73, file: !74, line: 105, baseType: !133, size: 32, offset: 2880)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !73, file: !74, line: 106, baseType: !203, size: 128, offset: 2944)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 128, elements: !210)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !74, line: 64, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !74, line: 61, size: 128, elements: !207)
!207 = !{!208, !209}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !206, file: !74, line: 62, baseType: !121, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !206, file: !74, line: 63, baseType: !170, size: 64, offset: 64)
!210 = !{!211}
!211 = !DISubrange(count: 2)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !73, file: !74, line: 107, baseType: !213, size: 64, offset: 3072)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 64, elements: !210)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !73, file: !74, line: 108, baseType: !170, size: 64, offset: 3136)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !73, file: !74, line: 109, baseType: !216, size: 64, offset: 3200)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!87, !170}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !73, file: !74, line: 111, baseType: !133, size: 32, offset: 3264)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !73, file: !74, line: 112, baseType: !221, size: 320, offset: 3328)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 320, elements: !264)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!87, !225, !71, !170}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !228)
!228 = !{!229, !230, !252, !253, !254, !255, !256, !257, !258, !259, !260}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !227, file: !10, line: 100, baseType: !133, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !227, file: !10, line: 101, baseType: !231, size: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !242, !243, !244, !245, !247, !249, !250, !251}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !233, file: !10, line: 84, baseType: !160, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !233, file: !10, line: 85, baseType: !160, size: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !233, file: !10, line: 86, baseType: !170, size: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !233, file: !10, line: 87, baseType: !152, size: 64, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !233, file: !10, line: 88, baseType: !240, size: 64, offset: 256)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !233, file: !10, line: 89, baseType: !112, size: 8, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !233, file: !10, line: 90, baseType: !160, size: 64, offset: 384)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !233, file: !10, line: 91, baseType: !68, size: 64, offset: 448)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !233, file: !10, line: 92, baseType: !246, size: 32, offset: 512)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !233, file: !10, line: 93, baseType: !248, size: 32, offset: 544)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !233, file: !10, line: 94, baseType: !231, size: 64, offset: 576)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !233, file: !10, line: 95, baseType: !160, size: 64, offset: 640)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !233, file: !10, line: 96, baseType: !170, size: 64, offset: 704)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !227, file: !10, line: 102, baseType: !160, size: 64, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !227, file: !10, line: 102, baseType: !160, size: 64, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !227, file: !10, line: 103, baseType: !160, size: 64, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !227, file: !10, line: 104, baseType: !89, size: 64, offset: 320)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !227, file: !10, line: 105, baseType: !246, size: 32, offset: 384)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !227, file: !10, line: 105, baseType: !246, size: 32, offset: 416)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !227, file: !10, line: 105, baseType: !246, size: 32, offset: 448)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !227, file: !10, line: 106, baseType: !71, size: 64, offset: 512)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !227, file: !10, line: 107, baseType: !261, size: 64, offset: 576)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!264 = !{!265}
!265 = !DISubrange(count: 5)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !73, file: !74, line: 113, baseType: !267, size: 320, offset: 3648)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 320, elements: !264)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!87, !71, !170}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !73, file: !74, line: 114, baseType: !272, size: 320, offset: 3968)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 320, elements: !264)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !73, file: !74, line: 115, baseType: !246, size: 32, offset: 4288)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !73, file: !74, line: 120, baseType: !261, size: 64, offset: 4352)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !73, file: !74, line: 121, baseType: !246, size: 32, offset: 4416)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_VPBJacobi", file: !278, line: 14, baseType: !279)
!278 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/vpbjacobi/vpbjacobi.c", directory: "/home/users/ndemeye/xSDK")
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !278, line: 12, size: 64, elements: !280)
!280 = !{!281}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "diag", scope: !279, file: !278, line: 13, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatScalar", file: !284, line: 799, baseType: !197)
!284 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmath.h", directory: "/home/users/ndemeye/xSDK")
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !25, line: 395, baseType: !45)
!286 = !{i32 7, !"Dwarf Version", i32 4}
!287 = !{i32 2, !"Debug Info Version", i32 3}
!288 = !{i32 1, !"wchar_size", i32 4}
!289 = !{i32 7, !"PIC Level", i32 2}
!290 = !{i32 7, !"uwtable", i32 1}
!291 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!292 = distinct !DISubprogram(name: "PCCreate_VPBJacobi", scope: !278, file: !278, line: 168, type: !293, scopeLine: 169, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !402)
!293 = !DISubroutineType(types: !294)
!294 = !{!87, !295}
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !298, line: 37, size: 6720, elements: !299)
!298 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcimpl.h", directory: "/home/users/ndemeye/xSDK")
!299 = !{!300, !302, !367, !372, !373, !374, !375, !376, !378, !379, !380, !381, !382, !383, !384, !385, !386, !396, !397, !398, !399, !400, !401}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !297, file: !298, line: 38, baseType: !301, size: 4480)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !74, line: 122, baseType: !73)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !297, file: !298, line: 38, baseType: !303, size: 1152, offset: 4480)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 1152, elements: !129)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PCOps", file: !298, line: 13, size: 1152, elements: !305)
!305 = !{!306, !308, !316, !323, !329, !334, !335, !339, !343, !351, !352, !357, !358, !359, !360, !361, !365, !366}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !304, file: !298, line: 14, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !304, file: !298, line: 15, baseType: !309, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!87, !295, !312, !312}
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !313, line: 21, baseType: !314)
!313 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !313, line: 21, flags: DIFlagFwdDecl)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "matapply", scope: !304, file: !298, line: 16, baseType: !317, size: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!87, !295, !320, !320}
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !39, line: 16, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !39, line: 16, flags: DIFlagFwdDecl)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "applyrichardson", scope: !304, file: !298, line: 17, baseType: !324, size: 64, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!87, !295, !312, !312, !312, !188, !188, !188, !133, !246, !179, !327}
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCRichardsonConvergedReason", file: !25, line: 102, baseType: !24)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "applyBA", scope: !304, file: !298, line: 18, baseType: !330, size: 64, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{!87, !295, !333, !312, !312, !312}
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "applytranspose", scope: !304, file: !298, line: 19, baseType: !309, size: 64, offset: 320)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "applyBAtranspose", scope: !304, file: !298, line: 20, baseType: !336, size: 64, offset: 384)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!87, !295, !133, !312, !312, !312}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !304, file: !298, line: 21, baseType: !340, size: 64, offset: 448)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!87, !225, !295}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !304, file: !298, line: 22, baseType: !344, size: 64, offset: 512)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!87, !295, !347, !312, !312}
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !348, line: 22, baseType: !349)
!348 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !348, line: 22, flags: DIFlagFwdDecl)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !304, file: !298, line: 23, baseType: !344, size: 64, offset: 576)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "getfactoredmatrix", scope: !304, file: !298, line: 24, baseType: !353, size: 64, offset: 640)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!87, !295, !356}
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricleft", scope: !304, file: !298, line: 25, baseType: !309, size: 64, offset: 704)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricright", scope: !304, file: !298, line: 26, baseType: !309, size: 64, offset: 768)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "setuponblocks", scope: !304, file: !298, line: 27, baseType: !307, size: 64, offset: 832)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !304, file: !298, line: 28, baseType: !307, size: 64, offset: 896)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !304, file: !298, line: 29, baseType: !362, size: 64, offset: 960)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!87, !295, !97}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !304, file: !298, line: 30, baseType: !307, size: 64, offset: 1024)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !304, file: !298, line: 31, baseType: !362, size: 64, offset: 1088)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !297, file: !298, line: 39, baseType: !368, size: 64, offset: 5632)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !369, line: 14, baseType: !370)
!369 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !369, line: 14, flags: DIFlagFwdDecl)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !297, file: !298, line: 40, baseType: !133, size: 32, offset: 5696)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "matstate", scope: !297, file: !298, line: 41, baseType: !172, size: 64, offset: 5760)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "matnonzerostate", scope: !297, file: !298, line: 41, baseType: !172, size: 64, offset: 5824)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "reusepreconditioner", scope: !297, file: !298, line: 42, baseType: !246, size: 32, offset: 5888)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !297, file: !298, line: 43, baseType: !377, size: 32, offset: 5920)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !39, line: 285, baseType: !38)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !297, file: !298, line: 45, baseType: !133, size: 32, offset: 5952)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "erroriffailure", scope: !297, file: !298, line: 46, baseType: !246, size: 32, offset: 5984)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !297, file: !298, line: 47, baseType: !320, size: 64, offset: 6016)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "pmat", scope: !297, file: !298, line: 47, baseType: !320, size: 64, offset: 6080)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleright", scope: !297, file: !298, line: 48, baseType: !312, size: 64, offset: 6144)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleleft", scope: !297, file: !298, line: 48, baseType: !312, size: 64, offset: 6208)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !297, file: !298, line: 49, baseType: !246, size: 32, offset: 6272)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "useAmat", scope: !297, file: !298, line: 50, baseType: !246, size: 32, offset: 6304)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatrices", scope: !297, file: !298, line: 51, baseType: !387, size: 64, offset: 6336)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!87, !295, !133, !390, !390, !356, !170}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !393, line: 11, baseType: !394)
!393 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !393, line: 11, flags: DIFlagFwdDecl)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatricesP", scope: !297, file: !298, line: 52, baseType: !170, size: 64, offset: 6400)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !297, file: !298, line: 53, baseType: !170, size: 64, offset: 6464)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "presolvedone", scope: !297, file: !298, line: 54, baseType: !133, size: 32, offset: 6528)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !297, file: !298, line: 55, baseType: !170, size: 64, offset: 6592)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "failedreason", scope: !297, file: !298, line: 56, baseType: !285, size: 32, offset: 6656)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "failedreasonrank", scope: !297, file: !298, line: 57, baseType: !285, size: 32, offset: 6688)
!402 = !{!403, !404, !405, !406}
!403 = !DILocalVariable(name: "pc", arg: 1, scope: !292, file: !278, line: 168, type: !295)
!404 = !DILocalVariable(name: "jac", scope: !292, file: !278, line: 170, type: !276)
!405 = !DILocalVariable(name: "ierr", scope: !292, file: !278, line: 171, type: !87)
!406 = !DILocalVariable(name: "ierr__", scope: !407, file: !278, line: 178, type: !87)
!407 = distinct !DILexicalBlock(scope: !292, file: !278, line: 178, column: 35)
!408 = !DILocation(line: 0, scope: !292)
!409 = !DILocation(line: 170, column: 3, scope: !292)
!410 = !DILocation(line: 173, column: 3, scope: !411)
!411 = distinct !DILexicalBlock(scope: !412, file: !278, line: 173, column: 3)
!412 = distinct !DILexicalBlock(scope: !413, file: !278, line: 173, column: 3)
!413 = distinct !DILexicalBlock(scope: !292, file: !278, line: 173, column: 3)
!414 = !{!415, !415, i64 0}
!415 = !{!"any pointer", !416, i64 0}
!416 = !{!"omnipotent char", !417, i64 0}
!417 = !{!"Simple C/C++ TBAA"}
!418 = !DILocation(line: 173, column: 3, scope: !412)
!419 = !DILocation(line: 173, column: 3, scope: !420)
!420 = distinct !DILexicalBlock(scope: !421, file: !278, line: 173, column: 3)
!421 = distinct !DILexicalBlock(scope: !411, file: !278, line: 173, column: 3)
!422 = !{!423, !424, i64 1536}
!423 = !{!"", !416, i64 0, !416, i64 512, !416, i64 1024, !416, i64 1280, !424, i64 1536, !424, i64 1540, !416, i64 1544}
!424 = !{!"int", !416, i64 0}
!425 = !DILocation(line: 173, column: 3, scope: !421)
!426 = !DILocation(line: 173, column: 3, scope: !427)
!427 = distinct !DILexicalBlock(scope: !420, file: !278, line: 173, column: 3)
!428 = !{!424, !424, i64 0}
!429 = !{!423, !424, i64 1540}
!430 = !DILocation(line: 178, column: 14, scope: !292)
!431 = !{!"branch_weights", i32 2146410443, i32 1073205}
!432 = !DILocation(line: 0, scope: !407)
!433 = !DILocation(line: 178, column: 35, scope: !407)
!434 = !{!"branch_weights", i32 2000, i32 1}
!435 = !DILocation(line: 178, column: 35, scope: !436)
!436 = distinct !DILexicalBlock(scope: !407, file: !278, line: 178, column: 35)
!437 = !DILocation(line: 179, column: 21, scope: !292)
!438 = !DILocation(line: 179, column: 7, scope: !292)
!439 = !DILocation(line: 179, column: 12, scope: !292)
!440 = !{!441, !415, i64 808}
!441 = !{!"_p_PC", !442, i64 0, !416, i64 560, !415, i64 704, !424, i64 712, !444, i64 720, !444, i64 728, !416, i64 736, !416, i64 740, !424, i64 744, !416, i64 748, !415, i64 752, !415, i64 760, !415, i64 768, !415, i64 776, !416, i64 784, !416, i64 788, !415, i64 792, !415, i64 800, !415, i64 808, !424, i64 816, !415, i64 824, !416, i64 832, !416, i64 836}
!442 = !{!"_p_PetscObject", !424, i64 0, !416, i64 8, !415, i64 64, !424, i64 72, !443, i64 80, !443, i64 88, !443, i64 96, !443, i64 104, !444, i64 112, !424, i64 120, !424, i64 124, !415, i64 128, !415, i64 136, !415, i64 144, !415, i64 152, !415, i64 160, !415, i64 168, !415, i64 176, !444, i64 184, !415, i64 192, !415, i64 200, !424, i64 208, !415, i64 216, !444, i64 224, !424, i64 232, !424, i64 236, !415, i64 240, !415, i64 248, !415, i64 256, !415, i64 264, !424, i64 272, !424, i64 276, !415, i64 280, !415, i64 288, !415, i64 296, !415, i64 304, !424, i64 312, !424, i64 316, !415, i64 320, !415, i64 328, !415, i64 336, !415, i64 344, !415, i64 352, !424, i64 360, !416, i64 368, !416, i64 384, !415, i64 392, !415, i64 400, !424, i64 408, !416, i64 416, !416, i64 456, !416, i64 496, !416, i64 536, !415, i64 544, !416, i64 552}
!443 = !{!"double", !416, i64 0}
!444 = !{!"long", !416, i64 0}
!445 = !DILocation(line: 185, column: 8, scope: !292)
!446 = !DILocation(line: 185, column: 13, scope: !292)
!447 = !{!448, !415, i64 0}
!448 = !{!"", !415, i64 0}
!449 = !DILocation(line: 194, column: 12, scope: !292)
!450 = !DILocation(line: 194, column: 32, scope: !292)
!451 = !{!452, !415, i64 8}
