; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/cg/gltr/gltr.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/cg/gltr/gltr.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque

!99 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !104, line: 70, baseType: !7, size: 32, elements: !105)
!104 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!105 = !{!106, !107, !108}
!106 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!107 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!108 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 451, baseType: !28, size: 32, elements: !110)
!110 = !{!111, !112, !113, !114, !115}
!111 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!112 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!113 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!114 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!115 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!116 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !117, line: 663, baseType: !7, size: 32, elements: !118)
!117 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!118 = !{!119, !120, !121}
!119 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!120 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!121 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!122 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !123)
!123 = !{!124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141}
!124 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!125 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!126 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!127 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!128 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!129 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!130 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!131 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!132 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!133 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!134 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!135 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!136 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!137 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!138 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!139 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!140 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!141 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!142 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 395, baseType: !28, size: 32, elements: !143)
!143 = !{!144, !145, !146, !147, !148, !149, !150}
!144 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!145 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!146 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!147 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!148 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!149 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!150 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!151 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !152, line: 155, baseType: !7, size: 32, elements: !153)
!152 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!153 = !{!154, !155, !156, !157, !158}
!154 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!155 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!156 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!157 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!158 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!159 = !{!160, !164, !165, !368, !200, !334, !369, !371, !250, !223, !398, !401, !28, !404, !226}
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !161, line: 330, baseType: !162)
!161 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !161, line: 330, flags: DIFlagFwdDecl)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !168, line: 73, size: 4480, elements: !169)
!168 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!169 = !{!170, !172, !221, !222, !224, !227, !228, !229, !230, !238, !239, !241, !245, !249, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !262, !263, !264, !266, !267, !269, !271, !272, !273, !274, !275, !278, !280, !281, !282, !283, !284, !287, !289, !290, !291, !301, !303, !304, !308, !309, !358, !363, !365, !366, !367}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !167, file: !168, line: 74, baseType: !171, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !167, file: !168, line: 75, baseType: !173, size: 448, offset: 64)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 448, elements: !219)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !168, line: 53, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 45, size: 448, elements: !176)
!176 = !{!177, !183, !191, !196, !203, !207, !214}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !175, file: !168, line: 46, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!181, !165, !182}
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !175, file: !168, line: 47, baseType: !184, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!181, !165, !187}
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !188, line: 16, baseType: !189)
!188 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !188, line: 16, flags: DIFlagFwdDecl)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !175, file: !168, line: 48, baseType: !192, size: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!181, !195}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !175, file: !168, line: 49, baseType: !197, size: 64, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!181, !165, !200, !165}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !175, file: !168, line: 50, baseType: !204, size: 64, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!181, !165, !200, !195}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !175, file: !168, line: 51, baseType: !208, size: 64, offset: 320)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!181, !165, !200, !211}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{null}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !175, file: !168, line: 52, baseType: !215, size: 64, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!181, !165, !200, !218}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!219 = !{!220}
!220 = !DISubrange(count: 1)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !167, file: !168, line: 76, baseType: !160, size: 64, offset: 512)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !167, file: !168, line: 77, baseType: !223, size: 32, offset: 576)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !167, file: !168, line: 78, baseType: !225, size: 64, offset: 640)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !226)
!226 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !167, file: !168, line: 78, baseType: !225, size: 64, offset: 704)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !167, file: !168, line: 78, baseType: !225, size: 64, offset: 768)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !167, file: !168, line: 78, baseType: !225, size: 64, offset: 832)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !167, file: !168, line: 79, baseType: !231, size: 64, offset: 896)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !234, line: 27, baseType: !235)
!234 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !236, line: 43, baseType: !237)
!236 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!237 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !167, file: !168, line: 80, baseType: !223, size: 32, offset: 960)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !167, file: !168, line: 81, baseType: !240, size: 32, offset: 992)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !167, file: !168, line: 82, baseType: !242, size: 64, offset: 1024)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !167, file: !168, line: 83, baseType: !246, size: 64, offset: 1088)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !167, file: !168, line: 84, baseType: !250, size: 64, offset: 1152)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !167, file: !168, line: 85, baseType: !250, size: 64, offset: 1216)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !167, file: !168, line: 86, baseType: !250, size: 64, offset: 1280)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !167, file: !168, line: 87, baseType: !250, size: 64, offset: 1344)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !167, file: !168, line: 88, baseType: !165, size: 64, offset: 1408)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !167, file: !168, line: 89, baseType: !231, size: 64, offset: 1472)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !167, file: !168, line: 90, baseType: !250, size: 64, offset: 1536)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !167, file: !168, line: 91, baseType: !250, size: 64, offset: 1600)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !167, file: !168, line: 92, baseType: !223, size: 32, offset: 1664)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !167, file: !168, line: 93, baseType: !164, size: 64, offset: 1728)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !167, file: !168, line: 94, baseType: !261, size: 64, offset: 1792)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !232)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !167, file: !168, line: 95, baseType: !223, size: 32, offset: 1856)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !167, file: !168, line: 95, baseType: !223, size: 32, offset: 1888)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !167, file: !168, line: 96, baseType: !265, size: 64, offset: 1920)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !167, file: !168, line: 96, baseType: !265, size: 64, offset: 1984)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !167, file: !168, line: 97, baseType: !268, size: 64, offset: 2048)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !167, file: !168, line: 97, baseType: !270, size: 64, offset: 2112)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !167, file: !168, line: 98, baseType: !223, size: 32, offset: 2176)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !167, file: !168, line: 98, baseType: !223, size: 32, offset: 2208)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !167, file: !168, line: 99, baseType: !265, size: 64, offset: 2240)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !167, file: !168, line: 99, baseType: !265, size: 64, offset: 2304)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !167, file: !168, line: 100, baseType: !276, size: 64, offset: 2368)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !226)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !167, file: !168, line: 100, baseType: !279, size: 64, offset: 2432)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !167, file: !168, line: 101, baseType: !223, size: 32, offset: 2496)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !167, file: !168, line: 101, baseType: !223, size: 32, offset: 2528)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !167, file: !168, line: 102, baseType: !265, size: 64, offset: 2560)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !167, file: !168, line: 102, baseType: !265, size: 64, offset: 2624)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !167, file: !168, line: 103, baseType: !285, size: 64, offset: 2688)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !277)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !167, file: !168, line: 103, baseType: !288, size: 64, offset: 2752)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !167, file: !168, line: 104, baseType: !218, size: 64, offset: 2816)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !167, file: !168, line: 105, baseType: !223, size: 32, offset: 2880)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !167, file: !168, line: 106, baseType: !292, size: 128, offset: 2944)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 128, elements: !299)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !168, line: 64, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 61, size: 128, elements: !296)
!296 = !{!297, !298}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !295, file: !168, line: 62, baseType: !211, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !295, file: !168, line: 63, baseType: !164, size: 64, offset: 64)
!299 = !{!300}
!300 = !DISubrange(count: 2)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !167, file: !168, line: 107, baseType: !302, size: 64, offset: 3072)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 64, elements: !299)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !167, file: !168, line: 108, baseType: !164, size: 64, offset: 3136)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !167, file: !168, line: 109, baseType: !305, size: 64, offset: 3200)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!181, !164}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !167, file: !168, line: 111, baseType: !223, size: 32, offset: 3264)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !167, file: !168, line: 112, baseType: !310, size: 320, offset: 3328)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 320, elements: !356)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!181, !314, !165, !164}
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !317)
!317 = !{!318, !319, !344, !345, !346, !347, !348, !349, !350, !351, !352}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !316, file: !12, line: 100, baseType: !223, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !316, file: !12, line: 101, baseType: !320, size: 64, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !323)
!323 = !{!324, !325, !326, !327, !328, !331, !332, !333, !337, !339, !341, !342, !343}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !322, file: !12, line: 84, baseType: !250, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !322, file: !12, line: 85, baseType: !250, size: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !322, file: !12, line: 86, baseType: !164, size: 64, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !322, file: !12, line: 87, baseType: !242, size: 64, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !322, file: !12, line: 88, baseType: !329, size: 64, offset: 256)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !200)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !322, file: !12, line: 89, baseType: !202, size: 8, offset: 320)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !322, file: !12, line: 90, baseType: !250, size: 64, offset: 384)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !322, file: !12, line: 91, baseType: !334, size: 64, offset: 448)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !335, line: 46, baseType: !336)
!335 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!336 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !322, file: !12, line: 92, baseType: !338, size: 32, offset: 512)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !322, file: !12, line: 93, baseType: !340, size: 32, offset: 544)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !322, file: !12, line: 94, baseType: !320, size: 64, offset: 576)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !322, file: !12, line: 95, baseType: !250, size: 64, offset: 640)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !322, file: !12, line: 96, baseType: !164, size: 64, offset: 704)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !316, file: !12, line: 102, baseType: !250, size: 64, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !316, file: !12, line: 102, baseType: !250, size: 64, offset: 192)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !316, file: !12, line: 103, baseType: !250, size: 64, offset: 256)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !316, file: !12, line: 104, baseType: !160, size: 64, offset: 320)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !316, file: !12, line: 105, baseType: !338, size: 32, offset: 384)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !316, file: !12, line: 105, baseType: !338, size: 32, offset: 416)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !316, file: !12, line: 105, baseType: !338, size: 32, offset: 448)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !316, file: !12, line: 106, baseType: !165, size: 64, offset: 512)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !316, file: !12, line: 107, baseType: !353, size: 64, offset: 576)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!356 = !{!357}
!357 = !DISubrange(count: 5)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !167, file: !168, line: 113, baseType: !359, size: 320, offset: 3648)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 320, elements: !356)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!181, !165, !164}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !167, file: !168, line: 114, baseType: !364, size: 320, offset: 3968)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 320, elements: !356)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !167, file: !168, line: 115, baseType: !338, size: 32, offset: 4288)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !167, file: !168, line: 120, baseType: !353, size: 64, offset: 4352)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !167, file: !168, line: 121, baseType: !338, size: 32, offset: 4416)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !370, line: 1451, baseType: !211)
!370 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPCG_GLTR", file: !373, line: 49, baseType: !374)
!373 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/ksp/impls/cg/gltr/gltrimpl.h", directory: "/home/users/ndemeye/xSDK")
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 23, size: 1152, elements: !375)
!375 = !{!376, !377, !378, !379, !380, !381, !382, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "diag", scope: !374, file: !373, line: 24, baseType: !276, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "offd", scope: !374, file: !373, line: 25, baseType: !276, size: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !374, file: !373, line: 26, baseType: !276, size: 64, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "beta", scope: !374, file: !373, line: 27, baseType: !276, size: 64, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "norm_r", scope: !374, file: !373, line: 28, baseType: !276, size: 64, offset: 256)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "rwork", scope: !374, file: !373, line: 30, baseType: !276, size: 64, offset: 320)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "iwork", scope: !374, file: !373, line: 31, baseType: !383, size: 64, offset: 384)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBLASInt", file: !6, line: 140, baseType: !28)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !374, file: !373, line: 33, baseType: !277, size: 64, offset: 448)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "norm_d", scope: !374, file: !373, line: 34, baseType: !277, size: 64, offset: 512)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "e_min", scope: !374, file: !373, line: 35, baseType: !277, size: 64, offset: 576)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "o_fcn", scope: !374, file: !373, line: 36, baseType: !277, size: 64, offset: 640)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !374, file: !373, line: 37, baseType: !277, size: 64, offset: 704)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "init_pert", scope: !374, file: !373, line: 39, baseType: !277, size: 64, offset: 768)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "eigen_tol", scope: !374, file: !373, line: 40, baseType: !277, size: 64, offset: 832)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "newton_tol", scope: !374, file: !373, line: 41, baseType: !277, size: 64, offset: 896)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "alloced", scope: !374, file: !373, line: 43, baseType: !223, size: 32, offset: 960)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "init_alloc", scope: !374, file: !373, line: 44, baseType: !223, size: 32, offset: 992)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "max_lanczos_its", scope: !374, file: !373, line: 46, baseType: !223, size: 32, offset: 1024)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "max_newton_its", scope: !374, file: !373, line: 47, baseType: !223, size: 32, offset: 1056)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "dtype", scope: !374, file: !373, line: 48, baseType: !223, size: 32, offset: 1088)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !161, line: 331, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !161, line: 331, flags: DIFlagFwdDecl)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !161, line: 338, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !161, line: 338, flags: DIFlagFwdDecl)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !27, line: 395, baseType: !142)
!405 = !{!0}
!406 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/cg/gltr/gltr.c", directory: "/home/users/ndemeye/xSDK")
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 4096, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 64)
!410 = !{i32 7, !"Dwarf Version", i32 4}
!411 = !{i32 2, !"Debug Info Version", i32 3}
!412 = !{i32 1, !"wchar_size", i32 4}
!413 = !{i32 7, !"PIC Level", i32 2}
!414 = !{i32 7, !"uwtable", i32 1}
!415 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!416 = distinct !DISubprogram(name: "KSPGLTRGetMinEig", scope: !406, file: !406, line: 23, type: !417, scopeLine: 24, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !663)
!417 = !DISubroutineType(types: !418)
!418 = !{!181, !419, !276}
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !35, line: 22, baseType: !420)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !104, line: 75, size: 12800, elements: !422)
!422 = !{!423, !425, !478, !483, !484, !485, !486, !516, !517, !518, !519, !520, !522, !527, !528, !529, !530, !531, !532, !533, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !556, !562, !563, !564, !565, !570, !571, !572, !573, !578, !579, !580, !581, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !633, !634, !635, !636, !637, !644, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !660, !661, !662}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !421, file: !104, line: 76, baseType: !424, size: 4480)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !168, line: 122, baseType: !167)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !421, file: !104, line: 76, baseType: !426, size: 896, offset: 4480)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 896, elements: !219)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !104, line: 18, size: 896, elements: !428)
!428 = !{!429, !437, !441, !445, !453, !454, !458, !459, !463, !467, !471, !472, !476, !477}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !427, file: !104, line: 19, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!181, !419, !433, !436}
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !152, line: 21, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !152, line: 21, flags: DIFlagFwdDecl)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !427, file: !104, line: 22, baseType: !438, size: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!181, !419, !433, !433, !436}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !427, file: !104, line: 25, baseType: !442, size: 64, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!181, !419}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !427, file: !104, line: 26, baseType: !446, size: 64, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!181, !419, !449, !449}
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !450, line: 16, baseType: !451)
!450 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !450, line: 16, flags: DIFlagFwdDecl)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !427, file: !104, line: 27, baseType: !442, size: 64, offset: 256)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !427, file: !104, line: 28, baseType: !455, size: 64, offset: 320)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!181, !314, !419}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !427, file: !104, line: 29, baseType: !442, size: 64, offset: 384)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !427, file: !104, line: 30, baseType: !460, size: 64, offset: 448)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!181, !419, !276, !276}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !427, file: !104, line: 31, baseType: !464, size: 64, offset: 512)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!181, !419, !223, !276, !276, !268}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !427, file: !104, line: 32, baseType: !468, size: 64, offset: 576)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!181, !419, !338, !338, !268, !436, !276, !276}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !427, file: !104, line: 33, baseType: !442, size: 64, offset: 640)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !427, file: !104, line: 34, baseType: !473, size: 64, offset: 704)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!181, !419, !187}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !427, file: !104, line: 35, baseType: !442, size: 64, offset: 768)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !427, file: !104, line: 36, baseType: !473, size: 64, offset: 832)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !421, file: !104, line: 77, baseType: !479, size: 64, offset: 5376)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !480, line: 14, baseType: !481)
!480 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !480, line: 14, flags: DIFlagFwdDecl)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !421, file: !104, line: 78, baseType: !338, size: 32, offset: 5440)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !421, file: !104, line: 79, baseType: !338, size: 32, offset: 5472)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !421, file: !104, line: 81, baseType: !223, size: 32, offset: 5504)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !421, file: !104, line: 82, baseType: !487, size: 64, offset: 5568)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !35, line: 752, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !104, line: 54, size: 5184, elements: !490)
!490 = !{!491, !492, !512, !513, !514, !515}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !489, file: !104, line: 55, baseType: !424, size: 4480)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !489, file: !104, line: 55, baseType: !493, size: 448, offset: 4480)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 448, elements: !219)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !104, line: 41, size: 448, elements: !495)
!495 = !{!496, !500, !501, !505, !506, !507, !511}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !494, file: !104, line: 42, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{!181, !487, !433, !433}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !494, file: !104, line: 43, baseType: !497, size: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !494, file: !104, line: 44, baseType: !502, size: 64, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{!181, !487}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !494, file: !104, line: 45, baseType: !502, size: 64, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !494, file: !104, line: 46, baseType: !502, size: 64, offset: 256)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !494, file: !104, line: 47, baseType: !508, size: 64, offset: 320)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!181, !487, !187}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !494, file: !104, line: 48, baseType: !502, size: 64, offset: 384)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !489, file: !104, line: 56, baseType: !419, size: 64, offset: 4928)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !489, file: !104, line: 57, baseType: !449, size: 64, offset: 4992)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !489, file: !104, line: 58, baseType: !261, size: 64, offset: 5056)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !489, file: !104, line: 59, baseType: !164, size: 64, offset: 5120)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !421, file: !104, line: 83, baseType: !338, size: 32, offset: 5632)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !421, file: !104, line: 84, baseType: !338, size: 32, offset: 5664)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !421, file: !104, line: 85, baseType: !338, size: 32, offset: 5696)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !421, file: !104, line: 86, baseType: !338, size: 32, offset: 5728)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !421, file: !104, line: 87, baseType: !521, size: 32, offset: 5760)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !27, line: 85, baseType: !26)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !421, file: !104, line: 88, baseType: !523, size: 384, offset: 5792)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 384, elements: !524)
!524 = !{!525, !526}
!525 = !DISubrange(count: 4)
!526 = !DISubrange(count: 3)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !421, file: !104, line: 89, baseType: !277, size: 64, offset: 6208)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !421, file: !104, line: 90, baseType: !277, size: 64, offset: 6272)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !421, file: !104, line: 91, baseType: !277, size: 64, offset: 6336)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !421, file: !104, line: 92, baseType: !277, size: 64, offset: 6400)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !421, file: !104, line: 93, baseType: !277, size: 64, offset: 6464)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !421, file: !104, line: 94, baseType: !277, size: 64, offset: 6528)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !421, file: !104, line: 95, baseType: !534, size: 32, offset: 6592)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !35, line: 540, baseType: !34)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !421, file: !104, line: 96, baseType: !338, size: 32, offset: 6624)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !421, file: !104, line: 98, baseType: !433, size: 64, offset: 6656)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !421, file: !104, line: 98, baseType: !433, size: 64, offset: 6720)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !421, file: !104, line: 102, baseType: !276, size: 64, offset: 6784)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !421, file: !104, line: 103, baseType: !276, size: 64, offset: 6848)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !421, file: !104, line: 104, baseType: !223, size: 32, offset: 6912)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !421, file: !104, line: 105, baseType: !223, size: 32, offset: 6944)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !421, file: !104, line: 106, baseType: !338, size: 32, offset: 6976)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !421, file: !104, line: 107, baseType: !276, size: 64, offset: 7040)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !421, file: !104, line: 108, baseType: !276, size: 64, offset: 7104)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !421, file: !104, line: 109, baseType: !223, size: 32, offset: 7168)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !421, file: !104, line: 110, baseType: !223, size: 32, offset: 7200)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !421, file: !104, line: 111, baseType: !338, size: 32, offset: 7232)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !421, file: !104, line: 113, baseType: !223, size: 32, offset: 7264)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !421, file: !104, line: 114, baseType: !338, size: 32, offset: 7296)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !421, file: !104, line: 117, baseType: !223, size: 32, offset: 7328)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !421, file: !104, line: 120, baseType: !552, size: 320, offset: 7360)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 320, elements: !356)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{!181, !419, !223, !277, !164}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !421, file: !104, line: 121, baseType: !557, size: 320, offset: 7680)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 320, elements: !356)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{!181, !561}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !421, file: !104, line: 122, baseType: !364, size: 320, offset: 8000)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !421, file: !104, line: 123, baseType: !223, size: 32, offset: 8320)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !421, file: !104, line: 124, baseType: !338, size: 32, offset: 8352)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !421, file: !104, line: 126, baseType: !566, size: 320, offset: 8384)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 320, elements: !356)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!181, !419, !164}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !421, file: !104, line: 127, baseType: !557, size: 320, offset: 8704)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !421, file: !104, line: 128, baseType: !364, size: 320, offset: 9024)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !421, file: !104, line: 129, baseType: !223, size: 32, offset: 9344)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !421, file: !104, line: 131, baseType: !574, size: 64, offset: 9408)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!181, !419, !223, !277, !577, !164}
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !421, file: !104, line: 132, baseType: !305, size: 64, offset: 9472)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !421, file: !104, line: 133, baseType: !164, size: 64, offset: 9536)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !421, file: !104, line: 135, baseType: !164, size: 64, offset: 9600)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !421, file: !104, line: 137, baseType: !582, size: 64, offset: 9664)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !27, line: 11, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !27, line: 11, flags: DIFlagFwdDecl)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !421, file: !104, line: 139, baseType: !164, size: 64, offset: 9728)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !421, file: !104, line: 142, baseType: !338, size: 32, offset: 9792)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !421, file: !104, line: 142, baseType: !338, size: 32, offset: 9824)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !421, file: !104, line: 142, baseType: !338, size: 32, offset: 9856)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !421, file: !104, line: 142, baseType: !338, size: 32, offset: 9888)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !421, file: !104, line: 142, baseType: !338, size: 32, offset: 9920)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !421, file: !104, line: 142, baseType: !338, size: 32, offset: 9952)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !421, file: !104, line: 142, baseType: !338, size: 32, offset: 9984)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !421, file: !104, line: 142, baseType: !338, size: 32, offset: 10016)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !421, file: !104, line: 142, baseType: !338, size: 32, offset: 10048)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !421, file: !104, line: 142, baseType: !338, size: 32, offset: 10080)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !421, file: !104, line: 142, baseType: !338, size: 32, offset: 10112)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !421, file: !104, line: 142, baseType: !338, size: 32, offset: 10144)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !421, file: !104, line: 142, baseType: !338, size: 32, offset: 10176)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !421, file: !104, line: 142, baseType: !338, size: 32, offset: 10208)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !421, file: !104, line: 143, baseType: !187, size: 64, offset: 10240)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !421, file: !104, line: 143, baseType: !187, size: 64, offset: 10304)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !421, file: !104, line: 143, baseType: !187, size: 64, offset: 10368)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !421, file: !104, line: 143, baseType: !187, size: 64, offset: 10432)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !421, file: !104, line: 143, baseType: !187, size: 64, offset: 10496)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !421, file: !104, line: 143, baseType: !187, size: 64, offset: 10560)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !421, file: !104, line: 143, baseType: !187, size: 64, offset: 10624)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !421, file: !104, line: 143, baseType: !187, size: 64, offset: 10688)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !421, file: !104, line: 143, baseType: !187, size: 64, offset: 10752)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !421, file: !104, line: 143, baseType: !187, size: 64, offset: 10816)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !421, file: !104, line: 143, baseType: !187, size: 64, offset: 10880)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !421, file: !104, line: 143, baseType: !187, size: 64, offset: 10944)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !421, file: !104, line: 143, baseType: !187, size: 64, offset: 11008)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !421, file: !104, line: 143, baseType: !187, size: 64, offset: 11072)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !421, file: !104, line: 144, baseType: !615, size: 32, offset: 11136)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !59, line: 162, baseType: !58)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !421, file: !104, line: 144, baseType: !615, size: 32, offset: 11168)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !421, file: !104, line: 144, baseType: !615, size: 32, offset: 11200)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !421, file: !104, line: 144, baseType: !615, size: 32, offset: 11232)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !421, file: !104, line: 144, baseType: !615, size: 32, offset: 11264)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !421, file: !104, line: 144, baseType: !615, size: 32, offset: 11296)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !421, file: !104, line: 144, baseType: !615, size: 32, offset: 11328)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !421, file: !104, line: 144, baseType: !615, size: 32, offset: 11360)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !421, file: !104, line: 144, baseType: !615, size: 32, offset: 11392)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !421, file: !104, line: 144, baseType: !615, size: 32, offset: 11424)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !421, file: !104, line: 144, baseType: !615, size: 32, offset: 11456)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !421, file: !104, line: 144, baseType: !615, size: 32, offset: 11488)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !421, file: !104, line: 144, baseType: !615, size: 32, offset: 11520)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !421, file: !104, line: 144, baseType: !615, size: 32, offset: 11552)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !421, file: !104, line: 147, baseType: !223, size: 32, offset: 11584)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !421, file: !104, line: 148, baseType: !436, size: 64, offset: 11648)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !421, file: !104, line: 150, baseType: !632, size: 32, offset: 11712)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !104, line: 70, baseType: !103)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !421, file: !104, line: 151, baseType: !338, size: 32, offset: 11744)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !421, file: !104, line: 153, baseType: !223, size: 32, offset: 11776)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !421, file: !104, line: 154, baseType: !223, size: 32, offset: 11808)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !421, file: !104, line: 156, baseType: !338, size: 32, offset: 11840)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !421, file: !104, line: 161, baseType: !638, size: 192, offset: 11904)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !421, file: !104, line: 157, size: 192, elements: !639)
!639 = !{!640, !641, !642, !643}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !638, file: !104, line: 158, baseType: !449, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !638, file: !104, line: 158, baseType: !449, size: 64, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !638, file: !104, line: 159, baseType: !338, size: 32, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !638, file: !104, line: 160, baseType: !338, size: 32, offset: 160)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !421, file: !104, line: 163, baseType: !645, size: 32, offset: 12096)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !35, line: 451, baseType: !109)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !421, file: !104, line: 165, baseType: !521, size: 32, offset: 12128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !421, file: !104, line: 166, baseType: !645, size: 32, offset: 12160)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !421, file: !104, line: 171, baseType: !338, size: 32, offset: 12192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !421, file: !104, line: 172, baseType: !338, size: 32, offset: 12224)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !421, file: !104, line: 173, baseType: !338, size: 32, offset: 12256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !421, file: !104, line: 174, baseType: !433, size: 64, offset: 12288)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !421, file: !104, line: 175, baseType: !433, size: 64, offset: 12352)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !421, file: !104, line: 177, baseType: !223, size: 32, offset: 12416)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !421, file: !104, line: 178, baseType: !338, size: 32, offset: 12448)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !421, file: !104, line: 180, baseType: !187, size: 64, offset: 12480)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !421, file: !104, line: 182, baseType: !657, size: 64, offset: 12544)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!181, !419, !433, !433, !164}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !421, file: !104, line: 183, baseType: !657, size: 64, offset: 12608)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !421, file: !104, line: 184, baseType: !164, size: 64, offset: 12672)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !421, file: !104, line: 184, baseType: !164, size: 64, offset: 12736)
!663 = !{!664, !665, !666, !667, !670, !671, !673, !677}
!664 = !DILocalVariable(name: "ksp", arg: 1, scope: !416, file: !406, line: 23, type: !419)
!665 = !DILocalVariable(name: "e_min", arg: 2, scope: !416, file: !406, line: 23, type: !276)
!666 = !DILocalVariable(name: "ierr", scope: !416, file: !406, line: 25, type: !181)
!667 = !DILocalVariable(name: "_7_f", scope: !668, file: !406, line: 29, type: !669)
!668 = distinct !DILexicalBlock(scope: !416, file: !406, line: 29, column: 10)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!670 = !DILocalVariable(name: "_7_ierr", scope: !668, file: !406, line: 29, type: !181)
!671 = !DILocalVariable(name: "ierr__", scope: !672, file: !406, line: 29, type: !181)
!672 = distinct !DILexicalBlock(scope: !668, file: !406, line: 29, column: 10)
!673 = !DILocalVariable(name: "ierr__", scope: !674, file: !406, line: 29, type: !181)
!674 = distinct !DILexicalBlock(scope: !675, file: !406, line: 29, column: 10)
!675 = distinct !DILexicalBlock(scope: !676, file: !406, line: 29, column: 10)
!676 = distinct !DILexicalBlock(scope: !668, file: !406, line: 29, column: 10)
!677 = !DILocalVariable(name: "ierr__", scope: !678, file: !406, line: 29, type: !181)
!678 = distinct !DILexicalBlock(scope: !416, file: !406, line: 29, column: 80)
!679 = !DILocation(line: 0, scope: !416)
!680 = !DILocation(line: 27, column: 3, scope: !681)
!681 = distinct !DILexicalBlock(scope: !682, file: !406, line: 27, column: 3)
!682 = distinct !DILexicalBlock(scope: !683, file: !406, line: 27, column: 3)
!683 = distinct !DILexicalBlock(scope: !416, file: !406, line: 27, column: 3)
!684 = !{!685, !685, i64 0}
!685 = !{!"any pointer", !686, i64 0}
!686 = !{!"omnipotent char", !687, i64 0}
!687 = !{!"Simple C/C++ TBAA"}
!688 = !DILocation(line: 27, column: 3, scope: !682)
!689 = !DILocation(line: 27, column: 3, scope: !690)
!690 = distinct !DILexicalBlock(scope: !691, file: !406, line: 27, column: 3)
!691 = distinct !DILexicalBlock(scope: !681, file: !406, line: 27, column: 3)
!692 = !{!693, !694, i64 1536}
!693 = !{!"", !686, i64 0, !686, i64 512, !686, i64 1024, !686, i64 1280, !694, i64 1536, !694, i64 1540, !686, i64 1544}
!694 = !{!"int", !686, i64 0}
!695 = !DILocation(line: 27, column: 3, scope: !691)
!696 = !DILocation(line: 27, column: 3, scope: !697)
!697 = distinct !DILexicalBlock(scope: !690, file: !406, line: 27, column: 3)
!698 = !{!694, !694, i64 0}
!699 = !{!693, !694, i64 1540}
!700 = !DILocation(line: 28, column: 3, scope: !701)
!701 = distinct !DILexicalBlock(scope: !702, file: !406, line: 28, column: 3)
!702 = distinct !DILexicalBlock(scope: !416, file: !406, line: 28, column: 3)
!703 = !DILocation(line: 28, column: 3, scope: !702)
!704 = !DILocation(line: 28, column: 3, scope: !705)
!705 = distinct !DILexicalBlock(scope: !702, file: !406, line: 28, column: 3)
!706 = !DILocation(line: 28, column: 3, scope: !707)
!707 = distinct !DILexicalBlock(scope: !702, file: !406, line: 28, column: 3)
!708 = !{!709, !694, i64 0}
!709 = !{!"_p_PetscObject", !694, i64 0, !686, i64 8, !685, i64 64, !694, i64 72, !710, i64 80, !710, i64 88, !710, i64 96, !710, i64 104, !711, i64 112, !694, i64 120, !694, i64 124, !685, i64 128, !685, i64 136, !685, i64 144, !685, i64 152, !685, i64 160, !685, i64 168, !685, i64 176, !711, i64 184, !685, i64 192, !685, i64 200, !694, i64 208, !685, i64 216, !711, i64 224, !694, i64 232, !694, i64 236, !685, i64 240, !685, i64 248, !685, i64 256, !685, i64 264, !694, i64 272, !694, i64 276, !685, i64 280, !685, i64 288, !685, i64 296, !685, i64 304, !694, i64 312, !694, i64 316, !685, i64 320, !685, i64 328, !685, i64 336, !685, i64 344, !685, i64 352, !694, i64 360, !686, i64 368, !686, i64 384, !685, i64 392, !685, i64 400, !694, i64 408, !686, i64 416, !686, i64 456, !686, i64 496, !686, i64 536, !685, i64 544, !686, i64 552}
