; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/dgmres/dgmres.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/dgmres/dgmres.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!73 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !104, line: 70, baseType: !7, size: 32, elements: !105)
!104 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!105 = !{!106, !107, !108}
!106 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!107 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!108 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 451, baseType: !28, size: 32, elements: !110)
!110 = !{!111, !112, !113, !114, !115}
!111 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!112 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!113 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!114 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!115 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!116 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !117, line: 663, baseType: !7, size: 32, elements: !118)
!117 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!118 = !{!119, !120, !121}
!119 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!120 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!121 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!122 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 297, baseType: !7, size: 32, elements: !123)
!123 = !{!124, !125, !126}
!124 = !DIEnumerator(name: "KSP_GMRES_CGS_REFINE_NEVER", value: 0, isUnsigned: true)
!125 = !DIEnumerator(name: "KSP_GMRES_CGS_REFINE_IFNEEDED", value: 1, isUnsigned: true)
!126 = !DIEnumerator(name: "KSP_GMRES_CGS_REFINE_ALWAYS", value: 2, isUnsigned: true)
!127 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 395, baseType: !28, size: 32, elements: !128)
!128 = !{!129, !130, !131, !132, !133, !134, !135}
!129 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!130 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!131 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!132 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!133 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!134 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!135 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!136 = !{!137, !345, !155, !236, !176, !348, !311, !199, !669, !672, !226, !28, !675, !202, !346, !637}
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !140, line: 73, size: 4480, elements: !141)
!140 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!141 = !{!142, !144, !197, !198, !200, !203, !204, !205, !206, !214, !215, !217, !221, !225, !227, !228, !229, !230, !231, !232, !233, !234, !235, !237, !239, !240, !241, !243, !244, !246, !248, !249, !250, !251, !252, !255, !257, !258, !259, !260, !261, !264, !266, !267, !268, !278, !280, !281, !285, !286, !335, !340, !342, !343, !344}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !139, file: !140, line: 74, baseType: !143, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !139, file: !140, line: 75, baseType: !145, size: 448, offset: 64)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 448, elements: !195)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !140, line: 53, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !140, line: 45, size: 448, elements: !148)
!148 = !{!149, !159, !167, !172, !179, !183, !190}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !147, file: !140, line: 46, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!153, !137, !154}
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !156, line: 330, baseType: !157)
!156 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !156, line: 330, flags: DIFlagFwdDecl)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !147, file: !140, line: 47, baseType: !160, size: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!153, !137, !163}
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !164, line: 16, baseType: !165)
!164 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !164, line: 16, flags: DIFlagFwdDecl)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !147, file: !140, line: 48, baseType: !168, size: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!153, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !147, file: !140, line: 49, baseType: !173, size: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!153, !137, !176, !137}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !178)
!178 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !147, file: !140, line: 50, baseType: !180, size: 64, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!153, !137, !176, !171}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !147, file: !140, line: 51, baseType: !184, size: 64, offset: 320)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!153, !137, !176, !187}
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{null}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !147, file: !140, line: 52, baseType: !191, size: 64, offset: 384)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!153, !137, !176, !194}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!195 = !{!196}
!196 = !DISubrange(count: 1)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !139, file: !140, line: 76, baseType: !155, size: 64, offset: 512)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !139, file: !140, line: 77, baseType: !199, size: 32, offset: 576)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !139, file: !140, line: 78, baseType: !201, size: 64, offset: 640)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !202)
!202 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !139, file: !140, line: 78, baseType: !201, size: 64, offset: 704)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !139, file: !140, line: 78, baseType: !201, size: 64, offset: 768)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !139, file: !140, line: 78, baseType: !201, size: 64, offset: 832)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !139, file: !140, line: 79, baseType: !207, size: 64, offset: 896)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !210, line: 27, baseType: !211)
!210 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !212, line: 43, baseType: !213)
!212 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!213 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !139, file: !140, line: 80, baseType: !199, size: 32, offset: 960)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !139, file: !140, line: 81, baseType: !216, size: 32, offset: 992)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !139, file: !140, line: 82, baseType: !218, size: 64, offset: 1024)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !139, file: !140, line: 83, baseType: !222, size: 64, offset: 1088)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !139, file: !140, line: 84, baseType: !226, size: 64, offset: 1152)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !139, file: !140, line: 85, baseType: !226, size: 64, offset: 1216)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !139, file: !140, line: 86, baseType: !226, size: 64, offset: 1280)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !139, file: !140, line: 87, baseType: !226, size: 64, offset: 1344)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !139, file: !140, line: 88, baseType: !137, size: 64, offset: 1408)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !139, file: !140, line: 89, baseType: !207, size: 64, offset: 1472)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !139, file: !140, line: 90, baseType: !226, size: 64, offset: 1536)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !139, file: !140, line: 91, baseType: !226, size: 64, offset: 1600)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !139, file: !140, line: 92, baseType: !199, size: 32, offset: 1664)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !139, file: !140, line: 93, baseType: !236, size: 64, offset: 1728)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !139, file: !140, line: 94, baseType: !238, size: 64, offset: 1792)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !208)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !139, file: !140, line: 95, baseType: !199, size: 32, offset: 1856)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !139, file: !140, line: 95, baseType: !199, size: 32, offset: 1888)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !139, file: !140, line: 96, baseType: !242, size: 64, offset: 1920)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !139, file: !140, line: 96, baseType: !242, size: 64, offset: 1984)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !139, file: !140, line: 97, baseType: !245, size: 64, offset: 2048)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !139, file: !140, line: 97, baseType: !247, size: 64, offset: 2112)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !139, file: !140, line: 98, baseType: !199, size: 32, offset: 2176)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !139, file: !140, line: 98, baseType: !199, size: 32, offset: 2208)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !139, file: !140, line: 99, baseType: !242, size: 64, offset: 2240)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !139, file: !140, line: 99, baseType: !242, size: 64, offset: 2304)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !139, file: !140, line: 100, baseType: !253, size: 64, offset: 2368)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !202)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !139, file: !140, line: 100, baseType: !256, size: 64, offset: 2432)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !139, file: !140, line: 101, baseType: !199, size: 32, offset: 2496)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !139, file: !140, line: 101, baseType: !199, size: 32, offset: 2528)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !139, file: !140, line: 102, baseType: !242, size: 64, offset: 2560)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !139, file: !140, line: 102, baseType: !242, size: 64, offset: 2624)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !139, file: !140, line: 103, baseType: !262, size: 64, offset: 2688)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !254)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !139, file: !140, line: 103, baseType: !265, size: 64, offset: 2752)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !139, file: !140, line: 104, baseType: !194, size: 64, offset: 2816)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !139, file: !140, line: 105, baseType: !199, size: 32, offset: 2880)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !139, file: !140, line: 106, baseType: !269, size: 128, offset: 2944)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 128, elements: !276)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !140, line: 64, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !140, line: 61, size: 128, elements: !273)
!273 = !{!274, !275}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !272, file: !140, line: 62, baseType: !187, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !272, file: !140, line: 63, baseType: !236, size: 64, offset: 64)
!276 = !{!277}
!277 = !DISubrange(count: 2)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !139, file: !140, line: 107, baseType: !279, size: 64, offset: 3072)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 64, elements: !276)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !139, file: !140, line: 108, baseType: !236, size: 64, offset: 3136)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !139, file: !140, line: 109, baseType: !282, size: 64, offset: 3200)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!153, !236}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !139, file: !140, line: 111, baseType: !199, size: 32, offset: 3264)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !139, file: !140, line: 112, baseType: !287, size: 320, offset: 3328)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 320, elements: !333)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!153, !291, !137, !236}
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !294)
!294 = !{!295, !296, !321, !322, !323, !324, !325, !326, !327, !328, !329}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !293, file: !12, line: 100, baseType: !199, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !293, file: !12, line: 101, baseType: !297, size: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !300)
!300 = !{!301, !302, !303, !304, !305, !308, !309, !310, !314, !316, !318, !319, !320}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !299, file: !12, line: 84, baseType: !226, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !299, file: !12, line: 85, baseType: !226, size: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !299, file: !12, line: 86, baseType: !236, size: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !299, file: !12, line: 87, baseType: !218, size: 64, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !299, file: !12, line: 88, baseType: !306, size: 64, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !176)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !299, file: !12, line: 89, baseType: !178, size: 8, offset: 320)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !299, file: !12, line: 90, baseType: !226, size: 64, offset: 384)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !299, file: !12, line: 91, baseType: !311, size: 64, offset: 448)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !312, line: 46, baseType: !313)
!312 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!313 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !299, file: !12, line: 92, baseType: !315, size: 32, offset: 512)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !299, file: !12, line: 93, baseType: !317, size: 32, offset: 544)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !299, file: !12, line: 94, baseType: !297, size: 64, offset: 576)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !299, file: !12, line: 95, baseType: !226, size: 64, offset: 640)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !299, file: !12, line: 96, baseType: !236, size: 64, offset: 704)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !293, file: !12, line: 102, baseType: !226, size: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !293, file: !12, line: 102, baseType: !226, size: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !293, file: !12, line: 103, baseType: !226, size: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !293, file: !12, line: 104, baseType: !155, size: 64, offset: 320)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !293, file: !12, line: 105, baseType: !315, size: 32, offset: 384)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !293, file: !12, line: 105, baseType: !315, size: 32, offset: 416)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !293, file: !12, line: 105, baseType: !315, size: 32, offset: 448)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !293, file: !12, line: 106, baseType: !137, size: 64, offset: 512)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !293, file: !12, line: 107, baseType: !330, size: 64, offset: 576)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!333 = !{!334}
!334 = !DISubrange(count: 5)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !139, file: !140, line: 113, baseType: !336, size: 320, offset: 3648)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 320, elements: !333)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!153, !137, !236}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !139, file: !140, line: 114, baseType: !341, size: 320, offset: 3968)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 320, elements: !333)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !139, file: !140, line: 115, baseType: !315, size: 32, offset: 4288)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !139, file: !140, line: 120, baseType: !330, size: 64, offset: 4352)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !139, file: !140, line: 121, baseType: !315, size: 32, offset: 4416)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !347, line: 1451, baseType: !187)
!347 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP_DGMRES", file: !350, line: 47, baseType: !351)
!350 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/ksp/impls/gmres/dgmres/dgmresimpl.h", directory: "/home/users/ndemeye/xSDK")
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !350, line: 44, size: 3648, elements: !352)
!352 = !{!353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !614, !616, !617, !618, !619, !620, !621, !622, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "hh_origin", scope: !351, file: !350, line: 45, baseType: !262, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "hes_origin", scope: !351, file: !350, line: 45, baseType: !262, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "hes_ritz", scope: !351, file: !350, line: 45, baseType: !262, size: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "cc_origin", scope: !351, file: !350, line: 45, baseType: !262, size: 64, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ss_origin", scope: !351, file: !350, line: 45, baseType: !262, size: 64, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "rs_origin", scope: !351, file: !350, line: 45, baseType: !262, size: 64, offset: 320)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "orthogwork", scope: !351, file: !350, line: 45, baseType: !262, size: 64, offset: 384)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "Dsvd", scope: !351, file: !350, line: 45, baseType: !253, size: 64, offset: 448)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "Rsvd", scope: !351, file: !350, line: 45, baseType: !262, size: 64, offset: 512)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "haptol", scope: !351, file: !350, line: 45, baseType: !254, size: 64, offset: 576)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "max_k", scope: !351, file: !350, line: 45, baseType: !199, size: 32, offset: 640)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "nextra_vecs", scope: !351, file: !350, line: 45, baseType: !199, size: 32, offset: 672)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "orthog", scope: !351, file: !350, line: 45, baseType: !366, size: 64, offset: 704)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!153, !369, !199}
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !35, line: 22, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !104, line: 75, size: 12800, elements: !372)
!372 = !{!373, !375, !429, !434, !435, !436, !437, !467, !468, !469, !470, !471, !473, !478, !479, !480, !481, !482, !483, !484, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !507, !513, !514, !515, !516, !521, !522, !523, !524, !529, !530, !531, !532, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !584, !585, !586, !587, !588, !595, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !611, !612, !613}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !371, file: !104, line: 76, baseType: !374, size: 4480)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !140, line: 122, baseType: !139)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !371, file: !104, line: 76, baseType: !376, size: 896, offset: 4480)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 896, elements: !195)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !104, line: 18, size: 896, elements: !378)
!378 = !{!379, !388, !392, !396, !404, !405, !409, !410, !414, !418, !422, !423, !427, !428}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !377, file: !104, line: 19, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!153, !369, !383, !387}
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !384, line: 21, baseType: !385)
!384 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !384, line: 21, flags: DIFlagFwdDecl)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !377, file: !104, line: 22, baseType: !389, size: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!153, !369, !383, !383, !387}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !377, file: !104, line: 25, baseType: !393, size: 64, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!153, !369}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !377, file: !104, line: 26, baseType: !397, size: 64, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!153, !369, !400, !400}
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !401, line: 16, baseType: !402)
!401 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !401, line: 16, flags: DIFlagFwdDecl)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !377, file: !104, line: 27, baseType: !393, size: 64, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !377, file: !104, line: 28, baseType: !406, size: 64, offset: 320)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!153, !291, !369}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !377, file: !104, line: 29, baseType: !393, size: 64, offset: 384)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !377, file: !104, line: 30, baseType: !411, size: 64, offset: 448)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!153, !369, !253, !253}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !377, file: !104, line: 31, baseType: !415, size: 64, offset: 512)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!153, !369, !199, !253, !253, !245}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !377, file: !104, line: 32, baseType: !419, size: 64, offset: 576)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!153, !369, !315, !315, !245, !387, !253, !253}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !377, file: !104, line: 33, baseType: !393, size: 64, offset: 640)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !377, file: !104, line: 34, baseType: !424, size: 64, offset: 704)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!153, !369, !163}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !377, file: !104, line: 35, baseType: !393, size: 64, offset: 768)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !377, file: !104, line: 36, baseType: !424, size: 64, offset: 832)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !371, file: !104, line: 77, baseType: !430, size: 64, offset: 5376)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !431, line: 14, baseType: !432)
!431 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !431, line: 14, flags: DIFlagFwdDecl)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !371, file: !104, line: 78, baseType: !315, size: 32, offset: 5440)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !371, file: !104, line: 79, baseType: !315, size: 32, offset: 5472)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !371, file: !104, line: 81, baseType: !199, size: 32, offset: 5504)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !371, file: !104, line: 82, baseType: !438, size: 64, offset: 5568)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !35, line: 752, baseType: !439)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !104, line: 54, size: 5184, elements: !441)
!441 = !{!442, !443, !463, !464, !465, !466}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !440, file: !104, line: 55, baseType: !374, size: 4480)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !440, file: !104, line: 55, baseType: !444, size: 448, offset: 4480)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 448, elements: !195)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !104, line: 41, size: 448, elements: !446)
!446 = !{!447, !451, !452, !456, !457, !458, !462}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !445, file: !104, line: 42, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{!153, !438, !383, !383}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !445, file: !104, line: 43, baseType: !448, size: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !445, file: !104, line: 44, baseType: !453, size: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!153, !438}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !445, file: !104, line: 45, baseType: !453, size: 64, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !445, file: !104, line: 46, baseType: !453, size: 64, offset: 256)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !445, file: !104, line: 47, baseType: !459, size: 64, offset: 320)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!153, !438, !163}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !445, file: !104, line: 48, baseType: !453, size: 64, offset: 384)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !440, file: !104, line: 56, baseType: !369, size: 64, offset: 4928)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !440, file: !104, line: 57, baseType: !400, size: 64, offset: 4992)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !440, file: !104, line: 58, baseType: !238, size: 64, offset: 5056)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !440, file: !104, line: 59, baseType: !236, size: 64, offset: 5120)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !371, file: !104, line: 83, baseType: !315, size: 32, offset: 5632)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !371, file: !104, line: 84, baseType: !315, size: 32, offset: 5664)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !371, file: !104, line: 85, baseType: !315, size: 32, offset: 5696)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !371, file: !104, line: 86, baseType: !315, size: 32, offset: 5728)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !371, file: !104, line: 87, baseType: !472, size: 32, offset: 5760)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !27, line: 85, baseType: !26)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !371, file: !104, line: 88, baseType: !474, size: 384, offset: 5792)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 384, elements: !475)
!475 = !{!476, !477}
!476 = !DISubrange(count: 4)
!477 = !DISubrange(count: 3)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !371, file: !104, line: 89, baseType: !254, size: 64, offset: 6208)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !371, file: !104, line: 90, baseType: !254, size: 64, offset: 6272)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !371, file: !104, line: 91, baseType: !254, size: 64, offset: 6336)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !371, file: !104, line: 92, baseType: !254, size: 64, offset: 6400)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !371, file: !104, line: 93, baseType: !254, size: 64, offset: 6464)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !371, file: !104, line: 94, baseType: !254, size: 64, offset: 6528)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !371, file: !104, line: 95, baseType: !485, size: 32, offset: 6592)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !35, line: 540, baseType: !34)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !371, file: !104, line: 96, baseType: !315, size: 32, offset: 6624)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !371, file: !104, line: 98, baseType: !383, size: 64, offset: 6656)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !371, file: !104, line: 98, baseType: !383, size: 64, offset: 6720)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !371, file: !104, line: 102, baseType: !253, size: 64, offset: 6784)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !371, file: !104, line: 103, baseType: !253, size: 64, offset: 6848)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !371, file: !104, line: 104, baseType: !199, size: 32, offset: 6912)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !371, file: !104, line: 105, baseType: !199, size: 32, offset: 6944)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !371, file: !104, line: 106, baseType: !315, size: 32, offset: 6976)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !371, file: !104, line: 107, baseType: !253, size: 64, offset: 7040)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !371, file: !104, line: 108, baseType: !253, size: 64, offset: 7104)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !371, file: !104, line: 109, baseType: !199, size: 32, offset: 7168)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !371, file: !104, line: 110, baseType: !199, size: 32, offset: 7200)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !371, file: !104, line: 111, baseType: !315, size: 32, offset: 7232)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !371, file: !104, line: 113, baseType: !199, size: 32, offset: 7264)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !371, file: !104, line: 114, baseType: !315, size: 32, offset: 7296)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !371, file: !104, line: 117, baseType: !199, size: 32, offset: 7328)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !371, file: !104, line: 120, baseType: !503, size: 320, offset: 7360)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, size: 320, elements: !333)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!153, !369, !199, !254, !236}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !371, file: !104, line: 121, baseType: !508, size: 320, offset: 7680)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !509, size: 320, elements: !333)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{!153, !512}
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !371, file: !104, line: 122, baseType: !341, size: 320, offset: 8000)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !371, file: !104, line: 123, baseType: !199, size: 32, offset: 8320)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !371, file: !104, line: 124, baseType: !315, size: 32, offset: 8352)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !371, file: !104, line: 126, baseType: !517, size: 320, offset: 8384)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !518, size: 320, elements: !333)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{!153, !369, !236}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !371, file: !104, line: 127, baseType: !508, size: 320, offset: 8704)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !371, file: !104, line: 128, baseType: !341, size: 320, offset: 9024)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !371, file: !104, line: 129, baseType: !199, size: 32, offset: 9344)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !371, file: !104, line: 131, baseType: !525, size: 64, offset: 9408)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!153, !369, !199, !254, !528, !236}
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !371, file: !104, line: 132, baseType: !282, size: 64, offset: 9472)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !371, file: !104, line: 133, baseType: !236, size: 64, offset: 9536)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !371, file: !104, line: 135, baseType: !236, size: 64, offset: 9600)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !371, file: !104, line: 137, baseType: !533, size: 64, offset: 9664)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !27, line: 11, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !27, line: 11, flags: DIFlagFwdDecl)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !371, file: !104, line: 139, baseType: !236, size: 64, offset: 9728)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !371, file: !104, line: 142, baseType: !315, size: 32, offset: 9792)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !371, file: !104, line: 142, baseType: !315, size: 32, offset: 9824)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !371, file: !104, line: 142, baseType: !315, size: 32, offset: 9856)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !371, file: !104, line: 142, baseType: !315, size: 32, offset: 9888)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !371, file: !104, line: 142, baseType: !315, size: 32, offset: 9920)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !371, file: !104, line: 142, baseType: !315, size: 32, offset: 9952)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !371, file: !104, line: 142, baseType: !315, size: 32, offset: 9984)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !371, file: !104, line: 142, baseType: !315, size: 32, offset: 10016)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !371, file: !104, line: 142, baseType: !315, size: 32, offset: 10048)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !371, file: !104, line: 142, baseType: !315, size: 32, offset: 10080)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !371, file: !104, line: 142, baseType: !315, size: 32, offset: 10112)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !371, file: !104, line: 142, baseType: !315, size: 32, offset: 10144)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !371, file: !104, line: 142, baseType: !315, size: 32, offset: 10176)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !371, file: !104, line: 142, baseType: !315, size: 32, offset: 10208)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !371, file: !104, line: 143, baseType: !163, size: 64, offset: 10240)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !371, file: !104, line: 143, baseType: !163, size: 64, offset: 10304)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !371, file: !104, line: 143, baseType: !163, size: 64, offset: 10368)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !371, file: !104, line: 143, baseType: !163, size: 64, offset: 10432)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !371, file: !104, line: 143, baseType: !163, size: 64, offset: 10496)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !371, file: !104, line: 143, baseType: !163, size: 64, offset: 10560)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !371, file: !104, line: 143, baseType: !163, size: 64, offset: 10624)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !371, file: !104, line: 143, baseType: !163, size: 64, offset: 10688)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !371, file: !104, line: 143, baseType: !163, size: 64, offset: 10752)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !371, file: !104, line: 143, baseType: !163, size: 64, offset: 10816)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !371, file: !104, line: 143, baseType: !163, size: 64, offset: 10880)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !371, file: !104, line: 143, baseType: !163, size: 64, offset: 10944)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !371, file: !104, line: 143, baseType: !163, size: 64, offset: 11008)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !371, file: !104, line: 143, baseType: !163, size: 64, offset: 11072)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !371, file: !104, line: 144, baseType: !566, size: 32, offset: 11136)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !59, line: 162, baseType: !58)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !371, file: !104, line: 144, baseType: !566, size: 32, offset: 11168)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !371, file: !104, line: 144, baseType: !566, size: 32, offset: 11200)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !371, file: !104, line: 144, baseType: !566, size: 32, offset: 11232)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !371, file: !104, line: 144, baseType: !566, size: 32, offset: 11264)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !371, file: !104, line: 144, baseType: !566, size: 32, offset: 11296)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !371, file: !104, line: 144, baseType: !566, size: 32, offset: 11328)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !371, file: !104, line: 144, baseType: !566, size: 32, offset: 11360)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !371, file: !104, line: 144, baseType: !566, size: 32, offset: 11392)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !371, file: !104, line: 144, baseType: !566, size: 32, offset: 11424)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !371, file: !104, line: 144, baseType: !566, size: 32, offset: 11456)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !371, file: !104, line: 144, baseType: !566, size: 32, offset: 11488)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !371, file: !104, line: 144, baseType: !566, size: 32, offset: 11520)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !371, file: !104, line: 144, baseType: !566, size: 32, offset: 11552)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !371, file: !104, line: 147, baseType: !199, size: 32, offset: 11584)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !371, file: !104, line: 148, baseType: !387, size: 64, offset: 11648)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !371, file: !104, line: 150, baseType: !583, size: 32, offset: 11712)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !104, line: 70, baseType: !103)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !371, file: !104, line: 151, baseType: !315, size: 32, offset: 11744)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !371, file: !104, line: 153, baseType: !199, size: 32, offset: 11776)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !371, file: !104, line: 154, baseType: !199, size: 32, offset: 11808)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !371, file: !104, line: 156, baseType: !315, size: 32, offset: 11840)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !371, file: !104, line: 161, baseType: !589, size: 192, offset: 11904)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !371, file: !104, line: 157, size: 192, elements: !590)
!590 = !{!591, !592, !593, !594}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !589, file: !104, line: 158, baseType: !400, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !589, file: !104, line: 158, baseType: !400, size: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !589, file: !104, line: 159, baseType: !315, size: 32, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !589, file: !104, line: 160, baseType: !315, size: 32, offset: 160)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !371, file: !104, line: 163, baseType: !596, size: 32, offset: 12096)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !35, line: 451, baseType: !109)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !371, file: !104, line: 165, baseType: !472, size: 32, offset: 12128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !371, file: !104, line: 166, baseType: !596, size: 32, offset: 12160)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !371, file: !104, line: 171, baseType: !315, size: 32, offset: 12192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !371, file: !104, line: 172, baseType: !315, size: 32, offset: 12224)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !371, file: !104, line: 173, baseType: !315, size: 32, offset: 12256)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !371, file: !104, line: 174, baseType: !383, size: 64, offset: 12288)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !371, file: !104, line: 175, baseType: !383, size: 64, offset: 12352)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !371, file: !104, line: 177, baseType: !199, size: 32, offset: 12416)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !371, file: !104, line: 178, baseType: !315, size: 32, offset: 12448)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !371, file: !104, line: 180, baseType: !163, size: 64, offset: 12480)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !371, file: !104, line: 182, baseType: !608, size: 64, offset: 12544)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!153, !369, !383, !383, !236}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !371, file: !104, line: 183, baseType: !608, size: 64, offset: 12608)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !371, file: !104, line: 184, baseType: !236, size: 64, offset: 12672)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !371, file: !104, line: 184, baseType: !236, size: 64, offset: 12736)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "cgstype", scope: !351, file: !350, line: 45, baseType: !615, size: 32, offset: 768)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGMRESCGSRefinementType", file: !35, line: 297, baseType: !122)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !351, file: !350, line: 45, baseType: !387, size: 64, offset: 832)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "vecb", scope: !351, file: !350, line: 45, baseType: !387, size: 64, offset: 896)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "q_preallocate", scope: !351, file: !350, line: 45, baseType: !199, size: 32, offset: 960)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "delta_allocate", scope: !351, file: !350, line: 45, baseType: !199, size: 32, offset: 992)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "vv_allocated", scope: !351, file: !350, line: 45, baseType: !199, size: 32, offset: 1024)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_allocated", scope: !351, file: !350, line: 45, baseType: !199, size: 32, offset: 1056)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "user_work", scope: !351, file: !350, line: 45, baseType: !623, size: 64, offset: 1088)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "mwork_alloc", scope: !351, file: !350, line: 45, baseType: !245, size: 64, offset: 1152)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "nwork_alloc", scope: !351, file: !350, line: 45, baseType: !199, size: 32, offset: 1216)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !351, file: !350, line: 45, baseType: !199, size: 32, offset: 1248)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "fullcycle", scope: !351, file: !350, line: 45, baseType: !199, size: 32, offset: 1280)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "nrs", scope: !351, file: !350, line: 45, baseType: !262, size: 64, offset: 1344)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "sol_temp", scope: !351, file: !350, line: 45, baseType: !383, size: 64, offset: 1408)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !351, file: !350, line: 45, baseType: !254, size: 64, offset: 1472)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "breakdowntol", scope: !351, file: !350, line: 45, baseType: !254, size: 64, offset: 1536)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "U", scope: !351, file: !350, line: 46, baseType: !387, size: 64, offset: 1600)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !351, file: !350, line: 46, baseType: !262, size: 64, offset: 1664)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "TF", scope: !351, file: !350, line: 46, baseType: !262, size: 64, offset: 1728)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "InvP", scope: !351, file: !350, line: 46, baseType: !636, size: 64, offset: 1792)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBLASInt", file: !6, line: 140, baseType: !28)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "neig", scope: !351, file: !350, line: 46, baseType: !199, size: 32, offset: 1856)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !351, file: !350, line: 46, baseType: !199, size: 32, offset: 1888)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "max_neig", scope: !351, file: !350, line: 46, baseType: !199, size: 32, offset: 1920)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "lambdaN", scope: !351, file: !350, line: 46, baseType: !254, size: 64, offset: 1984)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "smv", scope: !351, file: !350, line: 46, baseType: !254, size: 64, offset: 2048)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "force", scope: !351, file: !350, line: 46, baseType: !315, size: 32, offset: 2112)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "matvecs", scope: !351, file: !350, line: 46, baseType: !199, size: 32, offset: 2144)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "GreatestEig", scope: !351, file: !350, line: 46, baseType: !199, size: 32, offset: 2176)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "wr", scope: !351, file: !350, line: 46, baseType: !253, size: 64, offset: 2240)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "wi", scope: !351, file: !350, line: 46, baseType: !253, size: 64, offset: 2304)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "modul", scope: !351, file: !350, line: 46, baseType: !253, size: 64, offset: 2368)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "Q", scope: !351, file: !350, line: 46, baseType: !262, size: 64, offset: 2432)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "Z", scope: !351, file: !350, line: 46, baseType: !262, size: 64, offset: 2496)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !351, file: !350, line: 46, baseType: !245, size: 64, offset: 2560)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !351, file: !350, line: 46, baseType: !387, size: 64, offset: 2624)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "Sr", scope: !351, file: !350, line: 46, baseType: !262, size: 64, offset: 2688)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !351, file: !350, line: 46, baseType: !387, size: 64, offset: 2752)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "mx", scope: !351, file: !350, line: 46, baseType: !387, size: 64, offset: 2816)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "umx", scope: !351, file: !350, line: 46, baseType: !262, size: 64, offset: 2880)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "xmu", scope: !351, file: !350, line: 46, baseType: !262, size: 64, offset: 2944)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "xmx", scope: !351, file: !350, line: 46, baseType: !262, size: 64, offset: 3008)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !351, file: !350, line: 46, baseType: !262, size: 64, offset: 3072)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !351, file: !350, line: 46, baseType: !262, size: 64, offset: 3136)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "Sr2", scope: !351, file: !350, line: 46, baseType: !262, size: 64, offset: 3200)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "auau", scope: !351, file: !350, line: 46, baseType: !262, size: 64, offset: 3264)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "auu", scope: !351, file: !350, line: 46, baseType: !262, size: 64, offset: 3328)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !351, file: !350, line: 46, baseType: !262, size: 64, offset: 3392)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "iwork", scope: !351, file: !350, line: 46, baseType: !636, size: 64, offset: 3456)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "orth", scope: !351, file: !350, line: 46, baseType: !253, size: 64, offset: 3520)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "HasSchur", scope: !351, file: !350, line: 46, baseType: !315, size: 32, offset: 3584)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "improve", scope: !351, file: !350, line: 46, baseType: !315, size: 32, offset: 3616)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !156, line: 331, baseType: !670)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !156, line: 331, flags: DIFlagFwdDecl)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !156, line: 338, baseType: !673)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !156, line: 338, flags: DIFlagFwdDecl)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !27, line: 395, baseType: !127)
!676 = !{!0, !677}
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(name: "KSP_DGMRESApplyDeflation", scope: !2, file: !679, line: 7, type: !680, isLocal: false, isDefinition: true)
!679 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/dgmres/dgmres.c", directory: "/home/users/ndemeye/xSDK")
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogEvent", file: !681, line: 80, baseType: !28)
!681 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!682 = !{i32 7, !"Dwarf Version", i32 4}
!683 = !{i32 2, !"Debug Info Version", i32 3}
!684 = !{i32 1, !"wchar_size", i32 4}
!685 = !{i32 7, !"PIC Level", i32 2}
!686 = !{i32 7, !"uwtable", i32 1}
!687 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!688 = distinct !DISubprogram(name: "KSPDGMRESSetEigen", scope: !679, file: !679, line: 15, type: !367, scopeLine: 16, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !689)
!689 = !{!690, !691, !692, !693, !695, !696, !698, !702}
!690 = !DILocalVariable(name: "ksp", arg: 1, scope: !688, file: !679, line: 15, type: !369)
!691 = !DILocalVariable(name: "nb_eig", arg: 2, scope: !688, file: !679, line: 15, type: !199)
!692 = !DILocalVariable(name: "ierr", scope: !688, file: !679, line: 17, type: !153)
!693 = !DILocalVariable(name: "_7_f", scope: !694, file: !679, line: 20, type: !366)
!694 = distinct !DILexicalBlock(scope: !688, file: !679, line: 20, column: 10)
!695 = !DILocalVariable(name: "_7_ierr", scope: !694, file: !679, line: 20, type: !153)
!696 = !DILocalVariable(name: "ierr__", scope: !697, file: !679, line: 20, type: !153)
!697 = distinct !DILexicalBlock(scope: !694, file: !679, line: 20, column: 10)
!698 = !DILocalVariable(name: "ierr__", scope: !699, file: !679, line: 20, type: !153)
!699 = distinct !DILexicalBlock(scope: !700, file: !679, line: 20, column: 10)
!700 = distinct !DILexicalBlock(scope: !701, file: !679, line: 20, column: 10)
!701 = distinct !DILexicalBlock(scope: !694, file: !679, line: 20, column: 10)
!702 = !DILocalVariable(name: "ierr__", scope: !703, file: !679, line: 20, type: !153)
!703 = distinct !DILexicalBlock(scope: !688, file: !679, line: 20, column: 82)
!704 = !DILocation(line: 0, scope: !688)
!705 = !DILocation(line: 19, column: 3, scope: !706)
!706 = distinct !DILexicalBlock(scope: !707, file: !679, line: 19, column: 3)
!707 = distinct !DILexicalBlock(scope: !708, file: !679, line: 19, column: 3)
!708 = distinct !DILexicalBlock(scope: !688, file: !679, line: 19, column: 3)
!709 = !{!710, !710, i64 0}
!710 = !{!"any pointer", !711, i64 0}
!711 = !{!"omnipotent char", !712, i64 0}
!712 = !{!"Simple C/C++ TBAA"}
!713 = !DILocation(line: 19, column: 3, scope: !707)
!714 = !DILocation(line: 19, column: 3, scope: !715)
!715 = distinct !DILexicalBlock(scope: !716, file: !679, line: 19, column: 3)
!716 = distinct !DILexicalBlock(scope: !706, file: !679, line: 19, column: 3)
!717 = !{!718, !719, i64 1536}
