; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/utils/multequal.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/utils/multequal.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319}
!302 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!305 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!306 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!307 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!308 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!309 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!310 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!311 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!312 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!313 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!314 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!315 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!316 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!317 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!318 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!319 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!320 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !321, line: 624, baseType: !5, size: 32, elements: !322)
!321 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!322 = !{!323, !324, !325, !326}
!323 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!324 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!325 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!326 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!327 = !{!328, !331, !332, !335, !417, !72, !535, !393, !407, !538, !5}
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !321, line: 330, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !321, line: 330, flags: DIFlagFwdDecl)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !334)
!334 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !338, line: 73, size: 4480, elements: !339)
!338 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!339 = !{!340, !342, !388, !389, !391, !394, !395, !396, !397, !405, !406, !408, !412, !416, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !429, !430, !431, !433, !434, !436, !438, !439, !440, !441, !442, !445, !447, !448, !449, !450, !451, !454, !456, !457, !458, !468, !470, !471, !475, !476, !525, !530, !532, !533, !534}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !337, file: !338, line: 74, baseType: !341, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !337, file: !338, line: 75, baseType: !343, size: 448, offset: 64)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 448, elements: !386)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !338, line: 53, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !338, line: 45, size: 448, elements: !346)
!346 = !{!347, !353, !361, !366, !370, !374, !381}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !345, file: !338, line: 46, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!351, !335, !352}
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !345, file: !338, line: 47, baseType: !354, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!351, !335, !357}
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !358, line: 16, baseType: !359)
!358 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !358, line: 16, flags: DIFlagFwdDecl)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !345, file: !338, line: 48, baseType: !362, size: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!351, !365}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !345, file: !338, line: 49, baseType: !367, size: 64, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{!351, !335, !332, !335}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !345, file: !338, line: 50, baseType: !371, size: 64, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!351, !335, !332, !365}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !345, file: !338, line: 51, baseType: !375, size: 64, offset: 320)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!351, !335, !332, !378}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{null}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !345, file: !338, line: 52, baseType: !382, size: 64, offset: 384)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!351, !335, !332, !385}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!386 = !{!387}
!387 = !DISubrange(count: 1)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !337, file: !338, line: 76, baseType: !328, size: 64, offset: 512)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !337, file: !338, line: 77, baseType: !390, size: 32, offset: 576)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !337, file: !338, line: 78, baseType: !392, size: 64, offset: 640)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !393)
!393 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !337, file: !338, line: 78, baseType: !392, size: 64, offset: 704)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !337, file: !338, line: 78, baseType: !392, size: 64, offset: 768)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !337, file: !338, line: 78, baseType: !392, size: 64, offset: 832)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !337, file: !338, line: 79, baseType: !398, size: 64, offset: 896)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !401, line: 27, baseType: !402)
!401 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !403, line: 43, baseType: !404)
!403 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!404 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !337, file: !338, line: 80, baseType: !390, size: 32, offset: 960)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !337, file: !338, line: 81, baseType: !407, size: 32, offset: 992)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !337, file: !338, line: 82, baseType: !409, size: 64, offset: 1024)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !410)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !337, file: !338, line: 83, baseType: !413, size: 64, offset: 1088)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !337, file: !338, line: 84, baseType: !417, size: 64, offset: 1152)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !337, file: !338, line: 85, baseType: !417, size: 64, offset: 1216)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !337, file: !338, line: 86, baseType: !417, size: 64, offset: 1280)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !337, file: !338, line: 87, baseType: !417, size: 64, offset: 1344)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !337, file: !338, line: 88, baseType: !335, size: 64, offset: 1408)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !337, file: !338, line: 89, baseType: !398, size: 64, offset: 1472)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !337, file: !338, line: 90, baseType: !417, size: 64, offset: 1536)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !337, file: !338, line: 91, baseType: !417, size: 64, offset: 1600)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !337, file: !338, line: 92, baseType: !390, size: 32, offset: 1664)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !337, file: !338, line: 93, baseType: !331, size: 64, offset: 1728)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !337, file: !338, line: 94, baseType: !428, size: 64, offset: 1792)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !399)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !337, file: !338, line: 95, baseType: !390, size: 32, offset: 1856)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !337, file: !338, line: 95, baseType: !390, size: 32, offset: 1888)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !337, file: !338, line: 96, baseType: !432, size: 64, offset: 1920)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !337, file: !338, line: 96, baseType: !432, size: 64, offset: 1984)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !337, file: !338, line: 97, baseType: !435, size: 64, offset: 2048)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !337, file: !338, line: 97, baseType: !437, size: 64, offset: 2112)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !337, file: !338, line: 98, baseType: !390, size: 32, offset: 2176)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !337, file: !338, line: 98, baseType: !390, size: 32, offset: 2208)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !337, file: !338, line: 99, baseType: !432, size: 64, offset: 2240)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !337, file: !338, line: 99, baseType: !432, size: 64, offset: 2304)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !337, file: !338, line: 100, baseType: !443, size: 64, offset: 2368)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !393)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !337, file: !338, line: 100, baseType: !446, size: 64, offset: 2432)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !337, file: !338, line: 101, baseType: !390, size: 32, offset: 2496)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !337, file: !338, line: 101, baseType: !390, size: 32, offset: 2528)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !337, file: !338, line: 102, baseType: !432, size: 64, offset: 2560)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !337, file: !338, line: 102, baseType: !432, size: 64, offset: 2624)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !337, file: !338, line: 103, baseType: !452, size: 64, offset: 2688)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !444)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !337, file: !338, line: 103, baseType: !455, size: 64, offset: 2752)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !337, file: !338, line: 104, baseType: !385, size: 64, offset: 2816)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !337, file: !338, line: 105, baseType: !390, size: 32, offset: 2880)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !337, file: !338, line: 106, baseType: !459, size: 128, offset: 2944)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 128, elements: !466)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !338, line: 64, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !338, line: 61, size: 128, elements: !463)
!463 = !{!464, !465}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !462, file: !338, line: 62, baseType: !378, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !462, file: !338, line: 63, baseType: !331, size: 64, offset: 64)
!466 = !{!467}
!467 = !DISubrange(count: 2)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !337, file: !338, line: 107, baseType: !469, size: 64, offset: 3072)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 64, elements: !466)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !337, file: !338, line: 108, baseType: !331, size: 64, offset: 3136)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !337, file: !338, line: 109, baseType: !472, size: 64, offset: 3200)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!351, !331}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !337, file: !338, line: 111, baseType: !390, size: 32, offset: 3264)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !337, file: !338, line: 112, baseType: !477, size: 320, offset: 3328)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 320, elements: !523)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!351, !481, !335, !331}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !484)
!484 = !{!485, !486, !511, !512, !513, !514, !515, !516, !517, !518, !519}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !483, file: !10, line: 100, baseType: !390, size: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !483, file: !10, line: 101, baseType: !487, size: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !490)
!490 = !{!491, !492, !493, !494, !495, !498, !499, !500, !504, !506, !508, !509, !510}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !489, file: !10, line: 84, baseType: !417, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !489, file: !10, line: 85, baseType: !417, size: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !489, file: !10, line: 86, baseType: !331, size: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !489, file: !10, line: 87, baseType: !409, size: 64, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !489, file: !10, line: 88, baseType: !496, size: 64, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !332)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !489, file: !10, line: 89, baseType: !334, size: 8, offset: 320)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !489, file: !10, line: 90, baseType: !417, size: 64, offset: 384)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !489, file: !10, line: 91, baseType: !501, size: 64, offset: 448)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !502, line: 46, baseType: !503)
!502 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!503 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !489, file: !10, line: 92, baseType: !505, size: 32, offset: 512)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !489, file: !10, line: 93, baseType: !507, size: 32, offset: 544)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !489, file: !10, line: 94, baseType: !487, size: 64, offset: 576)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !489, file: !10, line: 95, baseType: !417, size: 64, offset: 640)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !489, file: !10, line: 96, baseType: !331, size: 64, offset: 704)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !483, file: !10, line: 102, baseType: !417, size: 64, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !483, file: !10, line: 102, baseType: !417, size: 64, offset: 192)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !483, file: !10, line: 103, baseType: !417, size: 64, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !483, file: !10, line: 104, baseType: !328, size: 64, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !483, file: !10, line: 105, baseType: !505, size: 32, offset: 384)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !483, file: !10, line: 105, baseType: !505, size: 32, offset: 416)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !483, file: !10, line: 105, baseType: !505, size: 32, offset: 448)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !483, file: !10, line: 106, baseType: !335, size: 64, offset: 512)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !483, file: !10, line: 107, baseType: !520, size: 64, offset: 576)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!523 = !{!524}
!524 = !DISubrange(count: 5)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !337, file: !338, line: 113, baseType: !526, size: 320, offset: 3648)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !527, size: 320, elements: !523)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!351, !335, !331}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !337, file: !338, line: 114, baseType: !531, size: 320, offset: 3968)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 320, elements: !523)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !337, file: !338, line: 115, baseType: !505, size: 32, offset: 4288)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !337, file: !338, line: 120, baseType: !520, size: 64, offset: 4352)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !337, file: !338, line: 121, baseType: !505, size: 32, offset: 4416)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !321, line: 331, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !321, line: 331, flags: DIFlagFwdDecl)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !321, line: 338, baseType: !539)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !321, line: 338, flags: DIFlagFwdDecl)
!541 = !{i32 7, !"Dwarf Version", i32 4}
!542 = !{i32 2, !"Debug Info Version", i32 3}
!543 = !{i32 1, !"wchar_size", i32 4}
!544 = !{i32 7, !"PIC Level", i32 2}
!545 = !{i32 7, !"uwtable", i32 1}
!546 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!547 = distinct !DISubprogram(name: "MatMultEqual", scope: !548, file: !548, line: 190, type: !549, scopeLine: 191, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1319)
!548 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/utils/multequal.c", directory: "/home/users/ndemeye/xSDK")
!549 = !DISubroutineType(types: !550)
!550 = !{!351, !551, !551, !390, !655}
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !554, line: 436, size: 23424, elements: !555)
!554 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!555 = !{!556, !558, !1065, !1085, !1086, !1087, !1089, !1090, !1091, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1215, !1216, !1232, !1233, !1234, !1235, !1236, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1271, !1291, !1292, !1294, !1295, !1296, !1297, !1298, !1299, !1317, !1318}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !553, file: !554, line: 437, baseType: !557, size: 4480)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !338, line: 122, baseType: !337)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !553, file: !554, line: 437, baseType: !559, size: 9472, offset: 4480)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !560, size: 9472, elements: !386)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !554, line: 32, size: 9472, elements: !561)
!561 = !{!562, !571, !575, !576, !583, !587, !588, !589, !590, !591, !592, !593, !617, !621, !626, !632, !651, !656, !660, !661, !666, !671, !672, !677, !681, !685, !689, !693, !697, !698, !699, !700, !701, !705, !706, !711, !712, !713, !714, !715, !720, !727, !732, !736, !740, !744, !748, !749, !753, !754, !761, !766, !767, !768, !769, !831, !839, !840, !844, !845, !849, !850, !854, !859, !860, !864, !868, !875, !876, !877, !878, !879, !880, !885, !886, !890, !894, !898, !899, !900, !904, !914, !915, !919, !920, !924, !925, !929, !930, !935, !936, !940, !944, !945, !946, !947, !948, !949, !950, !954, !955, !956, !957, !958, !959, !963, !964, !965, !966, !967, !968, !969, !970, !974, !978, !979, !980, !984, !985, !986, !987, !988, !989, !990, !994, !995, !996, !1001, !1005, !1006, !1010, !1011, !1012, !1013, !1039, !1043, !1044, !1045, !1046, !1047, !1051, !1052, !1053, !1054, !1055, !1059, !1063, !1064}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !560, file: !554, line: 34, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{!351, !551, !390, !566, !390, !566, !568, !570}
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !390)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !453)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !560, file: !554, line: 35, baseType: !572, size: 64, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!351, !551, !390, !435, !437, !455}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !560, file: !554, line: 36, baseType: !572, size: 64, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !560, file: !554, line: 37, baseType: !577, size: 64, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!351, !551, !580, !580}
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !581)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !560, file: !554, line: 38, baseType: !584, size: 64, offset: 256)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!351, !551, !580, !580, !580}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !560, file: !554, line: 40, baseType: !577, size: 64, offset: 320)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !560, file: !554, line: 41, baseType: !584, size: 64, offset: 384)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !560, file: !554, line: 42, baseType: !577, size: 64, offset: 448)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !560, file: !554, line: 43, baseType: !584, size: 64, offset: 512)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !560, file: !554, line: 44, baseType: !577, size: 64, offset: 576)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !560, file: !554, line: 46, baseType: !584, size: 64, offset: 640)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !560, file: !554, line: 47, baseType: !594, size: 64, offset: 704)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!351, !551, !597, !597, !601}
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !598, line: 11, baseType: !599)
!598 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !598, line: 11, flags: DIFlagFwdDecl)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !603)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !605)
!605 = !{!606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !604, file: !36, line: 1227, baseType: !444, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !604, file: !36, line: 1228, baseType: !444, size: 64, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !604, file: !36, line: 1229, baseType: !444, size: 64, offset: 128)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !604, file: !36, line: 1230, baseType: !444, size: 64, offset: 192)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !604, file: !36, line: 1231, baseType: !444, size: 64, offset: 256)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !604, file: !36, line: 1232, baseType: !444, size: 64, offset: 320)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !604, file: !36, line: 1233, baseType: !444, size: 64, offset: 384)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !604, file: !36, line: 1234, baseType: !444, size: 64, offset: 448)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !604, file: !36, line: 1236, baseType: !444, size: 64, offset: 512)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !604, file: !36, line: 1237, baseType: !444, size: 64, offset: 576)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !604, file: !36, line: 1238, baseType: !444, size: 64, offset: 640)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !560, file: !554, line: 48, baseType: !618, size: 64, offset: 768)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{!351, !551, !597, !601}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !560, file: !554, line: 49, baseType: !622, size: 64, offset: 832)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!351, !551, !580, !444, !625, !444, !390, !390, !580}
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !560, file: !554, line: 50, baseType: !627, size: 64, offset: 896)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!351, !551, !630, !631}
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !560, file: !554, line: 52, baseType: !633, size: 64, offset: 960)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{!351, !551, !636, !637}
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !639)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !640)
!640 = !{!641, !642, !643, !644, !645, !646, !647, !648, !649, !650}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !639, file: !36, line: 593, baseType: !392, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !639, file: !36, line: 594, baseType: !392, size: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !639, file: !36, line: 594, baseType: !392, size: 64, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !639, file: !36, line: 594, baseType: !392, size: 64, offset: 192)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !639, file: !36, line: 595, baseType: !392, size: 64, offset: 256)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !639, file: !36, line: 596, baseType: !392, size: 64, offset: 320)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !639, file: !36, line: 597, baseType: !392, size: 64, offset: 384)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !639, file: !36, line: 598, baseType: !392, size: 64, offset: 448)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !639, file: !36, line: 598, baseType: !392, size: 64, offset: 512)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !639, file: !36, line: 599, baseType: !392, size: 64, offset: 576)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !560, file: !554, line: 53, baseType: !652, size: 64, offset: 1024)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!351, !551, !551, !655}
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !560, file: !554, line: 54, baseType: !657, size: 64, offset: 1088)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!351, !551, !580}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !560, file: !554, line: 55, baseType: !577, size: 64, offset: 1152)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !560, file: !554, line: 56, baseType: !662, size: 64, offset: 1216)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{!351, !551, !665, !443}
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !560, file: !554, line: 58, baseType: !667, size: 64, offset: 1280)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!351, !551, !670}
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !560, file: !554, line: 59, baseType: !667, size: 64, offset: 1344)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !560, file: !554, line: 60, baseType: !673, size: 64, offset: 1408)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!351, !551, !676, !505}
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !560, file: !554, line: 61, baseType: !678, size: 64, offset: 1472)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{!351, !551}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !560, file: !554, line: 63, baseType: !682, size: 64, offset: 1536)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!351, !551, !390, !566, !453, !580, !580}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !560, file: !554, line: 64, baseType: !686, size: 64, offset: 1600)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!351, !551, !551, !597, !597, !601}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !560, file: !554, line: 65, baseType: !690, size: 64, offset: 1664)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!351, !551, !551, !601}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !560, file: !554, line: 66, baseType: !694, size: 64, offset: 1728)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!351, !551, !551, !597, !601}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !560, file: !554, line: 67, baseType: !690, size: 64, offset: 1792)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !560, file: !554, line: 69, baseType: !678, size: 64, offset: 1856)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !560, file: !554, line: 70, baseType: !686, size: 64, offset: 1920)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !560, file: !554, line: 71, baseType: !694, size: 64, offset: 1984)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !560, file: !554, line: 72, baseType: !702, size: 64, offset: 2048)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!351, !551, !631}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !560, file: !554, line: 73, baseType: !678, size: 64, offset: 2112)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !560, file: !554, line: 75, baseType: !707, size: 64, offset: 2176)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{!351, !551, !710, !631}
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !560, file: !554, line: 76, baseType: !577, size: 64, offset: 2240)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !560, file: !554, line: 77, baseType: !577, size: 64, offset: 2304)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !560, file: !554, line: 78, baseType: !594, size: 64, offset: 2368)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !560, file: !554, line: 79, baseType: !618, size: 64, offset: 2432)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !560, file: !554, line: 81, baseType: !716, size: 64, offset: 2496)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!351, !551, !453, !551, !719}
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !560, file: !554, line: 82, baseType: !721, size: 64, offset: 2560)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{!351, !551, !390, !724, !724, !630, !726}
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !597)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !560, file: !554, line: 83, baseType: !728, size: 64, offset: 2624)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!351, !551, !390, !731, !390}
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !560, file: !554, line: 84, baseType: !733, size: 64, offset: 2688)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!351, !551, !390, !566, !390, !566, !452}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !560, file: !554, line: 85, baseType: !737, size: 64, offset: 2752)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!351, !551, !551, !719}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !560, file: !554, line: 87, baseType: !741, size: 64, offset: 2816)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{!351, !551, !580, !435}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !560, file: !554, line: 88, baseType: !745, size: 64, offset: 2880)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!351, !551, !453}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !560, file: !554, line: 89, baseType: !745, size: 64, offset: 2944)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !560, file: !554, line: 90, baseType: !750, size: 64, offset: 3008)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!351, !551, !580, !570}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !560, file: !554, line: 91, baseType: !682, size: 64, offset: 3072)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !560, file: !554, line: 93, baseType: !755, size: 64, offset: 3136)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{!351, !551, !758}
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !759)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !560, file: !554, line: 94, baseType: !762, size: 64, offset: 3200)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{!351, !551, !390, !505, !505, !435, !765, !765, !655}
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !560, file: !554, line: 95, baseType: !762, size: 64, offset: 3264)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !560, file: !554, line: 96, baseType: !762, size: 64, offset: 3328)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !560, file: !554, line: 97, baseType: !762, size: 64, offset: 3392)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !560, file: !554, line: 99, baseType: !770, size: 64, offset: 3456)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{!351, !551, !773, !776}
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !598, line: 51, baseType: !774)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !598, line: 51, flags: DIFlagFwdDecl)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !777)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !554, line: 609, size: 6208, elements: !779)
!779 = !{!780, !781, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !800, !807, !808, !809, !810, !811, !812, !813, !814, !818, !819, !820, !821, !822, !824, !825, !826, !827, !828, !829, !830}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !778, file: !554, line: 610, baseType: !557, size: 4480)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !778, file: !554, line: 610, baseType: !782, size: 32, offset: 4480)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !386)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !778, file: !554, line: 611, baseType: !390, size: 32, offset: 4512)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !778, file: !554, line: 611, baseType: !390, size: 32, offset: 4544)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !778, file: !554, line: 611, baseType: !390, size: 32, offset: 4576)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !778, file: !554, line: 612, baseType: !390, size: 32, offset: 4608)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !778, file: !554, line: 613, baseType: !390, size: 32, offset: 4640)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !778, file: !554, line: 614, baseType: !435, size: 64, offset: 4672)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !778, file: !554, line: 615, baseType: !437, size: 64, offset: 4736)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !778, file: !554, line: 616, baseType: !731, size: 64, offset: 4800)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !778, file: !554, line: 617, baseType: !435, size: 64, offset: 4864)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !778, file: !554, line: 618, baseType: !793, size: 64, offset: 4928)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !554, line: 602, baseType: !795)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !554, line: 598, size: 128, elements: !796)
!796 = !{!797, !798, !799}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !795, file: !554, line: 599, baseType: !390, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !795, file: !554, line: 600, baseType: !390, size: 32, offset: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !795, file: !554, line: 601, baseType: !452, size: 64, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !778, file: !554, line: 619, baseType: !801, size: 64, offset: 4992)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !554, line: 607, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !554, line: 604, size: 128, elements: !804)
!804 = !{!805, !806}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !803, file: !554, line: 605, baseType: !390, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !803, file: !554, line: 606, baseType: !452, size: 64, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !778, file: !554, line: 620, baseType: !452, size: 64, offset: 5056)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !778, file: !554, line: 621, baseType: !444, size: 64, offset: 5120)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !778, file: !554, line: 622, baseType: !444, size: 64, offset: 5184)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !778, file: !554, line: 623, baseType: !580, size: 64, offset: 5248)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !778, file: !554, line: 623, baseType: !580, size: 64, offset: 5312)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !778, file: !554, line: 623, baseType: !580, size: 64, offset: 5376)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !778, file: !554, line: 624, baseType: !505, size: 32, offset: 5440)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !778, file: !554, line: 625, baseType: !815, size: 64, offset: 5504)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DISubroutineType(types: !817)
!817 = !{!351}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !778, file: !554, line: 626, baseType: !331, size: 64, offset: 5568)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !778, file: !554, line: 627, baseType: !580, size: 64, offset: 5632)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !778, file: !554, line: 628, baseType: !390, size: 32, offset: 5696)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !778, file: !554, line: 629, baseType: !332, size: 64, offset: 5760)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !778, file: !554, line: 630, baseType: !823, size: 32, offset: 5824)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !778, file: !554, line: 631, baseType: !390, size: 32, offset: 5856)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !778, file: !554, line: 631, baseType: !390, size: 32, offset: 5888)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !778, file: !554, line: 632, baseType: !505, size: 32, offset: 5920)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !778, file: !554, line: 633, baseType: !505, size: 32, offset: 5952)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !778, file: !554, line: 634, baseType: !378, size: 64, offset: 6016)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !778, file: !554, line: 634, baseType: !331, size: 64, offset: 6080)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !778, file: !554, line: 635, baseType: !398, size: 64, offset: 6144)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !560, file: !554, line: 100, baseType: !832, size: 64, offset: 3520)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DISubroutineType(types: !834)
!834 = !{!351, !551, !390, !390, !835, !838}
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !837)
!837 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !560, file: !554, line: 101, baseType: !678, size: 64, offset: 3584)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !560, file: !554, line: 102, baseType: !841, size: 64, offset: 3648)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DISubroutineType(types: !843)
!843 = !{!351, !551, !597, !597, !631}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !560, file: !554, line: 103, baseType: !563, size: 64, offset: 3712)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !560, file: !554, line: 105, baseType: !846, size: 64, offset: 3776)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!351, !551, !597, !597, !630, !631}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !560, file: !554, line: 106, baseType: !678, size: 64, offset: 3840)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !560, file: !554, line: 107, baseType: !851, size: 64, offset: 3904)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{!351, !551, !357}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !560, file: !554, line: 108, baseType: !855, size: 64, offset: 3968)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!351, !551, !858, !630, !631}
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !332)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !560, file: !554, line: 109, baseType: !815, size: 64, offset: 4032)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !560, file: !554, line: 111, baseType: !861, size: 64, offset: 4096)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!351, !551, !551, !551, !444, !551}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !560, file: !554, line: 112, baseType: !865, size: 64, offset: 4160)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!351, !551, !551, !551, !551}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !560, file: !554, line: 113, baseType: !869, size: 64, offset: 4224)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{!351, !551, !872, !872}
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !598, line: 30, baseType: !873)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !598, line: 30, flags: DIFlagFwdDecl)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !560, file: !554, line: 114, baseType: !563, size: 64, offset: 4288)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !560, file: !554, line: 115, baseType: !682, size: 64, offset: 4352)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !560, file: !554, line: 117, baseType: !741, size: 64, offset: 4416)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !560, file: !554, line: 118, baseType: !741, size: 64, offset: 4480)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !560, file: !554, line: 119, baseType: !855, size: 64, offset: 4544)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !560, file: !554, line: 120, baseType: !881, size: 64, offset: 4608)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!351, !551, !884, !655}
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !560, file: !554, line: 121, baseType: !815, size: 64, offset: 4672)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !560, file: !554, line: 123, baseType: !887, size: 64, offset: 4736)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{!351, !551, !390, !331}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !560, file: !554, line: 124, baseType: !891, size: 64, offset: 4800)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!351, !551, !776, !580, !331}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !560, file: !554, line: 125, baseType: !895, size: 64, offset: 4864)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!351, !481, !551}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !560, file: !554, line: 126, baseType: !577, size: 64, offset: 4928)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !560, file: !554, line: 127, baseType: !577, size: 64, offset: 4992)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !560, file: !554, line: 129, baseType: !901, size: 64, offset: 5056)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{!351, !551, !731}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !560, file: !554, line: 130, baseType: !905, size: 64, offset: 5120)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{!351, !551, !908, !908}
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !909)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !911)
!911 = !{!912, !913}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !910, file: !60, line: 653, baseType: !390, size: 32)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !910, file: !60, line: 653, baseType: !580, size: 64, offset: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !560, file: !554, line: 131, baseType: !905, size: 64, offset: 5184)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !560, file: !554, line: 132, baseType: !916, size: 64, offset: 5248)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!351, !551, !435, !435, !435}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !560, file: !554, line: 133, baseType: !851, size: 64, offset: 5312)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !560, file: !554, line: 135, baseType: !921, size: 64, offset: 5376)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{!351, !551, !444, !655}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !560, file: !554, line: 136, baseType: !921, size: 64, offset: 5440)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !560, file: !554, line: 137, baseType: !926, size: 64, offset: 5504)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{!351, !551, !655}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !560, file: !554, line: 138, baseType: !563, size: 64, offset: 5568)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !560, file: !554, line: 139, baseType: !931, size: 64, offset: 5632)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{!351, !551, !934, !934}
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !560, file: !554, line: 141, baseType: !815, size: 64, offset: 5696)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !560, file: !554, line: 142, baseType: !937, size: 64, offset: 5760)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DISubroutineType(types: !939)
!939 = !{!351, !551, !551, !444, !551}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !560, file: !554, line: 143, baseType: !941, size: 64, offset: 5824)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{!351, !551, !551, !551}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !560, file: !554, line: 144, baseType: !815, size: 64, offset: 5888)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !560, file: !554, line: 145, baseType: !937, size: 64, offset: 5952)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !560, file: !554, line: 147, baseType: !941, size: 64, offset: 6016)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !560, file: !554, line: 148, baseType: !815, size: 64, offset: 6080)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !560, file: !554, line: 149, baseType: !937, size: 64, offset: 6144)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !560, file: !554, line: 150, baseType: !941, size: 64, offset: 6208)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !560, file: !554, line: 151, baseType: !951, size: 64, offset: 6272)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{!351, !551, !505}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !560, file: !554, line: 153, baseType: !678, size: 64, offset: 6336)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !560, file: !554, line: 154, baseType: !678, size: 64, offset: 6400)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !560, file: !554, line: 155, baseType: !678, size: 64, offset: 6464)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !560, file: !554, line: 156, baseType: !678, size: 64, offset: 6528)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !560, file: !554, line: 157, baseType: !851, size: 64, offset: 6592)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !560, file: !554, line: 159, baseType: !960, size: 64, offset: 6656)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!351, !551, !390, !568}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !560, file: !554, line: 160, baseType: !678, size: 64, offset: 6720)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !560, file: !554, line: 161, baseType: !678, size: 64, offset: 6784)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !560, file: !554, line: 162, baseType: !678, size: 64, offset: 6848)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !560, file: !554, line: 163, baseType: !678, size: 64, offset: 6912)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !560, file: !554, line: 165, baseType: !941, size: 64, offset: 6976)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !560, file: !554, line: 166, baseType: !941, size: 64, offset: 7040)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !560, file: !554, line: 167, baseType: !741, size: 64, offset: 7104)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !560, file: !554, line: 168, baseType: !971, size: 64, offset: 7168)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!351, !551, !580, !390}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !560, file: !554, line: 169, baseType: !975, size: 64, offset: 7232)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!351, !551, !655, !435}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !560, file: !554, line: 171, baseType: !702, size: 64, offset: 7296)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !560, file: !554, line: 172, baseType: !678, size: 64, offset: 7360)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !560, file: !554, line: 173, baseType: !981, size: 64, offset: 7424)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!351, !551, !435, !765}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !560, file: !554, line: 174, baseType: !841, size: 64, offset: 7488)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !560, file: !554, line: 175, baseType: !841, size: 64, offset: 7552)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !560, file: !554, line: 177, baseType: !577, size: 64, offset: 7616)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !560, file: !554, line: 178, baseType: !627, size: 64, offset: 7680)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !560, file: !554, line: 179, baseType: !577, size: 64, offset: 7744)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !560, file: !554, line: 180, baseType: !584, size: 64, offset: 7808)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !560, file: !554, line: 181, baseType: !991, size: 64, offset: 7872)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!351, !551, !328, !630, !631}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !560, file: !554, line: 183, baseType: !901, size: 64, offset: 7936)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !560, file: !554, line: 184, baseType: !662, size: 64, offset: 8000)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !560, file: !554, line: 185, baseType: !997, size: 64, offset: 8064)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!351, !551, !1000}
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !560, file: !554, line: 186, baseType: !1002, size: 64, offset: 8128)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!351, !551, !390, !566, !452}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !560, file: !554, line: 187, baseType: !721, size: 64, offset: 8192)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !560, file: !554, line: 189, baseType: !1007, size: 64, offset: 8256)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!351, !551, !390, !390, !435, !568}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !560, file: !554, line: 190, baseType: !815, size: 64, offset: 8320)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !560, file: !554, line: 191, baseType: !937, size: 64, offset: 8384)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !560, file: !554, line: 192, baseType: !941, size: 64, offset: 8448)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !560, file: !554, line: 193, baseType: !1014, size: 64, offset: 8512)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!351, !551, !773, !1017}
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1018)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !554, line: 660, size: 5312, elements: !1020)
!1020 = !{!1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1019, file: !554, line: 661, baseType: !557, size: 4480)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1019, file: !554, line: 661, baseType: !782, size: 32, offset: 4480)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1019, file: !554, line: 662, baseType: !390, size: 32, offset: 4512)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1019, file: !554, line: 662, baseType: !390, size: 32, offset: 4544)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1019, file: !554, line: 662, baseType: !390, size: 32, offset: 4576)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1019, file: !554, line: 663, baseType: !390, size: 32, offset: 4608)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1019, file: !554, line: 664, baseType: !390, size: 32, offset: 4640)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1019, file: !554, line: 665, baseType: !435, size: 64, offset: 4672)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1019, file: !554, line: 666, baseType: !435, size: 64, offset: 4736)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1019, file: !554, line: 667, baseType: !390, size: 32, offset: 4800)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1019, file: !554, line: 668, baseType: !823, size: 32, offset: 4832)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1019, file: !554, line: 670, baseType: !435, size: 64, offset: 4864)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1019, file: !554, line: 670, baseType: !435, size: 64, offset: 4928)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1019, file: !554, line: 671, baseType: !435, size: 64, offset: 4992)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1019, file: !554, line: 672, baseType: !435, size: 64, offset: 5056)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1019, file: !554, line: 673, baseType: !435, size: 64, offset: 5120)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1019, file: !554, line: 674, baseType: !390, size: 32, offset: 5184)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1019, file: !554, line: 675, baseType: !435, size: 64, offset: 5248)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !560, file: !554, line: 195, baseType: !1040, size: 64, offset: 8576)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!351, !1017, !551, !551}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !560, file: !554, line: 196, baseType: !1040, size: 64, offset: 8640)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !560, file: !554, line: 197, baseType: !815, size: 64, offset: 8704)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !560, file: !554, line: 198, baseType: !937, size: 64, offset: 8768)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !560, file: !554, line: 199, baseType: !941, size: 64, offset: 8832)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !560, file: !554, line: 201, baseType: !1048, size: 64, offset: 8896)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!351, !551, !390, !390}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !560, file: !554, line: 202, baseType: !716, size: 64, offset: 8960)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !560, file: !554, line: 203, baseType: !584, size: 64, offset: 9024)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !560, file: !554, line: 204, baseType: !770, size: 64, offset: 9088)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !560, file: !554, line: 205, baseType: !901, size: 64, offset: 9152)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !560, file: !554, line: 206, baseType: !1056, size: 64, offset: 9216)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!351, !328, !551, !390, !630, !631}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !560, file: !554, line: 208, baseType: !1060, size: 64, offset: 9280)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!351, !390, !726}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !560, file: !554, line: 209, baseType: !941, size: 64, offset: 9344)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !560, file: !554, line: 210, baseType: !733, size: 64, offset: 9408)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !553, file: !554, line: 438, baseType: !1066, size: 64, offset: 13952)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !598, line: 60, baseType: !1067)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1069)
!1069 = !{!1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1068, file: !114, line: 241, baseType: !328, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1068, file: !114, line: 242, baseType: !407, size: 32, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1068, file: !114, line: 243, baseType: !390, size: 32, offset: 96)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1068, file: !114, line: 243, baseType: !390, size: 32, offset: 128)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1068, file: !114, line: 244, baseType: !390, size: 32, offset: 160)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1068, file: !114, line: 244, baseType: !390, size: 32, offset: 192)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1068, file: !114, line: 245, baseType: !435, size: 64, offset: 256)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1068, file: !114, line: 246, baseType: !505, size: 32, offset: 320)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1068, file: !114, line: 247, baseType: !390, size: 32, offset: 352)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1068, file: !114, line: 251, baseType: !390, size: 32, offset: 384)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1068, file: !114, line: 252, baseType: !872, size: 64, offset: 448)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1068, file: !114, line: 253, baseType: !505, size: 32, offset: 512)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1068, file: !114, line: 254, baseType: !390, size: 32, offset: 544)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1068, file: !114, line: 254, baseType: !390, size: 32, offset: 576)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1068, file: !114, line: 255, baseType: !390, size: 32, offset: 608)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !553, file: !554, line: 438, baseType: !1066, size: 64, offset: 14016)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !553, file: !554, line: 439, baseType: !331, size: 64, offset: 14080)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !553, file: !554, line: 440, baseType: !1088, size: 32, offset: 14144)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !553, file: !554, line: 441, baseType: !505, size: 32, offset: 14176)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !553, file: !554, line: 442, baseType: !505, size: 32, offset: 14208)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !553, file: !554, line: 443, baseType: !1092, size: 448, offset: 14272)
!1092 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1093, size: 448, elements: !1094)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !332)
!1094 = !{!1095}
!1095 = !DISubrange(count: 7)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !553, file: !554, line: 444, baseType: !505, size: 32, offset: 14720)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !553, file: !554, line: 445, baseType: !505, size: 32, offset: 14752)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !553, file: !554, line: 446, baseType: !390, size: 32, offset: 14784)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !553, file: !554, line: 447, baseType: !428, size: 64, offset: 14848)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !553, file: !554, line: 448, baseType: !428, size: 64, offset: 14912)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !553, file: !554, line: 449, baseType: !638, size: 640, offset: 14976)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !553, file: !554, line: 450, baseType: !570, size: 32, offset: 15616)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !553, file: !554, line: 451, baseType: !1104, size: 2880, offset: 15680)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !554, line: 318, baseType: !1105)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !554, line: 319, size: 2880, elements: !1106)
!1106 = !{!1107, !1108, !1109, !1110, !1111, !1112, !1113, !1126, !1127, !1132, !1137, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1152, !1153, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1185, !1186, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1209, !1210, !1211, !1212, !1213}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1105, file: !554, line: 320, baseType: !390, size: 32)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1105, file: !554, line: 321, baseType: !390, size: 32, offset: 32)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1105, file: !554, line: 322, baseType: !390, size: 32, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1105, file: !554, line: 323, baseType: !390, size: 32, offset: 96)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1105, file: !554, line: 324, baseType: !390, size: 32, offset: 128)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1105, file: !554, line: 325, baseType: !390, size: 32, offset: 160)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1105, file: !554, line: 326, baseType: !1114, size: 64, offset: 192)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !554, line: 293, baseType: !1115)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !554, line: 295, size: 448, elements: !1117)
!1117 = !{!1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1116, file: !554, line: 296, baseType: !1114, size: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1116, file: !554, line: 297, baseType: !452, size: 64, offset: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1116, file: !554, line: 297, baseType: !452, size: 64, offset: 128)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1116, file: !554, line: 298, baseType: !435, size: 64, offset: 192)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1116, file: !554, line: 298, baseType: !435, size: 64, offset: 256)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1116, file: !554, line: 299, baseType: !390, size: 32, offset: 320)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1116, file: !554, line: 300, baseType: !390, size: 32, offset: 352)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1116, file: !554, line: 301, baseType: !390, size: 32, offset: 384)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1105, file: !554, line: 326, baseType: !1114, size: 64, offset: 256)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1105, file: !554, line: 328, baseType: !1128, size: 64, offset: 320)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!351, !551, !1131, !435}
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1105, file: !554, line: 329, baseType: !1133, size: 64, offset: 384)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{!351, !1131, !1136, !437, !437, !455, !435}
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1105, file: !554, line: 330, baseType: !1138, size: 64, offset: 448)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!351, !1131}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1105, file: !554, line: 331, baseType: !1138, size: 64, offset: 512)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1105, file: !554, line: 334, baseType: !328, size: 64, offset: 576)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1105, file: !554, line: 335, baseType: !407, size: 32, offset: 640)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1105, file: !554, line: 335, baseType: !407, size: 32, offset: 672)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1105, file: !554, line: 336, baseType: !407, size: 32, offset: 704)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1105, file: !554, line: 336, baseType: !407, size: 32, offset: 736)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1105, file: !554, line: 337, baseType: !1148, size: 64, offset: 768)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !321, line: 339, baseType: !1150)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !321, line: 339, flags: DIFlagFwdDecl)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1105, file: !554, line: 338, baseType: !1148, size: 64, offset: 832)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1105, file: !554, line: 339, baseType: !1154, size: 64, offset: 896)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !321, line: 341, baseType: !1156)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !321, line: 351, size: 192, elements: !1157)
!1157 = !{!1158, !1159, !1160, !1161, !1162}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1156, file: !321, line: 354, baseType: !72, size: 32)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1156, file: !321, line: 355, baseType: !72, size: 32, offset: 32)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1156, file: !321, line: 356, baseType: !72, size: 32, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1156, file: !321, line: 361, baseType: !72, size: 32, offset: 96)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1156, file: !321, line: 362, baseType: !501, size: 64, offset: 128)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1105, file: !554, line: 340, baseType: !390, size: 32, offset: 960)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1105, file: !554, line: 340, baseType: !390, size: 32, offset: 992)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1105, file: !554, line: 341, baseType: !452, size: 64, offset: 1024)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1105, file: !554, line: 342, baseType: !435, size: 64, offset: 1088)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1105, file: !554, line: 343, baseType: !455, size: 64, offset: 1152)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1105, file: !554, line: 344, baseType: !437, size: 64, offset: 1216)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1105, file: !554, line: 345, baseType: !390, size: 32, offset: 1280)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1105, file: !554, line: 346, baseType: !1136, size: 64, offset: 1344)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1105, file: !554, line: 347, baseType: !505, size: 32, offset: 1408)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1105, file: !554, line: 348, baseType: !390, size: 32, offset: 1440)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1105, file: !554, line: 351, baseType: !505, size: 32, offset: 1472)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1105, file: !554, line: 352, baseType: !505, size: 32, offset: 1504)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1105, file: !554, line: 353, baseType: !407, size: 32, offset: 1536)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1105, file: !554, line: 354, baseType: !407, size: 32, offset: 1568)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1105, file: !554, line: 355, baseType: !1136, size: 64, offset: 1600)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1105, file: !554, line: 356, baseType: !1136, size: 64, offset: 1664)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1105, file: !554, line: 357, baseType: !1180, size: 64, offset: 1728)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !554, line: 310, baseType: !1182)
!1182 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !554, line: 308, size: 32, elements: !1183)
!1183 = !{!1184}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1182, file: !554, line: 309, baseType: !390, size: 32)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1105, file: !554, line: 357, baseType: !1180, size: 64, offset: 1792)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1105, file: !554, line: 358, baseType: !1187, size: 64, offset: 1856)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !554, line: 316, baseType: !1189)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !554, line: 312, size: 128, elements: !1190)
!1190 = !{!1191, !1192, !1193}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1189, file: !554, line: 313, baseType: !331, size: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1189, file: !554, line: 314, baseType: !390, size: 32, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1189, file: !554, line: 315, baseType: !334, size: 8, offset: 96)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1105, file: !554, line: 359, baseType: !1187, size: 64, offset: 1920)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1105, file: !554, line: 360, baseType: !1187, size: 64, offset: 1984)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1105, file: !554, line: 361, baseType: !390, size: 32, offset: 2048)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1105, file: !554, line: 362, baseType: !407, size: 32, offset: 2080)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1105, file: !554, line: 363, baseType: !390, size: 32, offset: 2112)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1105, file: !554, line: 364, baseType: !1136, size: 64, offset: 2176)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1105, file: !554, line: 365, baseType: !1154, size: 64, offset: 2240)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1105, file: !554, line: 366, baseType: !407, size: 32, offset: 2304)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1105, file: !554, line: 367, baseType: !407, size: 32, offset: 2336)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1105, file: !554, line: 368, baseType: !1148, size: 64, offset: 2368)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1105, file: !554, line: 369, baseType: !1148, size: 64, offset: 2432)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1105, file: !554, line: 370, baseType: !1206, size: 64, offset: 2496)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1207)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1105, file: !554, line: 371, baseType: !1206, size: 64, offset: 2560)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1105, file: !554, line: 372, baseType: !1206, size: 64, offset: 2624)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1105, file: !554, line: 373, baseType: !535, size: 64, offset: 2688)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1105, file: !554, line: 374, baseType: !501, size: 64, offset: 2752)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1105, file: !554, line: 375, baseType: !1214, size: 64, offset: 2816)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !553, file: !554, line: 451, baseType: !1104, size: 2880, offset: 18560)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !553, file: !554, line: 452, baseType: !1217, size: 64, offset: 21440)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1218)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64)
!1219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !554, line: 681, size: 4864, elements: !1220)
!1220 = !{!1221, !1222, !1223, !1224, !1225, !1226, !1227, !1231}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1219, file: !554, line: 682, baseType: !557, size: 4480)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1219, file: !554, line: 682, baseType: !782, size: 32, offset: 4480)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1219, file: !554, line: 683, baseType: !505, size: 32, offset: 4512)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1219, file: !554, line: 684, baseType: !390, size: 32, offset: 4544)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1219, file: !554, line: 685, baseType: !934, size: 64, offset: 4608)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1219, file: !554, line: 686, baseType: !452, size: 64, offset: 4672)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1219, file: !554, line: 687, baseType: !1228, size: 64, offset: 4736)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{!351, !1217, !580, !331}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1219, file: !554, line: 688, baseType: !331, size: 64, offset: 4800)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !553, file: !554, line: 453, baseType: !1217, size: 64, offset: 21504)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !553, file: !554, line: 454, baseType: !1217, size: 64, offset: 21568)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !553, file: !554, line: 455, baseType: !390, size: 32, offset: 21632)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "preallocated", scope: !553, file: !554, line: 456, baseType: !505, size: 32, offset: 21664)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !553, file: !554, line: 457, baseType: !1237, size: 320, offset: 21696)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStencilInfo", file: !554, line: 399, baseType: !1238)
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !554, line: 394, size: 320, elements: !1239)
!1239 = !{!1240, !1241, !1245, !1246}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !1238, file: !554, line: 395, baseType: !390, size: 32)
