; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ts/adapt/impls/dsp/adaptdsp.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ts/adapt/impls/dsp/adaptdsp.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._n_PetscSegBuffer = type opaque
%struct.FilterTab = type { i8*, double, [3 x double], [2 x double] }
%struct._p_TSAdapt = type { %struct._p_PetscObject, [1 x %struct._TSAdaptOps], i8*, i32 (%struct._p_TSAdapt*, %struct._p_TS*, double, %struct._p_Vec*, i32*)*, %struct.anon.5, i32, double, double, [2 x double], double, double, double, i32, double, [2 x double], i32, %struct._p_PetscViewer*, i32, i32 }

!56 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/tsimpl.h", directory: "/home/users/ndemeye/xSDK")
!57 = !{!58, !59, !60, !61, !62}
!58 = !DIEnumerator(name: "TSEVENT_NONE", value: 0, isUnsigned: true)
!59 = !DIEnumerator(name: "TSEVENT_LOCATED_INTERVAL", value: 1, isUnsigned: true)
!60 = !DIEnumerator(name: "TSEVENT_PROCESSING", value: 2, isUnsigned: true)
!61 = !DIEnumerator(name: "TSEVENT_ZERO", value: 3, isUnsigned: true)
!62 = !DIEnumerator(name: "TSEVENT_RESET_NEXTSTEP", value: 4, isUnsigned: true)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !64, line: 285, baseType: !7, size: 32, elements: !65)
!64 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!65 = !{!66, !67, !68, !69}
!66 = !DIEnumerator(name: "DIFFERENT_NONZERO_PATTERN", value: 0, isUnsigned: true)
!67 = !DIEnumerator(name: "SUBSET_NONZERO_PATTERN", value: 1, isUnsigned: true)
!68 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!69 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 103, baseType: !40, size: 32, elements: !71)
!71 = !{!72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82}
!72 = !DIEnumerator(name: "TS_CONVERGED_ITERATING", value: 0)
!73 = !DIEnumerator(name: "TS_CONVERGED_TIME", value: 1)
!74 = !DIEnumerator(name: "TS_CONVERGED_ITS", value: 2)
!75 = !DIEnumerator(name: "TS_CONVERGED_USER", value: 3)
!76 = !DIEnumerator(name: "TS_CONVERGED_EVENT", value: 4)
!77 = !DIEnumerator(name: "TS_CONVERGED_PSEUDO_FATOL", value: 5)
!78 = !DIEnumerator(name: "TS_CONVERGED_PSEUDO_FRTOL", value: 6)
!79 = !DIEnumerator(name: "TS_DIVERGED_NONLINEAR_SOLVE", value: -1)
!80 = !DIEnumerator(name: "TS_DIVERGED_STEP_REJECTED", value: -2)
!81 = !DIEnumerator(name: "TSFORWARD_DIVERGED_LINEAR_SOLVE", value: -3)
!82 = !DIEnumerator(name: "TSADJOINT_DIVERGED_LINEAR_SOLVE", value: -4)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 217, baseType: !7, size: 32, elements: !84)
!84 = !{!85, !86, !87, !88}
!85 = !DIEnumerator(name: "TS_EXACTFINALTIME_UNSPECIFIED", value: 0, isUnsigned: true)
!86 = !DIEnumerator(name: "TS_EXACTFINALTIME_STEPOVER", value: 1, isUnsigned: true)
!87 = !DIEnumerator(name: "TS_EXACTFINALTIME_INTERPOLATE", value: 2, isUnsigned: true)
!88 = !DIEnumerator(name: "TS_EXACTFINALTIME_MATCHSTEP", value: 3, isUnsigned: true)
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !90, line: 663, baseType: !7, size: 32, elements: !91)
!90 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!91 = !{!92, !93, !94}
!92 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !96)
!96 = !{!97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114}
!97 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!103 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!104 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!105 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!106 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!107 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!108 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!109 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!110 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!111 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!112 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!113 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!114 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!115 = !{!116, !120, !121, !324, !156, !196, !327, !330, !206, !40, !290, !325, !7, !333, !233, !179, !182}
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !117, line: 330, baseType: !118)
!117 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !117, line: 330, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !124, line: 73, size: 4480, elements: !125)
!124 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!125 = !{!126, !128, !177, !178, !180, !183, !184, !185, !186, !194, !195, !197, !201, !205, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !218, !219, !220, !222, !223, !225, !227, !228, !229, !230, !231, !234, !236, !237, !238, !239, !240, !243, !245, !246, !247, !257, !259, !260, !264, !265, !314, !319, !321, !322, !323}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !123, file: !124, line: 74, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !40)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !123, file: !124, line: 75, baseType: !129, size: 448, offset: 64)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 448, elements: !175)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !124, line: 53, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !124, line: 45, size: 448, elements: !132)
!132 = !{!133, !139, !147, !152, !159, !163, !170}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !131, file: !124, line: 46, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!137, !121, !138}
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !40)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !131, file: !124, line: 47, baseType: !140, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!137, !121, !143}
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !144, line: 16, baseType: !145)
!144 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !144, line: 16, flags: DIFlagFwdDecl)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !131, file: !124, line: 48, baseType: !148, size: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!137, !151}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !131, file: !124, line: 49, baseType: !153, size: 64, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!137, !121, !156, !121}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!158 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !131, file: !124, line: 50, baseType: !160, size: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!137, !121, !156, !151}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !131, file: !124, line: 51, baseType: !164, size: 64, offset: 320)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!137, !121, !156, !167}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{null}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !131, file: !124, line: 52, baseType: !171, size: 64, offset: 384)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!137, !121, !156, !174}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!175 = !{!176}
!176 = !DISubrange(count: 1)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !123, file: !124, line: 76, baseType: !116, size: 64, offset: 512)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !123, file: !124, line: 77, baseType: !179, size: 32, offset: 576)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !40)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !123, file: !124, line: 78, baseType: !181, size: 64, offset: 640)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !182)
!182 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !123, file: !124, line: 78, baseType: !181, size: 64, offset: 704)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !123, file: !124, line: 78, baseType: !181, size: 64, offset: 768)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !123, file: !124, line: 78, baseType: !181, size: 64, offset: 832)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !123, file: !124, line: 79, baseType: !187, size: 64, offset: 896)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !190, line: 27, baseType: !191)
!190 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !192, line: 43, baseType: !193)
!192 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!193 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !123, file: !124, line: 80, baseType: !179, size: 32, offset: 960)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !123, file: !124, line: 81, baseType: !196, size: 32, offset: 992)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !40)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !123, file: !124, line: 82, baseType: !198, size: 64, offset: 1024)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !123, file: !124, line: 83, baseType: !202, size: 64, offset: 1088)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !123, file: !124, line: 84, baseType: !206, size: 64, offset: 1152)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !123, file: !124, line: 85, baseType: !206, size: 64, offset: 1216)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !123, file: !124, line: 86, baseType: !206, size: 64, offset: 1280)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !123, file: !124, line: 87, baseType: !206, size: 64, offset: 1344)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !123, file: !124, line: 88, baseType: !121, size: 64, offset: 1408)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !123, file: !124, line: 89, baseType: !187, size: 64, offset: 1472)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !123, file: !124, line: 90, baseType: !206, size: 64, offset: 1536)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !123, file: !124, line: 91, baseType: !206, size: 64, offset: 1600)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !123, file: !124, line: 92, baseType: !179, size: 32, offset: 1664)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !123, file: !124, line: 93, baseType: !120, size: 64, offset: 1728)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !123, file: !124, line: 94, baseType: !217, size: 64, offset: 1792)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !188)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !123, file: !124, line: 95, baseType: !179, size: 32, offset: 1856)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !123, file: !124, line: 95, baseType: !179, size: 32, offset: 1888)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !123, file: !124, line: 96, baseType: !221, size: 64, offset: 1920)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !123, file: !124, line: 96, baseType: !221, size: 64, offset: 1984)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !123, file: !124, line: 97, baseType: !224, size: 64, offset: 2048)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !123, file: !124, line: 97, baseType: !226, size: 64, offset: 2112)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !123, file: !124, line: 98, baseType: !179, size: 32, offset: 2176)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !123, file: !124, line: 98, baseType: !179, size: 32, offset: 2208)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !123, file: !124, line: 99, baseType: !221, size: 64, offset: 2240)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !123, file: !124, line: 99, baseType: !221, size: 64, offset: 2304)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !123, file: !124, line: 100, baseType: !232, size: 64, offset: 2368)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !182)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !123, file: !124, line: 100, baseType: !235, size: 64, offset: 2432)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !123, file: !124, line: 101, baseType: !179, size: 32, offset: 2496)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !123, file: !124, line: 101, baseType: !179, size: 32, offset: 2528)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !123, file: !124, line: 102, baseType: !221, size: 64, offset: 2560)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !123, file: !124, line: 102, baseType: !221, size: 64, offset: 2624)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !123, file: !124, line: 103, baseType: !241, size: 64, offset: 2688)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !233)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !123, file: !124, line: 103, baseType: !244, size: 64, offset: 2752)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !123, file: !124, line: 104, baseType: !174, size: 64, offset: 2816)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !123, file: !124, line: 105, baseType: !179, size: 32, offset: 2880)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !123, file: !124, line: 106, baseType: !248, size: 128, offset: 2944)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 128, elements: !255)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !124, line: 64, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !124, line: 61, size: 128, elements: !252)
!252 = !{!253, !254}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !251, file: !124, line: 62, baseType: !167, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !251, file: !124, line: 63, baseType: !120, size: 64, offset: 64)
!255 = !{!256}
!256 = !DISubrange(count: 2)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !123, file: !124, line: 107, baseType: !258, size: 64, offset: 3072)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 64, elements: !255)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !123, file: !124, line: 108, baseType: !120, size: 64, offset: 3136)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !123, file: !124, line: 109, baseType: !261, size: 64, offset: 3200)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{!137, !120}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !123, file: !124, line: 111, baseType: !179, size: 32, offset: 3264)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !123, file: !124, line: 112, baseType: !266, size: 320, offset: 3328)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 320, elements: !312)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!137, !270, !121, !120}
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !273)
!273 = !{!274, !275, !300, !301, !302, !303, !304, !305, !306, !307, !308}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !272, file: !12, line: 100, baseType: !179, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !272, file: !12, line: 101, baseType: !276, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !279)
!279 = !{!280, !281, !282, !283, !284, !287, !288, !289, !293, !295, !297, !298, !299}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !278, file: !12, line: 84, baseType: !206, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !278, file: !12, line: 85, baseType: !206, size: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !278, file: !12, line: 86, baseType: !120, size: 64, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !278, file: !12, line: 87, baseType: !198, size: 64, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !278, file: !12, line: 88, baseType: !285, size: 64, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !278, file: !12, line: 89, baseType: !158, size: 8, offset: 320)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !278, file: !12, line: 90, baseType: !206, size: 64, offset: 384)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !278, file: !12, line: 91, baseType: !290, size: 64, offset: 448)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !291, line: 46, baseType: !292)
!291 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!292 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !278, file: !12, line: 92, baseType: !294, size: 32, offset: 512)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !278, file: !12, line: 93, baseType: !296, size: 32, offset: 544)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !278, file: !12, line: 94, baseType: !276, size: 64, offset: 576)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !278, file: !12, line: 95, baseType: !206, size: 64, offset: 640)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !278, file: !12, line: 96, baseType: !120, size: 64, offset: 704)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !272, file: !12, line: 102, baseType: !206, size: 64, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !272, file: !12, line: 102, baseType: !206, size: 64, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !272, file: !12, line: 103, baseType: !206, size: 64, offset: 256)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !272, file: !12, line: 104, baseType: !116, size: 64, offset: 320)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !272, file: !12, line: 105, baseType: !294, size: 32, offset: 384)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !272, file: !12, line: 105, baseType: !294, size: 32, offset: 416)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !272, file: !12, line: 105, baseType: !294, size: 32, offset: 448)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !272, file: !12, line: 106, baseType: !121, size: 64, offset: 512)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !272, file: !12, line: 107, baseType: !309, size: 64, offset: 576)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!312 = !{!313}
!313 = !DISubrange(count: 5)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !123, file: !124, line: 113, baseType: !315, size: 320, offset: 3648)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 320, elements: !312)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!137, !121, !120}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !123, file: !124, line: 114, baseType: !320, size: 320, offset: 3968)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 320, elements: !312)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !123, file: !124, line: 115, baseType: !294, size: 32, offset: 4288)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !123, file: !124, line: 120, baseType: !309, size: 64, offset: 4352)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !123, file: !124, line: 121, baseType: !294, size: 32, offset: 4416)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !326, line: 1451, baseType: !167)
!326 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !117, line: 331, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !117, line: 331, flags: DIFlagFwdDecl)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !117, line: 338, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !117, line: 338, flags: DIFlagFwdDecl)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSAdapt_DSP", file: !335, line: 36, baseType: !336)
!335 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ts/adapt/impls/dsp/adaptdsp.c", directory: "/home/users/ndemeye/xSDK")
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !335, line: 30, size: 768, elements: !337)
!337 = !{!338, !342, !344, !345, !346}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "kBeta", scope: !336, file: !335, line: 31, baseType: !339, size: 192)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 192, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 3)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "Alpha", scope: !336, file: !335, line: 32, baseType: !343, size: 128, offset: 192)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 128, elements: !255)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "cerror", scope: !336, file: !335, line: 33, baseType: !339, size: 192, offset: 320)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "hratio", scope: !336, file: !335, line: 34, baseType: !339, size: 192, offset: 512)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "rollback", scope: !336, file: !335, line: 35, baseType: !294, size: 32, offset: 704)
!347 = !{!348, !0, !351}
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "citation", scope: !2, file: !335, line: 4, type: !350, isLocal: true, isDefinition: true)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 128, elements: !255)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "filterlist", scope: !2, file: !335, line: 210, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 7168, elements: !360)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FilterTab", file: !335, line: 203, size: 448, elements: !355)
!355 = !{!356, !357, !358, !359}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !354, file: !335, line: 204, baseType: !156, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !354, file: !335, line: 205, baseType: !233, size: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "kBeta", scope: !354, file: !335, line: 206, baseType: !339, size: 192, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "Alpha", scope: !354, file: !335, line: 207, baseType: !343, size: 128, offset: 320)
!360 = !{!361}
!361 = !DISubrange(count: 16)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 64, elements: !255)
!363 = !{i32 7, !"Dwarf Version", i32 4}
!364 = !{i32 2, !"Debug Info Version", i32 3}
!365 = !{i32 1, !"wchar_size", i32 4}
!366 = !{i32 7, !"PIC Level", i32 2}
!367 = !{i32 7, !"uwtable", i32 1}
!368 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!369 = distinct !DISubprogram(name: "TSAdaptDSPSetFilter", scope: !335, file: !335, line: 330, type: !370, scopeLine: 331, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !871)
!370 = !DISubroutineType(types: !371)
!371 = !{!137, !372, !156}
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSAdapt", file: !35, line: 686, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TSAdapt", file: !56, line: 319, size: 10112, elements: !375)
!375 = !{!376, !378, !839, !840, !844, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !374, file: !56, line: 320, baseType: !377, size: 4480)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !124, line: 122, baseType: !123)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !374, file: !56, line: 320, baseType: !379, size: 384, offset: 4480)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 384, elements: !175)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TSAdaptOps", file: !56, line: 310, size: 384, elements: !381)
!381 = !{!382, !825, !829, !830, !834, !838}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "choose", scope: !380, file: !56, line: 311, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!137, !372, !386, !233, !224, !232, !432, !232, !232, !232}
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS", file: !35, line: 17, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TS", file: !56, line: 144, size: 17408, elements: !389)
!389 = !{!390, !391, !491, !493, !495, !500, !501, !502, !503, !505, !551, !558, !564, !566, !567, !572, !573, !574, !575, !576, !577, !581, !585, !586, !587, !591, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !701, !705, !709, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !761, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !791, !792, !793, !794, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !823, !824}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !388, file: !56, line: 145, baseType: !377, size: 4480)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !388, file: !56, line: 145, baseType: !392, size: 2048, offset: 4480)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, size: 2048, elements: !175)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TSOps", file: !56, line: 33, size: 2048, elements: !394)
!394 = !{!395, !406, !413, !417, !418, !419, !423, !428, !433, !437, !438, !442, !443, !447, !448, !449, !455, !456, !457, !458, !459, !460, !461, !462, !463, !469, !473, !477, !481, !485, !486, !487}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "snesfunction", scope: !393, file: !56, line: 34, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!137, !399, !403, !403, !386}
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !400, line: 18, baseType: !401)
!400 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsnes.h", directory: "/home/users/ndemeye/xSDK")
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !400, line: 18, flags: DIFlagFwdDecl)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !27, line: 21, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !27, line: 21, flags: DIFlagFwdDecl)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "snesjacobian", scope: !393, file: !56, line: 35, baseType: !407, size: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!137, !399, !403, !410, !410, !386}
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !64, line: 16, baseType: !411)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !64, line: 16, flags: DIFlagFwdDecl)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !393, file: !56, line: 36, baseType: !414, size: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!137, !386}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !393, file: !56, line: 37, baseType: !414, size: 64, offset: 192)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !393, file: !56, line: 38, baseType: !414, size: 64, offset: 256)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !393, file: !56, line: 39, baseType: !420, size: 64, offset: 320)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!137, !386, !233, !403}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "evaluatewlte", scope: !393, file: !56, line: 40, baseType: !424, size: 64, offset: 384)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!137, !386, !427, !224, !232}
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !27, line: 155, baseType: !26)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "evaluatestep", scope: !393, file: !56, line: 41, baseType: !429, size: 64, offset: 448)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!137, !386, !179, !403, !432}
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !393, file: !56, line: 42, baseType: !434, size: 64, offset: 512)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{!137, !270, !386}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !393, file: !56, line: 43, baseType: !414, size: 64, offset: 576)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !393, file: !56, line: 44, baseType: !439, size: 64, offset: 640)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!137, !386, !143}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !393, file: !56, line: 45, baseType: !414, size: 64, offset: 704)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "linearstability", scope: !393, file: !56, line: 46, baseType: !444, size: 64, offset: 768)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!137, !386, !233, !233, !232, !232}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !393, file: !56, line: 47, baseType: !439, size: 64, offset: 832)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "rollback", scope: !393, file: !56, line: 48, baseType: !414, size: 64, offset: 896)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "getstages", scope: !393, file: !56, line: 49, baseType: !450, size: 64, offset: 960)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!137, !386, !224, !453}
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "adjointstep", scope: !393, file: !56, line: 50, baseType: !414, size: 64, offset: 1024)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "adjointsetup", scope: !393, file: !56, line: 51, baseType: !414, size: 64, offset: 1088)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "adjointreset", scope: !393, file: !56, line: 52, baseType: !414, size: 64, offset: 1152)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "adjointintegral", scope: !393, file: !56, line: 53, baseType: !414, size: 64, offset: 1216)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsetup", scope: !393, file: !56, line: 54, baseType: !414, size: 64, offset: 1280)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "forwardreset", scope: !393, file: !56, line: 55, baseType: !414, size: 64, offset: 1344)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "forwardstep", scope: !393, file: !56, line: 56, baseType: !414, size: 64, offset: 1408)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "forwardintegral", scope: !393, file: !56, line: 57, baseType: !414, size: 64, offset: 1472)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "forwardgetstages", scope: !393, file: !56, line: 58, baseType: !464, size: 64, offset: 1536)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!137, !386, !224, !467}
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "getsolutioncomponents", scope: !393, file: !56, line: 59, baseType: !470, size: 64, offset: 1600)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!137, !386, !224, !454}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "getauxsolution", scope: !393, file: !56, line: 60, baseType: !474, size: 64, offset: 1664)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!137, !386, !454}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "gettimeerror", scope: !393, file: !56, line: 61, baseType: !478, size: 64, offset: 1728)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!137, !386, !179, !454}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "settimeerror", scope: !393, file: !56, line: 62, baseType: !482, size: 64, offset: 1792)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!137, !386, !403}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "startingmethod", scope: !393, file: !56, line: 63, baseType: !414, size: 64, offset: 1856)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "initcondition", scope: !393, file: !56, line: 64, baseType: !482, size: 64, offset: 1920)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "exacterror", scope: !393, file: !56, line: 65, baseType: !488, size: 64, offset: 1984)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!137, !386, !403, !403}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "problem_type", scope: !388, file: !56, line: 146, baseType: !492, size: 32, offset: 6528)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSProblemType", file: !35, line: 57, baseType: !34)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "equation_type", scope: !388, file: !56, line: 147, baseType: !494, size: 32, offset: 6560)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSEquationType", file: !35, line: 88, baseType: !39)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !388, file: !56, line: 149, baseType: !496, size: 64, offset: 6592)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !497, line: 14, baseType: !498)
!497 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !497, line: 14, flags: DIFlagFwdDecl)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !388, file: !56, line: 150, baseType: !403, size: 64, offset: 6656)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "vec_dot", scope: !388, file: !56, line: 151, baseType: !403, size: 64, offset: 6720)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "adapt", scope: !388, file: !56, line: 152, baseType: !372, size: 64, offset: 6784)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "default_adapt_type", scope: !388, file: !56, line: 153, baseType: !504, size: 64, offset: 6848)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSAdaptType", file: !35, line: 695, baseType: !156)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !388, file: !56, line: 154, baseType: !506, size: 64, offset: 6912)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSEvent", file: !56, line: 71, baseType: !507)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_TSEvent", file: !56, line: 410, size: 1792, elements: !509)
!509 = !{!510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !526, !530, !531, !532, !533, !534, !535, !536, !537, !539, !540, !541, !549, !550}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "fvalue", scope: !508, file: !56, line: 411, baseType: !241, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "fvalue_prev", scope: !508, file: !56, line: 412, baseType: !241, size: 64, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_prev", scope: !508, file: !56, line: 413, baseType: !233, size: 64, offset: 128)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_end", scope: !508, file: !56, line: 414, baseType: !233, size: 64, offset: 192)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_right", scope: !508, file: !56, line: 415, baseType: !233, size: 64, offset: 256)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "fvalue_right", scope: !508, file: !56, line: 416, baseType: !241, size: 64, offset: 320)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "side", scope: !508, file: !56, line: 417, baseType: !224, size: 64, offset: 384)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_prev", scope: !508, file: !56, line: 418, baseType: !233, size: 64, offset: 448)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_posteventinterval", scope: !508, file: !56, line: 419, baseType: !233, size: 64, offset: 512)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_postevent", scope: !508, file: !56, line: 420, baseType: !233, size: 64, offset: 576)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "timestep_min", scope: !508, file: !56, line: 421, baseType: !233, size: 64, offset: 640)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "zerocrossing", scope: !508, file: !56, line: 422, baseType: !432, size: 64, offset: 704)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "eventhandler", scope: !508, file: !56, line: 423, baseType: !523, size: 64, offset: 768)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!137, !386, !233, !403, !241, !120}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "postevent", scope: !508, file: !56, line: 424, baseType: !527, size: 64, offset: 832)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!137, !386, !179, !224, !233, !403, !294, !120}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !508, file: !56, line: 425, baseType: !120, size: 64, offset: 896)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !508, file: !56, line: 426, baseType: !224, size: 64, offset: 960)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "terminate", scope: !508, file: !56, line: 427, baseType: !432, size: 64, offset: 1024)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "nevents", scope: !508, file: !56, line: 428, baseType: !179, size: 32, offset: 1088)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "nevents_zero", scope: !508, file: !56, line: 429, baseType: !179, size: 32, offset: 1120)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "events_zero", scope: !508, file: !56, line: 430, baseType: !224, size: 64, offset: 1152)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "vtol", scope: !508, file: !56, line: 431, baseType: !232, size: 64, offset: 1216)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !508, file: !56, line: 432, baseType: !538, size: 32, offset: 1280)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSEventStatus", file: !56, line: 408, baseType: !55)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "iterctr", scope: !508, file: !56, line: 433, baseType: !179, size: 32, offset: 1312)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !508, file: !56, line: 434, baseType: !143, size: 64, offset: 1344)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "recorder", scope: !508, file: !56, line: 442, baseType: !542, size: 320, offset: 1408)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !508, file: !56, line: 436, size: 320, elements: !543)
!543 = !{!544, !545, !546, !547, !548}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ctr", scope: !542, file: !56, line: 437, baseType: !179, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !542, file: !56, line: 438, baseType: !232, size: 64, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "stepnum", scope: !542, file: !56, line: 439, baseType: !224, size: 64, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "nevents", scope: !542, file: !56, line: 440, baseType: !224, size: 64, offset: 192)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "eventidx", scope: !542, file: !56, line: 441, baseType: !226, size: 64, offset: 256)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "recsize", scope: !508, file: !56, line: 443, baseType: !179, size: 32, offset: 1728)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !508, file: !56, line: 444, baseType: !179, size: 32, offset: 1760)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !388, file: !56, line: 157, baseType: !552, size: 640, offset: 6976)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 640, elements: !556)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{!137, !386, !179, !233, !403, !120}
!556 = !{!557}
!557 = !DISubrange(count: 10)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !388, file: !56, line: 158, baseType: !559, size: 640, offset: 7616)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !560, size: 640, elements: !556)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{!137, !563}
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !388, file: !56, line: 159, baseType: !565, size: 640, offset: 8256)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 640, elements: !556)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !388, file: !56, line: 160, baseType: !179, size: 32, offset: 8896)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "adjointmonitor", scope: !388, file: !56, line: 161, baseType: !568, size: 640, offset: 8960)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 640, elements: !556)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{!137, !386, !179, !233, !403, !179, !454, !454, !120}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "adjointmonitordestroy", scope: !388, file: !56, line: 162, baseType: !559, size: 640, offset: 9600)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "adjointmonitorcontext", scope: !388, file: !56, line: 163, baseType: !565, size: 640, offset: 10240)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "numberadjointmonitors", scope: !388, file: !56, line: 164, baseType: !179, size: 32, offset: 10880)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "monitorFrequency", scope: !388, file: !56, line: 165, baseType: !179, size: 32, offset: 10912)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "prestep", scope: !388, file: !56, line: 167, baseType: !414, size: 64, offset: 10944)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "prestage", scope: !388, file: !56, line: 168, baseType: !578, size: 64, offset: 11008)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!137, !386, !233}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "poststage", scope: !388, file: !56, line: 169, baseType: !582, size: 64, offset: 11072)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!137, !386, !233, !179, !454}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "postevaluate", scope: !388, file: !56, line: 170, baseType: !414, size: 64, offset: 11136)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "poststep", scope: !388, file: !56, line: 171, baseType: !414, size: 64, offset: 11200)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "functiondomainerror", scope: !388, file: !56, line: 172, baseType: !588, size: 64, offset: 11264)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!137, !386, !233, !403, !432}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "trajectory", scope: !388, file: !56, line: 175, baseType: !592, size: 64, offset: 11328)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSTrajectory", file: !35, line: 293, baseType: !593)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TSTrajectory", file: !56, line: 89, size: 7040, elements: !595)
!595 = !{!596, !597, !626, !630, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !667, !668, !669, !670, !671, !675, !676, !677}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !594, file: !56, line: 90, baseType: !377, size: 4480)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !594, file: !56, line: 90, baseType: !598, size: 448, offset: 4480)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !599, size: 448, elements: !175)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TSTrajectoryOps", file: !56, line: 75, size: 448, elements: !600)
!600 = !{!601, !605, !609, !610, !614, !618, !622}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !599, file: !56, line: 76, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!137, !592, !143}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !599, file: !56, line: 77, baseType: !606, size: 64, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{!137, !592}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !599, file: !56, line: 78, baseType: !606, size: 64, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !599, file: !56, line: 79, baseType: !611, size: 64, offset: 192)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!137, !592, !386, !179, !233, !403}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !599, file: !56, line: 80, baseType: !615, size: 64, offset: 256)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!137, !592, !386, !179, !232}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !599, file: !56, line: 81, baseType: !619, size: 64, offset: 320)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!137, !270, !592}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !599, file: !56, line: 82, baseType: !623, size: 64, offset: 384)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{!137, !592, !386}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "tsh", scope: !594, file: !56, line: 91, baseType: !627, size: 64, offset: 4928)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSHistory", file: !56, line: 87, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_TSHistory", file: !56, line: 87, flags: DIFlagFwdDecl)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !594, file: !56, line: 116, baseType: !631, size: 1024, offset: 4992)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !594, file: !56, line: 93, size: 1024, elements: !632)
!632 = !{!633, !634, !635, !636, !637, !638, !639, !640, !641, !648}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !631, file: !56, line: 94, baseType: !179, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "W", scope: !631, file: !56, line: 95, baseType: !454, size: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !631, file: !56, line: 96, baseType: !241, size: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !631, file: !56, line: 97, baseType: !232, size: 64, offset: 192)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "WW", scope: !631, file: !56, line: 98, baseType: !454, size: 64, offset: 256)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "TT", scope: !631, file: !56, line: 99, baseType: !432, size: 64, offset: 320)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "TW", scope: !631, file: !56, line: 100, baseType: !232, size: 64, offset: 384)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "caching", scope: !631, file: !56, line: 103, baseType: !294, size: 32, offset: 448)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "Ucached", scope: !631, file: !56, line: 109, baseType: !642, size: 256, offset: 512)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !631, file: !56, line: 104, size: 256, elements: !643)
!643 = !{!644, !645, !646, !647}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !642, file: !56, line: 105, baseType: !187, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !642, file: !56, line: 106, baseType: !217, size: 64, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !642, file: !56, line: 107, baseType: !233, size: 64, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !642, file: !56, line: 108, baseType: !179, size: 32, offset: 192)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "Udotcached", scope: !631, file: !56, line: 115, baseType: !649, size: 256, offset: 768)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !631, file: !56, line: 110, size: 256, elements: !650)
!650 = !{!651, !652, !653, !654}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !649, file: !56, line: 111, baseType: !187, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !649, file: !56, line: 112, baseType: !217, size: 64, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !649, file: !56, line: 113, baseType: !233, size: 64, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !649, file: !56, line: 114, baseType: !179, size: 32, offset: 192)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "U", scope: !594, file: !56, line: 117, baseType: !403, size: 64, offset: 6016)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "Udot", scope: !594, file: !56, line: 117, baseType: !403, size: 64, offset: 6080)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "usehistory", scope: !594, file: !56, line: 118, baseType: !294, size: 32, offset: 6144)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "solution_only", scope: !594, file: !56, line: 119, baseType: !294, size: 32, offset: 6176)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_solve_mode", scope: !594, file: !56, line: 120, baseType: !294, size: 32, offset: 6208)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !594, file: !56, line: 121, baseType: !143, size: 64, offset: 6272)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !594, file: !56, line: 122, baseType: !179, size: 32, offset: 6336)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "recomps", scope: !594, file: !56, line: 123, baseType: !179, size: 32, offset: 6368)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "diskreads", scope: !594, file: !56, line: 124, baseType: !179, size: 32, offset: 6400)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "diskwrites", scope: !594, file: !56, line: 124, baseType: !179, size: 32, offset: 6432)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !594, file: !56, line: 125, baseType: !666, size: 64, offset: 6464)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "keepfiles", scope: !594, file: !56, line: 126, baseType: !294, size: 32, offset: 6528)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "dirname", scope: !594, file: !56, line: 127, baseType: !206, size: 64, offset: 6592)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "filetemplate", scope: !594, file: !56, line: 127, baseType: !206, size: 64, offset: 6656)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "dirfiletemplate", scope: !594, file: !56, line: 128, baseType: !206, size: 64, offset: 6720)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !594, file: !56, line: 129, baseType: !672, size: 64, offset: 6784)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!137, !120, !403, !454}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "transformdestroy", scope: !594, file: !56, line: 130, baseType: !261, size: 64, offset: 6848)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "transformctx", scope: !594, file: !56, line: 131, baseType: !120, size: 64, offset: 6912)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !594, file: !56, line: 132, baseType: !120, size: 64, offset: 6976)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensi", scope: !388, file: !56, line: 176, baseType: !454, size: 64, offset: 11392)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensip", scope: !388, file: !56, line: 177, baseType: !454, size: 64, offset: 11456)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "numcost", scope: !388, file: !56, line: 178, baseType: !179, size: 32, offset: 11520)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "vec_costintegral", scope: !388, file: !56, line: 179, baseType: !403, size: 64, offset: 11584)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "adjointsetupcalled", scope: !388, file: !56, line: 180, baseType: !179, size: 32, offset: 11648)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_steps", scope: !388, file: !56, line: 181, baseType: !179, size: 32, offset: 11680)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_max_steps", scope: !388, file: !56, line: 182, baseType: !179, size: 32, offset: 11712)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "adjoint_solve", scope: !388, file: !56, line: 183, baseType: !294, size: 32, offset: 11744)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "costintegralfwd", scope: !388, file: !56, line: 184, baseType: !294, size: 32, offset: 11776)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "vec_costintegrand", scope: !388, file: !56, line: 185, baseType: !403, size: 64, offset: 11840)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "Jacp", scope: !388, file: !56, line: 186, baseType: !410, size: 64, offset: 11904)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "Jacprhs", scope: !388, file: !56, line: 186, baseType: !410, size: 64, offset: 11968)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ijacobianpctx", scope: !388, file: !56, line: 187, baseType: !120, size: 64, offset: 12032)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacobianpctx", scope: !388, file: !56, line: 187, baseType: !120, size: 64, offset: 12096)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "costintegrandctx", scope: !388, file: !56, line: 188, baseType: !120, size: 64, offset: 12160)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_drdu", scope: !388, file: !56, line: 189, baseType: !454, size: 64, offset: 12224)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_drdp", scope: !388, file: !56, line: 190, baseType: !454, size: 64, offset: 12288)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "vec_drdu_col", scope: !388, file: !56, line: 191, baseType: !403, size: 64, offset: 12352)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "vec_drdp_col", scope: !388, file: !56, line: 191, baseType: !403, size: 64, offset: 12416)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacobianp", scope: !388, file: !56, line: 194, baseType: !698, size: 64, offset: 12480)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!137, !386, !233, !403, !410, !120}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ijacobianp", scope: !388, file: !56, line: 195, baseType: !702, size: 64, offset: 12544)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!137, !386, !233, !403, !403, !233, !410, !120}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "costintegrand", scope: !388, file: !56, line: 196, baseType: !706, size: 64, offset: 12608)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!137, !386, !233, !403, !403, !120}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "drdufunction", scope: !388, file: !56, line: 197, baseType: !710, size: 64, offset: 12672)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!137, !386, !233, !403, !454, !120}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "drdpfunction", scope: !388, file: !56, line: 198, baseType: !710, size: 64, offset: 12736)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensi2", scope: !388, file: !56, line: 201, baseType: !454, size: 64, offset: 12800)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_sensi2p", scope: !388, file: !56, line: 202, baseType: !454, size: 64, offset: 12864)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "vec_dir", scope: !388, file: !56, line: 203, baseType: !403, size: 64, offset: 12928)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fuu", scope: !388, file: !56, line: 204, baseType: !454, size: 64, offset: 12992)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_guu", scope: !388, file: !56, line: 204, baseType: !454, size: 64, offset: 13056)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fup", scope: !388, file: !56, line: 205, baseType: !454, size: 64, offset: 13120)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_gup", scope: !388, file: !56, line: 205, baseType: !454, size: 64, offset: 13184)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fpu", scope: !388, file: !56, line: 206, baseType: !454, size: 64, offset: 13248)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_gpu", scope: !388, file: !56, line: 206, baseType: !454, size: 64, offset: 13312)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_fpp", scope: !388, file: !56, line: 207, baseType: !454, size: 64, offset: 13376)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_gpp", scope: !388, file: !56, line: 207, baseType: !454, size: 64, offset: 13440)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproductctx", scope: !388, file: !56, line: 208, baseType: !120, size: 64, offset: 13504)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproductctx", scope: !388, file: !56, line: 208, baseType: !120, size: 64, offset: 13568)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fuu", scope: !388, file: !56, line: 209, baseType: !728, size: 64, offset: 13632)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!137, !386, !233, !403, !454, !403, !454, !120}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fup", scope: !388, file: !56, line: 210, baseType: !728, size: 64, offset: 13696)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fpu", scope: !388, file: !56, line: 211, baseType: !728, size: 64, offset: 13760)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ihessianproduct_fpp", scope: !388, file: !56, line: 212, baseType: !728, size: 64, offset: 13824)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_guu", scope: !388, file: !56, line: 213, baseType: !728, size: 64, offset: 13888)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_gup", scope: !388, file: !56, line: 214, baseType: !728, size: 64, offset: 13952)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_gpu", scope: !388, file: !56, line: 215, baseType: !728, size: 64, offset: 14016)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "rhshessianproduct_gpp", scope: !388, file: !56, line: 216, baseType: !728, size: 64, offset: 14080)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "mat_sensip", scope: !388, file: !56, line: 219, baseType: !410, size: 64, offset: 14144)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sensip_col", scope: !388, file: !56, line: 220, baseType: !403, size: 64, offset: 14208)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_integral_sensip", scope: !388, file: !56, line: 221, baseType: !454, size: 64, offset: 14272)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "num_parameters", scope: !388, file: !56, line: 222, baseType: !179, size: 32, offset: 14336)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "num_initialvalues", scope: !388, file: !56, line: 223, baseType: !179, size: 32, offset: 14368)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "vecsrhsjacobianpctx", scope: !388, file: !56, line: 224, baseType: !120, size: 64, offset: 14400)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsetupcalled", scope: !388, file: !56, line: 225, baseType: !179, size: 32, offset: 14464)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "forward_solve", scope: !388, file: !56, line: 226, baseType: !294, size: 32, offset: 14496)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "vecsrhsjacobianp", scope: !388, file: !56, line: 227, baseType: !710, size: 64, offset: 14528)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "Arhs", scope: !388, file: !56, line: 231, baseType: !410, size: 64, offset: 14592)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "Brhs", scope: !388, file: !56, line: 232, baseType: !410, size: 64, offset: 14656)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "Frhs", scope: !388, file: !56, line: 233, baseType: !403, size: 64, offset: 14720)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacobian", scope: !388, file: !56, line: 247, baseType: !751, size: 384, offset: 14784)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !388, file: !56, line: 238, size: 384, elements: !752)
!752 = !{!753, !754, !755, !756, !758, !759, !760}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !751, file: !56, line: 239, baseType: !233, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "Xid", scope: !751, file: !56, line: 240, baseType: !187, size: 64, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "Xstate", scope: !751, file: !56, line: 241, baseType: !217, size: 64, offset: 128)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "mstructure", scope: !751, file: !56, line: 242, baseType: !757, size: 32, offset: 192)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !64, line: 285, baseType: !63)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "reuse", scope: !751, file: !56, line: 245, baseType: !294, size: 32, offset: 224)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !751, file: !56, line: 246, baseType: !233, size: 64, offset: 256)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !751, file: !56, line: 246, baseType: !233, size: 64, offset: 320)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "ijacobian", scope: !388, file: !56, line: 251, baseType: !762, size: 64, offset: 15168)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !388, file: !56, line: 249, size: 64, elements: !763)
!763 = !{!764}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !762, file: !56, line: 250, baseType: !233, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "axpy_pattern", scope: !388, file: !56, line: 253, baseType: !757, size: 32, offset: 15232)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "snes", scope: !388, file: !56, line: 255, baseType: !399, size: 64, offset: 15296)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "usessnes", scope: !388, file: !56, line: 256, baseType: !294, size: 32, offset: 15360)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_its", scope: !388, file: !56, line: 258, baseType: !179, size: 32, offset: 15392)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "snes_its", scope: !388, file: !56, line: 259, baseType: !179, size: 32, offset: 15424)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "num_snes_failures", scope: !388, file: !56, line: 260, baseType: !179, size: 32, offset: 15456)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "max_snes_failures", scope: !388, file: !56, line: 261, baseType: !179, size: 32, offset: 15488)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ifuncs", scope: !388, file: !56, line: 264, baseType: !179, size: 32, offset: 15520)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "rhsfuncs", scope: !388, file: !56, line: 264, baseType: !179, size: 32, offset: 15552)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ijacs", scope: !388, file: !56, line: 264, baseType: !179, size: 32, offset: 15584)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "rhsjacs", scope: !388, file: !56, line: 264, baseType: !179, size: 32, offset: 15616)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !388, file: !56, line: 267, baseType: !179, size: 32, offset: 15648)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !388, file: !56, line: 268, baseType: !120, size: 64, offset: 15680)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !388, file: !56, line: 269, baseType: !120, size: 64, offset: 15744)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "max_steps", scope: !388, file: !56, line: 272, baseType: !179, size: 32, offset: 15808)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "max_time", scope: !388, file: !56, line: 273, baseType: !233, size: 64, offset: 15872)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "steprollback", scope: !388, file: !56, line: 277, baseType: !294, size: 32, offset: 15936)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "steprestart", scope: !388, file: !56, line: 278, baseType: !294, size: 32, offset: 15968)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "steps", scope: !388, file: !56, line: 279, baseType: !179, size: 32, offset: 16000)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "ptime", scope: !388, file: !56, line: 280, baseType: !233, size: 64, offset: 16064)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "time_step", scope: !388, file: !56, line: 281, baseType: !233, size: 64, offset: 16128)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_prev", scope: !388, file: !56, line: 282, baseType: !233, size: 64, offset: 16192)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ptime_prev_rollback", scope: !388, file: !56, line: 283, baseType: !233, size: 64, offset: 16256)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "solvetime", scope: !388, file: !56, line: 284, baseType: !233, size: 64, offset: 16320)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !388, file: !56, line: 286, baseType: !790, size: 32, offset: 16384)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSConvergedReason", file: !35, line: 115, baseType: !70)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "errorifstepfailed", scope: !388, file: !56, line: 287, baseType: !294, size: 32, offset: 16416)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "reject", scope: !388, file: !56, line: 288, baseType: !179, size: 32, offset: 16448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "max_reject", scope: !388, file: !56, line: 288, baseType: !179, size: 32, offset: 16480)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "exact_final_time", scope: !388, file: !56, line: 289, baseType: !795, size: 32, offset: 16512)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "TSExactFinalTimeOption", file: !35, line: 217, baseType: !83)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "atol", scope: !388, file: !56, line: 291, baseType: !233, size: 64, offset: 16576)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !388, file: !56, line: 291, baseType: !233, size: 64, offset: 16640)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "vatol", scope: !388, file: !56, line: 292, baseType: !403, size: 64, offset: 16704)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "vrtol", scope: !388, file: !56, line: 292, baseType: !403, size: 64, offset: 16768)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "cfltime", scope: !388, file: !56, line: 293, baseType: !233, size: 64, offset: 16832)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "cfltime_local", scope: !388, file: !56, line: 293, baseType: !233, size: 64, offset: 16896)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "testjacobian", scope: !388, file: !56, line: 295, baseType: !294, size: 32, offset: 16960)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "testjacobiantranspose", scope: !388, file: !56, line: 296, baseType: !294, size: 32, offset: 16992)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !388, file: !56, line: 298, baseType: !179, size: 32, offset: 17024)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !388, file: !56, line: 299, baseType: !454, size: 64, offset: 17088)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "num_rhs_splits", scope: !388, file: !56, line: 302, baseType: !179, size: 32, offset: 17152)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "tsrhssplit", scope: !388, file: !56, line: 303, baseType: !808, size: 64, offset: 17216)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "TS_RHSSplitLink", file: !56, line: 135, baseType: !809)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TS_RHSSplitLink", file: !56, line: 136, size: 320, elements: !811)
!811 = !{!812, !813, !814, !819, !820}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !810, file: !56, line: 137, baseType: !386, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "splitname", scope: !810, file: !56, line: 138, baseType: !206, size: 64, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "is", scope: !810, file: !56, line: 139, baseType: !815, size: 64, offset: 128)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !816, line: 11, baseType: !817)
!816 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !816, line: 11, flags: DIFlagFwdDecl)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !810, file: !56, line: 140, baseType: !808, size: 64, offset: 192)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !810, file: !56, line: 141, baseType: !821, size: 32, offset: 256)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogEvent", file: !822, line: 80, baseType: !40)
!822 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!823 = !DIDerivedType(tag: DW_TAG_member, name: "use_splitrhsfunction", scope: !388, file: !56, line: 304, baseType: !294, size: 32, offset: 17280)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "quadraturets", scope: !388, file: !56, line: 307, baseType: !386, size: 64, offset: 17344)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !380, file: !56, line: 312, baseType: !826, size: 64, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{!137, !372}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !380, file: !56, line: 313, baseType: !826, size: 64, offset: 128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !380, file: !56, line: 314, baseType: !831, size: 64, offset: 192)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{!137, !372, !143}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !380, file: !56, line: 315, baseType: !835, size: 64, offset: 256)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!137, !270, !372}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !380, file: !56, line: 316, baseType: !831, size: 64, offset: 320)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !374, file: !56, line: 321, baseType: !120, size: 64, offset: 4864)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "checkstage", scope: !374, file: !56, line: 322, baseType: !841, size: 64, offset: 4928)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DISubroutineType(types: !843)
!843 = !{!137, !372, !386, !233, !403, !432}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "candidates", scope: !374, file: !56, line: 331, baseType: !845, size: 4160, offset: 4992)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !374, file: !56, line: 323, size: 4160, elements: !846)
!846 = !{!847, !848, !849, !851, !853, !854, !856}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !845, file: !56, line: 324, baseType: !179, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "inuse_set", scope: !845, file: !56, line: 325, baseType: !294, size: 32, offset: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !845, file: !56, line: 326, baseType: !850, size: 1024, offset: 64)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 1024, elements: !360)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !845, file: !56, line: 327, baseType: !852, size: 512, offset: 1088)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 512, elements: !360)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "stageorder", scope: !845, file: !56, line: 328, baseType: !852, size: 512, offset: 1600)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "ccfl", scope: !845, file: !56, line: 329, baseType: !855, size: 1024, offset: 2112)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 1024, elements: !360)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !845, file: !56, line: 330, baseType: !855, size: 1024, offset: 3136)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "always_accept", scope: !374, file: !56, line: 332, baseType: !294, size: 32, offset: 9152)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "safety", scope: !374, file: !56, line: 333, baseType: !233, size: 64, offset: 9216)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "reject_safety", scope: !374, file: !56, line: 334, baseType: !233, size: 64, offset: 9280)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !374, file: !56, line: 335, baseType: !343, size: 128, offset: 9344)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "dt_min", scope: !374, file: !56, line: 336, baseType: !233, size: 64, offset: 9472)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "dt_max", scope: !374, file: !56, line: 336, baseType: !233, size: 64, offset: 9536)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_max", scope: !374, file: !56, line: 337, baseType: !233, size: 64, offset: 9600)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "glee_use_local", scope: !374, file: !56, line: 338, baseType: !294, size: 32, offset: 9664)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "scale_solve_failed", scope: !374, file: !56, line: 339, baseType: !233, size: 64, offset: 9728)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "matchstepfac", scope: !374, file: !56, line: 340, baseType: !343, size: 128, offset: 9792)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "wnormtype", scope: !374, file: !56, line: 341, baseType: !427, size: 32, offset: 9920)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !374, file: !56, line: 342, baseType: !143, size: 64, offset: 9984)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "timestepjustdecreased_delay", scope: !374, file: !56, line: 343, baseType: !179, size: 32, offset: 10048)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "timestepjustdecreased", scope: !374, file: !56, line: 344, baseType: !179, size: 32, offset: 10080)
!871 = !{!872, !873, !874, !875, !878, !879, !881, !885}
!872 = !DILocalVariable(name: "adapt", arg: 1, scope: !369, file: !335, line: 330, type: !372)
!873 = !DILocalVariable(name: "name", arg: 2, scope: !369, file: !335, line: 330, type: !156)
!874 = !DILocalVariable(name: "ierr", scope: !369, file: !335, line: 332, type: !137)
!875 = !DILocalVariable(name: "_7_f", scope: !876, file: !335, line: 336, type: !877)
!876 = distinct !DILexicalBlock(scope: !369, file: !335, line: 336, column: 10)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!878 = !DILocalVariable(name: "_7_ierr", scope: !876, file: !335, line: 336, type: !137)
!879 = !DILocalVariable(name: "ierr__", scope: !880, file: !335, line: 336, type: !137)
!880 = distinct !DILexicalBlock(scope: !876, file: !335, line: 336, column: 10)
!881 = !DILocalVariable(name: "ierr__", scope: !882, file: !335, line: 336, type: !137)
!882 = distinct !DILexicalBlock(scope: !883, file: !335, line: 336, column: 10)
!883 = distinct !DILexicalBlock(scope: !884, file: !335, line: 336, column: 10)
!884 = distinct !DILexicalBlock(scope: !876, file: !335, line: 336, column: 10)
!885 = !DILocalVariable(name: "ierr__", scope: !886, file: !335, line: 336, type: !137)
!886 = distinct !DILexicalBlock(scope: !369, file: !335, line: 336, column: 91)
!887 = !DILocation(line: 0, scope: !369)
!888 = !DILocation(line: 333, column: 3, scope: !889)
!889 = distinct !DILexicalBlock(scope: !890, file: !335, line: 333, column: 3)
!890 = distinct !DILexicalBlock(scope: !891, file: !335, line: 333, column: 3)
!891 = distinct !DILexicalBlock(scope: !369, file: !335, line: 333, column: 3)
!892 = !{!893, !893, i64 0}
!893 = !{!"any pointer", !894, i64 0}
!894 = !{!"omnipotent char", !895, i64 0}
!895 = !{!"Simple C/C++ TBAA"}
!896 = !DILocation(line: 333, column: 3, scope: !890)
!897 = !DILocation(line: 333, column: 3, scope: !898)
!898 = distinct !DILexicalBlock(scope: !899, file: !335, line: 333, column: 3)
!899 = distinct !DILexicalBlock(scope: !889, file: !335, line: 333, column: 3)
!900 = !{!901, !902, i64 1536}
!901 = !{!"", !894, i64 0, !894, i64 512, !894, i64 1024, !894, i64 1280, !902, i64 1536, !902, i64 1540, !894, i64 1544}
!902 = !{!"int", !894, i64 0}
!903 = !DILocation(line: 333, column: 3, scope: !899)
!904 = !DILocation(line: 333, column: 3, scope: !905)
!905 = distinct !DILexicalBlock(scope: !898, file: !335, line: 333, column: 3)
!906 = !{!902, !902, i64 0}
!907 = !{!901, !902, i64 1540}
!908 = !DILocation(line: 334, column: 3, scope: !909)
!909 = distinct !DILexicalBlock(scope: !910, file: !335, line: 334, column: 3)
!910 = distinct !DILexicalBlock(scope: !369, file: !335, line: 334, column: 3)
!911 = !DILocation(line: 334, column: 3, scope: !910)
!912 = !DILocation(line: 334, column: 3, scope: !913)
!913 = distinct !DILexicalBlock(scope: !910, file: !335, line: 334, column: 3)
!914 = !DILocation(line: 334, column: 3, scope: !915)
!915 = distinct !DILexicalBlock(scope: !910, file: !335, line: 334, column: 3)
!916 = !{!917, !902, i64 0}
