; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/utils/vecio.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/vec/utils/vecio.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Vec = type { %struct._p_PetscObject, [1 x %struct._VecOps], %struct._n_PetscLayout*, i8*, i32, %struct.VecStash, %struct.VecStash, i32, i32, i32, i8* }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!77 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !90, line: 155, baseType: !5, size: 32, elements: !91)
!90 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!91 = !{!92, !93, !94, !95, !96}
!92 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!93 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!94 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!95 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!96 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 580, baseType: !5, size: 32, elements: !98)
!98 = !{!99, !100, !101, !102, !103, !104, !105, !106, !107}
!99 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!100 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!101 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!102 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!103 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!104 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!105 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!106 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!107 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!108 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !90, line: 475, baseType: !5, size: 32, elements: !109)
!109 = !{!110, !111, !112}
!110 = !DIEnumerator(name: "VEC_IGNORE_OFF_PROC_ENTRIES", value: 0, isUnsigned: true)
!111 = !DIEnumerator(name: "VEC_IGNORE_NEGATIVE_INDICES", value: 1, isUnsigned: true)
!112 = !DIEnumerator(name: "VEC_SUBSET_OFF_PROC_ENTRIES", value: 2, isUnsigned: true)
!113 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 701, baseType: !5, size: 32, elements: !114)
!114 = !{!115, !116, !117, !118, !119}
!115 = !DIEnumerator(name: "PETSC_MEMTYPE_HOST", value: 0, isUnsigned: true)
!116 = !DIEnumerator(name: "PETSC_MEMTYPE_DEVICE", value: 1, isUnsigned: true)
!117 = !DIEnumerator(name: "PETSC_MEMTYPE_CUDA", value: 1, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_MEMTYPE_NVSHMEM", value: 17, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_MEMTYPE_HIP", value: 3, isUnsigned: true)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !90, line: 472, baseType: !5, size: 32, elements: !121)
!121 = !{!122, !123, !124, !125, !126}
!122 = !DIEnumerator(name: "PETSC_OFFLOAD_UNALLOCATED", value: 0, isUnsigned: true)
!123 = !DIEnumerator(name: "PETSC_OFFLOAD_CPU", value: 1, isUnsigned: true)
!124 = !DIEnumerator(name: "PETSC_OFFLOAD_GPU", value: 2, isUnsigned: true)
!125 = !DIEnumerator(name: "PETSC_OFFLOAD_BOTH", value: 3, isUnsigned: true)
!126 = !DIEnumerator(name: "PETSC_OFFLOAD_VECKOKKOS", value: 256, isUnsigned: true)
!127 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !128, line: 663, baseType: !5, size: 32, elements: !129)
!128 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!129 = !{!130, !131, !132}
!130 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!131 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!132 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!133 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !134, line: 624, baseType: !5, size: 32, elements: !135)
!134 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!135 = !{!136, !137, !138, !139}
!136 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!137 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!138 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!139 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!140 = !{!141, !217, !160, !198, !148, !228}
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !144, line: 73, size: 4480, elements: !145)
!144 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!145 = !{!146, !149, !292, !293, !294, !297, !298, !299, !300, !308, !309, !311, !312, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !328, !329, !330, !332, !333, !334, !336, !337, !338, !339, !340, !343, !345, !346, !347, !348, !349, !352, !354, !355, !356, !366, !368, !369, !373, !374, !381, !386, !388, !389, !390}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !143, file: !144, line: 74, baseType: !147, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !148)
!148 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !143, file: !144, line: 75, baseType: !150, size: 448, offset: 64)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 448, elements: !256)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !144, line: 53, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !144, line: 45, size: 448, elements: !153)
!153 = !{!154, !163, !267, !272, !276, !280, !287}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !152, file: !144, line: 46, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!158, !141, !159}
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !148)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !134, line: 330, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !134, line: 330, flags: DIFlagFwdDecl)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !152, file: !144, line: 47, baseType: !164, size: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!158, !141, !167}
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !168, line: 16, baseType: !169)
!168 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !171, line: 28, size: 6016, elements: !172)
!171 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/viewerimpl.h", directory: "/home/users/ndemeye/xSDK")
!172 = !{!173, !175, !258, !260, !264, !265, !266}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !170, file: !171, line: 29, baseType: !174, size: 4480)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !144, line: 122, baseType: !143)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !170, file: !171, line: 29, baseType: !176, size: 512, offset: 4480)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 512, elements: !256)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscViewerOps", file: !171, line: 11, size: 512, elements: !178)
!178 = !{!179, !183, !187, !188, !193, !194, !202, !255}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !177, file: !171, line: 12, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!158, !167}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !177, file: !171, line: 13, baseType: !184, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!158, !167, !167}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !177, file: !171, line: 14, baseType: !180, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "getsubviewer", scope: !177, file: !171, line: 15, baseType: !189, size: 64, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!158, !167, !160, !192}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubviewer", scope: !177, file: !171, line: 16, baseType: !189, size: 64, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !177, file: !171, line: 17, baseType: !195, size: 64, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!158, !167, !198, !199, !200, !201}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !148)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDataType", file: !4, line: 389, baseType: !3)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !177, file: !171, line: 18, baseType: !203, size: 64, offset: 384)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!158, !206, !167}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !30, line: 108, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !30, line: 99, size: 640, elements: !209)
!209 = !{!210, !211, !243, !244, !245, !246, !247, !248, !249, !250, !251}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !208, file: !30, line: 100, baseType: !199, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !208, file: !30, line: 101, baseType: !212, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !30, line: 82, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !30, line: 83, size: 768, elements: !215)
!215 = !{!216, !219, !220, !221, !225, !230, !231, !232, !236, !238, !240, !241, !242}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !214, file: !30, line: 84, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !214, file: !30, line: 85, baseType: !217, size: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !214, file: !30, line: 86, baseType: !198, size: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !214, file: !30, line: 87, baseType: !222, size: 64, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !214, file: !30, line: 88, baseType: !226, size: 64, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !218)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !214, file: !30, line: 89, baseType: !218, size: 8, offset: 320)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !214, file: !30, line: 90, baseType: !217, size: 64, offset: 384)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !214, file: !30, line: 91, baseType: !233, size: 64, offset: 448)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !234, line: 46, baseType: !235)
!234 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!235 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !214, file: !30, line: 92, baseType: !237, size: 32, offset: 512)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !25)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !214, file: !30, line: 93, baseType: !239, size: 32, offset: 544)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !30, line: 81, baseType: !29)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !214, file: !30, line: 94, baseType: !212, size: 64, offset: 576)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !214, file: !30, line: 95, baseType: !217, size: 64, offset: 640)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !214, file: !30, line: 96, baseType: !198, size: 64, offset: 704)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !208, file: !30, line: 102, baseType: !217, size: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !208, file: !30, line: 102, baseType: !217, size: 64, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !208, file: !30, line: 103, baseType: !217, size: 64, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !208, file: !30, line: 104, baseType: !160, size: 64, offset: 320)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !208, file: !30, line: 105, baseType: !237, size: 32, offset: 384)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !208, file: !30, line: 105, baseType: !237, size: 32, offset: 416)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !208, file: !30, line: 105, baseType: !237, size: 32, offset: 448)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !208, file: !30, line: 106, baseType: !141, size: 64, offset: 512)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !208, file: !30, line: 107, baseType: !252, size: 64, offset: 576)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !30, line: 10, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !30, line: 10, flags: DIFlagFwdDecl)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !177, file: !171, line: 19, baseType: !180, size: 64, offset: 448)
!256 = !{!257}
!257 = !DISubrange(count: 1)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !170, file: !171, line: 30, baseType: !259, size: 32, offset: 4992)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !45, line: 162, baseType: !44)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "formats", scope: !170, file: !171, line: 30, baseType: !261, size: 800, offset: 5024)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 800, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 25)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !170, file: !171, line: 31, baseType: !148, size: 32, offset: 5824)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !170, file: !171, line: 32, baseType: !198, size: 64, offset: 5888)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !170, file: !171, line: 33, baseType: !237, size: 32, offset: 5952)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !152, file: !144, line: 48, baseType: !268, size: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!158, !271}
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !152, file: !144, line: 49, baseType: !273, size: 64, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!158, !141, !228, !141}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !152, file: !144, line: 50, baseType: !277, size: 64, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!158, !141, !228, !271}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !152, file: !144, line: 51, baseType: !281, size: 64, offset: 320)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!158, !141, !228, !284}
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{null}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !152, file: !144, line: 52, baseType: !288, size: 64, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!158, !141, !228, !291}
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !143, file: !144, line: 76, baseType: !160, size: 64, offset: 512)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !143, file: !144, line: 77, baseType: !199, size: 32, offset: 576)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !143, file: !144, line: 78, baseType: !295, size: 64, offset: 640)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !296)
!296 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !143, file: !144, line: 78, baseType: !295, size: 64, offset: 704)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !143, file: !144, line: 78, baseType: !295, size: 64, offset: 768)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !143, file: !144, line: 78, baseType: !295, size: 64, offset: 832)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !143, file: !144, line: 79, baseType: !301, size: 64, offset: 896)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !304, line: 27, baseType: !305)
!304 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !306, line: 43, baseType: !307)
!306 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!307 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !143, file: !144, line: 80, baseType: !199, size: 32, offset: 960)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !143, file: !144, line: 81, baseType: !310, size: 32, offset: 992)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !148)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !143, file: !144, line: 82, baseType: !222, size: 64, offset: 1024)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !143, file: !144, line: 83, baseType: !313, size: 64, offset: 1088)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !143, file: !144, line: 84, baseType: !217, size: 64, offset: 1152)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !143, file: !144, line: 85, baseType: !217, size: 64, offset: 1216)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !143, file: !144, line: 86, baseType: !217, size: 64, offset: 1280)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !143, file: !144, line: 87, baseType: !217, size: 64, offset: 1344)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !143, file: !144, line: 88, baseType: !141, size: 64, offset: 1408)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !143, file: !144, line: 89, baseType: !301, size: 64, offset: 1472)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !143, file: !144, line: 90, baseType: !217, size: 64, offset: 1536)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !143, file: !144, line: 91, baseType: !217, size: 64, offset: 1600)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !143, file: !144, line: 92, baseType: !199, size: 32, offset: 1664)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !143, file: !144, line: 93, baseType: !198, size: 64, offset: 1728)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !143, file: !144, line: 94, baseType: !327, size: 64, offset: 1792)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !302)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !143, file: !144, line: 95, baseType: !199, size: 32, offset: 1856)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !143, file: !144, line: 95, baseType: !199, size: 32, offset: 1888)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !143, file: !144, line: 96, baseType: !331, size: 64, offset: 1920)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !143, file: !144, line: 96, baseType: !331, size: 64, offset: 1984)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !143, file: !144, line: 97, baseType: !200, size: 64, offset: 2048)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !143, file: !144, line: 97, baseType: !335, size: 64, offset: 2112)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !143, file: !144, line: 98, baseType: !199, size: 32, offset: 2176)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !143, file: !144, line: 98, baseType: !199, size: 32, offset: 2208)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !143, file: !144, line: 99, baseType: !331, size: 64, offset: 2240)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !143, file: !144, line: 99, baseType: !331, size: 64, offset: 2304)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !143, file: !144, line: 100, baseType: !341, size: 64, offset: 2368)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !296)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !143, file: !144, line: 100, baseType: !344, size: 64, offset: 2432)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !143, file: !144, line: 101, baseType: !199, size: 32, offset: 2496)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !143, file: !144, line: 101, baseType: !199, size: 32, offset: 2528)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !143, file: !144, line: 102, baseType: !331, size: 64, offset: 2560)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !143, file: !144, line: 102, baseType: !331, size: 64, offset: 2624)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !143, file: !144, line: 103, baseType: !350, size: 64, offset: 2688)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !342)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !143, file: !144, line: 103, baseType: !353, size: 64, offset: 2752)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !143, file: !144, line: 104, baseType: !291, size: 64, offset: 2816)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !143, file: !144, line: 105, baseType: !199, size: 32, offset: 2880)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !143, file: !144, line: 106, baseType: !357, size: 128, offset: 2944)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !358, size: 128, elements: !364)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !144, line: 64, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !144, line: 61, size: 128, elements: !361)
!361 = !{!362, !363}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !360, file: !144, line: 62, baseType: !284, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !360, file: !144, line: 63, baseType: !198, size: 64, offset: 64)
!364 = !{!365}
!365 = !DISubrange(count: 2)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !143, file: !144, line: 107, baseType: !367, size: 64, offset: 3072)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 64, elements: !364)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !143, file: !144, line: 108, baseType: !198, size: 64, offset: 3136)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !143, file: !144, line: 109, baseType: !370, size: 64, offset: 3200)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!158, !198}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !143, file: !144, line: 111, baseType: !199, size: 32, offset: 3264)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !143, file: !144, line: 112, baseType: !375, size: 320, offset: 3328)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 320, elements: !379)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!158, !206, !141, !198}
!379 = !{!380}
!380 = !DISubrange(count: 5)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !143, file: !144, line: 113, baseType: !382, size: 320, offset: 3648)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 320, elements: !379)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!158, !141, !198}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !143, file: !144, line: 114, baseType: !387, size: 320, offset: 3968)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 320, elements: !379)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !143, file: !144, line: 115, baseType: !237, size: 32, offset: 4288)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !143, file: !144, line: 120, baseType: !252, size: 64, offset: 4352)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !143, file: !144, line: 121, baseType: !237, size: 32, offset: 4416)
!391 = !{i32 7, !"Dwarf Version", i32 4}
!392 = !{i32 2, !"Debug Info Version", i32 3}
!393 = !{i32 1, !"wchar_size", i32 4}
!394 = !{i32 7, !"PIC Level", i32 2}
!395 = !{i32 7, !"uwtable", i32 1}
!396 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!397 = distinct !DISubprogram(name: "VecView_Binary", scope: !398, file: !398, line: 14, type: !399, scopeLine: 15, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !700)
!398 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/vec/utils/vecio.c", directory: "/home/users/ndemeye/xSDK")
!399 = !DISubroutineType(types: !400)
!400 = !{!158, !401, !167}
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !90, line: 21, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !404, line: 142, size: 12800, elements: !405)
!404 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!405 = !{!406, !407, !625, !646, !647, !648, !694, !695, !696, !697, !699}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !403, file: !404, line: 143, baseType: !174, size: 4480)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !403, file: !404, line: 143, baseType: !408, size: 5248, offset: 4480)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !409, size: 5248, elements: !256)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !404, line: 23, size: 5248, elements: !410)
!410 = !{!411, !416, !421, !425, !429, !435, !440, !441, !442, !446, !450, !451, !452, !456, !460, !466, !467, !471, !475, !479, !480, !487, !491, !492, !496, !500, !501, !502, !506, !507, !514, !519, !520, !521, !523, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !544, !545, !546, !550, !554, !555, !556, !557, !561, !562, !563, !564, !565, !566, !567, !571, !572, !576, !583, !584, !589, !590, !594, !595, !596, !597, !598, !599, !600, !601, !605, !606, !607, !613, !617, !618, !619}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !409, file: !404, line: 24, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!158, !401, !415}
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !409, file: !404, line: 25, baseType: !417, size: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!158, !401, !199, !420}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !409, file: !404, line: 26, baseType: !422, size: 64, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!158, !199, !415}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !409, file: !404, line: 27, baseType: !426, size: 64, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!158, !401, !401, !350}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !409, file: !404, line: 28, baseType: !430, size: 64, offset: 256)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!158, !401, !199, !433, !350}
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !401)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !409, file: !404, line: 29, baseType: !436, size: 64, offset: 320)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!158, !401, !439, !341}
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !90, line: 155, baseType: !89)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !409, file: !404, line: 30, baseType: !426, size: 64, offset: 384)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !409, file: !404, line: 31, baseType: !430, size: 64, offset: 448)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !409, file: !404, line: 32, baseType: !443, size: 64, offset: 512)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!158, !401, !351}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !409, file: !404, line: 33, baseType: !447, size: 64, offset: 576)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!158, !401, !401}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !409, file: !404, line: 34, baseType: !443, size: 64, offset: 640)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !409, file: !404, line: 35, baseType: !447, size: 64, offset: 704)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !409, file: !404, line: 36, baseType: !453, size: 64, offset: 768)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!158, !401, !351, !401}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !409, file: !404, line: 37, baseType: !457, size: 64, offset: 832)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!158, !401, !351, !351, !401}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !409, file: !404, line: 38, baseType: !461, size: 64, offset: 896)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!158, !401, !199, !464, !415}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !351)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !409, file: !404, line: 39, baseType: !453, size: 64, offset: 960)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !409, file: !404, line: 40, baseType: !468, size: 64, offset: 1024)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!158, !401, !351, !401, !401}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !409, file: !404, line: 41, baseType: !472, size: 64, offset: 1088)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!158, !401, !351, !351, !351, !401, !401}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !409, file: !404, line: 42, baseType: !476, size: 64, offset: 1152)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!158, !401, !401, !401}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !409, file: !404, line: 43, baseType: !476, size: 64, offset: 1216)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !409, file: !404, line: 44, baseType: !481, size: 64, offset: 1280)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!158, !401, !199, !484, !464, !486}
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !199)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !97)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !409, file: !404, line: 45, baseType: !488, size: 64, offset: 1344)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!158, !401}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !409, file: !404, line: 46, baseType: !488, size: 64, offset: 1408)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !409, file: !404, line: 47, baseType: !493, size: 64, offset: 1472)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{!158, !401, !353}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !409, file: !404, line: 48, baseType: !497, size: 64, offset: 1536)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{!158, !401, !200}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !409, file: !404, line: 49, baseType: !497, size: 64, offset: 1600)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !409, file: !404, line: 50, baseType: !493, size: 64, offset: 1664)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !409, file: !404, line: 51, baseType: !503, size: 64, offset: 1728)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!158, !401, !200, !341}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !409, file: !404, line: 52, baseType: !503, size: 64, offset: 1792)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !409, file: !404, line: 53, baseType: !508, size: 64, offset: 1856)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!158, !401, !511}
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !512)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !409, file: !404, line: 54, baseType: !515, size: 64, offset: 1920)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{!158, !401, !518, !237}
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !90, line: 475, baseType: !108)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !409, file: !404, line: 55, baseType: !481, size: 64, offset: 1984)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !409, file: !404, line: 56, baseType: !488, size: 64, offset: 2048)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !409, file: !404, line: 57, baseType: !522, size: 64, offset: 2112)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !409, file: !404, line: 58, baseType: !524, size: 64, offset: 2176)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!158, !401, !464}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !409, file: !404, line: 59, baseType: !524, size: 64, offset: 2240)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !409, file: !404, line: 60, baseType: !426, size: 64, offset: 2304)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !409, file: !404, line: 61, baseType: !426, size: 64, offset: 2368)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !409, file: !404, line: 62, baseType: !436, size: 64, offset: 2432)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !409, file: !404, line: 63, baseType: !430, size: 64, offset: 2496)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !409, file: !404, line: 64, baseType: !430, size: 64, offset: 2560)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !409, file: !404, line: 65, baseType: !522, size: 64, offset: 2624)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !409, file: !404, line: 66, baseType: !488, size: 64, offset: 2688)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !409, file: !404, line: 67, baseType: !488, size: 64, offset: 2752)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !409, file: !404, line: 68, baseType: !537, size: 64, offset: 2816)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!158, !401, !540}
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !541, line: 30, baseType: !542)
!541 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !541, line: 30, flags: DIFlagFwdDecl)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !409, file: !404, line: 69, baseType: !481, size: 64, offset: 2880)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !409, file: !404, line: 70, baseType: !488, size: 64, offset: 2944)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !409, file: !404, line: 71, baseType: !547, size: 64, offset: 3008)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{!158, !206, !401}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !409, file: !404, line: 72, baseType: !551, size: 64, offset: 3072)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!158, !401, !401, !341}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !409, file: !404, line: 73, baseType: !476, size: 64, offset: 3136)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !409, file: !404, line: 74, baseType: !476, size: 64, offset: 3200)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !409, file: !404, line: 75, baseType: !476, size: 64, offset: 3264)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !409, file: !404, line: 76, baseType: !558, size: 64, offset: 3328)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{!158, !401, !199, !484, !350}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !409, file: !404, line: 77, baseType: !488, size: 64, offset: 3392)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !409, file: !404, line: 78, baseType: !488, size: 64, offset: 3456)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !409, file: !404, line: 79, baseType: !488, size: 64, offset: 3520)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !409, file: !404, line: 80, baseType: !488, size: 64, offset: 3584)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !409, file: !404, line: 81, baseType: !443, size: 64, offset: 3648)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !409, file: !404, line: 82, baseType: !488, size: 64, offset: 3712)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !409, file: !404, line: 83, baseType: !568, size: 64, offset: 3776)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!158, !401, !199, !401, !486}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !409, file: !404, line: 84, baseType: !568, size: 64, offset: 3840)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !409, file: !404, line: 85, baseType: !573, size: 64, offset: 3904)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{!158, !401, !401, !350, !350}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !409, file: !404, line: 86, baseType: !577, size: 64, offset: 3968)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!158, !401, !580, !415}
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !541, line: 11, baseType: !581)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !541, line: 11, flags: DIFlagFwdDecl)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !409, file: !404, line: 87, baseType: !577, size: 64, offset: 4032)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !409, file: !404, line: 88, baseType: !585, size: 64, offset: 4096)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{!158, !401, !588}
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !409, file: !404, line: 89, baseType: !585, size: 64, offset: 4160)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !409, file: !404, line: 90, baseType: !591, size: 64, offset: 4224)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!158, !401, !199, !484, !484, !401, !486}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !409, file: !404, line: 91, baseType: !591, size: 64, offset: 4288)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !409, file: !404, line: 92, baseType: !522, size: 64, offset: 4352)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !409, file: !404, line: 93, baseType: !522, size: 64, offset: 4416)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !409, file: !404, line: 94, baseType: !447, size: 64, offset: 4480)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !409, file: !404, line: 95, baseType: !447, size: 64, offset: 4544)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !409, file: !404, line: 96, baseType: !447, size: 64, offset: 4608)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !409, file: !404, line: 97, baseType: !447, size: 64, offset: 4672)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !409, file: !404, line: 98, baseType: !602, size: 64, offset: 4736)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!158, !401, !237}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !409, file: !404, line: 99, baseType: !493, size: 64, offset: 4800)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !409, file: !404, line: 100, baseType: !493, size: 64, offset: 4864)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !409, file: !404, line: 101, baseType: !608, size: 64, offset: 4928)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!158, !401, !353, !611}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !113)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !409, file: !404, line: 102, baseType: !614, size: 64, offset: 4992)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!158, !401, !588, !611}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !409, file: !404, line: 103, baseType: !493, size: 64, offset: 5056)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !409, file: !404, line: 104, baseType: !585, size: 64, offset: 5120)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !409, file: !404, line: 105, baseType: !620, size: 64, offset: 5184)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!158, !199, !433, !415, !623}
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !403, file: !404, line: 144, baseType: !626, size: 64, offset: 9728)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !541, line: 60, baseType: !627)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !629, line: 240, size: 640, elements: !630)
!629 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!630 = !{!631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !628, file: !629, line: 241, baseType: !160, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !628, file: !629, line: 242, baseType: !310, size: 32, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !628, file: !629, line: 243, baseType: !199, size: 32, offset: 96)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !628, file: !629, line: 243, baseType: !199, size: 32, offset: 128)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !628, file: !629, line: 244, baseType: !199, size: 32, offset: 160)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !628, file: !629, line: 244, baseType: !199, size: 32, offset: 192)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !628, file: !629, line: 245, baseType: !200, size: 64, offset: 256)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !628, file: !629, line: 246, baseType: !237, size: 32, offset: 320)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !628, file: !629, line: 247, baseType: !199, size: 32, offset: 352)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !628, file: !629, line: 251, baseType: !199, size: 32, offset: 384)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !628, file: !629, line: 252, baseType: !540, size: 64, offset: 448)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !628, file: !629, line: 253, baseType: !237, size: 32, offset: 512)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !628, file: !629, line: 254, baseType: !199, size: 32, offset: 544)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !628, file: !629, line: 254, baseType: !199, size: 32, offset: 576)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !628, file: !629, line: 255, baseType: !199, size: 32, offset: 608)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !403, file: !404, line: 145, baseType: !198, size: 64, offset: 9792)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !403, file: !404, line: 146, baseType: !237, size: 32, offset: 9856)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !403, file: !404, line: 147, baseType: !649, size: 1344, offset: 9920)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !404, line: 140, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !404, line: 114, size: 1344, elements: !651)
!651 = !{!652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !670, !671, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !650, file: !404, line: 115, baseType: !199, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !650, file: !404, line: 116, baseType: !199, size: 32, offset: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !650, file: !404, line: 117, baseType: !199, size: 32, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !650, file: !404, line: 118, baseType: !199, size: 32, offset: 96)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !650, file: !404, line: 119, baseType: !199, size: 32, offset: 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !650, file: !404, line: 120, baseType: !199, size: 32, offset: 160)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !650, file: !404, line: 121, baseType: !200, size: 64, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !650, file: !404, line: 122, baseType: !350, size: 64, offset: 256)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !650, file: !404, line: 124, baseType: !160, size: 64, offset: 320)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !650, file: !404, line: 125, baseType: !310, size: 32, offset: 384)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !650, file: !404, line: 125, baseType: !310, size: 32, offset: 416)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !650, file: !404, line: 126, baseType: !310, size: 32, offset: 448)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !650, file: !404, line: 126, baseType: !310, size: 32, offset: 480)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !650, file: !404, line: 127, baseType: !666, size: 64, offset: 512)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !134, line: 339, baseType: !668)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !134, line: 339, flags: DIFlagFwdDecl)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !650, file: !404, line: 128, baseType: !666, size: 64, offset: 576)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !650, file: !404, line: 129, baseType: !672, size: 64, offset: 640)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !134, line: 341, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !134, line: 351, size: 192, elements: !675)
!675 = !{!676, !677, !678, !679, !680}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !674, file: !134, line: 354, baseType: !148, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !674, file: !134, line: 355, baseType: !148, size: 32, offset: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !674, file: !134, line: 356, baseType: !148, size: 32, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !674, file: !134, line: 361, baseType: !148, size: 32, offset: 96)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !674, file: !134, line: 362, baseType: !233, size: 64, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !650, file: !404, line: 130, baseType: !199, size: 32, offset: 704)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !650, file: !404, line: 130, baseType: !199, size: 32, offset: 736)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !650, file: !404, line: 131, baseType: !350, size: 64, offset: 768)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !650, file: !404, line: 131, baseType: !350, size: 64, offset: 832)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !650, file: !404, line: 132, baseType: !200, size: 64, offset: 896)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !650, file: !404, line: 132, baseType: !200, size: 64, offset: 960)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !650, file: !404, line: 133, baseType: !199, size: 32, offset: 1024)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !650, file: !404, line: 134, baseType: !200, size: 64, offset: 1088)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !650, file: !404, line: 135, baseType: !199, size: 32, offset: 1152)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !650, file: !404, line: 136, baseType: !237, size: 32, offset: 1184)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !650, file: !404, line: 137, baseType: !237, size: 32, offset: 1216)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !650, file: !404, line: 138, baseType: !486, size: 32, offset: 1248)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !650, file: !404, line: 139, baseType: !200, size: 64, offset: 1280)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !403, file: !404, line: 147, baseType: !649, size: 1344, offset: 11264)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !403, file: !404, line: 148, baseType: !237, size: 32, offset: 12608)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !403, file: !404, line: 149, baseType: !199, size: 32, offset: 12640)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !403, file: !404, line: 150, baseType: !698, size: 32, offset: 12672)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !90, line: 472, baseType: !120)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !403, file: !404, line: 157, baseType: !217, size: 64, offset: 12736)
!700 = !{!701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !713, !714, !716, !722, !723, !725, !727, !729, !731, !733, !735, !739, !741, !743, !745, !799, !800, !801, !802, !803, !805, !807, !810, !811, !813, !817, !821, !823, !825, !827}
!701 = !DILocalVariable(name: "vec", arg: 1, scope: !397, file: !398, line: 14, type: !401)
!702 = !DILocalVariable(name: "viewer", arg: 2, scope: !397, file: !398, line: 14, type: !167)
!703 = !DILocalVariable(name: "ierr", scope: !397, file: !398, line: 16, type: !158)
!704 = !DILocalVariable(name: "skipHeader", scope: !397, file: !398, line: 17, type: !237)
!705 = !DILocalVariable(name: "map", scope: !397, file: !398, line: 18, type: !626)
!706 = !DILocalVariable(name: "tr", scope: !397, file: !398, line: 19, type: !367)
!707 = !DILocalVariable(name: "n", scope: !397, file: !398, line: 19, type: !199)
!708 = !DILocalVariable(name: "s", scope: !397, file: !398, line: 19, type: !199)
!709 = !DILocalVariable(name: "N", scope: !397, file: !398, line: 19, type: !199)
!710 = !DILocalVariable(name: "xarray", scope: !397, file: !398, line: 20, type: !464)
!711 = !DILocalVariable(name: "_7_ierr", scope: !712, file: !398, line: 23, type: !158)
!712 = distinct !DILexicalBlock(scope: !397, file: !398, line: 23, column: 3)
!713 = !DILocalVariable(name: "_7_flag", scope: !712, file: !398, line: 23, type: !310)
!714 = !DILocalVariable(name: "_7_errorcode", scope: !715, file: !398, line: 23, type: !158)
!715 = distinct !DILexicalBlock(scope: !712, file: !398, line: 23, column: 3)
!716 = !DILocalVariable(name: "_7_errorstring", scope: !717, file: !398, line: 23, type: !719)
!717 = distinct !DILexicalBlock(scope: !718, file: !398, line: 23, column: 3)
!718 = distinct !DILexicalBlock(scope: !715, file: !398, line: 23, column: 3)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 2048, elements: !720)
!720 = !{!721}
!721 = !DISubrange(count: 256)
!722 = !DILocalVariable(name: "_7_resultlen", scope: !717, file: !398, line: 23, type: !310)
!723 = !DILocalVariable(name: "ierr__", scope: !724, file: !398, line: 24, type: !158)
!724 = distinct !DILexicalBlock(scope: !397, file: !398, line: 24, column: 35)
!725 = !DILocalVariable(name: "ierr__", scope: !726, file: !398, line: 25, type: !158)
!726 = distinct !DILexicalBlock(scope: !397, file: !398, line: 25, column: 61)
!727 = !DILocalVariable(name: "ierr__", scope: !728, file: !398, line: 27, type: !158)
!728 = distinct !DILexicalBlock(scope: !397, file: !398, line: 27, column: 33)
!729 = !DILocalVariable(name: "ierr__", scope: !730, file: !398, line: 28, type: !158)
!730 = distinct !DILexicalBlock(scope: !397, file: !398, line: 28, column: 42)
!731 = !DILocalVariable(name: "ierr__", scope: !732, file: !398, line: 29, type: !158)
!732 = distinct !DILexicalBlock(scope: !397, file: !398, line: 29, column: 43)
!733 = !DILocalVariable(name: "ierr__", scope: !734, file: !398, line: 30, type: !158)
!734 = distinct !DILexicalBlock(scope: !397, file: !398, line: 30, column: 37)
!735 = !DILocalVariable(name: "ierr__", scope: !736, file: !398, line: 33, type: !158)
!736 = distinct !DILexicalBlock(scope: !737, file: !398, line: 33, column: 74)
!737 = distinct !DILexicalBlock(scope: !738, file: !398, line: 33, column: 20)
!738 = distinct !DILexicalBlock(scope: !397, file: !398, line: 33, column: 7)
!739 = !DILocalVariable(name: "ierr__", scope: !740, file: !398, line: 35, type: !158)
!740 = distinct !DILexicalBlock(scope: !397, file: !398, line: 35, column: 39)
!741 = !DILocalVariable(name: "ierr__", scope: !742, file: !398, line: 36, type: !158)
!742 = distinct !DILexicalBlock(scope: !397, file: !398, line: 36, column: 70)
!743 = !DILocalVariable(name: "ierr__", scope: !744, file: !398, line: 37, type: !158)
!744 = distinct !DILexicalBlock(scope: !397, file: !398, line: 37, column: 43)
!745 = !DILocalVariable(name: "info", scope: !746, file: !398, line: 40, type: !747)
!746 = distinct !DILexicalBlock(scope: !397, file: !398, line: 39, column: 3)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !749, line: 7, baseType: !750)
!749 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !751, line: 245, size: 1728, elements: !752)
!751 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/libio.h", directory: "")
!752 = !{!753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !773, !774, !775, !776, !778, !780, !782, !784, !787, !789, !790, !791, !792, !793, !794, !795}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !750, file: !751, line: 246, baseType: !148, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !750, file: !751, line: 251, baseType: !217, size: 64, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !750, file: !751, line: 252, baseType: !217, size: 64, offset: 128)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !750, file: !751, line: 253, baseType: !217, size: 64, offset: 192)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !750, file: !751, line: 254, baseType: !217, size: 64, offset: 256)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !750, file: !751, line: 255, baseType: !217, size: 64, offset: 320)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !750, file: !751, line: 256, baseType: !217, size: 64, offset: 384)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !750, file: !751, line: 257, baseType: !217, size: 64, offset: 448)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !750, file: !751, line: 258, baseType: !217, size: 64, offset: 512)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !750, file: !751, line: 260, baseType: !217, size: 64, offset: 576)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !750, file: !751, line: 261, baseType: !217, size: 64, offset: 640)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !750, file: !751, line: 262, baseType: !217, size: 64, offset: 704)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !750, file: !751, line: 264, baseType: !766, size: 64, offset: 768)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !751, line: 160, size: 192, elements: !768)
!768 = !{!769, !770, !772}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !767, file: !751, line: 161, baseType: !766, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !767, file: !751, line: 162, baseType: !771, size: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !767, file: !751, line: 166, baseType: !148, size: 32, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !750, file: !751, line: 266, baseType: !771, size: 64, offset: 832)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !750, file: !751, line: 268, baseType: !148, size: 32, offset: 896)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !750, file: !751, line: 272, baseType: !148, size: 32, offset: 928)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !750, file: !751, line: 274, baseType: !777, size: 64, offset: 960)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !306, line: 140, baseType: !307)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !750, file: !751, line: 278, baseType: !779, size: 16, offset: 1024)
!779 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !750, file: !751, line: 279, baseType: !781, size: 8, offset: 1040)
!781 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !750, file: !751, line: 280, baseType: !783, size: 8, offset: 1048)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 8, elements: !256)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !750, file: !751, line: 284, baseType: !785, size: 64, offset: 1088)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !751, line: 154, baseType: null)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !750, file: !751, line: 293, baseType: !788, size: 64, offset: 1152)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !306, line: 141, baseType: !307)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !750, file: !751, line: 301, baseType: !198, size: 64, offset: 1216)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !750, file: !751, line: 302, baseType: !198, size: 64, offset: 1280)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !750, file: !751, line: 303, baseType: !198, size: 64, offset: 1344)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !750, file: !751, line: 304, baseType: !198, size: 64, offset: 1408)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !750, file: !751, line: 306, baseType: !233, size: 64, offset: 1472)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !750, file: !751, line: 307, baseType: !148, size: 32, offset: 1536)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !750, file: !751, line: 309, baseType: !796, size: 160, offset: 1568)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 160, elements: !797)
!797 = !{!798}
!798 = !DISubrange(count: 20)
!799 = !DILocalVariable(name: "rank", scope: !746, file: !398, line: 41, type: !310)
!800 = !DILocalVariable(name: "format", scope: !746, file: !398, line: 42, type: !259)
!801 = !DILocalVariable(name: "name", scope: !746, file: !398, line: 43, type: !228)
!802 = !DILocalVariable(name: "pre", scope: !746, file: !398, line: 43, type: !228)
!803 = !DILocalVariable(name: "ierr__", scope: !804, file: !398, line: 45, type: !158)
!804 = distinct !DILexicalBlock(scope: !746, file: !398, line: 45, column: 58)
!805 = !DILocalVariable(name: "_7_errorcode", scope: !806, file: !398, line: 46, type: !158)
!806 = distinct !DILexicalBlock(scope: !746, file: !398, line: 46, column: 67)
!807 = !DILocalVariable(name: "_7_errorstring", scope: !808, file: !398, line: 46, type: !719)
!808 = distinct !DILexicalBlock(scope: !809, file: !398, line: 46, column: 67)
!809 = distinct !DILexicalBlock(scope: !806, file: !398, line: 46, column: 67)
!810 = !DILocalVariable(name: "_7_resultlen", scope: !808, file: !398, line: 46, type: !310)
!811 = !DILocalVariable(name: "ierr__", scope: !812, file: !398, line: 48, type: !158)
!812 = distinct !DILexicalBlock(scope: !746, file: !398, line: 48, column: 49)
!813 = !DILocalVariable(name: "ierr__", scope: !814, file: !398, line: 50, type: !158)
!814 = distinct !DILexicalBlock(scope: !815, file: !398, line: 50, column: 57)
!815 = distinct !DILexicalBlock(scope: !816, file: !398, line: 49, column: 47)
!816 = distinct !DILexicalBlock(scope: !746, file: !398, line: 49, column: 9)
!817 = !DILocalVariable(name: "ierr__", scope: !818, file: !398, line: 52, type: !158)
!818 = distinct !DILexicalBlock(scope: !819, file: !398, line: 52, column: 123)
!819 = distinct !DILexicalBlock(scope: !820, file: !398, line: 51, column: 26)
!820 = distinct !DILexicalBlock(scope: !815, file: !398, line: 51, column: 11)
!821 = !DILocalVariable(name: "ierr__", scope: !822, file: !398, line: 53, type: !158)
!822 = distinct !DILexicalBlock(scope: !819, file: !398, line: 53, column: 94)
!823 = !DILocalVariable(name: "ierr__", scope: !824, file: !398, line: 54, type: !158)
!824 = distinct !DILexicalBlock(scope: !819, file: !398, line: 54, column: 123)
!825 = !DILocalVariable(name: "ierr__", scope: !826, file: !398, line: 58, type: !158)
!826 = distinct !DILexicalBlock(scope: !746, file: !398, line: 58, column: 63)
!827 = !DILocalVariable(name: "ierr__", scope: !828, file: !398, line: 59, type: !158)
!828 = distinct !DILexicalBlock(scope: !829, file: !398, line: 59, column: 130)
!829 = distinct !DILexicalBlock(scope: !830, file: !398, line: 59, column: 24)
!830 = distinct !DILexicalBlock(scope: !746, file: !398, line: 59, column: 9)
!831 = !DILocation(line: 0, scope: !397)
!832 = !DILocation(line: 17, column: 3, scope: !397)
!833 = !DILocation(line: 18, column: 3, scope: !397)
!834 = !DILocation(line: 19, column: 3, scope: !397)
!835 = !DILocation(line: 19, column: 21, scope: !397)
!836 = !DILocation(line: 20, column: 3, scope: !397)
!837 = !DILocation(line: 22, column: 3, scope: !838)
!838 = distinct !DILexicalBlock(scope: !839, file: !398, line: 22, column: 3)
!839 = distinct !DILexicalBlock(scope: !840, file: !398, line: 22, column: 3)
!840 = distinct !DILexicalBlock(scope: !397, file: !398, line: 22, column: 3)
!841 = !{!842, !842, i64 0}
!842 = !{!"any pointer", !843, i64 0}
!843 = !{!"omnipotent char", !844, i64 0}
!844 = !{!"Simple C/C++ TBAA"}
!845 = !DILocation(line: 22, column: 3, scope: !839)
!846 = !DILocation(line: 22, column: 3, scope: !847)
!847 = distinct !DILexicalBlock(scope: !848, file: !398, line: 22, column: 3)
!848 = distinct !DILexicalBlock(scope: !838, file: !398, line: 22, column: 3)
!849 = !{!850, !851, i64 1536}
