; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/objects/subcomm.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/objects/subcomm.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct._n_PetscSubcomm = type { %struct.ompi_communicator_t*, %struct.ompi_communicator_t*, %struct.ompi_communicator_t*, i32, i32, i32*, i32, i8* }
%struct.ompi_communicator_t = type opaque
%struct._p_PetscOptionItems = type { i32, %struct._n_PetscOptionItem*, i8*, i8*, i8*, %struct.ompi_communicator_t*, i32, i32, i32, %struct._p_PetscObject*, %struct._n_PetscOptions* }
%struct._n_PetscOptionItem = type { i8*, i8*, i8*, %struct._n_PetscFunctionList*, i8**, i8, i8*, i64, i32, i32, %struct._n_PetscOptionItem*, i8*, i8* }
%struct._n_PetscFunctionList = type opaque
%struct._p_PetscObject = type opaque
%struct._n_PetscOptions = type opaque
%struct._p_PetscViewer = type opaque
%struct.ompi_datatype_t = type opaque

@.str = private unnamed_addr constant [8 x i8] c"GENERAL\00", align 1
@.str.1 = private unnamed_addr constant [11 x i8] c"CONTIGUOUS\00", align 1
@.str.2 = private unnamed_addr constant [11 x i8] c"INTERLACED\00", align 1

!57 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!60 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!61 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!62 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!63 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!64 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!65 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!66 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!67 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!68 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!69 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!70 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!72 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!85 = !{!86, !90, !91, !92, !93, !96, !99, !100, !101, !104, !107}
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !87, line: 330, baseType: !88)
!87 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !87, line: 330, flags: DIFlagFwdDecl)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEnum", file: !6, line: 58, baseType: !37)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!95 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !6, line: 430, flags: DIFlagFwdDecl)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!100 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 46, baseType: !103)
!102 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!103 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !87, line: 331, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !87, line: 331, flags: DIFlagFwdDecl)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !100)
!108 = !{!0}
!109 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/objects/subcomm.c", directory: "/home/users/ndemeye/xSDK")
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 384, elements: !112)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!112 = !{!113}
!113 = !DISubrange(count: 6)
!114 = !{i32 7, !"Dwarf Version", i32 4}
!115 = !{i32 2, !"Debug Info Version", i32 3}
!116 = !{i32 1, !"wchar_size", i32 4}
!117 = !{i32 7, !"PIC Level", i32 2}
!118 = !{i32 7, !"uwtable", i32 1}
!119 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!120 = distinct !DISubprogram(name: "PetscSubcommSetFromOptions", scope: !109, file: !109, line: 24, type: !121, scopeLine: 25, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !139)
!121 = !DISubroutineType(types: !122)
!122 = !{!123, !124}
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !100)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSubcomm", file: !6, line: 656, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSubcomm", file: !127, line: 2653, size: 448, elements: !128)
!127 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!128 = !{!129, !130, !131, !132, !133, !134, !136, !138}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !126, file: !127, line: 2654, baseType: !86, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "dupparent", scope: !126, file: !127, line: 2655, baseType: !86, size: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !126, file: !127, line: 2656, baseType: !86, size: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !126, file: !127, line: 2657, baseType: !107, size: 32, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !126, file: !127, line: 2658, baseType: !107, size: 32, offset: 224)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !126, file: !127, line: 2659, baseType: !135, size: 64, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !126, file: !127, line: 2660, baseType: !137, size: 32, offset: 320)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSubcommType", file: !6, line: 657, baseType: !5)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "subcommprefix", scope: !126, file: !127, line: 2661, baseType: !99, size: 64, offset: 384)
!139 = !{!140, !141, !142, !143, !145, !187, !189, !193, !195, !197, !199, !203, !205, !207, !210, !212, !214, !218, !220}
!140 = !DILocalVariable(name: "psubcomm", arg: 1, scope: !120, file: !109, line: 24, type: !124)
!141 = !DILocalVariable(name: "ierr", scope: !120, file: !109, line: 26, type: !123)
!142 = !DILocalVariable(name: "type", scope: !120, file: !109, line: 27, type: !137)
!143 = !DILocalVariable(name: "flg", scope: !120, file: !109, line: 28, type: !144)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !12)
!145 = !DILocalVariable(name: "PetscOptionsObjectBase", scope: !146, file: !109, line: 33, type: !147)
!146 = distinct !DILexicalBlock(scope: !120, file: !109, line: 33, column: 10)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !23, line: 108, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !23, line: 99, size: 640, elements: !149)
!149 = !{!150, !152, !175, !176, !177, !178, !179, !180, !181, !182, !183}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !148, file: !23, line: 100, baseType: !151, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !100)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !148, file: !23, line: 101, baseType: !153, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !23, line: 82, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !23, line: 83, size: 768, elements: !156)
!156 = !{!157, !158, !159, !160, !164, !166, !167, !168, !169, !170, !172, !173, !174}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !155, file: !23, line: 84, baseType: !99, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !155, file: !23, line: 85, baseType: !99, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !155, file: !23, line: 86, baseType: !90, size: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !155, file: !23, line: 87, baseType: !161, size: 64, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !155, file: !23, line: 88, baseType: !165, size: 64, offset: 256)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !155, file: !23, line: 89, baseType: !95, size: 8, offset: 320)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !155, file: !23, line: 90, baseType: !99, size: 64, offset: 384)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !155, file: !23, line: 91, baseType: !101, size: 64, offset: 448)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !155, file: !23, line: 92, baseType: !144, size: 32, offset: 512)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !155, file: !23, line: 93, baseType: !171, size: 32, offset: 544)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !23, line: 81, baseType: !22)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !155, file: !23, line: 94, baseType: !153, size: 64, offset: 576)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !155, file: !23, line: 95, baseType: !99, size: 64, offset: 640)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !155, file: !23, line: 96, baseType: !90, size: 64, offset: 704)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !148, file: !23, line: 102, baseType: !99, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !148, file: !23, line: 102, baseType: !99, size: 64, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !148, file: !23, line: 103, baseType: !99, size: 64, offset: 256)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !148, file: !23, line: 104, baseType: !86, size: 64, offset: 320)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !148, file: !23, line: 105, baseType: !144, size: 32, offset: 384)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !148, file: !23, line: 105, baseType: !144, size: 32, offset: 416)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !148, file: !23, line: 105, baseType: !144, size: 32, offset: 448)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !148, file: !23, line: 106, baseType: !96, size: 64, offset: 512)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !148, file: !23, line: 107, baseType: !184, size: 64, offset: 576)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !23, line: 10, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !23, line: 10, flags: DIFlagFwdDecl)
!187 = !DILocalVariable(name: "PetscOptionsObject", scope: !146, file: !109, line: 33, type: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!189 = !DILocalVariable(name: "_5_ierr", scope: !190, file: !109, line: 33, type: !123)
!190 = distinct !DILexicalBlock(scope: !191, file: !109, line: 33, column: 10)
!191 = distinct !DILexicalBlock(scope: !192, file: !109, line: 33, column: 10)
!192 = distinct !DILexicalBlock(scope: !146, file: !109, line: 33, column: 10)
!193 = !DILocalVariable(name: "ierr__", scope: !194, file: !109, line: 33, type: !123)
!194 = distinct !DILexicalBlock(scope: !190, file: !109, line: 33, column: 10)
!195 = !DILocalVariable(name: "ierr__", scope: !196, file: !109, line: 33, type: !123)
!196 = distinct !DILexicalBlock(scope: !190, file: !109, line: 33, column: 102)
!197 = !DILocalVariable(name: "ierr__", scope: !198, file: !109, line: 34, type: !123)
!198 = distinct !DILexicalBlock(scope: !190, file: !109, line: 34, column: 122)
!199 = !DILocalVariable(name: "ierr__", scope: !200, file: !109, line: 37, type: !123)
!200 = distinct !DILexicalBlock(scope: !201, file: !109, line: 37, column: 53)
!201 = distinct !DILexicalBlock(scope: !202, file: !109, line: 35, column: 38)
!202 = distinct !DILexicalBlock(scope: !190, file: !109, line: 35, column: 7)
!203 = !DILocalVariable(name: "ierr__", scope: !204, file: !109, line: 38, type: !123)
!204 = distinct !DILexicalBlock(scope: !201, file: !109, line: 38, column: 49)
!205 = !DILocalVariable(name: "ierr__", scope: !206, file: !109, line: 39, type: !123)
!206 = distinct !DILexicalBlock(scope: !201, file: !109, line: 39, column: 43)
!207 = !DILocalVariable(name: "ierr__", scope: !208, file: !109, line: 44, type: !123)
!208 = distinct !DILexicalBlock(scope: !209, file: !109, line: 44, column: 54)
!209 = distinct !DILexicalBlock(scope: !201, file: !109, line: 40, column: 19)
!210 = !DILocalVariable(name: "ierr__", scope: !211, file: !109, line: 47, type: !123)
!211 = distinct !DILexicalBlock(scope: !209, file: !109, line: 47, column: 54)
!212 = !DILocalVariable(name: "ierr__", scope: !213, file: !109, line: 54, type: !123)
!213 = distinct !DILexicalBlock(scope: !190, file: !109, line: 54, column: 112)
!214 = !DILocalVariable(name: "ierr__", scope: !215, file: !109, line: 56, type: !123)
!215 = distinct !DILexicalBlock(scope: !216, file: !109, line: 56, column: 78)
!216 = distinct !DILexicalBlock(scope: !217, file: !109, line: 55, column: 12)
!217 = distinct !DILexicalBlock(scope: !190, file: !109, line: 55, column: 7)
!218 = !DILocalVariable(name: "ierr__", scope: !219, file: !109, line: 58, type: !123)
!219 = distinct !DILexicalBlock(scope: !190, file: !109, line: 58, column: 10)
!220 = !DILocalVariable(name: "ierr__", scope: !221, file: !109, line: 58, type: !123)
!221 = distinct !DILexicalBlock(scope: !120, file: !109, line: 58, column: 28)
!222 = !DILocation(line: 0, scope: !120)
!223 = !DILocation(line: 27, column: 3, scope: !120)
!224 = !DILocation(line: 28, column: 3, scope: !120)
!225 = !DILocation(line: 30, column: 3, scope: !226)
!226 = distinct !DILexicalBlock(scope: !227, file: !109, line: 30, column: 3)
!227 = distinct !DILexicalBlock(scope: !228, file: !109, line: 30, column: 3)
!228 = distinct !DILexicalBlock(scope: !120, file: !109, line: 30, column: 3)
!229 = !{!230, !230, i64 0}
!230 = !{!"any pointer", !231, i64 0}
!231 = !{!"omnipotent char", !232, i64 0}
!232 = !{!"Simple C/C++ TBAA"}
!233 = !DILocation(line: 30, column: 3, scope: !227)
!234 = !DILocation(line: 30, column: 3, scope: !235)
