; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/fetidp/fetidp.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/fetidp/fetidp.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._n_PetscSegBuffer = type opaque

!399 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!400 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !401, line: 663, baseType: !7, size: 32, elements: !402)
!401 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!402 = !{!403, !404, !405}
!403 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!404 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!405 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!406 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !407)
!407 = !{!408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425}
!408 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!409 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!410 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!411 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!412 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!413 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!414 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!415 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!416 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!417 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!418 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!419 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!420 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!421 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!422 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!423 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!424 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!425 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!426 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !297, line: 318, baseType: !7, size: 32, elements: !427)
!427 = !{!428, !429}
!428 = !DIEnumerator(name: "PC_BDDC_INTERFACE_EXT_DIRICHLET", value: 0, isUnsigned: true)
!429 = !DIEnumerator(name: "PC_BDDC_INTERFACE_EXT_LUMP", value: 1, isUnsigned: true)
!430 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 327, baseType: !7, size: 32, elements: !431)
!431 = !{!432, !433, !434}
!432 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!433 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!434 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!435 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !62, line: 475, baseType: !7, size: 32, elements: !436)
!436 = !{!437, !438, !439}
!437 = !DIEnumerator(name: "VEC_IGNORE_OFF_PROC_ENTRIES", value: 0, isUnsigned: true)
!438 = !DIEnumerator(name: "VEC_IGNORE_NEGATIVE_INDICES", value: 1, isUnsigned: true)
!439 = !DIEnumerator(name: "VEC_SUBSET_OFF_PROC_ENTRIES", value: 2, isUnsigned: true)
!440 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !116, line: 149, baseType: !7, size: 32, elements: !441)
!441 = !{!442, !443}
!442 = !DIEnumerator(name: "IS_GTOLM_MASK", value: 0, isUnsigned: true)
!443 = !DIEnumerator(name: "IS_GTOLM_DROP", value: 1, isUnsigned: true)
!444 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !445, line: 624, baseType: !7, size: 32, elements: !446)
!445 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!446 = !{!447, !448, !449, !450}
!447 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!448 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!449 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!450 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!451 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !62, line: 30, baseType: !7, size: 32, elements: !452)
!452 = !{!453, !454, !455, !456, !457}
!453 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!454 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!455 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!456 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!457 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!458 = !{!459, !462, !463, !666, !498, !632, !669, !667, !2074, !548, !74, !493, !1595, !2096, !2097, !1347, !2122, !2087}
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !445, line: 330, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !445, line: 330, flags: DIFlagFwdDecl)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !464)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !466, line: 73, size: 4480, elements: !467)
!466 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!467 = !{!468, !470, !519, !520, !522, !525, !526, !527, !528, !536, !537, !539, !543, !547, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !560, !561, !562, !564, !565, !567, !569, !570, !571, !572, !573, !576, !578, !579, !580, !581, !582, !585, !587, !588, !589, !599, !601, !602, !606, !607, !656, !661, !663, !664, !665}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !465, file: !466, line: 74, baseType: !469, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !74)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !465, file: !466, line: 75, baseType: !471, size: 448, offset: 64)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !472, size: 448, elements: !517)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !466, line: 53, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !466, line: 45, size: 448, elements: !474)
!474 = !{!475, !481, !489, !494, !501, !505, !512}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !473, file: !466, line: 46, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!479, !463, !480}
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !74)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !473, file: !466, line: 47, baseType: !482, size: 64, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!479, !463, !485}
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !486, line: 16, baseType: !487)
!486 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !486, line: 16, flags: DIFlagFwdDecl)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !473, file: !466, line: 48, baseType: !490, size: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{!479, !493}
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !473, file: !466, line: 49, baseType: !495, size: 64, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{!479, !463, !498, !463}
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !500)
!500 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !473, file: !466, line: 50, baseType: !502, size: 64, offset: 256)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{!479, !463, !498, !493}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !473, file: !466, line: 51, baseType: !506, size: 64, offset: 320)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!479, !463, !498, !509}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{null}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !473, file: !466, line: 52, baseType: !513, size: 64, offset: 384)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!479, !463, !498, !516}
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!517 = !{!518}
!518 = !DISubrange(count: 1)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !465, file: !466, line: 76, baseType: !459, size: 64, offset: 512)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !465, file: !466, line: 77, baseType: !521, size: 32, offset: 576)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !74)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !465, file: !466, line: 78, baseType: !523, size: 64, offset: 640)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !524)
!524 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !465, file: !466, line: 78, baseType: !523, size: 64, offset: 704)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !465, file: !466, line: 78, baseType: !523, size: 64, offset: 768)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !465, file: !466, line: 78, baseType: !523, size: 64, offset: 832)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !465, file: !466, line: 79, baseType: !529, size: 64, offset: 896)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !531)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !532, line: 27, baseType: !533)
!532 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !534, line: 43, baseType: !535)
!534 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!535 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !465, file: !466, line: 80, baseType: !521, size: 32, offset: 960)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !465, file: !466, line: 81, baseType: !538, size: 32, offset: 992)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !74)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !465, file: !466, line: 82, baseType: !540, size: 64, offset: 1024)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !541)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !465, file: !466, line: 83, baseType: !544, size: 64, offset: 1088)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !545)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !465, file: !466, line: 84, baseType: !548, size: 64, offset: 1152)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !465, file: !466, line: 85, baseType: !548, size: 64, offset: 1216)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !465, file: !466, line: 86, baseType: !548, size: 64, offset: 1280)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !465, file: !466, line: 87, baseType: !548, size: 64, offset: 1344)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !465, file: !466, line: 88, baseType: !463, size: 64, offset: 1408)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !465, file: !466, line: 89, baseType: !529, size: 64, offset: 1472)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !465, file: !466, line: 90, baseType: !548, size: 64, offset: 1536)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !465, file: !466, line: 91, baseType: !548, size: 64, offset: 1600)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !465, file: !466, line: 92, baseType: !521, size: 32, offset: 1664)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !465, file: !466, line: 93, baseType: !462, size: 64, offset: 1728)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !465, file: !466, line: 94, baseType: !559, size: 64, offset: 1792)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !530)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !465, file: !466, line: 95, baseType: !521, size: 32, offset: 1856)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !465, file: !466, line: 95, baseType: !521, size: 32, offset: 1888)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !465, file: !466, line: 96, baseType: !563, size: 64, offset: 1920)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !465, file: !466, line: 96, baseType: !563, size: 64, offset: 1984)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !465, file: !466, line: 97, baseType: !566, size: 64, offset: 2048)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !465, file: !466, line: 97, baseType: !568, size: 64, offset: 2112)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !465, file: !466, line: 98, baseType: !521, size: 32, offset: 2176)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !465, file: !466, line: 98, baseType: !521, size: 32, offset: 2208)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !465, file: !466, line: 99, baseType: !563, size: 64, offset: 2240)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !465, file: !466, line: 99, baseType: !563, size: 64, offset: 2304)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !465, file: !466, line: 100, baseType: !574, size: 64, offset: 2368)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !524)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !465, file: !466, line: 100, baseType: !577, size: 64, offset: 2432)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !465, file: !466, line: 101, baseType: !521, size: 32, offset: 2496)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !465, file: !466, line: 101, baseType: !521, size: 32, offset: 2528)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !465, file: !466, line: 102, baseType: !563, size: 64, offset: 2560)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !465, file: !466, line: 102, baseType: !563, size: 64, offset: 2624)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !465, file: !466, line: 103, baseType: !583, size: 64, offset: 2688)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !575)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !465, file: !466, line: 103, baseType: !586, size: 64, offset: 2752)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !465, file: !466, line: 104, baseType: !516, size: 64, offset: 2816)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !465, file: !466, line: 105, baseType: !521, size: 32, offset: 2880)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !465, file: !466, line: 106, baseType: !590, size: 128, offset: 2944)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 128, elements: !597)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !466, line: 64, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !466, line: 61, size: 128, elements: !594)
!594 = !{!595, !596}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !593, file: !466, line: 62, baseType: !509, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !593, file: !466, line: 63, baseType: !462, size: 64, offset: 64)
!597 = !{!598}
!598 = !DISubrange(count: 2)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !465, file: !466, line: 107, baseType: !600, size: 64, offset: 3072)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !521, size: 64, elements: !597)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !465, file: !466, line: 108, baseType: !462, size: 64, offset: 3136)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !465, file: !466, line: 109, baseType: !603, size: 64, offset: 3200)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!479, !462}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !465, file: !466, line: 111, baseType: !521, size: 32, offset: 3264)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !465, file: !466, line: 112, baseType: !608, size: 320, offset: 3328)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !609, size: 320, elements: !654)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{!479, !612, !463, !462}
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !615)
!615 = !{!616, !617, !642, !643, !644, !645, !646, !647, !648, !649, !650}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !614, file: !12, line: 100, baseType: !521, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !614, file: !12, line: 101, baseType: !618, size: 64, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !619)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !621)
!621 = !{!622, !623, !624, !625, !626, !629, !630, !631, !635, !637, !639, !640, !641}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !620, file: !12, line: 84, baseType: !548, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !620, file: !12, line: 85, baseType: !548, size: 64, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !620, file: !12, line: 86, baseType: !462, size: 64, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !620, file: !12, line: 87, baseType: !540, size: 64, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !620, file: !12, line: 88, baseType: !627, size: 64, offset: 256)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !498)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !620, file: !12, line: 89, baseType: !500, size: 8, offset: 320)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !620, file: !12, line: 90, baseType: !548, size: 64, offset: 384)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !620, file: !12, line: 91, baseType: !632, size: 64, offset: 448)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !633, line: 46, baseType: !634)
!633 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!634 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !620, file: !12, line: 92, baseType: !636, size: 32, offset: 512)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !620, file: !12, line: 93, baseType: !638, size: 32, offset: 544)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !620, file: !12, line: 94, baseType: !618, size: 64, offset: 576)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !620, file: !12, line: 95, baseType: !548, size: 64, offset: 640)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !620, file: !12, line: 96, baseType: !462, size: 64, offset: 704)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !614, file: !12, line: 102, baseType: !548, size: 64, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !614, file: !12, line: 102, baseType: !548, size: 64, offset: 192)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !614, file: !12, line: 103, baseType: !548, size: 64, offset: 256)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !614, file: !12, line: 104, baseType: !459, size: 64, offset: 320)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !614, file: !12, line: 105, baseType: !636, size: 32, offset: 384)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !614, file: !12, line: 105, baseType: !636, size: 32, offset: 416)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !614, file: !12, line: 105, baseType: !636, size: 32, offset: 448)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !614, file: !12, line: 106, baseType: !463, size: 64, offset: 512)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !614, file: !12, line: 107, baseType: !651, size: 64, offset: 576)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !652)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!654 = !{!655}
!655 = !DISubrange(count: 5)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !465, file: !466, line: 113, baseType: !657, size: 320, offset: 3648)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !658, size: 320, elements: !654)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!479, !463, !462}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !465, file: !466, line: 114, baseType: !662, size: 320, offset: 3968)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !462, size: 320, elements: !654)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !465, file: !466, line: 115, baseType: !636, size: 32, offset: 4288)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !465, file: !466, line: 120, baseType: !651, size: 64, offset: 4352)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !465, file: !466, line: 121, baseType: !636, size: 32, offset: 4416)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !668, line: 1451, baseType: !509)
!668 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_BDDC", file: !671, line: 191, baseType: !672)
!671 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/pc/impls/bddc/bddc.h", directory: "/home/users/ndemeye/xSDK")
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !671, line: 25, size: 9664, elements: !673)
!673 = !{!674, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1928, !1929, !1930, !1931, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1996, !1997, !1998, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "pcis", scope: !672, file: !671, line: 27, baseType: !675, size: 2432)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_IS", file: !676, line: 78, baseType: !677)
!676 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/pc/impls/is/pcis.h", directory: "/home/users/ndemeye/xSDK")
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !676, line: 13, size: 2432, elements: !678)
!678 = !{!679, !680, !681, !686, !687, !688, !689, !1457, !1458, !1459, !1460, !1461, !1462, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !677, file: !676, line: 24, baseType: !521, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "n_B", scope: !677, file: !676, line: 25, baseType: !521, size: 32, offset: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "is_B_local", scope: !677, file: !676, line: 26, baseType: !682, size: 64, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !683, line: 11, baseType: !684)
!683 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !683, line: 11, flags: DIFlagFwdDecl)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "is_I_local", scope: !677, file: !676, line: 27, baseType: !682, size: 64, offset: 128)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "is_B_global", scope: !677, file: !676, line: 28, baseType: !682, size: 64, offset: 192)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "is_I_global", scope: !677, file: !676, line: 29, baseType: !682, size: 64, offset: 256)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "A_II", scope: !677, file: !676, line: 31, baseType: !690, size: 64, offset: 320)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !38, line: 16, baseType: !691)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !693, line: 436, size: 23424, elements: !694)
!693 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!694 = !{!695, !697, !1200, !1220, !1221, !1222, !1224, !1225, !1226, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1353, !1354, !1370, !1371, !1372, !1373, !1374, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1409, !1429, !1430, !1432, !1433, !1434, !1435, !1436, !1437, !1455, !1456}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !692, file: !693, line: 437, baseType: !696, size: 4480)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !466, line: 122, baseType: !465)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !692, file: !693, line: 437, baseType: !698, size: 9472, offset: 4480)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !699, size: 9472, elements: !517)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !693, line: 32, size: 9472, elements: !700)
!700 = !{!701, !710, !714, !715, !722, !726, !727, !728, !729, !730, !731, !732, !752, !756, !761, !767, !786, !791, !795, !796, !801, !806, !807, !812, !816, !820, !824, !828, !832, !833, !834, !835, !836, !840, !841, !846, !847, !848, !849, !850, !855, !862, !867, !871, !875, !879, !883, !884, !888, !889, !896, !901, !902, !903, !904, !966, !974, !975, !979, !980, !984, !985, !989, !994, !995, !999, !1003, !1010, !1011, !1012, !1013, !1014, !1015, !1020, !1021, !1025, !1029, !1033, !1034, !1035, !1039, !1049, !1050, !1054, !1055, !1059, !1060, !1064, !1065, !1070, !1071, !1075, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1089, !1090, !1091, !1092, !1093, !1094, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1109, !1113, !1114, !1115, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1129, !1130, !1131, !1136, !1140, !1141, !1145, !1146, !1147, !1148, !1174, !1178, !1179, !1180, !1181, !1182, !1186, !1187, !1188, !1189, !1190, !1194, !1198, !1199}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !699, file: !693, line: 34, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!479, !690, !521, !705, !521, !705, !707, !709}
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !521)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !584)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !26)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !699, file: !693, line: 35, baseType: !711, size: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!479, !690, !521, !566, !568, !586}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !699, file: !693, line: 36, baseType: !711, size: 64, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !699, file: !693, line: 37, baseType: !716, size: 64, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!479, !690, !719, !719}
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !62, line: 21, baseType: !720)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !62, line: 21, flags: DIFlagFwdDecl)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !699, file: !693, line: 38, baseType: !723, size: 64, offset: 256)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!479, !690, !719, !719, !719}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !699, file: !693, line: 40, baseType: !716, size: 64, offset: 320)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !699, file: !693, line: 41, baseType: !723, size: 64, offset: 384)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !699, file: !693, line: 42, baseType: !716, size: 64, offset: 448)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !699, file: !693, line: 43, baseType: !723, size: 64, offset: 512)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !699, file: !693, line: 44, baseType: !716, size: 64, offset: 576)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !699, file: !693, line: 46, baseType: !723, size: 64, offset: 640)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !699, file: !693, line: 47, baseType: !733, size: 64, offset: 704)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!479, !690, !682, !682, !736}
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !738)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !38, line: 1239, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 1226, size: 704, elements: !740)
!740 = !{!741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !739, file: !38, line: 1227, baseType: !575, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !739, file: !38, line: 1228, baseType: !575, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !739, file: !38, line: 1229, baseType: !575, size: 64, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !739, file: !38, line: 1230, baseType: !575, size: 64, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !739, file: !38, line: 1231, baseType: !575, size: 64, offset: 256)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !739, file: !38, line: 1232, baseType: !575, size: 64, offset: 320)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !739, file: !38, line: 1233, baseType: !575, size: 64, offset: 384)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !739, file: !38, line: 1234, baseType: !575, size: 64, offset: 448)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !739, file: !38, line: 1236, baseType: !575, size: 64, offset: 512)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !739, file: !38, line: 1237, baseType: !575, size: 64, offset: 576)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !739, file: !38, line: 1238, baseType: !575, size: 64, offset: 640)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !699, file: !693, line: 48, baseType: !753, size: 64, offset: 768)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!479, !690, !682, !736}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !699, file: !693, line: 49, baseType: !757, size: 64, offset: 832)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{!479, !690, !719, !575, !760, !575, !521, !521, !719}
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !38, line: 1291, baseType: !37)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !699, file: !693, line: 50, baseType: !762, size: 64, offset: 896)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{!479, !690, !765, !766}
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !38, line: 238, baseType: !50)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !699, file: !693, line: 52, baseType: !768, size: 64, offset: 960)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!479, !690, !771, !772}
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !38, line: 612, baseType: !56)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !38, line: 600, baseType: !774)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 592, size: 640, elements: !775)
!775 = !{!776, !777, !778, !779, !780, !781, !782, !783, !784, !785}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !774, file: !38, line: 593, baseType: !523, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !774, file: !38, line: 594, baseType: !523, size: 64, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !774, file: !38, line: 594, baseType: !523, size: 64, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !774, file: !38, line: 594, baseType: !523, size: 64, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !774, file: !38, line: 595, baseType: !523, size: 64, offset: 256)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !774, file: !38, line: 596, baseType: !523, size: 64, offset: 320)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !774, file: !38, line: 597, baseType: !523, size: 64, offset: 384)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !774, file: !38, line: 598, baseType: !523, size: 64, offset: 448)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !774, file: !38, line: 598, baseType: !523, size: 64, offset: 512)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !774, file: !38, line: 599, baseType: !523, size: 64, offset: 576)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !699, file: !693, line: 53, baseType: !787, size: 64, offset: 1024)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{!479, !690, !690, !790}
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !699, file: !693, line: 54, baseType: !792, size: 64, offset: 1088)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{!479, !690, !719}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !699, file: !693, line: 55, baseType: !716, size: 64, offset: 1152)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !699, file: !693, line: 56, baseType: !797, size: 64, offset: 1216)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{!479, !690, !800, !574}
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !62, line: 155, baseType: !61)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !699, file: !693, line: 58, baseType: !802, size: 64, offset: 1280)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{!479, !690, !805}
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !38, line: 424, baseType: !69)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !699, file: !693, line: 59, baseType: !802, size: 64, offset: 1344)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !699, file: !693, line: 60, baseType: !808, size: 64, offset: 1408)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DISubroutineType(types: !810)
!810 = !{!479, !690, !811, !636}
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !38, line: 469, baseType: !73)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !699, file: !693, line: 61, baseType: !813, size: 64, offset: 1472)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{!479, !690}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !699, file: !693, line: 63, baseType: !817, size: 64, offset: 1536)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{!479, !690, !521, !705, !584, !719, !719}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !699, file: !693, line: 64, baseType: !821, size: 64, offset: 1600)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{!479, !690, !690, !682, !682, !736}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !699, file: !693, line: 65, baseType: !825, size: 64, offset: 1664)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{!479, !690, !690, !736}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !699, file: !693, line: 66, baseType: !829, size: 64, offset: 1728)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{!479, !690, !690, !682, !736}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !699, file: !693, line: 67, baseType: !825, size: 64, offset: 1792)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !699, file: !693, line: 69, baseType: !813, size: 64, offset: 1856)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !699, file: !693, line: 70, baseType: !821, size: 64, offset: 1920)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !699, file: !693, line: 71, baseType: !829, size: 64, offset: 1984)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !699, file: !693, line: 72, baseType: !837, size: 64, offset: 2048)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{!479, !690, !766}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !699, file: !693, line: 73, baseType: !813, size: 64, offset: 2112)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !699, file: !693, line: 75, baseType: !842, size: 64, offset: 2176)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!479, !690, !845, !766}
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !38, line: 563, baseType: !104)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !699, file: !693, line: 76, baseType: !716, size: 64, offset: 2240)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !699, file: !693, line: 77, baseType: !716, size: 64, offset: 2304)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !699, file: !693, line: 78, baseType: !733, size: 64, offset: 2368)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !699, file: !693, line: 79, baseType: !753, size: 64, offset: 2432)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !699, file: !693, line: 81, baseType: !851, size: 64, offset: 2496)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{!479, !690, !584, !690, !854}
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !38, line: 285, baseType: !109)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !699, file: !693, line: 82, baseType: !856, size: 64, offset: 2560)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{!479, !690, !521, !859, !859, !765, !861}
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !682)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !699, file: !693, line: 83, baseType: !863, size: 64, offset: 2624)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{!479, !690, !521, !866, !521}
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !699, file: !693, line: 84, baseType: !868, size: 64, offset: 2688)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!479, !690, !521, !705, !521, !705, !583}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !699, file: !693, line: 85, baseType: !872, size: 64, offset: 2752)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!479, !690, !690, !854}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !699, file: !693, line: 87, baseType: !876, size: 64, offset: 2816)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{!479, !690, !719, !566}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !699, file: !693, line: 88, baseType: !880, size: 64, offset: 2880)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DISubroutineType(types: !882)
!882 = !{!479, !690, !584}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !699, file: !693, line: 89, baseType: !880, size: 64, offset: 2944)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !699, file: !693, line: 90, baseType: !885, size: 64, offset: 3008)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{!479, !690, !719, !709}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !699, file: !693, line: 91, baseType: !817, size: 64, offset: 3072)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !699, file: !693, line: 93, baseType: !890, size: 64, offset: 3136)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{!479, !690, !893}
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !894)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !699, file: !693, line: 94, baseType: !897, size: 64, offset: 3200)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DISubroutineType(types: !899)
!899 = !{!479, !690, !521, !636, !636, !566, !900, !900, !790}
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !699, file: !693, line: 95, baseType: !897, size: 64, offset: 3264)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !699, file: !693, line: 96, baseType: !897, size: 64, offset: 3328)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !699, file: !693, line: 97, baseType: !897, size: 64, offset: 3392)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !699, file: !693, line: 99, baseType: !905, size: 64, offset: 3456)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{!479, !690, !908, !911}
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !683, line: 51, baseType: !909)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !683, line: 51, flags: DIFlagFwdDecl)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !38, line: 1378, baseType: !912)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !693, line: 609, size: 6208, elements: !914)
!914 = !{!915, !916, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !935, !942, !943, !944, !945, !946, !947, !948, !949, !953, !954, !955, !956, !957, !959, !960, !961, !962, !963, !964, !965}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !913, file: !693, line: 610, baseType: !696, size: 4480)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !913, file: !693, line: 610, baseType: !917, size: 32, offset: 4480)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 32, elements: !517)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !913, file: !693, line: 611, baseType: !521, size: 32, offset: 4512)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !913, file: !693, line: 611, baseType: !521, size: 32, offset: 4544)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !913, file: !693, line: 611, baseType: !521, size: 32, offset: 4576)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !913, file: !693, line: 612, baseType: !521, size: 32, offset: 4608)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !913, file: !693, line: 613, baseType: !521, size: 32, offset: 4640)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !913, file: !693, line: 614, baseType: !566, size: 64, offset: 4672)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !913, file: !693, line: 615, baseType: !568, size: 64, offset: 4736)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !913, file: !693, line: 616, baseType: !866, size: 64, offset: 4800)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !913, file: !693, line: 617, baseType: !566, size: 64, offset: 4864)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !913, file: !693, line: 618, baseType: !928, size: 64, offset: 4928)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !693, line: 602, baseType: !930)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !693, line: 598, size: 128, elements: !931)
!931 = !{!932, !933, !934}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !930, file: !693, line: 599, baseType: !521, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !930, file: !693, line: 600, baseType: !521, size: 32, offset: 32)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !930, file: !693, line: 601, baseType: !583, size: 64, offset: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !913, file: !693, line: 619, baseType: !936, size: 64, offset: 4992)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !693, line: 607, baseType: !938)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !693, line: 604, size: 128, elements: !939)
!939 = !{!940, !941}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !938, file: !693, line: 605, baseType: !521, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !938, file: !693, line: 606, baseType: !583, size: 64, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !913, file: !693, line: 620, baseType: !583, size: 64, offset: 5056)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !913, file: !693, line: 621, baseType: !575, size: 64, offset: 5120)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !913, file: !693, line: 622, baseType: !575, size: 64, offset: 5184)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !913, file: !693, line: 623, baseType: !719, size: 64, offset: 5248)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !913, file: !693, line: 623, baseType: !719, size: 64, offset: 5312)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !913, file: !693, line: 623, baseType: !719, size: 64, offset: 5376)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !913, file: !693, line: 624, baseType: !636, size: 32, offset: 5440)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !913, file: !693, line: 625, baseType: !950, size: 64, offset: 5504)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{!479}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !913, file: !693, line: 626, baseType: !462, size: 64, offset: 5568)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !913, file: !693, line: 627, baseType: !719, size: 64, offset: 5632)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !913, file: !693, line: 628, baseType: !521, size: 32, offset: 5696)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !913, file: !693, line: 629, baseType: !498, size: 64, offset: 5760)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !913, file: !693, line: 630, baseType: !958, size: 32, offset: 5824)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !116, line: 213, baseType: !115)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !913, file: !693, line: 631, baseType: !521, size: 32, offset: 5856)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !913, file: !693, line: 631, baseType: !521, size: 32, offset: 5888)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !913, file: !693, line: 632, baseType: !636, size: 32, offset: 5920)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !913, file: !693, line: 633, baseType: !636, size: 32, offset: 5952)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !913, file: !693, line: 634, baseType: !509, size: 64, offset: 6016)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !913, file: !693, line: 634, baseType: !462, size: 64, offset: 6080)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !913, file: !693, line: 635, baseType: !529, size: 64, offset: 6144)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !699, file: !693, line: 100, baseType: !967, size: 64, offset: 3520)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!479, !690, !521, !521, !970, !973}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !116, line: 215, baseType: !972)
!972 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !699, file: !693, line: 101, baseType: !813, size: 64, offset: 3584)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !699, file: !693, line: 102, baseType: !976, size: 64, offset: 3648)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!479, !690, !682, !682, !766}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !699, file: !693, line: 103, baseType: !702, size: 64, offset: 3712)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !699, file: !693, line: 105, baseType: !981, size: 64, offset: 3776)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!479, !690, !682, !682, !765, !766}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !699, file: !693, line: 106, baseType: !813, size: 64, offset: 3840)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !699, file: !693, line: 107, baseType: !986, size: 64, offset: 3904)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!479, !690, !485}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !699, file: !693, line: 108, baseType: !990, size: 64, offset: 3968)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!479, !690, !993, !765, !766}
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !38, line: 25, baseType: !498)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !699, file: !693, line: 109, baseType: !950, size: 64, offset: 4032)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !699, file: !693, line: 111, baseType: !996, size: 64, offset: 4096)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!479, !690, !690, !690, !575, !690}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !699, file: !693, line: 112, baseType: !1000, size: 64, offset: 4160)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!479, !690, !690, !690, !690}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !699, file: !693, line: 113, baseType: !1004, size: 64, offset: 4224)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!479, !690, !1007, !1007}
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !683, line: 30, baseType: !1008)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !683, line: 30, flags: DIFlagFwdDecl)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !699, file: !693, line: 114, baseType: !702, size: 64, offset: 4288)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !699, file: !693, line: 115, baseType: !817, size: 64, offset: 4352)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !699, file: !693, line: 117, baseType: !876, size: 64, offset: 4416)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !699, file: !693, line: 118, baseType: !876, size: 64, offset: 4480)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !699, file: !693, line: 119, baseType: !990, size: 64, offset: 4544)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !699, file: !693, line: 120, baseType: !1016, size: 64, offset: 4608)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!479, !690, !1019, !790}
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !38, line: 1675, baseType: !120)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !699, file: !693, line: 121, baseType: !950, size: 64, offset: 4672)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !699, file: !693, line: 123, baseType: !1022, size: 64, offset: 4736)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!479, !690, !521, !462}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !699, file: !693, line: 124, baseType: !1026, size: 64, offset: 4800)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!479, !690, !911, !719, !462}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !699, file: !693, line: 125, baseType: !1030, size: 64, offset: 4864)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!479, !612, !690}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !699, file: !693, line: 126, baseType: !716, size: 64, offset: 4928)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !699, file: !693, line: 127, baseType: !716, size: 64, offset: 4992)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !699, file: !693, line: 129, baseType: !1036, size: 64, offset: 5056)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!479, !690, !866}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !699, file: !693, line: 130, baseType: !1040, size: 64, offset: 5120)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!479, !690, !1043, !1043}
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !62, line: 654, baseType: !1044)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !62, line: 653, size: 128, elements: !1046)
!1046 = !{!1047, !1048}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1045, file: !62, line: 653, baseType: !521, size: 32)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1045, file: !62, line: 653, baseType: !719, size: 64, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !699, file: !693, line: 131, baseType: !1040, size: 64, offset: 5184)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !699, file: !693, line: 132, baseType: !1051, size: 64, offset: 5248)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!479, !690, !566, !566, !566}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !699, file: !693, line: 133, baseType: !986, size: 64, offset: 5312)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !699, file: !693, line: 135, baseType: !1056, size: 64, offset: 5376)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!479, !690, !575, !790}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !699, file: !693, line: 136, baseType: !1056, size: 64, offset: 5440)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !699, file: !693, line: 137, baseType: !1061, size: 64, offset: 5504)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!479, !690, !790}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !699, file: !693, line: 138, baseType: !702, size: 64, offset: 5568)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !699, file: !693, line: 139, baseType: !1066, size: 64, offset: 5632)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!479, !690, !1069, !1069}
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !699, file: !693, line: 141, baseType: !950, size: 64, offset: 5696)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !699, file: !693, line: 142, baseType: !1072, size: 64, offset: 5760)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!479, !690, !690, !575, !690}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !699, file: !693, line: 143, baseType: !1076, size: 64, offset: 5824)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!479, !690, !690, !690}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !699, file: !693, line: 144, baseType: !950, size: 64, offset: 5888)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !699, file: !693, line: 145, baseType: !1072, size: 64, offset: 5952)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !699, file: !693, line: 147, baseType: !1076, size: 64, offset: 6016)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !699, file: !693, line: 148, baseType: !950, size: 64, offset: 6080)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !699, file: !693, line: 149, baseType: !1072, size: 64, offset: 6144)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !699, file: !693, line: 150, baseType: !1076, size: 64, offset: 6208)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !699, file: !693, line: 151, baseType: !1086, size: 64, offset: 6272)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!479, !690, !636}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !699, file: !693, line: 153, baseType: !813, size: 64, offset: 6336)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !699, file: !693, line: 154, baseType: !813, size: 64, offset: 6400)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !699, file: !693, line: 155, baseType: !813, size: 64, offset: 6464)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !699, file: !693, line: 156, baseType: !813, size: 64, offset: 6528)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !699, file: !693, line: 157, baseType: !986, size: 64, offset: 6592)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !699, file: !693, line: 159, baseType: !1095, size: 64, offset: 6656)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!479, !690, !521, !707}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !699, file: !693, line: 160, baseType: !813, size: 64, offset: 6720)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !699, file: !693, line: 161, baseType: !813, size: 64, offset: 6784)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !699, file: !693, line: 162, baseType: !813, size: 64, offset: 6848)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !699, file: !693, line: 163, baseType: !813, size: 64, offset: 6912)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !699, file: !693, line: 165, baseType: !1076, size: 64, offset: 6976)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !699, file: !693, line: 166, baseType: !1076, size: 64, offset: 7040)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !699, file: !693, line: 167, baseType: !876, size: 64, offset: 7104)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !699, file: !693, line: 168, baseType: !1106, size: 64, offset: 7168)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!479, !690, !719, !521}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !699, file: !693, line: 169, baseType: !1110, size: 64, offset: 7232)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!479, !690, !790, !566}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !699, file: !693, line: 171, baseType: !837, size: 64, offset: 7296)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !699, file: !693, line: 172, baseType: !813, size: 64, offset: 7360)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !699, file: !693, line: 173, baseType: !1116, size: 64, offset: 7424)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{!479, !690, !566, !900}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !699, file: !693, line: 174, baseType: !976, size: 64, offset: 7488)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !699, file: !693, line: 175, baseType: !976, size: 64, offset: 7552)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !699, file: !693, line: 177, baseType: !716, size: 64, offset: 7616)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !699, file: !693, line: 178, baseType: !762, size: 64, offset: 7680)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !699, file: !693, line: 179, baseType: !716, size: 64, offset: 7744)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !699, file: !693, line: 180, baseType: !723, size: 64, offset: 7808)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !699, file: !693, line: 181, baseType: !1126, size: 64, offset: 7872)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!479, !690, !459, !765, !766}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !699, file: !693, line: 183, baseType: !1036, size: 64, offset: 7936)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !699, file: !693, line: 184, baseType: !797, size: 64, offset: 8000)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !699, file: !693, line: 185, baseType: !1132, size: 64, offset: 8064)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!479, !690, !1135}
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !699, file: !693, line: 186, baseType: !1137, size: 64, offset: 8128)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!479, !690, !521, !705, !583}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !699, file: !693, line: 187, baseType: !856, size: 64, offset: 8192)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !699, file: !693, line: 189, baseType: !1142, size: 64, offset: 8256)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{!479, !690, !521, !521, !566, !707}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !699, file: !693, line: 190, baseType: !950, size: 64, offset: 8320)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !699, file: !693, line: 191, baseType: !1072, size: 64, offset: 8384)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !699, file: !693, line: 192, baseType: !1076, size: 64, offset: 8448)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !699, file: !693, line: 193, baseType: !1149, size: 64, offset: 8512)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!479, !690, !908, !1152}
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !38, line: 1401, baseType: !1153)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !693, line: 660, size: 5312, elements: !1155)
!1155 = !{!1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1154, file: !693, line: 661, baseType: !696, size: 4480)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1154, file: !693, line: 661, baseType: !917, size: 32, offset: 4480)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1154, file: !693, line: 662, baseType: !521, size: 32, offset: 4512)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1154, file: !693, line: 662, baseType: !521, size: 32, offset: 4544)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1154, file: !693, line: 662, baseType: !521, size: 32, offset: 4576)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1154, file: !693, line: 663, baseType: !521, size: 32, offset: 4608)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1154, file: !693, line: 664, baseType: !521, size: 32, offset: 4640)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1154, file: !693, line: 665, baseType: !566, size: 64, offset: 4672)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1154, file: !693, line: 666, baseType: !566, size: 64, offset: 4736)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1154, file: !693, line: 667, baseType: !521, size: 32, offset: 4800)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1154, file: !693, line: 668, baseType: !958, size: 32, offset: 4832)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1154, file: !693, line: 670, baseType: !566, size: 64, offset: 4864)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1154, file: !693, line: 670, baseType: !566, size: 64, offset: 4928)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1154, file: !693, line: 671, baseType: !566, size: 64, offset: 4992)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1154, file: !693, line: 672, baseType: !566, size: 64, offset: 5056)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1154, file: !693, line: 673, baseType: !566, size: 64, offset: 5120)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1154, file: !693, line: 674, baseType: !521, size: 32, offset: 5184)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1154, file: !693, line: 675, baseType: !566, size: 64, offset: 5248)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !699, file: !693, line: 195, baseType: !1175, size: 64, offset: 8576)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{!479, !1152, !690, !690}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !699, file: !693, line: 196, baseType: !1175, size: 64, offset: 8640)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !699, file: !693, line: 197, baseType: !950, size: 64, offset: 8704)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !699, file: !693, line: 198, baseType: !1072, size: 64, offset: 8768)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !699, file: !693, line: 199, baseType: !1076, size: 64, offset: 8832)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !699, file: !693, line: 201, baseType: !1183, size: 64, offset: 8896)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{!479, !690, !521, !521}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !699, file: !693, line: 202, baseType: !851, size: 64, offset: 8960)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !699, file: !693, line: 203, baseType: !723, size: 64, offset: 9024)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !699, file: !693, line: 204, baseType: !905, size: 64, offset: 9088)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !699, file: !693, line: 205, baseType: !1036, size: 64, offset: 9152)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !699, file: !693, line: 206, baseType: !1191, size: 64, offset: 9216)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DISubroutineType(types: !1193)
!1193 = !{!479, !459, !690, !521, !765, !766}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !699, file: !693, line: 208, baseType: !1195, size: 64, offset: 9280)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1196 = !DISubroutineType(types: !1197)
!1197 = !{!479, !521, !861}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !699, file: !693, line: 209, baseType: !1076, size: 64, offset: 9344)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !699, file: !693, line: 210, baseType: !868, size: 64, offset: 9408)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !692, file: !693, line: 438, baseType: !1201, size: 64, offset: 13952)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !683, line: 60, baseType: !1202)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !116, line: 240, size: 640, elements: !1204)
!1204 = !{!1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1203, file: !116, line: 241, baseType: !459, size: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1203, file: !116, line: 242, baseType: !538, size: 32, offset: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1203, file: !116, line: 243, baseType: !521, size: 32, offset: 96)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1203, file: !116, line: 243, baseType: !521, size: 32, offset: 128)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1203, file: !116, line: 244, baseType: !521, size: 32, offset: 160)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1203, file: !116, line: 244, baseType: !521, size: 32, offset: 192)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1203, file: !116, line: 245, baseType: !566, size: 64, offset: 256)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1203, file: !116, line: 246, baseType: !636, size: 32, offset: 320)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1203, file: !116, line: 247, baseType: !521, size: 32, offset: 352)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1203, file: !116, line: 251, baseType: !521, size: 32, offset: 384)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1203, file: !116, line: 252, baseType: !1007, size: 64, offset: 448)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1203, file: !116, line: 253, baseType: !636, size: 32, offset: 512)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1203, file: !116, line: 254, baseType: !521, size: 32, offset: 544)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1203, file: !116, line: 254, baseType: !521, size: 32, offset: 576)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1203, file: !116, line: 255, baseType: !521, size: 32, offset: 608)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !692, file: !693, line: 438, baseType: !1201, size: 64, offset: 14016)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !692, file: !693, line: 439, baseType: !462, size: 64, offset: 14080)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !692, file: !693, line: 440, baseType: !1223, size: 32, offset: 14144)
!1223 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !38, line: 161, baseType: !265)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !692, file: !693, line: 441, baseType: !636, size: 32, offset: 14176)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !692, file: !693, line: 442, baseType: !636, size: 32, offset: 14208)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !692, file: !693, line: 443, baseType: !1227, size: 448, offset: 14272)
!1227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1228, size: 448, elements: !1229)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !38, line: 1159, baseType: !498)
!1229 = !{!1230}
!1230 = !DISubrange(count: 7)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !692, file: !693, line: 444, baseType: !636, size: 32, offset: 14720)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !692, file: !693, line: 445, baseType: !636, size: 32, offset: 14752)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !692, file: !693, line: 446, baseType: !521, size: 32, offset: 14784)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !692, file: !693, line: 447, baseType: !559, size: 64, offset: 14848)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !692, file: !693, line: 448, baseType: !559, size: 64, offset: 14912)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !692, file: !693, line: 449, baseType: !773, size: 640, offset: 14976)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !692, file: !693, line: 450, baseType: !709, size: 32, offset: 15616)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !692, file: !693, line: 451, baseType: !1239, size: 2880, offset: 15680)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !693, line: 318, baseType: !1240)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !693, line: 319, size: 2880, elements: !1241)
!1241 = !{!1242, !1243, !1244, !1245, !1246, !1247, !1248, !1261, !1262, !1267, !1272, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1287, !1288, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1320, !1321, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1344, !1345, !1346, !1350, !1351}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1240, file: !693, line: 320, baseType: !521, size: 32)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1240, file: !693, line: 321, baseType: !521, size: 32, offset: 32)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1240, file: !693, line: 322, baseType: !521, size: 32, offset: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1240, file: !693, line: 323, baseType: !521, size: 32, offset: 96)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1240, file: !693, line: 324, baseType: !521, size: 32, offset: 128)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1240, file: !693, line: 325, baseType: !521, size: 32, offset: 160)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1240, file: !693, line: 326, baseType: !1249, size: 64, offset: 192)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !693, line: 293, baseType: !1250)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !693, line: 295, size: 448, elements: !1252)
!1252 = !{!1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1251, file: !693, line: 296, baseType: !1249, size: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1251, file: !693, line: 297, baseType: !583, size: 64, offset: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1251, file: !693, line: 297, baseType: !583, size: 64, offset: 128)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1251, file: !693, line: 298, baseType: !566, size: 64, offset: 192)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1251, file: !693, line: 298, baseType: !566, size: 64, offset: 256)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1251, file: !693, line: 299, baseType: !521, size: 32, offset: 320)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1251, file: !693, line: 300, baseType: !521, size: 32, offset: 352)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1251, file: !693, line: 301, baseType: !521, size: 32, offset: 384)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1240, file: !693, line: 326, baseType: !1249, size: 64, offset: 256)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1240, file: !693, line: 328, baseType: !1263, size: 64, offset: 320)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{!479, !690, !1266, !566}
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1240, file: !693, line: 329, baseType: !1268, size: 64, offset: 384)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{!479, !1266, !1271, !568, !568, !586, !566}
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1240, file: !693, line: 330, baseType: !1273, size: 64, offset: 448)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64)
!1274 = !DISubroutineType(types: !1275)
!1275 = !{!479, !1266}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1240, file: !693, line: 331, baseType: !1273, size: 64, offset: 512)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1240, file: !693, line: 334, baseType: !459, size: 64, offset: 576)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1240, file: !693, line: 335, baseType: !538, size: 32, offset: 640)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1240, file: !693, line: 335, baseType: !538, size: 32, offset: 672)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1240, file: !693, line: 336, baseType: !538, size: 32, offset: 704)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1240, file: !693, line: 336, baseType: !538, size: 32, offset: 736)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1240, file: !693, line: 337, baseType: !1283, size: 64, offset: 768)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64)
!1284 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !445, line: 339, baseType: !1285)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64)
!1286 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !445, line: 339, flags: DIFlagFwdDecl)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1240, file: !693, line: 338, baseType: !1283, size: 64, offset: 832)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1240, file: !693, line: 339, baseType: !1289, size: 64, offset: 896)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64)
!1290 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !445, line: 341, baseType: !1291)
!1291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !445, line: 351, size: 192, elements: !1292)
!1292 = !{!1293, !1294, !1295, !1296, !1297}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1291, file: !445, line: 354, baseType: !74, size: 32)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1291, file: !445, line: 355, baseType: !74, size: 32, offset: 32)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1291, file: !445, line: 356, baseType: !74, size: 32, offset: 64)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1291, file: !445, line: 361, baseType: !74, size: 32, offset: 96)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1291, file: !445, line: 362, baseType: !632, size: 64, offset: 128)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1240, file: !693, line: 340, baseType: !521, size: 32, offset: 960)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1240, file: !693, line: 340, baseType: !521, size: 32, offset: 992)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1240, file: !693, line: 341, baseType: !583, size: 64, offset: 1024)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1240, file: !693, line: 342, baseType: !566, size: 64, offset: 1088)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1240, file: !693, line: 343, baseType: !586, size: 64, offset: 1152)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1240, file: !693, line: 344, baseType: !568, size: 64, offset: 1216)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1240, file: !693, line: 345, baseType: !521, size: 32, offset: 1280)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1240, file: !693, line: 346, baseType: !1271, size: 64, offset: 1344)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1240, file: !693, line: 347, baseType: !636, size: 32, offset: 1408)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1240, file: !693, line: 348, baseType: !521, size: 32, offset: 1440)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1240, file: !693, line: 351, baseType: !636, size: 32, offset: 1472)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1240, file: !693, line: 352, baseType: !636, size: 32, offset: 1504)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1240, file: !693, line: 353, baseType: !538, size: 32, offset: 1536)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1240, file: !693, line: 354, baseType: !538, size: 32, offset: 1568)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1240, file: !693, line: 355, baseType: !1271, size: 64, offset: 1600)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1240, file: !693, line: 356, baseType: !1271, size: 64, offset: 1664)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1240, file: !693, line: 357, baseType: !1315, size: 64, offset: 1728)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64)
!1316 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !693, line: 310, baseType: !1317)
!1317 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !693, line: 308, size: 32, elements: !1318)
!1318 = !{!1319}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1317, file: !693, line: 309, baseType: !521, size: 32)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1240, file: !693, line: 357, baseType: !1315, size: 64, offset: 1792)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1240, file: !693, line: 358, baseType: !1322, size: 64, offset: 1856)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64)
!1323 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !693, line: 316, baseType: !1324)
!1324 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !693, line: 312, size: 128, elements: !1325)
!1325 = !{!1326, !1327, !1328}
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1324, file: !693, line: 313, baseType: !462, size: 64)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1324, file: !693, line: 314, baseType: !521, size: 32, offset: 64)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1324, file: !693, line: 315, baseType: !500, size: 8, offset: 96)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1240, file: !693, line: 359, baseType: !1322, size: 64, offset: 1920)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1240, file: !693, line: 360, baseType: !1322, size: 64, offset: 1984)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1240, file: !693, line: 361, baseType: !521, size: 32, offset: 2048)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1240, file: !693, line: 362, baseType: !538, size: 32, offset: 2080)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1240, file: !693, line: 363, baseType: !521, size: 32, offset: 2112)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1240, file: !693, line: 364, baseType: !1271, size: 64, offset: 2176)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1240, file: !693, line: 365, baseType: !1289, size: 64, offset: 2240)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1240, file: !693, line: 366, baseType: !538, size: 32, offset: 2304)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1240, file: !693, line: 367, baseType: !538, size: 32, offset: 2336)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1240, file: !693, line: 368, baseType: !1283, size: 64, offset: 2368)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1240, file: !693, line: 369, baseType: !1283, size: 64, offset: 2432)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1240, file: !693, line: 370, baseType: !1341, size: 64, offset: 2496)
!1341 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !6, line: 678, baseType: !1342)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64)
!1343 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !6, line: 678, flags: DIFlagFwdDecl)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1240, file: !693, line: 371, baseType: !1341, size: 64, offset: 2560)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1240, file: !693, line: 372, baseType: !1341, size: 64, offset: 2624)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1240, file: !693, line: 373, baseType: !1347, size: 64, offset: 2688)
!1347 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !445, line: 331, baseType: !1348)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64)
!1349 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !445, line: 331, flags: DIFlagFwdDecl)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1240, file: !693, line: 374, baseType: !632, size: 64, offset: 2752)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1240, file: !693, line: 375, baseType: !1352, size: 64, offset: 2816)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !692, file: !693, line: 451, baseType: !1239, size: 2880, offset: 18560)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !692, file: !693, line: 452, baseType: !1355, size: 64, offset: 21440)
!1355 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !38, line: 1723, baseType: !1356)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64)
!1357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !693, line: 681, size: 4864, elements: !1358)
!1358 = !{!1359, !1360, !1361, !1362, !1363, !1364, !1365, !1369}
