; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/complementarity/impls/ssls/ssfls.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/complementarity/impls/ssls/ssfls.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque

!8 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 81, baseType: !5, size: 32, elements: !11)
!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!12 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 181, baseType: !26, size: 32, elements: !27)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctao.h", directory: "/home/users/ndemeye/xSDK")
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40}
!28 = !DIEnumerator(name: "TAO_CONVERGED_GATOL", value: 3)
!29 = !DIEnumerator(name: "TAO_CONVERGED_GRTOL", value: 4)
!30 = !DIEnumerator(name: "TAO_CONVERGED_GTTOL", value: 5)
!31 = !DIEnumerator(name: "TAO_CONVERGED_STEPTOL", value: 6)
!32 = !DIEnumerator(name: "TAO_CONVERGED_MINF", value: 7)
!33 = !DIEnumerator(name: "TAO_CONVERGED_USER", value: 8)
!34 = !DIEnumerator(name: "TAO_DIVERGED_MAXITS", value: -2)
!35 = !DIEnumerator(name: "TAO_DIVERGED_NAN", value: -4)
!36 = !DIEnumerator(name: "TAO_DIVERGED_MAXFCN", value: -5)
!37 = !DIEnumerator(name: "TAO_DIVERGED_LS_FAILURE", value: -6)
!38 = !DIEnumerator(name: "TAO_DIVERGED_TR_REDUCTION", value: -7)
!39 = !DIEnumerator(name: "TAO_DIVERGED_USER", value: -8)
!40 = !DIEnumerator(name: "TAO_CONTINUE_ITERATING", value: 0)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 26, baseType: !5, size: 32, elements: !42)
!42 = !{!43, !44, !45}
!43 = !DIEnumerator(name: "TAO_SUBSET_SUBVEC", value: 0, isUnsigned: true)
!44 = !DIEnumerator(name: "TAO_SUBSET_MASK", value: 1, isUnsigned: true)
!45 = !DIEnumerator(name: "TAO_SUBSET_MATRIXFREE", value: 2, isUnsigned: true)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 663, baseType: !5, size: 32, elements: !48)
!47 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!48 = !{!49, !50, !51}
!49 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!50 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!51 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !53, line: 6, baseType: !26, size: 32, elements: !54)
!53 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctaolinesearch.h", directory: "/home/users/ndemeye/xSDK")
!54 = !{!55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66}
!55 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_INFORNAN", value: -1)
!56 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_BADPARAMETER", value: -2)
!57 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_ASCENT", value: -3)
!58 = !DIEnumerator(name: "TAOLINESEARCH_CONTINUE_ITERATING", value: 0)
!59 = !DIEnumerator(name: "TAOLINESEARCH_SUCCESS", value: 1)
!60 = !DIEnumerator(name: "TAOLINESEARCH_SUCCESS_USER", value: 2)
!61 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_OTHER", value: 3)
!62 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_MAXFCN", value: 4)
!63 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_UPPERBOUND", value: 5)
!64 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_LOWERBOUND", value: 6)
!65 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_RTOL", value: 7)
!66 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_USER", value: 8)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !68, line: 155, baseType: !5, size: 32, elements: !69)
!68 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!69 = !{!70, !71, !72, !73, !74}
!70 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!71 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!72 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!73 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!74 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!75 = !{!76, !125, !129, !130, !133, !136, !98}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "TAO_SSLS", file: !78, line: 94, baseType: !79)
!78 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/tao/complementarity/impls/ssls/ssls.h", directory: "/home/users/ndemeye/xSDK")
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 55, size: 1984, elements: !80)
!80 = !{!81, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !117, !118, !119, !124}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ff", scope: !79, file: !78, line: 56, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !68, line: 21, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !68, line: 21, flags: DIFlagFwdDecl)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "dpsi", scope: !79, file: !78, line: 57, baseType: !82, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "da", scope: !79, file: !78, line: 59, baseType: !82, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !79, file: !78, line: 60, baseType: !82, size: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !79, file: !78, line: 61, baseType: !82, size: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "dxfree", scope: !79, file: !78, line: 62, baseType: !82, size: 64, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "t1", scope: !79, file: !78, line: 64, baseType: !82, size: 64, offset: 384)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "t2", scope: !79, file: !78, line: 65, baseType: !82, size: 64, offset: 448)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "r1", scope: !79, file: !78, line: 67, baseType: !82, size: 64, offset: 512)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "r2", scope: !79, file: !78, line: 67, baseType: !82, size: 64, offset: 576)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "r3", scope: !79, file: !78, line: 67, baseType: !82, size: 64, offset: 640)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !79, file: !78, line: 67, baseType: !82, size: 64, offset: 704)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "merit", scope: !79, file: !78, line: 69, baseType: !97, size: 64, offset: 768)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !98)
!98 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "merit_eqn", scope: !79, file: !78, line: 70, baseType: !97, size: 64, offset: 832)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "merit_mu", scope: !79, file: !78, line: 71, baseType: !97, size: 64, offset: 896)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !79, file: !78, line: 73, baseType: !97, size: 64, offset: 960)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "rho", scope: !79, file: !78, line: 74, baseType: !97, size: 64, offset: 1024)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !79, file: !78, line: 76, baseType: !97, size: 64, offset: 1088)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "atol", scope: !79, file: !78, line: 77, baseType: !97, size: 64, offset: 1152)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !79, file: !78, line: 79, baseType: !97, size: 64, offset: 1216)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "mu_init", scope: !79, file: !78, line: 82, baseType: !97, size: 64, offset: 1280)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !79, file: !78, line: 83, baseType: !97, size: 64, offset: 1344)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "dmu", scope: !79, file: !78, line: 84, baseType: !97, size: 64, offset: 1408)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "mucon", scope: !79, file: !78, line: 85, baseType: !97, size: 64, offset: 1472)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "d_mucon", scope: !79, file: !78, line: 86, baseType: !97, size: 64, offset: 1536)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "g_mucon", scope: !79, file: !78, line: 87, baseType: !97, size: 64, offset: 1600)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "J_sub", scope: !79, file: !78, line: 89, baseType: !113, size: 64, offset: 1664)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !114, line: 16, baseType: !115)
!114 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !114, line: 16, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "Jpre_sub", scope: !79, file: !78, line: 89, baseType: !113, size: 64, offset: 1728)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !79, file: !78, line: 90, baseType: !82, size: 64, offset: 1792)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "fixed", scope: !79, file: !78, line: 92, baseType: !120, size: 64, offset: 1856)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !121, line: 11, baseType: !122)
!121 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !121, line: 11, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !79, file: !78, line: 93, baseType: !120, size: 64, offset: 1920)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !126, line: 330, baseType: !127)
!126 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !126, line: 330, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!132 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !134, line: 46, baseType: !135)
!134 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!135 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !139, line: 73, size: 4480, elements: !140)
!139 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!140 = !{!141, !143, !189, !190, !192, !194, !195, !196, !197, !205, !206, !208, !212, !216, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !229, !230, !231, !233, !234, !236, !238, !239, !240, !241, !242, !244, !246, !247, !248, !249, !250, !253, !255, !256, !257, !267, !269, !270, !274, !275, !321, !326, !328, !329, !330}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !138, file: !139, line: 74, baseType: !142, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !138, file: !139, line: 75, baseType: !144, size: 448, offset: 64)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 448, elements: !187)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !139, line: 53, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !139, line: 45, size: 448, elements: !147)
!147 = !{!148, !154, !162, !167, !171, !175, !182}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !146, file: !139, line: 46, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!152, !136, !153}
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !146, file: !139, line: 47, baseType: !155, size: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!152, !136, !158}
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !159, line: 16, baseType: !160)
!159 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !159, line: 16, flags: DIFlagFwdDecl)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !146, file: !139, line: 48, baseType: !163, size: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!152, !166}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !146, file: !139, line: 49, baseType: !168, size: 64, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!152, !136, !130, !136}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !146, file: !139, line: 50, baseType: !172, size: 64, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!152, !136, !130, !166}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !146, file: !139, line: 51, baseType: !176, size: 64, offset: 320)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!152, !136, !130, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{null}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !146, file: !139, line: 52, baseType: !183, size: 64, offset: 384)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!152, !136, !130, !186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!187 = !{!188}
!188 = !DISubrange(count: 1)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !138, file: !139, line: 76, baseType: !125, size: 64, offset: 512)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !138, file: !139, line: 77, baseType: !191, size: 32, offset: 576)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !138, file: !139, line: 78, baseType: !193, size: 64, offset: 640)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !98)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !138, file: !139, line: 78, baseType: !193, size: 64, offset: 704)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !138, file: !139, line: 78, baseType: !193, size: 64, offset: 768)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !138, file: !139, line: 78, baseType: !193, size: 64, offset: 832)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !138, file: !139, line: 79, baseType: !198, size: 64, offset: 896)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !200)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !201, line: 27, baseType: !202)
!201 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !203, line: 43, baseType: !204)
!203 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!204 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !138, file: !139, line: 80, baseType: !191, size: 32, offset: 960)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !138, file: !139, line: 81, baseType: !207, size: 32, offset: 992)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !138, file: !139, line: 82, baseType: !209, size: 64, offset: 1024)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !138, file: !139, line: 83, baseType: !213, size: 64, offset: 1088)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !138, file: !139, line: 84, baseType: !217, size: 64, offset: 1152)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !138, file: !139, line: 85, baseType: !217, size: 64, offset: 1216)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !138, file: !139, line: 86, baseType: !217, size: 64, offset: 1280)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !138, file: !139, line: 87, baseType: !217, size: 64, offset: 1344)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !138, file: !139, line: 88, baseType: !136, size: 64, offset: 1408)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !138, file: !139, line: 89, baseType: !198, size: 64, offset: 1472)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !138, file: !139, line: 90, baseType: !217, size: 64, offset: 1536)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !138, file: !139, line: 91, baseType: !217, size: 64, offset: 1600)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !138, file: !139, line: 92, baseType: !191, size: 32, offset: 1664)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !138, file: !139, line: 93, baseType: !129, size: 64, offset: 1728)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !138, file: !139, line: 94, baseType: !228, size: 64, offset: 1792)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !199)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !138, file: !139, line: 95, baseType: !191, size: 32, offset: 1856)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !138, file: !139, line: 95, baseType: !191, size: 32, offset: 1888)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !138, file: !139, line: 96, baseType: !232, size: 64, offset: 1920)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !138, file: !139, line: 96, baseType: !232, size: 64, offset: 1984)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !138, file: !139, line: 97, baseType: !235, size: 64, offset: 2048)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !138, file: !139, line: 97, baseType: !237, size: 64, offset: 2112)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !138, file: !139, line: 98, baseType: !191, size: 32, offset: 2176)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !138, file: !139, line: 98, baseType: !191, size: 32, offset: 2208)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !138, file: !139, line: 99, baseType: !232, size: 64, offset: 2240)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !138, file: !139, line: 99, baseType: !232, size: 64, offset: 2304)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !138, file: !139, line: 100, baseType: !243, size: 64, offset: 2368)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !138, file: !139, line: 100, baseType: !245, size: 64, offset: 2432)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !138, file: !139, line: 101, baseType: !191, size: 32, offset: 2496)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !138, file: !139, line: 101, baseType: !191, size: 32, offset: 2528)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !138, file: !139, line: 102, baseType: !232, size: 64, offset: 2560)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !138, file: !139, line: 102, baseType: !232, size: 64, offset: 2624)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !138, file: !139, line: 103, baseType: !251, size: 64, offset: 2688)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !97)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !138, file: !139, line: 103, baseType: !254, size: 64, offset: 2752)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !138, file: !139, line: 104, baseType: !186, size: 64, offset: 2816)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !138, file: !139, line: 105, baseType: !191, size: 32, offset: 2880)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !138, file: !139, line: 106, baseType: !258, size: 128, offset: 2944)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 128, elements: !265)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !139, line: 64, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !139, line: 61, size: 128, elements: !262)
!262 = !{!263, !264}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !261, file: !139, line: 62, baseType: !179, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !261, file: !139, line: 63, baseType: !129, size: 64, offset: 64)
!265 = !{!266}
!266 = !DISubrange(count: 2)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !138, file: !139, line: 107, baseType: !268, size: 64, offset: 3072)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 64, elements: !265)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !138, file: !139, line: 108, baseType: !129, size: 64, offset: 3136)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !138, file: !139, line: 109, baseType: !271, size: 64, offset: 3200)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!152, !129}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !138, file: !139, line: 111, baseType: !191, size: 32, offset: 3264)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !138, file: !139, line: 112, baseType: !276, size: 320, offset: 3328)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 320, elements: !319)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!152, !280, !136, !129}
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !283)
!283 = !{!284, !285, !307, !308, !309, !310, !311, !312, !313, !314, !315}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !282, file: !10, line: 100, baseType: !191, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !282, file: !10, line: 101, baseType: !286, size: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !289)
!289 = !{!290, !291, !292, !293, !294, !297, !298, !299, !300, !302, !304, !305, !306}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !288, file: !10, line: 84, baseType: !217, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !288, file: !10, line: 85, baseType: !217, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !288, file: !10, line: 86, baseType: !129, size: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !288, file: !10, line: 87, baseType: !209, size: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !288, file: !10, line: 88, baseType: !295, size: 64, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !288, file: !10, line: 89, baseType: !132, size: 8, offset: 320)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !288, file: !10, line: 90, baseType: !217, size: 64, offset: 384)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !288, file: !10, line: 91, baseType: !133, size: 64, offset: 448)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !288, file: !10, line: 92, baseType: !301, size: 32, offset: 512)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !288, file: !10, line: 93, baseType: !303, size: 32, offset: 544)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !288, file: !10, line: 94, baseType: !286, size: 64, offset: 576)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !288, file: !10, line: 95, baseType: !217, size: 64, offset: 640)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !288, file: !10, line: 96, baseType: !129, size: 64, offset: 704)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !282, file: !10, line: 102, baseType: !217, size: 64, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !282, file: !10, line: 102, baseType: !217, size: 64, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !282, file: !10, line: 103, baseType: !217, size: 64, offset: 256)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !282, file: !10, line: 104, baseType: !125, size: 64, offset: 320)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !282, file: !10, line: 105, baseType: !301, size: 32, offset: 384)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !282, file: !10, line: 105, baseType: !301, size: 32, offset: 416)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !282, file: !10, line: 105, baseType: !301, size: 32, offset: 448)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !282, file: !10, line: 106, baseType: !136, size: 64, offset: 512)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !282, file: !10, line: 107, baseType: !316, size: 64, offset: 576)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!319 = !{!320}
!320 = !DISubrange(count: 5)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !138, file: !139, line: 113, baseType: !322, size: 320, offset: 3648)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 320, elements: !319)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!152, !136, !129}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !138, file: !139, line: 114, baseType: !327, size: 320, offset: 3968)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 320, elements: !319)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !138, file: !139, line: 115, baseType: !301, size: 32, offset: 4288)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !138, file: !139, line: 120, baseType: !316, size: 64, offset: 4352)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !138, file: !139, line: 121, baseType: !301, size: 32, offset: 4416)
!331 = !{i32 7, !"Dwarf Version", i32 4}
!332 = !{i32 2, !"Debug Info Version", i32 3}
!333 = !{i32 1, !"wchar_size", i32 4}
!334 = !{i32 7, !"PIC Level", i32 2}
!335 = !{i32 7, !"uwtable", i32 1}
!336 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!337 = distinct !DISubprogram(name: "TaoSetUp_SSFLS", scope: !338, file: !338, line: 3, type: !339, scopeLine: 4, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !559)
!338 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/tao/complementarity/impls/ssls/ssfls.c", directory: "/home/users/ndemeye/xSDK")
!339 = !DISubroutineType(types: !340)
!340 = !{!152, !341}
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tao", file: !25, line: 118, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Tao", file: !344, line: 45, size: 14656, elements: !345)
!344 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/taoimpl.h", directory: "/home/users/ndemeye/xSDK")
!345 = !{!346, !348, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !431, !437, !439, !440, !441, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !511, !512, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !551, !552, !553, !554, !555, !556, !557, !558}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !343, file: !344, line: 46, baseType: !347, size: 4480)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !139, line: 122, baseType: !138)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !343, file: !344, line: 46, baseType: !349, size: 1536, offset: 4480)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 1536, elements: !187)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TaoOps", file: !344, line: 13, size: 1536, elements: !351)
!351 = !{!352, !356, !360, !364, !368, !369, !370, !371, !372, !373, !374, !378, !382, !383, !384, !385, !389, !393, !394, !398, !400, !401, !405, !409}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !350, file: !344, line: 15, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!152, !341, !82, !243, !129}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgradient", scope: !350, file: !344, line: 16, baseType: !357, size: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!152, !341, !82, !243, !82, !129}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "computegradient", scope: !350, file: !344, line: 17, baseType: !361, size: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!152, !341, !82, !82, !129}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "computehessian", scope: !350, file: !344, line: 18, baseType: !365, size: 64, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!152, !341, !82, !113, !113, !129}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidual", scope: !350, file: !344, line: 19, baseType: !361, size: 64, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidualjacobian", scope: !350, file: !344, line: 20, baseType: !365, size: 64, offset: 320)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "computeconstraints", scope: !350, file: !344, line: 21, baseType: !361, size: 64, offset: 384)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "computeinequalityconstraints", scope: !350, file: !344, line: 22, baseType: !361, size: 64, offset: 448)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "computeequalityconstraints", scope: !350, file: !344, line: 23, baseType: !361, size: 64, offset: 512)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobian", scope: !350, file: !344, line: 24, baseType: !365, size: 64, offset: 576)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianstate", scope: !350, file: !344, line: 25, baseType: !375, size: 64, offset: 640)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!152, !341, !82, !113, !113, !113, !129}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobiandesign", scope: !350, file: !344, line: 26, baseType: !379, size: 64, offset: 704)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!152, !341, !82, !113, !129}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianinequality", scope: !350, file: !344, line: 27, baseType: !365, size: 64, offset: 768)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianequality", scope: !350, file: !344, line: 28, baseType: !365, size: 64, offset: 832)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "computebounds", scope: !350, file: !344, line: 29, baseType: !361, size: 64, offset: 896)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !350, file: !344, line: 30, baseType: !386, size: 64, offset: 960)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!152, !341, !191, !129}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "convergencetest", scope: !350, file: !344, line: 31, baseType: !390, size: 64, offset: 1024)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!152, !341, !129}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "convergencedestroy", scope: !350, file: !344, line: 32, baseType: !271, size: 64, offset: 1088)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "computedual", scope: !350, file: !344, line: 35, baseType: !395, size: 64, offset: 1152)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!152, !341, !82, !82}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !350, file: !344, line: 36, baseType: !399, size: 64, offset: 1216)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !350, file: !344, line: 37, baseType: !399, size: 64, offset: 1280)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !350, file: !344, line: 38, baseType: !402, size: 64, offset: 1344)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!152, !341, !158}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !350, file: !344, line: 39, baseType: !406, size: 64, offset: 1408)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!152, !280, !341}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !350, file: !344, line: 40, baseType: !399, size: 64, offset: 1472)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !343, file: !344, line: 47, baseType: !129, size: 64, offset: 6016)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "user_objP", scope: !343, file: !344, line: 48, baseType: !129, size: 64, offset: 6080)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "user_objgradP", scope: !343, file: !344, line: 49, baseType: !129, size: 64, offset: 6144)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "user_gradP", scope: !343, file: !344, line: 50, baseType: !129, size: 64, offset: 6208)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "user_hessP", scope: !343, file: !344, line: 51, baseType: !129, size: 64, offset: 6272)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsresP", scope: !343, file: !344, line: 52, baseType: !129, size: 64, offset: 6336)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsjacP", scope: !343, file: !344, line: 53, baseType: !129, size: 64, offset: 6400)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "user_conP", scope: !343, file: !344, line: 54, baseType: !129, size: 64, offset: 6464)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_equalityP", scope: !343, file: !344, line: 55, baseType: !129, size: 64, offset: 6528)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_inequalityP", scope: !343, file: !344, line: 56, baseType: !129, size: 64, offset: 6592)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "user_jacP", scope: !343, file: !344, line: 57, baseType: !129, size: 64, offset: 6656)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_equalityP", scope: !343, file: !344, line: 58, baseType: !129, size: 64, offset: 6720)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_inequalityP", scope: !343, file: !344, line: 59, baseType: !129, size: 64, offset: 6784)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_stateP", scope: !343, file: !344, line: 60, baseType: !129, size: 64, offset: 6848)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_designP", scope: !343, file: !344, line: 61, baseType: !129, size: 64, offset: 6912)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "user_boundsP", scope: !343, file: !344, line: 62, baseType: !129, size: 64, offset: 6976)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "user_update", scope: !343, file: !344, line: 63, baseType: !129, size: 64, offset: 7040)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !343, file: !344, line: 65, baseType: !428, size: 640, offset: 7104)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 640, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 10)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !343, file: !344, line: 66, baseType: !432, size: 640, offset: 7744)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 640, elements: !429)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!152, !436}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !343, file: !344, line: 67, baseType: !438, size: 640, offset: 8384)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 640, elements: !429)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !343, file: !344, line: 68, baseType: !191, size: 32, offset: 9024)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !343, file: !344, line: 69, baseType: !129, size: 64, offset: 9088)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !343, file: !344, line: 70, baseType: !442, size: 32, offset: 9152)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoConvergedReason", file: !25, line: 196, baseType: !24)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !343, file: !344, line: 72, baseType: !301, size: 32, offset: 9184)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !343, file: !344, line: 73, baseType: !129, size: 64, offset: 9216)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "solution", scope: !343, file: !344, line: 75, baseType: !82, size: 64, offset: 9280)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !343, file: !344, line: 76, baseType: !82, size: 64, offset: 9344)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "stepdirection", scope: !343, file: !344, line: 77, baseType: !82, size: 64, offset: 9408)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "XL", scope: !343, file: !344, line: 78, baseType: !82, size: 64, offset: 9472)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "XU", scope: !343, file: !344, line: 79, baseType: !82, size: 64, offset: 9536)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "IL", scope: !343, file: !344, line: 80, baseType: !82, size: 64, offset: 9600)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "IU", scope: !343, file: !344, line: 81, baseType: !82, size: 64, offset: 9664)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "DI", scope: !343, file: !344, line: 82, baseType: !82, size: 64, offset: 9728)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "DE", scope: !343, file: !344, line: 83, baseType: !82, size: 64, offset: 9792)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "hessian", scope: !343, file: !344, line: 84, baseType: !113, size: 64, offset: 9856)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "hessian_pre", scope: !343, file: !344, line: 85, baseType: !113, size: 64, offset: 9920)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm", scope: !343, file: !344, line: 86, baseType: !113, size: 64, offset: 9984)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm_tmp", scope: !343, file: !344, line: 87, baseType: !82, size: 64, offset: 10048)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ls_res", scope: !343, file: !344, line: 88, baseType: !82, size: 64, offset: 10112)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac", scope: !343, file: !344, line: 89, baseType: !113, size: 64, offset: 10176)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac_pre", scope: !343, file: !344, line: 90, baseType: !113, size: 64, offset: 10240)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_v", scope: !343, file: !344, line: 91, baseType: !82, size: 64, offset: 10304)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_n", scope: !343, file: !344, line: 92, baseType: !191, size: 32, offset: 10368)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_rows", scope: !343, file: !344, line: 93, baseType: !235, size: 64, offset: 10432)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_cols", scope: !343, file: !344, line: 94, baseType: !235, size: 64, offset: 10496)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_w", scope: !343, file: !344, line: 95, baseType: !243, size: 64, offset: 10560)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !343, file: !344, line: 96, baseType: !82, size: 64, offset: 10624)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_equality", scope: !343, file: !344, line: 97, baseType: !82, size: 64, offset: 10688)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_inequality", scope: !343, file: !344, line: 98, baseType: !82, size: 64, offset: 10752)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !343, file: !344, line: 99, baseType: !113, size: 64, offset: 10816)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !343, file: !344, line: 100, baseType: !113, size: 64, offset: 10880)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality", scope: !343, file: !344, line: 101, baseType: !113, size: 64, offset: 10944)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality_pre", scope: !343, file: !344, line: 102, baseType: !113, size: 64, offset: 11008)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality", scope: !343, file: !344, line: 103, baseType: !113, size: 64, offset: 11072)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality_pre", scope: !343, file: !344, line: 104, baseType: !113, size: 64, offset: 11136)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state", scope: !343, file: !344, line: 105, baseType: !113, size: 64, offset: 11200)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_inv", scope: !343, file: !344, line: 106, baseType: !113, size: 64, offset: 11264)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design", scope: !343, file: !344, line: 107, baseType: !113, size: 64, offset: 11328)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_pre", scope: !343, file: !344, line: 108, baseType: !113, size: 64, offset: 11392)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design_pre", scope: !343, file: !344, line: 109, baseType: !113, size: 64, offset: 11456)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "state_is", scope: !343, file: !344, line: 110, baseType: !120, size: 64, offset: 11520)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "design_is", scope: !343, file: !344, line: 111, baseType: !120, size: 64, offset: 11584)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !343, file: !344, line: 112, baseType: !97, size: 64, offset: 11648)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !343, file: !344, line: 113, baseType: !97, size: 64, offset: 11712)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "gnorm0", scope: !343, file: !344, line: 114, baseType: !97, size: 64, offset: 11776)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm", scope: !343, file: !344, line: 115, baseType: !97, size: 64, offset: 11840)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm0", scope: !343, file: !344, line: 116, baseType: !97, size: 64, offset: 11904)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !343, file: !344, line: 117, baseType: !97, size: 64, offset: 11968)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !343, file: !344, line: 119, baseType: !191, size: 32, offset: 12032)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !343, file: !344, line: 120, baseType: !191, size: 32, offset: 12064)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "max_constraints", scope: !343, file: !344, line: 121, baseType: !191, size: 32, offset: 12096)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !343, file: !344, line: 122, baseType: !191, size: 32, offset: 12128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ngrads", scope: !343, file: !344, line: 123, baseType: !191, size: 32, offset: 12160)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncgrads", scope: !343, file: !344, line: 124, baseType: !191, size: 32, offset: 12192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "nhess", scope: !343, file: !344, line: 125, baseType: !191, size: 32, offset: 12224)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !343, file: !344, line: 126, baseType: !191, size: 32, offset: 12256)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ntotalits", scope: !343, file: !344, line: 127, baseType: !191, size: 32, offset: 12288)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "nconstraints", scope: !343, file: !344, line: 128, baseType: !191, size: 32, offset: 12320)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "niconstraints", scope: !343, file: !344, line: 129, baseType: !191, size: 32, offset: 12352)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "neconstraints", scope: !343, file: !344, line: 130, baseType: !191, size: 32, offset: 12384)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "njac", scope: !343, file: !344, line: 131, baseType: !191, size: 32, offset: 12416)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "njac_equality", scope: !343, file: !344, line: 132, baseType: !191, size: 32, offset: 12448)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "njac_inequality", scope: !343, file: !344, line: 133, baseType: !191, size: 32, offset: 12480)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "njac_state", scope: !343, file: !344, line: 134, baseType: !191, size: 32, offset: 12512)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "njac_design", scope: !343, file: !344, line: 135, baseType: !191, size: 32, offset: 12544)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_its", scope: !343, file: !344, line: 137, baseType: !191, size: 32, offset: 12576)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_tot_its", scope: !343, file: !344, line: 138, baseType: !191, size: 32, offset: 12608)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !343, file: !344, line: 140, baseType: !508, size: 64, offset: 12672)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearch", file: !53, line: 5, baseType: !509)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TaoLineSearch", file: !53, line: 5, flags: DIFlagFwdDecl)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "lsflag", scope: !343, file: !344, line: 141, baseType: !301, size: 32, offset: 12736)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !343, file: !344, line: 142, baseType: !513, size: 64, offset: 12800)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !514, line: 22, baseType: !515)
!514 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !514, line: 22, flags: DIFlagFwdDecl)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "trust0", scope: !343, file: !344, line: 143, baseType: !97, size: 64, offset: 12864)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !343, file: !344, line: 144, baseType: !97, size: 64, offset: 12928)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "gatol", scope: !343, file: !344, line: 146, baseType: !97, size: 64, offset: 12992)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "grtol", scope: !343, file: !344, line: 147, baseType: !97, size: 64, offset: 13056)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "gttol", scope: !343, file: !344, line: 148, baseType: !97, size: 64, offset: 13120)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "catol", scope: !343, file: !344, line: 149, baseType: !97, size: 64, offset: 13184)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "crtol", scope: !343, file: !344, line: 150, baseType: !97, size: 64, offset: 13248)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "steptol", scope: !343, file: !344, line: 151, baseType: !97, size: 64, offset: 13312)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "fmin", scope: !343, file: !344, line: 152, baseType: !97, size: 64, offset: 13376)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs_changed", scope: !343, file: !344, line: 153, baseType: !301, size: 32, offset: 13440)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "max_it_changed", scope: !343, file: !344, line: 154, baseType: !301, size: 32, offset: 13472)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "gatol_changed", scope: !343, file: !344, line: 155, baseType: !301, size: 32, offset: 13504)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "grtol_changed", scope: !343, file: !344, line: 156, baseType: !301, size: 32, offset: 13536)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "gttol_changed", scope: !343, file: !344, line: 157, baseType: !301, size: 32, offset: 13568)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "fmin_changed", scope: !343, file: !344, line: 158, baseType: !301, size: 32, offset: 13600)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "catol_changed", scope: !343, file: !344, line: 159, baseType: !301, size: 32, offset: 13632)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "crtol_changed", scope: !343, file: !344, line: 160, baseType: !301, size: 32, offset: 13664)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "steptol_changed", scope: !343, file: !344, line: 161, baseType: !301, size: 32, offset: 13696)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "trust0_changed", scope: !343, file: !344, line: 162, baseType: !301, size: 32, offset: 13728)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "printreason", scope: !343, file: !344, line: 163, baseType: !301, size: 32, offset: 13760)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "viewsolution", scope: !343, file: !344, line: 164, baseType: !301, size: 32, offset: 13792)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "viewgradient", scope: !343, file: !344, line: 165, baseType: !301, size: 32, offset: 13824)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "viewconstraints", scope: !343, file: !344, line: 166, baseType: !301, size: 32, offset: 13856)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "viewhessian", scope: !343, file: !344, line: 167, baseType: !301, size: 32, offset: 13888)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "viewjacobian", scope: !343, file: !344, line: 168, baseType: !301, size: 32, offset: 13920)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "bounded", scope: !343, file: !344, line: 169, baseType: !301, size: 32, offset: 13952)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "constrained", scope: !343, file: !344, line: 170, baseType: !301, size: 32, offset: 13984)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "eq_constrained", scope: !343, file: !344, line: 171, baseType: !301, size: 32, offset: 14016)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_constrained", scope: !343, file: !344, line: 172, baseType: !301, size: 32, offset: 14048)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_doublesided", scope: !343, file: !344, line: 173, baseType: !301, size: 32, offset: 14080)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "header_printed", scope: !343, file: !344, line: 174, baseType: !301, size: 32, offset: 14112)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "recycle", scope: !343, file: !344, line: 175, baseType: !301, size: 32, offset: 14144)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "subset_type", scope: !343, file: !344, line: 177, baseType: !550, size: 32, offset: 14176)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoSubsetType", file: !25, line: 26, baseType: !41)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "hist_max", scope: !343, file: !344, line: 178, baseType: !191, size: 32, offset: 14208)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "hist_obj", scope: !343, file: !344, line: 179, baseType: !243, size: 64, offset: 14272)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "hist_resid", scope: !343, file: !344, line: 180, baseType: !243, size: 64, offset: 14336)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "hist_cnorm", scope: !343, file: !344, line: 181, baseType: !243, size: 64, offset: 14400)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "hist_lits", scope: !343, file: !344, line: 182, baseType: !235, size: 64, offset: 14464)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "hist_len", scope: !343, file: !344, line: 183, baseType: !191, size: 32, offset: 14528)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "hist_reset", scope: !343, file: !344, line: 184, baseType: !301, size: 32, offset: 14560)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "hist_malloc", scope: !343, file: !344, line: 185, baseType: !301, size: 32, offset: 14592)
!559 = !{!560, !561, !562, !563, !565, !567, !569, !571, !573, !575, !577, !579, !581, !585, !589}
!560 = !DILocalVariable(name: "tao", arg: 1, scope: !337, file: !338, line: 3, type: !341)
!561 = !DILocalVariable(name: "ssls", scope: !337, file: !338, line: 5, type: !76)
!562 = !DILocalVariable(name: "ierr", scope: !337, file: !338, line: 6, type: !152)
!563 = !DILocalVariable(name: "ierr__", scope: !564, file: !338, line: 9, type: !152)
!564 = distinct !DILexicalBlock(scope: !337, file: !338, line: 9, column: 53)
!565 = !DILocalVariable(name: "ierr__", scope: !566, file: !338, line: 10, type: !152)
!566 = distinct !DILexicalBlock(scope: !337, file: !338, line: 10, column: 58)
!567 = !DILocalVariable(name: "ierr__", scope: !568, file: !338, line: 11, type: !152)
!568 = distinct !DILexicalBlock(scope: !337, file: !338, line: 11, column: 47)
!569 = !DILocalVariable(name: "ierr__", scope: !570, file: !338, line: 12, type: !152)
!570 = distinct !DILexicalBlock(scope: !337, file: !338, line: 12, column: 48)
!571 = !DILocalVariable(name: "ierr__", scope: !572, file: !338, line: 13, type: !152)
!572 = distinct !DILexicalBlock(scope: !337, file: !338, line: 13, column: 50)
!573 = !DILocalVariable(name: "ierr__", scope: !574, file: !338, line: 14, type: !152)
!574 = distinct !DILexicalBlock(scope: !337, file: !338, line: 14, column: 48)
!575 = !DILocalVariable(name: "ierr__", scope: !576, file: !338, line: 15, type: !152)
!576 = distinct !DILexicalBlock(scope: !337, file: !338, line: 15, column: 48)
!577 = !DILocalVariable(name: "ierr__", scope: !578, file: !338, line: 16, type: !152)
!578 = distinct !DILexicalBlock(scope: !337, file: !338, line: 16, column: 48)
!579 = !DILocalVariable(name: "ierr__", scope: !580, file: !338, line: 17, type: !152)
!580 = distinct !DILexicalBlock(scope: !337, file: !338, line: 17, column: 48)
!581 = !DILocalVariable(name: "ierr__", scope: !582, file: !338, line: 19, type: !152)
!582 = distinct !DILexicalBlock(scope: !583, file: !338, line: 19, column: 49)
!583 = distinct !DILexicalBlock(scope: !584, file: !338, line: 18, column: 17)
!584 = distinct !DILexicalBlock(scope: !337, file: !338, line: 18, column: 7)
!585 = !DILocalVariable(name: "ierr__", scope: !586, file: !338, line: 22, type: !152)
!586 = distinct !DILexicalBlock(scope: !587, file: !338, line: 22, column: 49)
!587 = distinct !DILexicalBlock(scope: !588, file: !338, line: 21, column: 17)
!588 = distinct !DILexicalBlock(scope: !337, file: !338, line: 21, column: 7)
!589 = !DILocalVariable(name: "ierr__", scope: !590, file: !338, line: 24, type: !152)
!590 = distinct !DILexicalBlock(scope: !337, file: !338, line: 24, column: 74)
!591 = !DILocation(line: 0, scope: !337)
!592 = !DILocation(line: 5, column: 43, scope: !337)
!593 = !{!594, !599, i64 1152}
