; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/partition/partition.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/partition/partition.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._n_PetscFunctionList = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!287 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !38, line: 187, baseType: !7, size: 32, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294, !295}
!289 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!294 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!295 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!296 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !297, line: 663, baseType: !7, size: 32, elements: !298)
!297 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!298 = !{!299, !300, !301}
!299 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!300 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!301 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!302 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !303)
!303 = !{!304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321}
!304 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!305 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!306 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!307 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!308 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!309 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!310 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!311 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!312 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!313 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!314 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!315 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!316 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!317 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!318 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!319 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!320 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!321 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!322 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !323, line: 624, baseType: !7, size: 32, elements: !324)
!323 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!324 = !{!325, !326, !327, !328}
!325 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!326 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!327 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!328 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!329 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 327, baseType: !7, size: 32, elements: !330)
!330 = !{!331, !332, !333}
!331 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!332 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!333 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!334 = !{!335, !338, !339, !342, !343, !346, !351, !544, !547, !429, !74, !405, !456, !447, !455, !550, !551, !552}
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !337)
!337 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !74)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !323, line: 330, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !323, line: 330, flags: DIFlagFwdDecl)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !344, line: 46, baseType: !345)
!344 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!345 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !347, line: 1451, baseType: !348)
!347 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{null}
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !354, line: 73, size: 4480, elements: !355)
!354 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!355 = !{!356, !358, !401, !402, !403, !406, !407, !408, !409, !417, !418, !420, !424, !428, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !441, !442, !443, !445, !446, !448, !450, !451, !452, !453, !454, !457, !459, !460, !461, !462, !463, !466, !468, !469, !470, !480, !482, !483, !487, !488, !534, !539, !541, !542, !543}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !353, file: !354, line: 74, baseType: !357, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !74)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !353, file: !354, line: 75, baseType: !359, size: 448, offset: 64)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 448, elements: !399)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !354, line: 53, baseType: !361)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !354, line: 45, size: 448, elements: !362)
!362 = !{!363, !369, !377, !382, !386, !390, !394}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !361, file: !354, line: 46, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!367, !351, !368}
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !74)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !361, file: !354, line: 47, baseType: !370, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!367, !351, !373}
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !374, line: 16, baseType: !375)
!374 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !374, line: 16, flags: DIFlagFwdDecl)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !361, file: !354, line: 48, baseType: !378, size: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!367, !381}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !361, file: !354, line: 49, baseType: !383, size: 64, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!367, !351, !335, !351}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !361, file: !354, line: 50, baseType: !387, size: 64, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!367, !351, !335, !381}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !361, file: !354, line: 51, baseType: !391, size: 64, offset: 320)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!367, !351, !335, !348}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !361, file: !354, line: 52, baseType: !395, size: 64, offset: 384)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!367, !351, !335, !398}
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!399 = !{!400}
!400 = !DISubrange(count: 1)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !353, file: !354, line: 76, baseType: !339, size: 64, offset: 512)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !353, file: !354, line: 77, baseType: !338, size: 32, offset: 576)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !353, file: !354, line: 78, baseType: !404, size: 64, offset: 640)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !405)
!405 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !353, file: !354, line: 78, baseType: !404, size: 64, offset: 704)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !353, file: !354, line: 78, baseType: !404, size: 64, offset: 768)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !353, file: !354, line: 78, baseType: !404, size: 64, offset: 832)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !353, file: !354, line: 79, baseType: !410, size: 64, offset: 896)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !411)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !413, line: 27, baseType: !414)
!413 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !415, line: 43, baseType: !416)
!415 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!416 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !353, file: !354, line: 80, baseType: !338, size: 32, offset: 960)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !353, file: !354, line: 81, baseType: !419, size: 32, offset: 992)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !74)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !353, file: !354, line: 82, baseType: !421, size: 64, offset: 1024)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !422)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !353, file: !354, line: 83, baseType: !425, size: 64, offset: 1088)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !353, file: !354, line: 84, baseType: !429, size: 64, offset: 1152)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !353, file: !354, line: 85, baseType: !429, size: 64, offset: 1216)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !353, file: !354, line: 86, baseType: !429, size: 64, offset: 1280)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !353, file: !354, line: 87, baseType: !429, size: 64, offset: 1344)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !353, file: !354, line: 88, baseType: !351, size: 64, offset: 1408)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !353, file: !354, line: 89, baseType: !410, size: 64, offset: 1472)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !353, file: !354, line: 90, baseType: !429, size: 64, offset: 1536)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !353, file: !354, line: 91, baseType: !429, size: 64, offset: 1600)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !353, file: !354, line: 92, baseType: !338, size: 32, offset: 1664)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !353, file: !354, line: 93, baseType: !342, size: 64, offset: 1728)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !353, file: !354, line: 94, baseType: !440, size: 64, offset: 1792)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !411)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !353, file: !354, line: 95, baseType: !338, size: 32, offset: 1856)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !353, file: !354, line: 95, baseType: !338, size: 32, offset: 1888)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !353, file: !354, line: 96, baseType: !444, size: 64, offset: 1920)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !353, file: !354, line: 96, baseType: !444, size: 64, offset: 1984)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !353, file: !354, line: 97, baseType: !447, size: 64, offset: 2048)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !353, file: !354, line: 97, baseType: !449, size: 64, offset: 2112)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !353, file: !354, line: 98, baseType: !338, size: 32, offset: 2176)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !353, file: !354, line: 98, baseType: !338, size: 32, offset: 2208)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !353, file: !354, line: 99, baseType: !444, size: 64, offset: 2240)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !353, file: !354, line: 99, baseType: !444, size: 64, offset: 2304)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !353, file: !354, line: 100, baseType: !455, size: 64, offset: 2368)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !405)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !353, file: !354, line: 100, baseType: !458, size: 64, offset: 2432)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !353, file: !354, line: 101, baseType: !338, size: 32, offset: 2496)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !353, file: !354, line: 101, baseType: !338, size: 32, offset: 2528)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !353, file: !354, line: 102, baseType: !444, size: 64, offset: 2560)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !353, file: !354, line: 102, baseType: !444, size: 64, offset: 2624)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !353, file: !354, line: 103, baseType: !464, size: 64, offset: 2688)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !456)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !353, file: !354, line: 103, baseType: !467, size: 64, offset: 2752)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !353, file: !354, line: 104, baseType: !398, size: 64, offset: 2816)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !353, file: !354, line: 105, baseType: !338, size: 32, offset: 2880)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !353, file: !354, line: 106, baseType: !471, size: 128, offset: 2944)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !472, size: 128, elements: !478)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !354, line: 64, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !354, line: 61, size: 128, elements: !475)
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !474, file: !354, line: 62, baseType: !348, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !474, file: !354, line: 63, baseType: !342, size: 64, offset: 64)
!478 = !{!479}
!479 = !DISubrange(count: 2)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !353, file: !354, line: 107, baseType: !481, size: 64, offset: 3072)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 64, elements: !478)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !353, file: !354, line: 108, baseType: !342, size: 64, offset: 3136)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !353, file: !354, line: 109, baseType: !484, size: 64, offset: 3200)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!367, !342}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !353, file: !354, line: 111, baseType: !338, size: 32, offset: 3264)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !353, file: !354, line: 112, baseType: !489, size: 320, offset: 3328)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 320, elements: !532)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{!367, !493, !351, !342}
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !496)
!496 = !{!497, !498, !520, !521, !522, !523, !524, !525, !526, !527, !528}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !495, file: !12, line: 100, baseType: !338, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !495, file: !12, line: 101, baseType: !499, size: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !500)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !502)
!502 = !{!503, !504, !505, !506, !507, !510, !511, !512, !513, !515, !517, !518, !519}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !501, file: !12, line: 84, baseType: !429, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !501, file: !12, line: 85, baseType: !429, size: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !501, file: !12, line: 86, baseType: !342, size: 64, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !501, file: !12, line: 87, baseType: !421, size: 64, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !501, file: !12, line: 88, baseType: !508, size: 64, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !335)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !501, file: !12, line: 89, baseType: !337, size: 8, offset: 320)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !501, file: !12, line: 90, baseType: !429, size: 64, offset: 384)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !501, file: !12, line: 91, baseType: !343, size: 64, offset: 448)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !501, file: !12, line: 92, baseType: !514, size: 32, offset: 512)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !501, file: !12, line: 93, baseType: !516, size: 32, offset: 544)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !501, file: !12, line: 94, baseType: !499, size: 64, offset: 576)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !501, file: !12, line: 95, baseType: !429, size: 64, offset: 640)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !501, file: !12, line: 96, baseType: !342, size: 64, offset: 704)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !495, file: !12, line: 102, baseType: !429, size: 64, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !495, file: !12, line: 102, baseType: !429, size: 64, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !495, file: !12, line: 103, baseType: !429, size: 64, offset: 256)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !495, file: !12, line: 104, baseType: !339, size: 64, offset: 320)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !495, file: !12, line: 105, baseType: !514, size: 32, offset: 384)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !495, file: !12, line: 105, baseType: !514, size: 32, offset: 416)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !495, file: !12, line: 105, baseType: !514, size: 32, offset: 448)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !495, file: !12, line: 106, baseType: !351, size: 64, offset: 512)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !495, file: !12, line: 107, baseType: !529, size: 64, offset: 576)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!532 = !{!533}
!533 = !DISubrange(count: 5)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !353, file: !354, line: 113, baseType: !535, size: 320, offset: 3648)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 320, elements: !532)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!367, !351, !342}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !353, file: !354, line: 114, baseType: !540, size: 320, offset: 3968)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 320, elements: !532)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !353, file: !354, line: 115, baseType: !514, size: 32, offset: 4288)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !353, file: !354, line: 120, baseType: !529, size: 64, offset: 4352)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !353, file: !354, line: 121, baseType: !514, size: 32, offset: 4416)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !323, line: 331, baseType: !545)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !323, line: 331, flags: DIFlagFwdDecl)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !323, line: 338, baseType: !548)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !323, line: 338, flags: DIFlagFwdDecl)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectDestroyFunction", file: !354, line: 130, baseType: !378)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectViewFunction", file: !354, line: 131, baseType: !370)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!553 = !{!0, !554, !557}
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "MatPartitioningRegisterAllCalled", scope: !2, file: !556, line: 167, type: !514, isLocal: false, isDefinition: true)
!556 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/partition/partition.c", directory: "/home/users/ndemeye/xSDK")
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "MAT_PARTITIONING_CLASSID", scope: !2, file: !556, line: 5, type: !357, isLocal: false, isDefinition: true)
!559 = !{i32 7, !"Dwarf Version", i32 4}
!560 = !{i32 2, !"Debug Info Version", i32 3}
!561 = !{i32 1, !"wchar_size", i32 4}
!562 = !{i32 7, !"PIC Level", i32 2}
!563 = !{i32 7, !"uwtable", i32 1}
!564 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!565 = distinct !DISubprogram(name: "MatPartitioningCreate_Current", scope: !556, file: !556, line: 87, type: !566, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1368)
!566 = !DISubroutineType(types: !567)
!567 = !{!367, !568}
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatPartitioning", file: !38, line: 1427, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatPartitioning", file: !571, line: 527, size: 5248, elements: !572)
!571 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!572 = !{!573, !575, !600, !1362, !1363, !1364, !1365, !1366, !1367}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !570, file: !571, line: 528, baseType: !574, size: 4480)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !354, line: 122, baseType: !353)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !570, file: !571, line: 528, baseType: !576, size: 384, offset: 4480)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !577, size: 384, elements: !399)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatPartitioningOps", file: !571, line: 518, size: 384, elements: !578)
!578 = !{!579, !588, !589, !593, !595, !599}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !577, file: !571, line: 519, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{!367, !568, !583}
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !585, line: 11, baseType: !586)
!585 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !585, line: 11, flags: DIFlagFwdDecl)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "applynd", scope: !577, file: !571, line: 520, baseType: !580, size: 64, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !577, file: !571, line: 521, baseType: !590, size: 64, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!367, !493, !568}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !577, file: !571, line: 522, baseType: !594, size: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !577, file: !571, line: 523, baseType: !596, size: 64, offset: 256)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{!367, !568, !373}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "improve", scope: !577, file: !571, line: 524, baseType: !580, size: 64, offset: 320)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "adj", scope: !570, file: !571, line: 529, baseType: !601, size: 64, offset: 4864)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !38, line: 16, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !571, line: 436, size: 23424, elements: !604)
!604 = !{!605, !606, !1108, !1128, !1129, !1130, !1132, !1133, !1134, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1258, !1259, !1275, !1276, !1277, !1278, !1279, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1314, !1334, !1335, !1337, !1338, !1339, !1340, !1341, !1342, !1360, !1361}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !603, file: !571, line: 437, baseType: !574, size: 4480)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !603, file: !571, line: 437, baseType: !607, size: 9472, offset: 4480)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !608, size: 9472, elements: !399)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !571, line: 32, size: 9472, elements: !609)
!609 = !{!610, !619, !623, !624, !631, !635, !636, !637, !638, !639, !640, !641, !661, !665, !670, !676, !695, !700, !704, !705, !710, !715, !716, !721, !725, !729, !733, !737, !741, !742, !743, !744, !745, !749, !750, !755, !756, !757, !758, !759, !764, !771, !775, !779, !783, !787, !791, !792, !796, !797, !804, !809, !810, !811, !812, !874, !882, !883, !887, !888, !892, !893, !897, !902, !903, !907, !911, !918, !919, !920, !921, !922, !923, !928, !929, !933, !937, !941, !942, !943, !947, !957, !958, !962, !963, !967, !968, !972, !973, !978, !979, !983, !987, !988, !989, !990, !991, !992, !993, !997, !998, !999, !1000, !1001, !1002, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1017, !1021, !1022, !1023, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1037, !1038, !1039, !1044, !1048, !1049, !1053, !1054, !1055, !1056, !1082, !1086, !1087, !1088, !1089, !1090, !1094, !1095, !1096, !1097, !1098, !1102, !1106, !1107}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !608, file: !571, line: 34, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!367, !601, !338, !614, !338, !614, !616, !618}
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !338)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !465)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !26)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !608, file: !571, line: 35, baseType: !620, size: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!367, !601, !338, !447, !449, !467}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !608, file: !571, line: 36, baseType: !620, size: 64, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !608, file: !571, line: 37, baseType: !625, size: 64, offset: 192)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!367, !601, !628, !628}
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !62, line: 21, baseType: !629)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !62, line: 21, flags: DIFlagFwdDecl)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !608, file: !571, line: 38, baseType: !632, size: 64, offset: 256)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DISubroutineType(types: !634)
!634 = !{!367, !601, !628, !628, !628}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !608, file: !571, line: 40, baseType: !625, size: 64, offset: 320)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !608, file: !571, line: 41, baseType: !632, size: 64, offset: 384)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !608, file: !571, line: 42, baseType: !625, size: 64, offset: 448)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !608, file: !571, line: 43, baseType: !632, size: 64, offset: 512)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !608, file: !571, line: 44, baseType: !625, size: 64, offset: 576)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !608, file: !571, line: 46, baseType: !632, size: 64, offset: 640)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !608, file: !571, line: 47, baseType: !642, size: 64, offset: 704)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!367, !601, !584, !584, !645}
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !647)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !38, line: 1239, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 1226, size: 704, elements: !649)
!649 = !{!650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !648, file: !38, line: 1227, baseType: !456, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !648, file: !38, line: 1228, baseType: !456, size: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !648, file: !38, line: 1229, baseType: !456, size: 64, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !648, file: !38, line: 1230, baseType: !456, size: 64, offset: 192)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !648, file: !38, line: 1231, baseType: !456, size: 64, offset: 256)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !648, file: !38, line: 1232, baseType: !456, size: 64, offset: 320)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !648, file: !38, line: 1233, baseType: !456, size: 64, offset: 384)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !648, file: !38, line: 1234, baseType: !456, size: 64, offset: 448)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !648, file: !38, line: 1236, baseType: !456, size: 64, offset: 512)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !648, file: !38, line: 1237, baseType: !456, size: 64, offset: 576)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !648, file: !38, line: 1238, baseType: !456, size: 64, offset: 640)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !608, file: !571, line: 48, baseType: !662, size: 64, offset: 768)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{!367, !601, !584, !645}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !608, file: !571, line: 49, baseType: !666, size: 64, offset: 832)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!367, !601, !628, !456, !669, !456, !338, !338, !628}
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !38, line: 1291, baseType: !37)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !608, file: !571, line: 50, baseType: !671, size: 64, offset: 896)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!367, !601, !674, !675}
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !38, line: 238, baseType: !50)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !608, file: !571, line: 52, baseType: !677, size: 64, offset: 960)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!367, !601, !680, !681}
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !38, line: 612, baseType: !56)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !38, line: 600, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 592, size: 640, elements: !684)
!684 = !{!685, !686, !687, !688, !689, !690, !691, !692, !693, !694}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !683, file: !38, line: 593, baseType: !404, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !683, file: !38, line: 594, baseType: !404, size: 64, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !683, file: !38, line: 594, baseType: !404, size: 64, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !683, file: !38, line: 594, baseType: !404, size: 64, offset: 192)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !683, file: !38, line: 595, baseType: !404, size: 64, offset: 256)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !683, file: !38, line: 596, baseType: !404, size: 64, offset: 320)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !683, file: !38, line: 597, baseType: !404, size: 64, offset: 384)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !683, file: !38, line: 598, baseType: !404, size: 64, offset: 448)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !683, file: !38, line: 598, baseType: !404, size: 64, offset: 512)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !683, file: !38, line: 599, baseType: !404, size: 64, offset: 576)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !608, file: !571, line: 53, baseType: !696, size: 64, offset: 1024)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!367, !601, !601, !699}
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !608, file: !571, line: 54, baseType: !701, size: 64, offset: 1088)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!367, !601, !628}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !608, file: !571, line: 55, baseType: !625, size: 64, offset: 1152)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !608, file: !571, line: 56, baseType: !706, size: 64, offset: 1216)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!367, !601, !709, !455}
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !62, line: 155, baseType: !61)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !608, file: !571, line: 58, baseType: !711, size: 64, offset: 1280)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!367, !601, !714}
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !38, line: 424, baseType: !69)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !608, file: !571, line: 59, baseType: !711, size: 64, offset: 1344)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !608, file: !571, line: 60, baseType: !717, size: 64, offset: 1408)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{!367, !601, !720, !514}
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !38, line: 469, baseType: !73)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !608, file: !571, line: 61, baseType: !722, size: 64, offset: 1472)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!367, !601}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !608, file: !571, line: 63, baseType: !726, size: 64, offset: 1536)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!367, !601, !338, !614, !465, !628, !628}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !608, file: !571, line: 64, baseType: !730, size: 64, offset: 1600)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!367, !601, !601, !584, !584, !645}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !608, file: !571, line: 65, baseType: !734, size: 64, offset: 1664)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!367, !601, !601, !645}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !608, file: !571, line: 66, baseType: !738, size: 64, offset: 1728)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!367, !601, !601, !584, !645}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !608, file: !571, line: 67, baseType: !734, size: 64, offset: 1792)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !608, file: !571, line: 69, baseType: !722, size: 64, offset: 1856)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !608, file: !571, line: 70, baseType: !730, size: 64, offset: 1920)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !608, file: !571, line: 71, baseType: !738, size: 64, offset: 1984)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !608, file: !571, line: 72, baseType: !746, size: 64, offset: 2048)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!367, !601, !675}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !608, file: !571, line: 73, baseType: !722, size: 64, offset: 2112)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !608, file: !571, line: 75, baseType: !751, size: 64, offset: 2176)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!367, !601, !754, !675}
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !38, line: 563, baseType: !104)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !608, file: !571, line: 76, baseType: !625, size: 64, offset: 2240)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !608, file: !571, line: 77, baseType: !625, size: 64, offset: 2304)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !608, file: !571, line: 78, baseType: !642, size: 64, offset: 2368)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !608, file: !571, line: 79, baseType: !662, size: 64, offset: 2432)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !608, file: !571, line: 81, baseType: !760, size: 64, offset: 2496)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!367, !601, !465, !601, !763}
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !38, line: 285, baseType: !109)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !608, file: !571, line: 82, baseType: !765, size: 64, offset: 2560)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!367, !601, !338, !768, !768, !674, !770}
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !584)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !608, file: !571, line: 83, baseType: !772, size: 64, offset: 2624)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!367, !601, !338, !583, !338}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !608, file: !571, line: 84, baseType: !776, size: 64, offset: 2688)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{!367, !601, !338, !614, !338, !614, !464}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !608, file: !571, line: 85, baseType: !780, size: 64, offset: 2752)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{!367, !601, !601, !763}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !608, file: !571, line: 87, baseType: !784, size: 64, offset: 2816)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{!367, !601, !628, !447}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !608, file: !571, line: 88, baseType: !788, size: 64, offset: 2880)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{!367, !601, !465}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !608, file: !571, line: 89, baseType: !788, size: 64, offset: 2944)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !608, file: !571, line: 90, baseType: !793, size: 64, offset: 3008)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DISubroutineType(types: !795)
!795 = !{!367, !601, !628, !618}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !608, file: !571, line: 91, baseType: !726, size: 64, offset: 3072)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !608, file: !571, line: 93, baseType: !798, size: 64, offset: 3136)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{!367, !601, !801}
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !608, file: !571, line: 94, baseType: !805, size: 64, offset: 3200)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DISubroutineType(types: !807)
!807 = !{!367, !601, !338, !514, !514, !447, !808, !808, !699}
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !608, file: !571, line: 95, baseType: !805, size: 64, offset: 3264)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !608, file: !571, line: 96, baseType: !805, size: 64, offset: 3328)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !608, file: !571, line: 97, baseType: !805, size: 64, offset: 3392)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !608, file: !571, line: 99, baseType: !813, size: 64, offset: 3456)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{!367, !601, !816, !819}
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !585, line: 51, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !585, line: 51, flags: DIFlagFwdDecl)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !38, line: 1378, baseType: !820)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !571, line: 609, size: 6208, elements: !822)
!822 = !{!823, !824, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !843, !850, !851, !852, !853, !854, !855, !856, !857, !861, !862, !863, !864, !865, !867, !868, !869, !870, !871, !872, !873}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !821, file: !571, line: 610, baseType: !574, size: 4480)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !821, file: !571, line: 610, baseType: !825, size: 32, offset: 4480)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 32, elements: !399)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !821, file: !571, line: 611, baseType: !338, size: 32, offset: 4512)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !821, file: !571, line: 611, baseType: !338, size: 32, offset: 4544)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !821, file: !571, line: 611, baseType: !338, size: 32, offset: 4576)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !821, file: !571, line: 612, baseType: !338, size: 32, offset: 4608)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !821, file: !571, line: 613, baseType: !338, size: 32, offset: 4640)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !821, file: !571, line: 614, baseType: !447, size: 64, offset: 4672)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !821, file: !571, line: 615, baseType: !449, size: 64, offset: 4736)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !821, file: !571, line: 616, baseType: !583, size: 64, offset: 4800)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !821, file: !571, line: 617, baseType: !447, size: 64, offset: 4864)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !821, file: !571, line: 618, baseType: !836, size: 64, offset: 4928)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !571, line: 602, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !571, line: 598, size: 128, elements: !839)
!839 = !{!840, !841, !842}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !838, file: !571, line: 599, baseType: !338, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !838, file: !571, line: 600, baseType: !338, size: 32, offset: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !838, file: !571, line: 601, baseType: !464, size: 64, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !821, file: !571, line: 619, baseType: !844, size: 64, offset: 4992)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !571, line: 607, baseType: !846)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !571, line: 604, size: 128, elements: !847)
!847 = !{!848, !849}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !846, file: !571, line: 605, baseType: !338, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !846, file: !571, line: 606, baseType: !464, size: 64, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !821, file: !571, line: 620, baseType: !464, size: 64, offset: 5056)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !821, file: !571, line: 621, baseType: !456, size: 64, offset: 5120)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !821, file: !571, line: 622, baseType: !456, size: 64, offset: 5184)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !821, file: !571, line: 623, baseType: !628, size: 64, offset: 5248)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !821, file: !571, line: 623, baseType: !628, size: 64, offset: 5312)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !821, file: !571, line: 623, baseType: !628, size: 64, offset: 5376)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !821, file: !571, line: 624, baseType: !514, size: 32, offset: 5440)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !821, file: !571, line: 625, baseType: !858, size: 64, offset: 5504)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{!367}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !821, file: !571, line: 626, baseType: !342, size: 64, offset: 5568)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !821, file: !571, line: 627, baseType: !628, size: 64, offset: 5632)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !821, file: !571, line: 628, baseType: !338, size: 32, offset: 5696)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !821, file: !571, line: 629, baseType: !335, size: 64, offset: 5760)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !821, file: !571, line: 630, baseType: !866, size: 32, offset: 5824)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !116, line: 213, baseType: !115)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !821, file: !571, line: 631, baseType: !338, size: 32, offset: 5856)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !821, file: !571, line: 631, baseType: !338, size: 32, offset: 5888)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !821, file: !571, line: 632, baseType: !514, size: 32, offset: 5920)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !821, file: !571, line: 633, baseType: !514, size: 32, offset: 5952)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !821, file: !571, line: 634, baseType: !348, size: 64, offset: 6016)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !821, file: !571, line: 634, baseType: !342, size: 64, offset: 6080)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !821, file: !571, line: 635, baseType: !410, size: 64, offset: 6144)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !608, file: !571, line: 100, baseType: !875, size: 64, offset: 3520)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!367, !601, !338, !338, !878, !881}
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !116, line: 215, baseType: !880)
!880 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !608, file: !571, line: 101, baseType: !722, size: 64, offset: 3584)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !608, file: !571, line: 102, baseType: !884, size: 64, offset: 3648)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{!367, !601, !584, !584, !675}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !608, file: !571, line: 103, baseType: !611, size: 64, offset: 3712)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !608, file: !571, line: 105, baseType: !889, size: 64, offset: 3776)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{!367, !601, !584, !584, !674, !675}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !608, file: !571, line: 106, baseType: !722, size: 64, offset: 3840)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !608, file: !571, line: 107, baseType: !894, size: 64, offset: 3904)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{!367, !601, !373}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !608, file: !571, line: 108, baseType: !898, size: 64, offset: 3968)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{!367, !601, !901, !674, !675}
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !38, line: 25, baseType: !335)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !608, file: !571, line: 109, baseType: !858, size: 64, offset: 4032)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !608, file: !571, line: 111, baseType: !904, size: 64, offset: 4096)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{!367, !601, !601, !601, !456, !601}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !608, file: !571, line: 112, baseType: !908, size: 64, offset: 4160)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!367, !601, !601, !601, !601}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !608, file: !571, line: 113, baseType: !912, size: 64, offset: 4224)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{!367, !601, !915, !915}
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !585, line: 30, baseType: !916)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !585, line: 30, flags: DIFlagFwdDecl)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !608, file: !571, line: 114, baseType: !611, size: 64, offset: 4288)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !608, file: !571, line: 115, baseType: !726, size: 64, offset: 4352)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !608, file: !571, line: 117, baseType: !784, size: 64, offset: 4416)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !608, file: !571, line: 118, baseType: !784, size: 64, offset: 4480)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !608, file: !571, line: 119, baseType: !898, size: 64, offset: 4544)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !608, file: !571, line: 120, baseType: !924, size: 64, offset: 4608)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{!367, !601, !927, !699}
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !38, line: 1675, baseType: !120)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !608, file: !571, line: 121, baseType: !858, size: 64, offset: 4672)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !608, file: !571, line: 123, baseType: !930, size: 64, offset: 4736)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{!367, !601, !338, !342}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !608, file: !571, line: 124, baseType: !934, size: 64, offset: 4800)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!367, !601, !819, !628, !342}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !608, file: !571, line: 125, baseType: !938, size: 64, offset: 4864)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!367, !493, !601}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !608, file: !571, line: 126, baseType: !625, size: 64, offset: 4928)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !608, file: !571, line: 127, baseType: !625, size: 64, offset: 4992)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !608, file: !571, line: 129, baseType: !944, size: 64, offset: 5056)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{!367, !601, !583}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !608, file: !571, line: 130, baseType: !948, size: 64, offset: 5120)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{!367, !601, !951, !951}
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !62, line: 654, baseType: !952)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !62, line: 653, size: 128, elements: !954)
!954 = !{!955, !956}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !953, file: !62, line: 653, baseType: !338, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !953, file: !62, line: 653, baseType: !628, size: 64, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !608, file: !571, line: 131, baseType: !948, size: 64, offset: 5184)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !608, file: !571, line: 132, baseType: !959, size: 64, offset: 5248)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!367, !601, !447, !447, !447}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !608, file: !571, line: 133, baseType: !894, size: 64, offset: 5312)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !608, file: !571, line: 135, baseType: !964, size: 64, offset: 5376)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{!367, !601, !456, !699}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !608, file: !571, line: 136, baseType: !964, size: 64, offset: 5440)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !608, file: !571, line: 137, baseType: !969, size: 64, offset: 5504)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!367, !601, !699}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !608, file: !571, line: 138, baseType: !611, size: 64, offset: 5568)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !608, file: !571, line: 139, baseType: !974, size: 64, offset: 5632)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!367, !601, !977, !977}
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !608, file: !571, line: 141, baseType: !858, size: 64, offset: 5696)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !608, file: !571, line: 142, baseType: !980, size: 64, offset: 5760)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!367, !601, !601, !456, !601}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !608, file: !571, line: 143, baseType: !984, size: 64, offset: 5824)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!367, !601, !601, !601}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !608, file: !571, line: 144, baseType: !858, size: 64, offset: 5888)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !608, file: !571, line: 145, baseType: !980, size: 64, offset: 5952)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !608, file: !571, line: 147, baseType: !984, size: 64, offset: 6016)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !608, file: !571, line: 148, baseType: !858, size: 64, offset: 6080)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !608, file: !571, line: 149, baseType: !980, size: 64, offset: 6144)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !608, file: !571, line: 150, baseType: !984, size: 64, offset: 6208)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !608, file: !571, line: 151, baseType: !994, size: 64, offset: 6272)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!367, !601, !514}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !608, file: !571, line: 153, baseType: !722, size: 64, offset: 6336)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !608, file: !571, line: 154, baseType: !722, size: 64, offset: 6400)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !608, file: !571, line: 155, baseType: !722, size: 64, offset: 6464)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !608, file: !571, line: 156, baseType: !722, size: 64, offset: 6528)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !608, file: !571, line: 157, baseType: !894, size: 64, offset: 6592)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !608, file: !571, line: 159, baseType: !1003, size: 64, offset: 6656)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!367, !601, !338, !616}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !608, file: !571, line: 160, baseType: !722, size: 64, offset: 6720)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !608, file: !571, line: 161, baseType: !722, size: 64, offset: 6784)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !608, file: !571, line: 162, baseType: !722, size: 64, offset: 6848)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !608, file: !571, line: 163, baseType: !722, size: 64, offset: 6912)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !608, file: !571, line: 165, baseType: !984, size: 64, offset: 6976)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !608, file: !571, line: 166, baseType: !984, size: 64, offset: 7040)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !608, file: !571, line: 167, baseType: !784, size: 64, offset: 7104)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !608, file: !571, line: 168, baseType: !1014, size: 64, offset: 7168)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!367, !601, !628, !338}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !608, file: !571, line: 169, baseType: !1018, size: 64, offset: 7232)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!367, !601, !699, !447}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !608, file: !571, line: 171, baseType: !746, size: 64, offset: 7296)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !608, file: !571, line: 172, baseType: !722, size: 64, offset: 7360)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !608, file: !571, line: 173, baseType: !1024, size: 64, offset: 7424)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!367, !601, !447, !808}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !608, file: !571, line: 174, baseType: !884, size: 64, offset: 7488)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !608, file: !571, line: 175, baseType: !884, size: 64, offset: 7552)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !608, file: !571, line: 177, baseType: !625, size: 64, offset: 7616)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !608, file: !571, line: 178, baseType: !671, size: 64, offset: 7680)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !608, file: !571, line: 179, baseType: !625, size: 64, offset: 7744)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !608, file: !571, line: 180, baseType: !632, size: 64, offset: 7808)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !608, file: !571, line: 181, baseType: !1034, size: 64, offset: 7872)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!367, !601, !339, !674, !675}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !608, file: !571, line: 183, baseType: !944, size: 64, offset: 7936)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !608, file: !571, line: 184, baseType: !706, size: 64, offset: 8000)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !608, file: !571, line: 185, baseType: !1040, size: 64, offset: 8064)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!367, !601, !1043}
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !608, file: !571, line: 186, baseType: !1045, size: 64, offset: 8128)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!367, !601, !338, !614, !464}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !608, file: !571, line: 187, baseType: !765, size: 64, offset: 8192)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !608, file: !571, line: 189, baseType: !1050, size: 64, offset: 8256)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!367, !601, !338, !338, !447, !616}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !608, file: !571, line: 190, baseType: !858, size: 64, offset: 8320)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !608, file: !571, line: 191, baseType: !980, size: 64, offset: 8384)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !608, file: !571, line: 192, baseType: !984, size: 64, offset: 8448)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !608, file: !571, line: 193, baseType: !1057, size: 64, offset: 8512)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!367, !601, !816, !1060}
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !38, line: 1401, baseType: !1061)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !571, line: 660, size: 5312, elements: !1063)
!1063 = !{!1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1062, file: !571, line: 661, baseType: !574, size: 4480)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1062, file: !571, line: 661, baseType: !825, size: 32, offset: 4480)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1062, file: !571, line: 662, baseType: !338, size: 32, offset: 4512)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1062, file: !571, line: 662, baseType: !338, size: 32, offset: 4544)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1062, file: !571, line: 662, baseType: !338, size: 32, offset: 4576)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1062, file: !571, line: 663, baseType: !338, size: 32, offset: 4608)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1062, file: !571, line: 664, baseType: !338, size: 32, offset: 4640)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1062, file: !571, line: 665, baseType: !447, size: 64, offset: 4672)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1062, file: !571, line: 666, baseType: !447, size: 64, offset: 4736)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1062, file: !571, line: 667, baseType: !338, size: 32, offset: 4800)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1062, file: !571, line: 668, baseType: !866, size: 32, offset: 4832)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1062, file: !571, line: 670, baseType: !447, size: 64, offset: 4864)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1062, file: !571, line: 670, baseType: !447, size: 64, offset: 4928)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1062, file: !571, line: 671, baseType: !447, size: 64, offset: 4992)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1062, file: !571, line: 672, baseType: !447, size: 64, offset: 5056)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1062, file: !571, line: 673, baseType: !447, size: 64, offset: 5120)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1062, file: !571, line: 674, baseType: !338, size: 32, offset: 5184)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1062, file: !571, line: 675, baseType: !447, size: 64, offset: 5248)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !608, file: !571, line: 195, baseType: !1083, size: 64, offset: 8576)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!367, !1060, !601, !601}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !608, file: !571, line: 196, baseType: !1083, size: 64, offset: 8640)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !608, file: !571, line: 197, baseType: !858, size: 64, offset: 8704)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !608, file: !571, line: 198, baseType: !980, size: 64, offset: 8768)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !608, file: !571, line: 199, baseType: !984, size: 64, offset: 8832)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !608, file: !571, line: 201, baseType: !1091, size: 64, offset: 8896)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!367, !601, !338, !338}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !608, file: !571, line: 202, baseType: !760, size: 64, offset: 8960)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !608, file: !571, line: 203, baseType: !632, size: 64, offset: 9024)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !608, file: !571, line: 204, baseType: !813, size: 64, offset: 9088)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !608, file: !571, line: 205, baseType: !944, size: 64, offset: 9152)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !608, file: !571, line: 206, baseType: !1099, size: 64, offset: 9216)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!367, !339, !601, !338, !674, !675}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !608, file: !571, line: 208, baseType: !1103, size: 64, offset: 9280)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!367, !338, !770}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !608, file: !571, line: 209, baseType: !984, size: 64, offset: 9344)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !608, file: !571, line: 210, baseType: !776, size: 64, offset: 9408)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !603, file: !571, line: 438, baseType: !1109, size: 64, offset: 13952)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !585, line: 60, baseType: !1110)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !116, line: 240, size: 640, elements: !1112)
!1112 = !{!1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1111, file: !116, line: 241, baseType: !339, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1111, file: !116, line: 242, baseType: !419, size: 32, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1111, file: !116, line: 243, baseType: !338, size: 32, offset: 96)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1111, file: !116, line: 243, baseType: !338, size: 32, offset: 128)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1111, file: !116, line: 244, baseType: !338, size: 32, offset: 160)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1111, file: !116, line: 244, baseType: !338, size: 32, offset: 192)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1111, file: !116, line: 245, baseType: !447, size: 64, offset: 256)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1111, file: !116, line: 246, baseType: !514, size: 32, offset: 320)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1111, file: !116, line: 247, baseType: !338, size: 32, offset: 352)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1111, file: !116, line: 251, baseType: !338, size: 32, offset: 384)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1111, file: !116, line: 252, baseType: !915, size: 64, offset: 448)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1111, file: !116, line: 253, baseType: !514, size: 32, offset: 512)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1111, file: !116, line: 254, baseType: !338, size: 32, offset: 544)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1111, file: !116, line: 254, baseType: !338, size: 32, offset: 576)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1111, file: !116, line: 255, baseType: !338, size: 32, offset: 608)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !603, file: !571, line: 438, baseType: !1109, size: 64, offset: 14016)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !603, file: !571, line: 439, baseType: !342, size: 64, offset: 14080)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !603, file: !571, line: 440, baseType: !1131, size: 32, offset: 14144)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !38, line: 161, baseType: !265)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !603, file: !571, line: 441, baseType: !514, size: 32, offset: 14176)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !603, file: !571, line: 442, baseType: !514, size: 32, offset: 14208)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !603, file: !571, line: 443, baseType: !1135, size: 448, offset: 14272)
!1135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1136, size: 448, elements: !1137)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !38, line: 1159, baseType: !335)
!1137 = !{!1138}
!1138 = !DISubrange(count: 7)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !603, file: !571, line: 444, baseType: !514, size: 32, offset: 14720)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !603, file: !571, line: 445, baseType: !514, size: 32, offset: 14752)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !603, file: !571, line: 446, baseType: !338, size: 32, offset: 14784)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !603, file: !571, line: 447, baseType: !440, size: 64, offset: 14848)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !603, file: !571, line: 448, baseType: !440, size: 64, offset: 14912)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !603, file: !571, line: 449, baseType: !682, size: 640, offset: 14976)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !603, file: !571, line: 450, baseType: !618, size: 32, offset: 15616)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !603, file: !571, line: 451, baseType: !1147, size: 2880, offset: 15680)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !571, line: 318, baseType: !1148)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !571, line: 319, size: 2880, elements: !1149)
!1149 = !{!1150, !1151, !1152, !1153, !1154, !1155, !1156, !1169, !1170, !1175, !1180, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1195, !1196, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1228, !1229, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1252, !1253, !1254, !1255, !1256}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1148, file: !571, line: 320, baseType: !338, size: 32)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1148, file: !571, line: 321, baseType: !338, size: 32, offset: 32)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1148, file: !571, line: 322, baseType: !338, size: 32, offset: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1148, file: !571, line: 323, baseType: !338, size: 32, offset: 96)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1148, file: !571, line: 324, baseType: !338, size: 32, offset: 128)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1148, file: !571, line: 325, baseType: !338, size: 32, offset: 160)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1148, file: !571, line: 326, baseType: !1157, size: 64, offset: 192)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !571, line: 293, baseType: !1158)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !571, line: 295, size: 448, elements: !1160)
!1160 = !{!1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1159, file: !571, line: 296, baseType: !1157, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1159, file: !571, line: 297, baseType: !464, size: 64, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1159, file: !571, line: 297, baseType: !464, size: 64, offset: 128)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1159, file: !571, line: 298, baseType: !447, size: 64, offset: 192)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1159, file: !571, line: 298, baseType: !447, size: 64, offset: 256)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1159, file: !571, line: 299, baseType: !338, size: 32, offset: 320)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1159, file: !571, line: 300, baseType: !338, size: 32, offset: 352)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1159, file: !571, line: 301, baseType: !338, size: 32, offset: 384)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1148, file: !571, line: 326, baseType: !1157, size: 64, offset: 256)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1148, file: !571, line: 328, baseType: !1171, size: 64, offset: 320)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{!367, !601, !1174, !447}
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1148, file: !571, line: 329, baseType: !1176, size: 64, offset: 384)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = !DISubroutineType(types: !1178)
!1178 = !{!367, !1174, !1179, !449, !449, !467, !447}
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1148, file: !571, line: 330, baseType: !1181, size: 64, offset: 448)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = !DISubroutineType(types: !1183)
!1183 = !{!367, !1174}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1148, file: !571, line: 331, baseType: !1181, size: 64, offset: 512)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1148, file: !571, line: 334, baseType: !339, size: 64, offset: 576)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1148, file: !571, line: 335, baseType: !419, size: 32, offset: 640)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1148, file: !571, line: 335, baseType: !419, size: 32, offset: 672)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1148, file: !571, line: 336, baseType: !419, size: 32, offset: 704)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1148, file: !571, line: 336, baseType: !419, size: 32, offset: 736)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1148, file: !571, line: 337, baseType: !1191, size: 64, offset: 768)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !323, line: 339, baseType: !1193)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !323, line: 339, flags: DIFlagFwdDecl)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1148, file: !571, line: 338, baseType: !1191, size: 64, offset: 832)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1148, file: !571, line: 339, baseType: !1197, size: 64, offset: 896)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !323, line: 341, baseType: !1199)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !323, line: 351, size: 192, elements: !1200)
!1200 = !{!1201, !1202, !1203, !1204, !1205}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1199, file: !323, line: 354, baseType: !74, size: 32)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1199, file: !323, line: 355, baseType: !74, size: 32, offset: 32)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1199, file: !323, line: 356, baseType: !74, size: 32, offset: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1199, file: !323, line: 361, baseType: !74, size: 32, offset: 96)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1199, file: !323, line: 362, baseType: !343, size: 64, offset: 128)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1148, file: !571, line: 340, baseType: !338, size: 32, offset: 960)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1148, file: !571, line: 340, baseType: !338, size: 32, offset: 992)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1148, file: !571, line: 341, baseType: !464, size: 64, offset: 1024)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1148, file: !571, line: 342, baseType: !447, size: 64, offset: 1088)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1148, file: !571, line: 343, baseType: !467, size: 64, offset: 1152)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1148, file: !571, line: 344, baseType: !449, size: 64, offset: 1216)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1148, file: !571, line: 345, baseType: !338, size: 32, offset: 1280)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1148, file: !571, line: 346, baseType: !1179, size: 64, offset: 1344)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1148, file: !571, line: 347, baseType: !514, size: 32, offset: 1408)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1148, file: !571, line: 348, baseType: !338, size: 32, offset: 1440)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1148, file: !571, line: 351, baseType: !514, size: 32, offset: 1472)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1148, file: !571, line: 352, baseType: !514, size: 32, offset: 1504)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1148, file: !571, line: 353, baseType: !419, size: 32, offset: 1536)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1148, file: !571, line: 354, baseType: !419, size: 32, offset: 1568)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1148, file: !571, line: 355, baseType: !1179, size: 64, offset: 1600)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1148, file: !571, line: 356, baseType: !1179, size: 64, offset: 1664)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1148, file: !571, line: 357, baseType: !1223, size: 64, offset: 1728)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !571, line: 310, baseType: !1225)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !571, line: 308, size: 32, elements: !1226)
!1226 = !{!1227}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1225, file: !571, line: 309, baseType: !338, size: 32)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1148, file: !571, line: 357, baseType: !1223, size: 64, offset: 1792)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1148, file: !571, line: 358, baseType: !1230, size: 64, offset: 1856)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64)
!1231 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !571, line: 316, baseType: !1232)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !571, line: 312, size: 128, elements: !1233)
!1233 = !{!1234, !1235, !1236}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1232, file: !571, line: 313, baseType: !342, size: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1232, file: !571, line: 314, baseType: !338, size: 32, offset: 64)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1232, file: !571, line: 315, baseType: !337, size: 8, offset: 96)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1148, file: !571, line: 359, baseType: !1230, size: 64, offset: 1920)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1148, file: !571, line: 360, baseType: !1230, size: 64, offset: 1984)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1148, file: !571, line: 361, baseType: !338, size: 32, offset: 2048)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1148, file: !571, line: 362, baseType: !419, size: 32, offset: 2080)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1148, file: !571, line: 363, baseType: !338, size: 32, offset: 2112)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1148, file: !571, line: 364, baseType: !1179, size: 64, offset: 2176)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1148, file: !571, line: 365, baseType: !1197, size: 64, offset: 2240)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1148, file: !571, line: 366, baseType: !419, size: 32, offset: 2304)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1148, file: !571, line: 367, baseType: !419, size: 32, offset: 2336)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1148, file: !571, line: 368, baseType: !1191, size: 64, offset: 2368)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1148, file: !571, line: 369, baseType: !1191, size: 64, offset: 2432)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1148, file: !571, line: 370, baseType: !1249, size: 64, offset: 2496)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !6, line: 678, baseType: !1250)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !6, line: 678, flags: DIFlagFwdDecl)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1148, file: !571, line: 371, baseType: !1249, size: 64, offset: 2560)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1148, file: !571, line: 372, baseType: !1249, size: 64, offset: 2624)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1148, file: !571, line: 373, baseType: !544, size: 64, offset: 2688)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1148, file: !571, line: 374, baseType: !343, size: 64, offset: 2752)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1148, file: !571, line: 375, baseType: !1257, size: 64, offset: 2816)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !603, file: !571, line: 451, baseType: !1147, size: 2880, offset: 18560)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !603, file: !571, line: 452, baseType: !1260, size: 64, offset: 21440)
