; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/viewer/interface/viewreg.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/classes/viewer/interface/viewreg.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._n_PetscFunctionList = type opaque
%struct._n_PetscOptionsHelpPrinted = type { %struct.kh_HTPrinted_s*, %struct._n_PetscSegBuffer* }
%struct.kh_HTPrinted_s = type { i32, i32, i32, i32, i32*, i8**, i8* }
%struct._n_PetscSegBuffer = type opaque
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!59 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!60 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!61 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!62 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!63 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!64 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!65 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!66 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!67 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!68 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!69 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!70 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!72 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 481, baseType: !98, size: 32, elements: !99)
!98 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!99 = !{!100, !101, !102, !103, !104, !105}
!100 = !DIEnumerator(name: "FILE_MODE_UNDEFINED", value: -1)
!101 = !DIEnumerator(name: "FILE_MODE_READ", value: 0)
!102 = !DIEnumerator(name: "FILE_MODE_WRITE", value: 1)
!103 = !DIEnumerator(name: "FILE_MODE_APPEND", value: 2)
!104 = !DIEnumerator(name: "FILE_MODE_UPDATE", value: 3)
!105 = !DIEnumerator(name: "FILE_MODE_APPEND_UPDATE", value: 4)
!106 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 58, baseType: !7, size: 32, elements: !107)
!107 = !{!108}
!108 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!109 = !{!110, !113, !117, !118, !121, !174, !360, !362, !363, !364, !365, !192, !367, !98, !370, !376, !383, !385}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!112 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !114, line: 330, baseType: !115)
!114 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !114, line: 330, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !119, line: 46, baseType: !120)
!119 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!120 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !13, line: 430, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !124, line: 73, size: 4480, elements: !125)
!124 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!125 = !{!126, !128, !261, !262, !263, !266, !267, !268, !269, !277, !278, !280, !281, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !297, !298, !299, !301, !302, !303, !305, !306, !307, !308, !309, !312, !314, !315, !316, !317, !318, !321, !323, !324, !325, !335, !337, !338, !342, !343, !350, !355, !357, !358, !359}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !123, file: !124, line: 74, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !13, line: 32, baseType: !98)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !123, file: !124, line: 75, baseType: !129, size: 448, offset: 64)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 448, elements: !225)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !124, line: 53, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !124, line: 45, size: 448, elements: !132)
!132 = !{!133, !139, !236, !241, !245, !249, !256}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !131, file: !124, line: 46, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!137, !121, !138}
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !13, line: 14, baseType: !98)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !131, file: !124, line: 47, baseType: !140, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!137, !121, !143}
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !144, line: 16, baseType: !145)
!144 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !147, line: 28, size: 6016, elements: !148)
!147 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/viewerimpl.h", directory: "/home/users/ndemeye/xSDK")
!148 = !{!149, !151, !227, !229, !233, !234, !235}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !146, file: !147, line: 29, baseType: !150, size: 4480)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !124, line: 122, baseType: !123)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !146, file: !147, line: 29, baseType: !152, size: 512, offset: 4480)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 512, elements: !225)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscViewerOps", file: !147, line: 11, size: 512, elements: !154)
!154 = !{!155, !159, !163, !164, !169, !170, !177, !224}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !153, file: !147, line: 12, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!137, !143}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !153, file: !147, line: 13, baseType: !160, size: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!137, !143, !143}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !153, file: !147, line: 14, baseType: !156, size: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "getsubviewer", scope: !153, file: !147, line: 15, baseType: !165, size: 64, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!137, !143, !113, !168}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubviewer", scope: !153, file: !147, line: 16, baseType: !165, size: 64, offset: 256)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !153, file: !147, line: 17, baseType: !171, size: 64, offset: 320)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!137, !143, !117, !174, !175, !176}
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !13, line: 102, baseType: !98)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDataType", file: !13, line: 389, baseType: !17)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !153, file: !147, line: 18, baseType: !178, size: 64, offset: 384)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!137, !181, !143}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !38, line: 108, baseType: !183)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !38, line: 99, size: 640, elements: !184)
!184 = !{!185, !186, !212, !213, !214, !215, !216, !217, !218, !219, !220}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !183, file: !38, line: 100, baseType: !174, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !183, file: !38, line: 101, baseType: !187, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !38, line: 82, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !38, line: 83, size: 768, elements: !190)
!190 = !{!191, !193, !194, !195, !199, !202, !203, !204, !205, !207, !209, !210, !211}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !189, file: !38, line: 84, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !189, file: !38, line: 85, baseType: !192, size: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !189, file: !38, line: 86, baseType: !117, size: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !189, file: !38, line: 87, baseType: !196, size: 64, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !13, line: 465, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !13, line: 465, flags: DIFlagFwdDecl)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !189, file: !38, line: 88, baseType: !200, size: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !189, file: !38, line: 89, baseType: !112, size: 8, offset: 320)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !189, file: !38, line: 90, baseType: !192, size: 64, offset: 384)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !189, file: !38, line: 91, baseType: !118, size: 64, offset: 448)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !189, file: !38, line: 92, baseType: !206, size: 32, offset: 512)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !13, line: 170, baseType: !12)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !189, file: !38, line: 93, baseType: !208, size: 32, offset: 544)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !38, line: 81, baseType: !37)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !189, file: !38, line: 94, baseType: !187, size: 64, offset: 576)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !189, file: !38, line: 95, baseType: !192, size: 64, offset: 640)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !189, file: !38, line: 96, baseType: !117, size: 64, offset: 704)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !183, file: !38, line: 102, baseType: !192, size: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !183, file: !38, line: 102, baseType: !192, size: 64, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !183, file: !38, line: 103, baseType: !192, size: 64, offset: 256)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !183, file: !38, line: 104, baseType: !113, size: 64, offset: 320)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !183, file: !38, line: 105, baseType: !206, size: 32, offset: 384)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !183, file: !38, line: 105, baseType: !206, size: 32, offset: 416)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !183, file: !38, line: 105, baseType: !206, size: 32, offset: 448)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !183, file: !38, line: 106, baseType: !121, size: 64, offset: 512)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !183, file: !38, line: 107, baseType: !221, size: 64, offset: 576)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !38, line: 10, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !38, line: 10, flags: DIFlagFwdDecl)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !153, file: !147, line: 19, baseType: !156, size: 64, offset: 448)
!225 = !{!226}
!226 = !DISubrange(count: 1)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !146, file: !147, line: 30, baseType: !228, size: 32, offset: 4992)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !53, line: 162, baseType: !52)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "formats", scope: !146, file: !147, line: 30, baseType: !230, size: 800, offset: 5024)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 800, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 25)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !146, file: !147, line: 31, baseType: !98, size: 32, offset: 5824)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !146, file: !147, line: 32, baseType: !117, size: 64, offset: 5888)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !146, file: !147, line: 33, baseType: !206, size: 32, offset: 5952)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !131, file: !124, line: 48, baseType: !237, size: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!137, !240}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !131, file: !124, line: 49, baseType: !242, size: 64, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!137, !121, !110, !121}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !131, file: !124, line: 50, baseType: !246, size: 64, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!137, !121, !110, !240}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !131, file: !124, line: 51, baseType: !250, size: 64, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!137, !121, !110, !253}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !131, file: !124, line: 52, baseType: !257, size: 64, offset: 384)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!137, !121, !110, !260}
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !123, file: !124, line: 76, baseType: !113, size: 64, offset: 512)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !123, file: !124, line: 77, baseType: !174, size: 32, offset: 576)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !123, file: !124, line: 78, baseType: !264, size: 64, offset: 640)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !13, line: 360, baseType: !265)
!265 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !123, file: !124, line: 78, baseType: !264, size: 64, offset: 704)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !123, file: !124, line: 78, baseType: !264, size: 64, offset: 768)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !123, file: !124, line: 78, baseType: !264, size: 64, offset: 832)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !123, file: !124, line: 79, baseType: !270, size: 64, offset: 896)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !13, line: 442, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !13, line: 90, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !273, line: 27, baseType: !274)
!273 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !275, line: 43, baseType: !276)
!275 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!276 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !123, file: !124, line: 80, baseType: !174, size: 32, offset: 960)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !123, file: !124, line: 81, baseType: !279, size: 32, offset: 992)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !13, line: 49, baseType: !98)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !123, file: !124, line: 82, baseType: !196, size: 64, offset: 1024)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !123, file: !124, line: 83, baseType: !282, size: 64, offset: 1088)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !13, line: 496, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !13, line: 496, flags: DIFlagFwdDecl)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !123, file: !124, line: 84, baseType: !192, size: 64, offset: 1152)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !123, file: !124, line: 85, baseType: !192, size: 64, offset: 1216)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !123, file: !124, line: 86, baseType: !192, size: 64, offset: 1280)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !123, file: !124, line: 87, baseType: !192, size: 64, offset: 1344)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !123, file: !124, line: 88, baseType: !121, size: 64, offset: 1408)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !123, file: !124, line: 89, baseType: !270, size: 64, offset: 1472)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !123, file: !124, line: 90, baseType: !192, size: 64, offset: 1536)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !123, file: !124, line: 91, baseType: !192, size: 64, offset: 1600)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !123, file: !124, line: 92, baseType: !174, size: 32, offset: 1664)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !123, file: !124, line: 93, baseType: !117, size: 64, offset: 1728)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !123, file: !124, line: 94, baseType: !296, size: 64, offset: 1792)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !13, line: 455, baseType: !271)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !123, file: !124, line: 95, baseType: !174, size: 32, offset: 1856)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !123, file: !124, line: 95, baseType: !174, size: 32, offset: 1888)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !123, file: !124, line: 96, baseType: !300, size: 64, offset: 1920)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !123, file: !124, line: 96, baseType: !300, size: 64, offset: 1984)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !123, file: !124, line: 97, baseType: !175, size: 64, offset: 2048)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !123, file: !124, line: 97, baseType: !304, size: 64, offset: 2112)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !123, file: !124, line: 98, baseType: !174, size: 32, offset: 2176)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !123, file: !124, line: 98, baseType: !174, size: 32, offset: 2208)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !123, file: !124, line: 99, baseType: !300, size: 64, offset: 2240)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !123, file: !124, line: 99, baseType: !300, size: 64, offset: 2304)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !123, file: !124, line: 100, baseType: !310, size: 64, offset: 2368)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !13, line: 189, baseType: !265)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !123, file: !124, line: 100, baseType: !313, size: 64, offset: 2432)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !123, file: !124, line: 101, baseType: !174, size: 32, offset: 2496)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !123, file: !124, line: 101, baseType: !174, size: 32, offset: 2528)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !123, file: !124, line: 102, baseType: !300, size: 64, offset: 2560)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !123, file: !124, line: 102, baseType: !300, size: 64, offset: 2624)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !123, file: !124, line: 103, baseType: !319, size: 64, offset: 2688)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !13, line: 305, baseType: !311)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !123, file: !124, line: 103, baseType: !322, size: 64, offset: 2752)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !123, file: !124, line: 104, baseType: !260, size: 64, offset: 2816)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !123, file: !124, line: 105, baseType: !174, size: 32, offset: 2880)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !123, file: !124, line: 106, baseType: !326, size: 128, offset: 2944)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 128, elements: !333)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !124, line: 64, baseType: !329)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !124, line: 61, size: 128, elements: !330)
!330 = !{!331, !332}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !329, file: !124, line: 62, baseType: !253, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !329, file: !124, line: 63, baseType: !117, size: 64, offset: 64)
!333 = !{!334}
!334 = !DISubrange(count: 2)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !123, file: !124, line: 107, baseType: !336, size: 64, offset: 3072)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 64, elements: !333)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !123, file: !124, line: 108, baseType: !117, size: 64, offset: 3136)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !123, file: !124, line: 109, baseType: !339, size: 64, offset: 3200)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!137, !117}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !123, file: !124, line: 111, baseType: !174, size: 32, offset: 3264)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !123, file: !124, line: 112, baseType: !344, size: 320, offset: 3328)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !345, size: 320, elements: !348)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!137, !181, !121, !117}
!348 = !{!349}
!349 = !DISubrange(count: 5)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !123, file: !124, line: 113, baseType: !351, size: 320, offset: 3648)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 320, elements: !348)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!137, !121, !117}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !123, file: !124, line: 114, baseType: !356, size: 320, offset: 3968)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 320, elements: !348)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !123, file: !124, line: 115, baseType: !206, size: 32, offset: 4288)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !123, file: !124, line: 120, baseType: !221, size: 64, offset: 4352)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !123, file: !124, line: 121, baseType: !206, size: 32, offset: 4416)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEnum", file: !13, line: 58, baseType: !106)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectDestroyFunction", file: !124, line: 130, baseType: !237)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectViewFunction", file: !124, line: 131, baseType: !140)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !366, line: 1451, baseType: !253)
!366 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !114, line: 331, baseType: !368)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !114, line: 331, flags: DIFlagFwdDecl)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HTPrinted_t", file: !372, line: 11, baseType: !373)
!372 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/classes/viewer/interface/viewreg.c", directory: "/home/users/ndemeye/xSDK")
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HTPrinted_s", file: !372, line: 11, size: 320, elements: !374)
!374 = !{!375, !379, !380, !381, !382, !384, !387}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !373, file: !372, line: 11, baseType: !376, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !377, line: 166, baseType: !378)
!377 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/khash/khash.h", directory: "/home/users/ndemeye/xSDK")
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !377, line: 139, baseType: !7)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !373, file: !372, line: 11, baseType: !376, size: 32, offset: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !373, file: !372, line: 11, baseType: !376, size: 32, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !373, file: !372, line: 11, baseType: !376, size: 32, offset: 96)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !373, file: !372, line: 11, baseType: !383, size: 64, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !373, file: !372, line: 11, baseType: !385, size: 64, offset: 192)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_cstr_t", file: !377, line: 615, baseType: !110)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !373, file: !372, line: 11, baseType: !192, size: 64, offset: 256)
!388 = !{!0, !389, !400, !403, !406, !408}
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "PetscOptionsHelpPrintedSingleton", scope: !2, file: !372, line: 10, type: !391, isLocal: false, isDefinition: true)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionsHelpPrinted", file: !13, line: 680, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionsHelpPrinted", file: !372, line: 12, size: 128, elements: !394)
!394 = !{!395, !396}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "printed", scope: !393, file: !372, line: 13, baseType: !370, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "strings", scope: !393, file: !372, line: 14, baseType: !397, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !13, line: 678, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !13, line: 678, flags: DIFlagFwdDecl)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "noviewers", scope: !2, file: !372, line: 99, type: !402, isLocal: true, isDefinition: true)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 800, elements: !231)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression(DW_OP_constu, 4605110762971426980, DW_OP_stack_value))
!404 = distinct !DIGlobalVariable(name: "__ac_HASH_UPPER", scope: !2, file: !377, line: 196, type: !405, isLocal: true, isDefinition: true)
!405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !265)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "inoviewers", scope: !2, file: !372, line: 100, type: !174, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "noviewer", scope: !2, file: !372, line: 98, type: !206, isLocal: true, isDefinition: true)
!410 = !{i32 7, !"Dwarf Version", i32 4}
!411 = !{i32 2, !"Debug Info Version", i32 3}
!412 = !{i32 1, !"wchar_size", i32 4}
!413 = !{i32 7, !"PIC Level", i32 2}
!414 = !{i32 7, !"uwtable", i32 1}
!415 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!416 = distinct !DISubprogram(name: "PetscOptionsHelpPrintedDestroy", scope: !372, file: !372, line: 17, type: !417, scopeLine: 18, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !420)
!417 = !DISubroutineType(types: !418)
!418 = !{!137, !419}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!420 = !{!421, !422, !423, !425}
!421 = !DILocalVariable(name: "hp", arg: 1, scope: !416, file: !372, line: 17, type: !419)
!422 = !DILocalVariable(name: "ierr", scope: !416, file: !372, line: 19, type: !137)
!423 = !DILocalVariable(name: "ierr__", scope: !424, file: !372, line: 24, type: !137)
!424 = distinct !DILexicalBlock(scope: !416, file: !372, line: 24, column: 49)
!425 = !DILocalVariable(name: "ierr__", scope: !426, file: !372, line: 25, type: !137)
!426 = distinct !DILexicalBlock(scope: !416, file: !372, line: 25, column: 25)
!427 = !DILocation(line: 0, scope: !416)
!428 = !DILocation(line: 21, column: 3, scope: !429)
!429 = distinct !DILexicalBlock(scope: !430, file: !372, line: 21, column: 3)
!430 = distinct !DILexicalBlock(scope: !431, file: !372, line: 21, column: 3)
!431 = distinct !DILexicalBlock(scope: !416, file: !372, line: 21, column: 3)
!432 = !{!433, !433, i64 0}
!433 = !{!"any pointer", !434, i64 0}
!434 = !{!"omnipotent char", !435, i64 0}
!435 = !{!"Simple C/C++ TBAA"}
!436 = !DILocation(line: 21, column: 3, scope: !430)
!437 = !DILocation(line: 21, column: 3, scope: !438)
!438 = distinct !DILexicalBlock(scope: !439, file: !372, line: 21, column: 3)
!439 = distinct !DILexicalBlock(scope: !429, file: !372, line: 21, column: 3)
!440 = !{!441, !442, i64 1536}
!441 = !{!"", !434, i64 0, !434, i64 512, !434, i64 1024, !434, i64 1280, !442, i64 1536, !442, i64 1540, !434, i64 1544}
!442 = !{!"int", !434, i64 0}
!443 = !DILocation(line: 21, column: 3, scope: !439)
!444 = !DILocation(line: 21, column: 3, scope: !445)
!445 = distinct !DILexicalBlock(scope: !438, file: !372, line: 21, column: 3)
!446 = !{!442, !442, i64 0}
!447 = !{!441, !442, i64 1540}
!448 = !DILocation(line: 22, column: 8, scope: !449)
!449 = distinct !DILexicalBlock(scope: !416, file: !372, line: 22, column: 7)
