; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/tsirm/tsirm.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/tsirm/tsirm.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_communicator_t = type opaque

!91 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 70, baseType: !5, size: 32, elements: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!105 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 451, baseType: !26, size: 32, elements: !108)
!108 = !{!109, !110, !111, !112, !113}
!109 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!110 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!111 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!112 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!113 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !115, line: 663, baseType: !5, size: 32, elements: !116)
!115 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!116 = !{!117, !118, !119}
!117 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !121, line: 155, baseType: !5, size: 32, elements: !122)
!121 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!122 = !{!123, !124, !125, !126, !127}
!123 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!124 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!125 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!126 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!127 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!128 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 395, baseType: !26, size: 32, elements: !129)
!129 = !{!130, !131, !132, !133, !134, !135, !136}
!130 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!131 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!132 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!133 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!134 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!135 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!136 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!137 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 580, baseType: !5, size: 32, elements: !138)
!138 = !{!139, !140, !141, !142, !143, !144, !145, !146, !147}
!139 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!140 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!141 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!142 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!143 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!144 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!145 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!146 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!147 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!148 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !149, line: 424, baseType: !5, size: 32, elements: !150)
!149 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!150 = !{!151, !152}
!151 = !DIEnumerator(name: "MAT_FLUSH_ASSEMBLY", value: 1, isUnsigned: true)
!152 = !DIEnumerator(name: "MAT_FINAL_ASSEMBLY", value: 0, isUnsigned: true)
!153 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !149, line: 238, baseType: !5, size: 32, elements: !154)
!154 = !{!155, !156, !157, !158}
!155 = !DIEnumerator(name: "MAT_INITIAL_MATRIX", value: 0, isUnsigned: true)
!156 = !DIEnumerator(name: "MAT_REUSE_MATRIX", value: 1, isUnsigned: true)
!157 = !DIEnumerator(name: "MAT_IGNORE_MATRIX", value: 2, isUnsigned: true)
!158 = !DIEnumerator(name: "MAT_INPLACE_MATRIX", value: 3, isUnsigned: true)
!159 = !{!160, !185, !188, !192, !193, !169, !390, !393, !276, !26, !396, !228}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP_TSIRM", file: !162, line: 9, baseType: !163)
!162 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/tsirm/tsirm.c", directory: "/home/users/ndemeye/xSDK")
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !162, line: 4, size: 512, elements: !164)
!164 = !{!165, !168, !170, !171, !172, !173, !174, !175, !179, !180, !184}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "tol_ls", scope: !163, file: !162, line: 5, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !167)
!167 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "size_ls", scope: !163, file: !162, line: 6, baseType: !169, size: 32, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "maxiter_ls", scope: !163, file: !162, line: 6, baseType: !169, size: 32, offset: 96)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "cgls", scope: !163, file: !162, line: 6, baseType: !169, size: 32, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !163, file: !162, line: 6, baseType: !169, size: 32, offset: 160)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Istart", scope: !163, file: !162, line: 6, baseType: !169, size: 32, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Iend", scope: !163, file: !162, line: 6, baseType: !169, size: 32, offset: 224)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !163, file: !162, line: 7, baseType: !176, size: 64, offset: 256)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !149, line: 16, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !149, line: 16, flags: DIFlagFwdDecl)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "S", scope: !163, file: !162, line: 7, baseType: !176, size: 64, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "Alpha", scope: !163, file: !162, line: 8, baseType: !181, size: 64, offset: 384)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !121, line: 21, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !121, line: 21, flags: DIFlagFwdDecl)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !163, file: !162, line: 8, baseType: !181, size: 64, offset: 448)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !186, line: 46, baseType: !187)
!186 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!187 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !189, line: 330, baseType: !190)
!189 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !189, line: 330, flags: DIFlagFwdDecl)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !196, line: 73, size: 4480, elements: !197)
!196 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!197 = !{!198, !200, !249, !250, !251, !253, !254, !255, !256, !264, !265, !267, !271, !275, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !288, !289, !290, !292, !293, !295, !297, !298, !299, !300, !301, !303, !305, !306, !307, !308, !309, !312, !314, !315, !316, !326, !328, !329, !333, !334, !380, !385, !387, !388, !389}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !195, file: !196, line: 74, baseType: !199, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !195, file: !196, line: 75, baseType: !201, size: 448, offset: 64)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 448, elements: !247)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !196, line: 53, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !196, line: 45, size: 448, elements: !204)
!204 = !{!205, !211, !219, !224, !231, !235, !242}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !203, file: !196, line: 46, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!209, !193, !210}
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !203, file: !196, line: 47, baseType: !212, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!209, !193, !215}
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !216, line: 16, baseType: !217)
!216 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !216, line: 16, flags: DIFlagFwdDecl)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !203, file: !196, line: 48, baseType: !220, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!209, !223}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !203, file: !196, line: 49, baseType: !225, size: 64, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!209, !193, !228, !193}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !230)
!230 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !203, file: !196, line: 50, baseType: !232, size: 64, offset: 256)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!209, !193, !228, !223}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !203, file: !196, line: 51, baseType: !236, size: 64, offset: 320)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!209, !193, !228, !239}
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{null}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !203, file: !196, line: 52, baseType: !243, size: 64, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!209, !193, !228, !246}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!247 = !{!248}
!248 = !DISubrange(count: 1)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !195, file: !196, line: 76, baseType: !188, size: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !195, file: !196, line: 77, baseType: !169, size: 32, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !195, file: !196, line: 78, baseType: !252, size: 64, offset: 640)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !167)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !195, file: !196, line: 78, baseType: !252, size: 64, offset: 704)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !195, file: !196, line: 78, baseType: !252, size: 64, offset: 768)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !195, file: !196, line: 78, baseType: !252, size: 64, offset: 832)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !195, file: !196, line: 79, baseType: !257, size: 64, offset: 896)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !260, line: 27, baseType: !261)
!260 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !262, line: 43, baseType: !263)
!262 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!263 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !195, file: !196, line: 80, baseType: !169, size: 32, offset: 960)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !195, file: !196, line: 81, baseType: !266, size: 32, offset: 992)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !195, file: !196, line: 82, baseType: !268, size: 64, offset: 1024)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !195, file: !196, line: 83, baseType: !272, size: 64, offset: 1088)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !195, file: !196, line: 84, baseType: !276, size: 64, offset: 1152)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !195, file: !196, line: 85, baseType: !276, size: 64, offset: 1216)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !195, file: !196, line: 86, baseType: !276, size: 64, offset: 1280)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !195, file: !196, line: 87, baseType: !276, size: 64, offset: 1344)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !195, file: !196, line: 88, baseType: !193, size: 64, offset: 1408)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !195, file: !196, line: 89, baseType: !257, size: 64, offset: 1472)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !195, file: !196, line: 90, baseType: !276, size: 64, offset: 1536)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !195, file: !196, line: 91, baseType: !276, size: 64, offset: 1600)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !195, file: !196, line: 92, baseType: !169, size: 32, offset: 1664)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !195, file: !196, line: 93, baseType: !192, size: 64, offset: 1728)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !195, file: !196, line: 94, baseType: !287, size: 64, offset: 1792)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !258)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !195, file: !196, line: 95, baseType: !169, size: 32, offset: 1856)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !195, file: !196, line: 95, baseType: !169, size: 32, offset: 1888)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !195, file: !196, line: 96, baseType: !291, size: 64, offset: 1920)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !195, file: !196, line: 96, baseType: !291, size: 64, offset: 1984)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !195, file: !196, line: 97, baseType: !294, size: 64, offset: 2048)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !195, file: !196, line: 97, baseType: !296, size: 64, offset: 2112)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !195, file: !196, line: 98, baseType: !169, size: 32, offset: 2176)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !195, file: !196, line: 98, baseType: !169, size: 32, offset: 2208)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !195, file: !196, line: 99, baseType: !291, size: 64, offset: 2240)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !195, file: !196, line: 99, baseType: !291, size: 64, offset: 2304)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !195, file: !196, line: 100, baseType: !302, size: 64, offset: 2368)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !195, file: !196, line: 100, baseType: !304, size: 64, offset: 2432)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !195, file: !196, line: 101, baseType: !169, size: 32, offset: 2496)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !195, file: !196, line: 101, baseType: !169, size: 32, offset: 2528)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !195, file: !196, line: 102, baseType: !291, size: 64, offset: 2560)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !195, file: !196, line: 102, baseType: !291, size: 64, offset: 2624)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !195, file: !196, line: 103, baseType: !310, size: 64, offset: 2688)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !166)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !195, file: !196, line: 103, baseType: !313, size: 64, offset: 2752)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !195, file: !196, line: 104, baseType: !246, size: 64, offset: 2816)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !195, file: !196, line: 105, baseType: !169, size: 32, offset: 2880)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !195, file: !196, line: 106, baseType: !317, size: 128, offset: 2944)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !318, size: 128, elements: !324)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !196, line: 64, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !196, line: 61, size: 128, elements: !321)
!321 = !{!322, !323}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !320, file: !196, line: 62, baseType: !239, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !320, file: !196, line: 63, baseType: !192, size: 64, offset: 64)
!324 = !{!325}
!325 = !DISubrange(count: 2)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !195, file: !196, line: 107, baseType: !327, size: 64, offset: 3072)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 64, elements: !324)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !195, file: !196, line: 108, baseType: !192, size: 64, offset: 3136)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !195, file: !196, line: 109, baseType: !330, size: 64, offset: 3200)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{!209, !192}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !195, file: !196, line: 111, baseType: !169, size: 32, offset: 3264)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !195, file: !196, line: 112, baseType: !335, size: 320, offset: 3328)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 320, elements: !378)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!209, !339, !193, !192}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !342)
!342 = !{!343, !344, !366, !367, !368, !369, !370, !371, !372, !373, !374}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !341, file: !10, line: 100, baseType: !169, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !341, file: !10, line: 101, baseType: !345, size: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !348)
!348 = !{!349, !350, !351, !352, !353, !356, !357, !358, !359, !361, !363, !364, !365}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !347, file: !10, line: 84, baseType: !276, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !347, file: !10, line: 85, baseType: !276, size: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !347, file: !10, line: 86, baseType: !192, size: 64, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !347, file: !10, line: 87, baseType: !268, size: 64, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !347, file: !10, line: 88, baseType: !354, size: 64, offset: 256)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !228)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !347, file: !10, line: 89, baseType: !230, size: 8, offset: 320)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !347, file: !10, line: 90, baseType: !276, size: 64, offset: 384)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !347, file: !10, line: 91, baseType: !185, size: 64, offset: 448)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !347, file: !10, line: 92, baseType: !360, size: 32, offset: 512)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !347, file: !10, line: 93, baseType: !362, size: 32, offset: 544)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !347, file: !10, line: 94, baseType: !345, size: 64, offset: 576)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !347, file: !10, line: 95, baseType: !276, size: 64, offset: 640)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !347, file: !10, line: 96, baseType: !192, size: 64, offset: 704)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !341, file: !10, line: 102, baseType: !276, size: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !341, file: !10, line: 102, baseType: !276, size: 64, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !341, file: !10, line: 103, baseType: !276, size: 64, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !341, file: !10, line: 104, baseType: !188, size: 64, offset: 320)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !341, file: !10, line: 105, baseType: !360, size: 32, offset: 384)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !341, file: !10, line: 105, baseType: !360, size: 32, offset: 416)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !341, file: !10, line: 105, baseType: !360, size: 32, offset: 448)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !341, file: !10, line: 106, baseType: !193, size: 64, offset: 512)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !341, file: !10, line: 107, baseType: !375, size: 64, offset: 576)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!378 = !{!379}
!379 = !DISubrange(count: 5)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !195, file: !196, line: 113, baseType: !381, size: 320, offset: 3648)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !382, size: 320, elements: !378)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!209, !193, !192}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !195, file: !196, line: 114, baseType: !386, size: 320, offset: 3968)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 320, elements: !378)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !195, file: !196, line: 115, baseType: !360, size: 32, offset: 4288)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !195, file: !196, line: 120, baseType: !375, size: 64, offset: 4352)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !195, file: !196, line: 121, baseType: !360, size: 32, offset: 4416)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !189, line: 331, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !189, line: 331, flags: DIFlagFwdDecl)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !189, line: 338, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !189, line: 338, flags: DIFlagFwdDecl)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !25, line: 395, baseType: !128)
!397 = !{i32 7, !"Dwarf Version", i32 4}
!398 = !{i32 2, !"Debug Info Version", i32 3}
!399 = !{i32 1, !"wchar_size", i32 4}
!400 = !{i32 7, !"PIC Level", i32 2}
!401 = !{i32 7, !"uwtable", i32 1}
!402 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!403 = distinct !DISubprogram(name: "KSPSolve_TSIRM", scope: !162, file: !162, line: 43, type: !404, scopeLine: 44, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !641)
!404 = !DISubroutineType(types: !405)
!405 = !{!209, !406}
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !33, line: 22, baseType: !407)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !102, line: 75, size: 12800, elements: !409)
!409 = !{!410, !412, !456, !461, !462, !463, !464, !494, !495, !496, !497, !498, !500, !505, !506, !507, !508, !509, !510, !511, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !534, !540, !541, !542, !543, !548, !549, !550, !551, !556, !557, !558, !559, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !611, !612, !613, !614, !615, !622, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !638, !639, !640}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !408, file: !102, line: 76, baseType: !411, size: 4480)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !196, line: 122, baseType: !195)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !408, file: !102, line: 76, baseType: !413, size: 896, offset: 4480)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 896, elements: !247)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !102, line: 18, size: 896, elements: !415)
!415 = !{!416, !421, !425, !427, !431, !432, !436, !437, !441, !445, !449, !450, !454, !455}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !414, file: !102, line: 19, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!209, !406, !181, !420}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !414, file: !102, line: 22, baseType: !422, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!209, !406, !181, !181, !420}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !414, file: !102, line: 25, baseType: !426, size: 64, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !414, file: !102, line: 26, baseType: !428, size: 64, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!209, !406, !176, !176}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !414, file: !102, line: 27, baseType: !426, size: 64, offset: 256)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !414, file: !102, line: 28, baseType: !433, size: 64, offset: 320)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!209, !339, !406}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !414, file: !102, line: 29, baseType: !426, size: 64, offset: 384)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !414, file: !102, line: 30, baseType: !438, size: 64, offset: 448)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!209, !406, !302, !302}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !414, file: !102, line: 31, baseType: !442, size: 64, offset: 512)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!209, !406, !169, !302, !302, !294}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !414, file: !102, line: 32, baseType: !446, size: 64, offset: 576)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!209, !406, !360, !360, !294, !420, !302, !302}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !414, file: !102, line: 33, baseType: !426, size: 64, offset: 640)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !414, file: !102, line: 34, baseType: !451, size: 64, offset: 704)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!209, !406, !215}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !414, file: !102, line: 35, baseType: !426, size: 64, offset: 768)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !414, file: !102, line: 36, baseType: !451, size: 64, offset: 832)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !408, file: !102, line: 77, baseType: !457, size: 64, offset: 5376)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !458, line: 14, baseType: !459)
!458 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !458, line: 14, flags: DIFlagFwdDecl)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !408, file: !102, line: 78, baseType: !360, size: 32, offset: 5440)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !408, file: !102, line: 79, baseType: !360, size: 32, offset: 5472)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !408, file: !102, line: 81, baseType: !169, size: 32, offset: 5504)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !408, file: !102, line: 82, baseType: !465, size: 64, offset: 5568)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !33, line: 752, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !102, line: 54, size: 5184, elements: !468)
!468 = !{!469, !470, !490, !491, !492, !493}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !467, file: !102, line: 55, baseType: !411, size: 4480)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !467, file: !102, line: 55, baseType: !471, size: 448, offset: 4480)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !472, size: 448, elements: !247)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !102, line: 41, size: 448, elements: !473)
!473 = !{!474, !478, !479, !483, !484, !485, !489}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !472, file: !102, line: 42, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!209, !465, !181, !181}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !472, file: !102, line: 43, baseType: !475, size: 64, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !472, file: !102, line: 44, baseType: !480, size: 64, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!209, !465}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !472, file: !102, line: 45, baseType: !480, size: 64, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !472, file: !102, line: 46, baseType: !480, size: 64, offset: 256)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !472, file: !102, line: 47, baseType: !486, size: 64, offset: 320)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!209, !465, !215}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !472, file: !102, line: 48, baseType: !480, size: 64, offset: 384)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !467, file: !102, line: 56, baseType: !406, size: 64, offset: 4928)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !467, file: !102, line: 57, baseType: !176, size: 64, offset: 4992)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !467, file: !102, line: 58, baseType: !287, size: 64, offset: 5056)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !467, file: !102, line: 59, baseType: !192, size: 64, offset: 5120)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !408, file: !102, line: 83, baseType: !360, size: 32, offset: 5632)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !408, file: !102, line: 84, baseType: !360, size: 32, offset: 5664)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !408, file: !102, line: 85, baseType: !360, size: 32, offset: 5696)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !408, file: !102, line: 86, baseType: !360, size: 32, offset: 5728)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !408, file: !102, line: 87, baseType: !499, size: 32, offset: 5760)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !24)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !408, file: !102, line: 88, baseType: !501, size: 384, offset: 5792)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 384, elements: !502)
!502 = !{!503, !504}
!503 = !DISubrange(count: 4)
!504 = !DISubrange(count: 3)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !408, file: !102, line: 89, baseType: !166, size: 64, offset: 6208)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !408, file: !102, line: 90, baseType: !166, size: 64, offset: 6272)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !408, file: !102, line: 91, baseType: !166, size: 64, offset: 6336)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !408, file: !102, line: 92, baseType: !166, size: 64, offset: 6400)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !408, file: !102, line: 93, baseType: !166, size: 64, offset: 6464)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !408, file: !102, line: 94, baseType: !166, size: 64, offset: 6528)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !408, file: !102, line: 95, baseType: !512, size: 32, offset: 6592)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !33, line: 540, baseType: !32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !408, file: !102, line: 96, baseType: !360, size: 32, offset: 6624)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !408, file: !102, line: 98, baseType: !181, size: 64, offset: 6656)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !408, file: !102, line: 98, baseType: !181, size: 64, offset: 6720)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !408, file: !102, line: 102, baseType: !302, size: 64, offset: 6784)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !408, file: !102, line: 103, baseType: !302, size: 64, offset: 6848)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !408, file: !102, line: 104, baseType: !169, size: 32, offset: 6912)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !408, file: !102, line: 105, baseType: !169, size: 32, offset: 6944)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !408, file: !102, line: 106, baseType: !360, size: 32, offset: 6976)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !408, file: !102, line: 107, baseType: !302, size: 64, offset: 7040)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !408, file: !102, line: 108, baseType: !302, size: 64, offset: 7104)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !408, file: !102, line: 109, baseType: !169, size: 32, offset: 7168)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !408, file: !102, line: 110, baseType: !169, size: 32, offset: 7200)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !408, file: !102, line: 111, baseType: !360, size: 32, offset: 7232)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !408, file: !102, line: 113, baseType: !169, size: 32, offset: 7264)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !408, file: !102, line: 114, baseType: !360, size: 32, offset: 7296)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !408, file: !102, line: 117, baseType: !169, size: 32, offset: 7328)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !408, file: !102, line: 120, baseType: !530, size: 320, offset: 7360)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !531, size: 320, elements: !378)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!209, !406, !169, !166, !192}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !408, file: !102, line: 121, baseType: !535, size: 320, offset: 7680)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 320, elements: !378)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!209, !539}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !408, file: !102, line: 122, baseType: !386, size: 320, offset: 8000)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !408, file: !102, line: 123, baseType: !169, size: 32, offset: 8320)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !408, file: !102, line: 124, baseType: !360, size: 32, offset: 8352)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !408, file: !102, line: 126, baseType: !544, size: 320, offset: 8384)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 320, elements: !378)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{!209, !406, !192}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !408, file: !102, line: 127, baseType: !535, size: 320, offset: 8704)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !408, file: !102, line: 128, baseType: !386, size: 320, offset: 9024)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !408, file: !102, line: 129, baseType: !169, size: 32, offset: 9344)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !408, file: !102, line: 131, baseType: !552, size: 64, offset: 9408)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{!209, !406, !169, !166, !555, !192}
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !408, file: !102, line: 132, baseType: !330, size: 64, offset: 9472)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !408, file: !102, line: 133, baseType: !192, size: 64, offset: 9536)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !408, file: !102, line: 135, baseType: !192, size: 64, offset: 9600)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !408, file: !102, line: 137, baseType: !560, size: 64, offset: 9664)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !561)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !25, line: 11, flags: DIFlagFwdDecl)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !408, file: !102, line: 139, baseType: !192, size: 64, offset: 9728)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !408, file: !102, line: 142, baseType: !360, size: 32, offset: 9792)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !408, file: !102, line: 142, baseType: !360, size: 32, offset: 9824)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !408, file: !102, line: 142, baseType: !360, size: 32, offset: 9856)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !408, file: !102, line: 142, baseType: !360, size: 32, offset: 9888)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !408, file: !102, line: 142, baseType: !360, size: 32, offset: 9920)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !408, file: !102, line: 142, baseType: !360, size: 32, offset: 9952)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !408, file: !102, line: 142, baseType: !360, size: 32, offset: 9984)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !408, file: !102, line: 142, baseType: !360, size: 32, offset: 10016)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !408, file: !102, line: 142, baseType: !360, size: 32, offset: 10048)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !408, file: !102, line: 142, baseType: !360, size: 32, offset: 10080)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !408, file: !102, line: 142, baseType: !360, size: 32, offset: 10112)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !408, file: !102, line: 142, baseType: !360, size: 32, offset: 10144)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !408, file: !102, line: 142, baseType: !360, size: 32, offset: 10176)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !408, file: !102, line: 142, baseType: !360, size: 32, offset: 10208)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !408, file: !102, line: 143, baseType: !215, size: 64, offset: 10240)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !408, file: !102, line: 143, baseType: !215, size: 64, offset: 10304)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !408, file: !102, line: 143, baseType: !215, size: 64, offset: 10368)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !408, file: !102, line: 143, baseType: !215, size: 64, offset: 10432)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !408, file: !102, line: 143, baseType: !215, size: 64, offset: 10496)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !408, file: !102, line: 143, baseType: !215, size: 64, offset: 10560)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !408, file: !102, line: 143, baseType: !215, size: 64, offset: 10624)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !408, file: !102, line: 143, baseType: !215, size: 64, offset: 10688)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !408, file: !102, line: 143, baseType: !215, size: 64, offset: 10752)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !408, file: !102, line: 143, baseType: !215, size: 64, offset: 10816)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !408, file: !102, line: 143, baseType: !215, size: 64, offset: 10880)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !408, file: !102, line: 143, baseType: !215, size: 64, offset: 10944)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !408, file: !102, line: 143, baseType: !215, size: 64, offset: 11008)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !408, file: !102, line: 143, baseType: !215, size: 64, offset: 11072)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !408, file: !102, line: 144, baseType: !593, size: 32, offset: 11136)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !57, line: 162, baseType: !56)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !408, file: !102, line: 144, baseType: !593, size: 32, offset: 11168)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !408, file: !102, line: 144, baseType: !593, size: 32, offset: 11200)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !408, file: !102, line: 144, baseType: !593, size: 32, offset: 11232)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !408, file: !102, line: 144, baseType: !593, size: 32, offset: 11264)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !408, file: !102, line: 144, baseType: !593, size: 32, offset: 11296)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !408, file: !102, line: 144, baseType: !593, size: 32, offset: 11328)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !408, file: !102, line: 144, baseType: !593, size: 32, offset: 11360)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !408, file: !102, line: 144, baseType: !593, size: 32, offset: 11392)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !408, file: !102, line: 144, baseType: !593, size: 32, offset: 11424)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !408, file: !102, line: 144, baseType: !593, size: 32, offset: 11456)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !408, file: !102, line: 144, baseType: !593, size: 32, offset: 11488)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !408, file: !102, line: 144, baseType: !593, size: 32, offset: 11520)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !408, file: !102, line: 144, baseType: !593, size: 32, offset: 11552)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !408, file: !102, line: 147, baseType: !169, size: 32, offset: 11584)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !408, file: !102, line: 148, baseType: !420, size: 64, offset: 11648)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !408, file: !102, line: 150, baseType: !610, size: 32, offset: 11712)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !102, line: 70, baseType: !101)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !408, file: !102, line: 151, baseType: !360, size: 32, offset: 11744)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !408, file: !102, line: 153, baseType: !169, size: 32, offset: 11776)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !408, file: !102, line: 154, baseType: !169, size: 32, offset: 11808)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !408, file: !102, line: 156, baseType: !360, size: 32, offset: 11840)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !408, file: !102, line: 161, baseType: !616, size: 192, offset: 11904)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !408, file: !102, line: 157, size: 192, elements: !617)
!617 = !{!618, !619, !620, !621}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !616, file: !102, line: 158, baseType: !176, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !616, file: !102, line: 158, baseType: !176, size: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !616, file: !102, line: 159, baseType: !360, size: 32, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !616, file: !102, line: 160, baseType: !360, size: 32, offset: 160)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !408, file: !102, line: 163, baseType: !623, size: 32, offset: 12096)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !33, line: 451, baseType: !107)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !408, file: !102, line: 165, baseType: !499, size: 32, offset: 12128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !408, file: !102, line: 166, baseType: !623, size: 32, offset: 12160)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !408, file: !102, line: 171, baseType: !360, size: 32, offset: 12192)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !408, file: !102, line: 172, baseType: !360, size: 32, offset: 12224)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !408, file: !102, line: 173, baseType: !360, size: 32, offset: 12256)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !408, file: !102, line: 174, baseType: !181, size: 64, offset: 12288)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !408, file: !102, line: 175, baseType: !181, size: 64, offset: 12352)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !408, file: !102, line: 177, baseType: !169, size: 32, offset: 12416)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !408, file: !102, line: 178, baseType: !360, size: 32, offset: 12448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !408, file: !102, line: 180, baseType: !215, size: 64, offset: 12480)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !408, file: !102, line: 182, baseType: !635, size: 64, offset: 12544)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!209, !406, !181, !181, !192}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !408, file: !102, line: 183, baseType: !635, size: 64, offset: 12608)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !408, file: !102, line: 184, baseType: !192, size: 64, offset: 12672)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !408, file: !102, line: 184, baseType: !192, size: 64, offset: 12736)
!641 = !{!642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !664, !666, !668, !670, !672, !674, !676, !678, !684, !685, !686, !687, !689, !691, !697, !698, !702, !704, !707, !709, !711, !717, !719, !721, !723, !725, !727, !729, !731, !735, !737, !741, !744, !746, !750, !753, !755, !757, !759, !761, !763, !765, !767, !769}
!642 = !DILocalVariable(name: "ksp", arg: 1, scope: !403, file: !162, line: 43, type: !406)
!643 = !DILocalVariable(name: "ierr", scope: !403, file: !162, line: 45, type: !209)
!644 = !DILocalVariable(name: "tsirm", scope: !403, file: !162, line: 46, type: !160)
!645 = !DILocalVariable(name: "sub_ksp", scope: !403, file: !162, line: 47, type: !406)
!646 = !DILocalVariable(name: "pc", scope: !403, file: !162, line: 48, type: !560)
!647 = !DILocalVariable(name: "AS", scope: !403, file: !162, line: 49, type: !176)
!648 = !DILocalVariable(name: "x", scope: !403, file: !162, line: 50, type: !181)
!649 = !DILocalVariable(name: "b", scope: !403, file: !162, line: 50, type: !181)
!650 = !DILocalVariable(name: "array", scope: !403, file: !162, line: 51, type: !310)
!651 = !DILocalVariable(name: "norm", scope: !403, file: !162, line: 52, type: !166)
!652 = !DILocalVariable(name: "i", scope: !403, file: !162, line: 53, type: !169)
!653 = !DILocalVariable(name: "ind_row", scope: !403, file: !162, line: 53, type: !294)
!654 = !DILocalVariable(name: "first_iteration", scope: !403, file: !162, line: 53, type: !169)
!655 = !DILocalVariable(name: "its", scope: !403, file: !162, line: 53, type: !169)
!656 = !DILocalVariable(name: "total", scope: !403, file: !162, line: 53, type: !169)
!657 = !DILocalVariable(name: "col", scope: !403, file: !162, line: 53, type: !169)
!658 = !DILocalVariable(name: "restart", scope: !403, file: !162, line: 54, type: !169)
!659 = !DILocalVariable(name: "ksp_min", scope: !403, file: !162, line: 55, type: !406)
!660 = !DILocalVariable(name: "pc_min", scope: !403, file: !162, line: 56, type: !560)
!661 = !DILocalVariable(name: "isksp", scope: !403, file: !162, line: 57, type: !360)
!662 = !DILocalVariable(name: "ierr__", scope: !663, file: !162, line: 64, type: !209)
!663 = distinct !DILexicalBlock(scope: !403, file: !162, line: 64, column: 59)
!664 = !DILocalVariable(name: "ierr__", scope: !665, file: !162, line: 68, type: !209)
!665 = distinct !DILexicalBlock(scope: !403, file: !162, line: 68, column: 28)
!666 = !DILocalVariable(name: "ierr__", scope: !667, file: !162, line: 69, type: !209)
!667 = distinct !DILexicalBlock(scope: !403, file: !162, line: 69, column: 63)
!668 = !DILocalVariable(name: "ierr__", scope: !669, file: !162, line: 71, type: !209)
!669 = distinct !DILexicalBlock(scope: !403, file: !162, line: 71, column: 35)
!670 = !DILocalVariable(name: "ierr__", scope: !671, file: !162, line: 72, type: !209)
!671 = distinct !DILexicalBlock(scope: !403, file: !162, line: 72, column: 86)
!672 = !DILocalVariable(name: "ierr__", scope: !673, file: !162, line: 75, type: !209)
!673 = distinct !DILexicalBlock(scope: !403, file: !162, line: 75, column: 51)
!674 = !DILocalVariable(name: "ierr__", scope: !675, file: !162, line: 76, type: !209)
!675 = distinct !DILexicalBlock(scope: !403, file: !162, line: 76, column: 33)
!676 = !DILocalVariable(name: "ierr__", scope: !677, file: !162, line: 77, type: !209)
!677 = distinct !DILexicalBlock(scope: !403, file: !162, line: 77, column: 41)
!678 = !DILocalVariable(name: "ierr", scope: !679, file: !162, line: 78, type: !209)
!679 = distinct !DILexicalBlock(scope: !680, file: !162, line: 78, column: 3)
!680 = distinct !DILexicalBlock(scope: !681, file: !162, line: 78, column: 3)
!681 = distinct !DILexicalBlock(scope: !682, file: !162, line: 78, column: 3)
!682 = distinct !DILexicalBlock(scope: !683, file: !162, line: 78, column: 3)
