; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/linesearch/interface/taolinesearch.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/linesearch/interface/taolinesearch.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._n_PetscFunctionList = type opaque
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!14 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!24 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!25 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 6, baseType: !28, size: 32, elements: !29)
!27 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctaolinesearch.h", directory: "/home/users/ndemeye/xSDK")
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41}
!30 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_INFORNAN", value: -1)
!31 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_BADPARAMETER", value: -2)
!32 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_ASCENT", value: -3)
!33 = !DIEnumerator(name: "TAOLINESEARCH_CONTINUE_ITERATING", value: 0)
!34 = !DIEnumerator(name: "TAOLINESEARCH_SUCCESS", value: 1)
!35 = !DIEnumerator(name: "TAOLINESEARCH_SUCCESS_USER", value: 2)
!36 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_OTHER", value: 3)
!37 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_MAXFCN", value: 4)
!38 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_UPPERBOUND", value: 5)
!39 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_LOWERBOUND", value: 6)
!40 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_RTOL", value: 7)
!41 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_USER", value: 8)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 663, baseType: !7, size: 32, elements: !44)
!43 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!44 = !{!45, !46, !47}
!45 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!46 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!47 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !49)
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67}
!50 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!51 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!52 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!54 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!55 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!56 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!57 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!60 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!61 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!62 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!63 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!64 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!65 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!66 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!67 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 624, baseType: !7, size: 32, elements: !70)
!69 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!70 = !{!71, !72, !73, !74}
!71 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!72 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!73 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!74 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!75 = !{!76, !79, !80, !115, !165, !28, !141, !249, !283, !284, !285, !133, !286, !126}
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !69, line: 330, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !69, line: 330, flags: DIFlagFwdDecl)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !83, line: 73, size: 4480, elements: !84)
!83 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!84 = !{!85, !87, !136, !137, !139, !142, !143, !144, !145, !153, !154, !156, !160, !164, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !177, !178, !179, !181, !182, !184, !186, !187, !188, !189, !190, !193, !195, !196, !197, !198, !199, !202, !204, !205, !206, !216, !218, !219, !223, !224, !273, !278, !280, !281, !282}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !82, file: !83, line: 74, baseType: !86, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !82, file: !83, line: 75, baseType: !88, size: 448, offset: 64)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 448, elements: !134)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !83, line: 53, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !83, line: 45, size: 448, elements: !91)
!91 = !{!92, !98, !106, !111, !118, !122, !129}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !90, file: !83, line: 46, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!96, !80, !97}
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !90, file: !83, line: 47, baseType: !99, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!96, !80, !102}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !103, line: 16, baseType: !104)
!103 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !103, line: 16, flags: DIFlagFwdDecl)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !90, file: !83, line: 48, baseType: !107, size: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!96, !110}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !90, file: !83, line: 49, baseType: !112, size: 64, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!96, !80, !115, !80}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!117 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !90, file: !83, line: 50, baseType: !119, size: 64, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!96, !80, !115, !110}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !90, file: !83, line: 51, baseType: !123, size: 64, offset: 320)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!96, !80, !115, !126}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{null}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !90, file: !83, line: 52, baseType: !130, size: 64, offset: 384)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!96, !80, !115, !133}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!134 = !{!135}
!135 = !DISubrange(count: 1)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !82, file: !83, line: 76, baseType: !76, size: 64, offset: 512)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !82, file: !83, line: 77, baseType: !138, size: 32, offset: 576)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !82, file: !83, line: 78, baseType: !140, size: 64, offset: 640)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !141)
!141 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !82, file: !83, line: 78, baseType: !140, size: 64, offset: 704)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !82, file: !83, line: 78, baseType: !140, size: 64, offset: 768)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !82, file: !83, line: 78, baseType: !140, size: 64, offset: 832)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !82, file: !83, line: 79, baseType: !146, size: 64, offset: 896)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !149, line: 27, baseType: !150)
!149 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !151, line: 43, baseType: !152)
!151 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!152 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !82, file: !83, line: 80, baseType: !138, size: 32, offset: 960)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !82, file: !83, line: 81, baseType: !155, size: 32, offset: 992)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !82, file: !83, line: 82, baseType: !157, size: 64, offset: 1024)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !82, file: !83, line: 83, baseType: !161, size: 64, offset: 1088)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !82, file: !83, line: 84, baseType: !165, size: 64, offset: 1152)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !82, file: !83, line: 85, baseType: !165, size: 64, offset: 1216)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !82, file: !83, line: 86, baseType: !165, size: 64, offset: 1280)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !82, file: !83, line: 87, baseType: !165, size: 64, offset: 1344)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !82, file: !83, line: 88, baseType: !80, size: 64, offset: 1408)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !82, file: !83, line: 89, baseType: !146, size: 64, offset: 1472)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !82, file: !83, line: 90, baseType: !165, size: 64, offset: 1536)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !82, file: !83, line: 91, baseType: !165, size: 64, offset: 1600)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !82, file: !83, line: 92, baseType: !138, size: 32, offset: 1664)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !82, file: !83, line: 93, baseType: !79, size: 64, offset: 1728)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !82, file: !83, line: 94, baseType: !176, size: 64, offset: 1792)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !147)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !82, file: !83, line: 95, baseType: !138, size: 32, offset: 1856)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !82, file: !83, line: 95, baseType: !138, size: 32, offset: 1888)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !82, file: !83, line: 96, baseType: !180, size: 64, offset: 1920)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !82, file: !83, line: 96, baseType: !180, size: 64, offset: 1984)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !82, file: !83, line: 97, baseType: !183, size: 64, offset: 2048)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !82, file: !83, line: 97, baseType: !185, size: 64, offset: 2112)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !82, file: !83, line: 98, baseType: !138, size: 32, offset: 2176)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !82, file: !83, line: 98, baseType: !138, size: 32, offset: 2208)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !82, file: !83, line: 99, baseType: !180, size: 64, offset: 2240)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !82, file: !83, line: 99, baseType: !180, size: 64, offset: 2304)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !82, file: !83, line: 100, baseType: !191, size: 64, offset: 2368)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !141)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !82, file: !83, line: 100, baseType: !194, size: 64, offset: 2432)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !82, file: !83, line: 101, baseType: !138, size: 32, offset: 2496)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !82, file: !83, line: 101, baseType: !138, size: 32, offset: 2528)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !82, file: !83, line: 102, baseType: !180, size: 64, offset: 2560)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !82, file: !83, line: 102, baseType: !180, size: 64, offset: 2624)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !82, file: !83, line: 103, baseType: !200, size: 64, offset: 2688)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !192)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !82, file: !83, line: 103, baseType: !203, size: 64, offset: 2752)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !82, file: !83, line: 104, baseType: !133, size: 64, offset: 2816)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !82, file: !83, line: 105, baseType: !138, size: 32, offset: 2880)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !82, file: !83, line: 106, baseType: !207, size: 128, offset: 2944)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 128, elements: !214)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !83, line: 64, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !83, line: 61, size: 128, elements: !211)
!211 = !{!212, !213}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !210, file: !83, line: 62, baseType: !126, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !210, file: !83, line: 63, baseType: !79, size: 64, offset: 64)
!214 = !{!215}
!215 = !DISubrange(count: 2)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !82, file: !83, line: 107, baseType: !217, size: 64, offset: 3072)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 64, elements: !214)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !82, file: !83, line: 108, baseType: !79, size: 64, offset: 3136)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !82, file: !83, line: 109, baseType: !220, size: 64, offset: 3200)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!96, !79}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !82, file: !83, line: 111, baseType: !138, size: 32, offset: 3264)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !82, file: !83, line: 112, baseType: !225, size: 320, offset: 3328)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 320, elements: !271)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!96, !229, !80, !79}
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !232)
!232 = !{!233, !234, !259, !260, !261, !262, !263, !264, !265, !266, !267}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !231, file: !12, line: 100, baseType: !138, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !231, file: !12, line: 101, baseType: !235, size: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !246, !247, !248, !252, !254, !256, !257, !258}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !237, file: !12, line: 84, baseType: !165, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !237, file: !12, line: 85, baseType: !165, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !237, file: !12, line: 86, baseType: !79, size: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !237, file: !12, line: 87, baseType: !157, size: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !237, file: !12, line: 88, baseType: !244, size: 64, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !237, file: !12, line: 89, baseType: !117, size: 8, offset: 320)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !237, file: !12, line: 90, baseType: !165, size: 64, offset: 384)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !237, file: !12, line: 91, baseType: !249, size: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !250, line: 46, baseType: !251)
!250 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!251 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !237, file: !12, line: 92, baseType: !253, size: 32, offset: 512)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !237, file: !12, line: 93, baseType: !255, size: 32, offset: 544)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !237, file: !12, line: 94, baseType: !235, size: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !237, file: !12, line: 95, baseType: !165, size: 64, offset: 640)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !237, file: !12, line: 96, baseType: !79, size: 64, offset: 704)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !231, file: !12, line: 102, baseType: !165, size: 64, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !231, file: !12, line: 102, baseType: !165, size: 64, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !231, file: !12, line: 103, baseType: !165, size: 64, offset: 256)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !231, file: !12, line: 104, baseType: !76, size: 64, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !231, file: !12, line: 105, baseType: !253, size: 32, offset: 384)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !231, file: !12, line: 105, baseType: !253, size: 32, offset: 416)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !231, file: !12, line: 105, baseType: !253, size: 32, offset: 448)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !231, file: !12, line: 106, baseType: !80, size: 64, offset: 512)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !231, file: !12, line: 107, baseType: !268, size: 64, offset: 576)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!271 = !{!272}
!272 = !DISubrange(count: 5)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !82, file: !83, line: 113, baseType: !274, size: 320, offset: 3648)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 320, elements: !271)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!96, !80, !79}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !82, file: !83, line: 114, baseType: !279, size: 320, offset: 3968)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 320, elements: !271)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !82, file: !83, line: 115, baseType: !253, size: 32, offset: 4288)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !82, file: !83, line: 120, baseType: !268, size: 64, offset: 4352)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !82, file: !83, line: 121, baseType: !253, size: 32, offset: 4416)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectDestroyFunction", file: !83, line: 130, baseType: !107)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectViewFunction", file: !83, line: 131, baseType: !99)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !287, line: 1451, baseType: !126)
!287 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!288 = !{!0, !289, !292, !296}
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "TAOLINESEARCH_CLASSID", scope: !2, file: !291, line: 6, type: !86, isLocal: false, isDefinition: true)
!291 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/tao/linesearch/interface/taolinesearch.c", directory: "/home/users/ndemeye/xSDK")
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "TAOLINESEARCH_Apply", scope: !2, file: !291, line: 8, type: !294, isLocal: false, isDefinition: true)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogEvent", file: !295, line: 80, baseType: !28)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "TAOLINESEARCH_Eval", scope: !2, file: !291, line: 9, type: !294, isLocal: false, isDefinition: true)
!298 = !{i32 7, !"Dwarf Version", i32 4}
!299 = !{i32 2, !"Debug Info Version", i32 3}
!300 = !{i32 1, !"wchar_size", i32 4}
!301 = !{i32 7, !"PIC Level", i32 2}
!302 = !{i32 7, !"uwtable", i32 1}
!303 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!304 = distinct !DISubprogram(name: "TaoLineSearchViewFromOptions", scope: !291, file: !291, line: 24, type: !305, scopeLine: 25, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !397)
!305 = !DISubroutineType(types: !306)
!306 = !{!96, !307, !80, !115}
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearch", file: !27, line: 5, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TaoLineSearch", file: !310, line: 22, size: 7104, elements: !311)
!310 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/taolinesearchimpl.h", directory: "/home/users/ndemeye/xSDK")
!311 = !{!312, !314, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !387, !388, !389, !390, !391, !392}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !309, file: !310, line: 23, baseType: !313, size: 4480)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !83, line: 122, baseType: !82)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !309, file: !310, line: 23, baseType: !315, size: 704, offset: 4480)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 704, elements: !134)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TaoLineSearchOps", file: !310, line: 8, size: 704, elements: !317)
!317 = !{!318, !326, !330, !334, !338, !342, !346, !350, !354, !355, !356}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !316, file: !310, line: 9, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!96, !307, !322, !191, !79}
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !323, line: 21, baseType: !324)
!323 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !323, line: 21, flags: DIFlagFwdDecl)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "computegradient", scope: !316, file: !310, line: 10, baseType: !327, size: 64, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!96, !307, !322, !322, !79}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgradient", scope: !316, file: !310, line: 11, baseType: !331, size: 64, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!96, !307, !322, !191, !322, !79}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgts", scope: !316, file: !310, line: 12, baseType: !335, size: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!96, !307, !322, !322, !191, !191, !79}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !316, file: !310, line: 13, baseType: !339, size: 64, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!96, !307}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !316, file: !310, line: 14, baseType: !343, size: 64, offset: 320)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!96, !307, !322, !191, !322, !322}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !316, file: !310, line: 15, baseType: !347, size: 64, offset: 384)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!96, !307, !102}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !316, file: !310, line: 16, baseType: !351, size: 64, offset: 448)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!96, !229, !307}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !316, file: !310, line: 17, baseType: !339, size: 64, offset: 512)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !316, file: !310, line: 18, baseType: !339, size: 64, offset: 576)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !316, file: !310, line: 19, baseType: !339, size: 64, offset: 640)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "userctx_func", scope: !309, file: !310, line: 24, baseType: !79, size: 64, offset: 5184)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "userctx_grad", scope: !309, file: !310, line: 25, baseType: !79, size: 64, offset: 5248)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "userctx_funcgrad", scope: !309, file: !310, line: 26, baseType: !79, size: 64, offset: 5312)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "userctx_funcgts", scope: !309, file: !310, line: 27, baseType: !79, size: 64, offset: 5376)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "usemonitor", scope: !309, file: !310, line: 28, baseType: !253, size: 32, offset: 5440)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !309, file: !310, line: 29, baseType: !102, size: 64, offset: 5504)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !309, file: !310, line: 31, baseType: !253, size: 32, offset: 5568)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "usegts", scope: !309, file: !310, line: 32, baseType: !253, size: 32, offset: 5600)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "usetaoroutines", scope: !309, file: !310, line: 33, baseType: !253, size: 32, offset: 5632)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "hasobjective", scope: !309, file: !310, line: 34, baseType: !253, size: 32, offset: 5664)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "hasgradient", scope: !309, file: !310, line: 35, baseType: !253, size: 32, offset: 5696)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "hasobjectiveandgradient", scope: !309, file: !310, line: 36, baseType: !253, size: 32, offset: 5728)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !309, file: !310, line: 37, baseType: !79, size: 64, offset: 5760)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !309, file: !310, line: 40, baseType: !322, size: 64, offset: 5824)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !309, file: !310, line: 41, baseType: !322, size: 64, offset: 5888)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "bounded", scope: !309, file: !310, line: 42, baseType: !138, size: 32, offset: 5952)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "start_x", scope: !309, file: !310, line: 44, baseType: !322, size: 64, offset: 6016)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "stepdirection", scope: !309, file: !310, line: 45, baseType: !322, size: 64, offset: 6080)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "f_fullstep", scope: !309, file: !310, line: 46, baseType: !192, size: 64, offset: 6144)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "new_f", scope: !309, file: !310, line: 47, baseType: !192, size: 64, offset: 6208)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "new_x", scope: !309, file: !310, line: 48, baseType: !322, size: 64, offset: 6272)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "new_g", scope: !309, file: !310, line: 49, baseType: !322, size: 64, offset: 6336)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !309, file: !310, line: 51, baseType: !192, size: 64, offset: 6400)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "initstep", scope: !309, file: !310, line: 52, baseType: !192, size: 64, offset: 6464)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !309, file: !310, line: 54, baseType: !138, size: 32, offset: 6528)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "nfeval", scope: !309, file: !310, line: 55, baseType: !138, size: 32, offset: 6560)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ngeval", scope: !309, file: !310, line: 56, baseType: !138, size: 32, offset: 6592)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "nfgeval", scope: !309, file: !310, line: 57, baseType: !138, size: 32, offset: 6624)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !309, file: !310, line: 58, baseType: !386, size: 32, offset: 6656)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearchConvergedReason", file: !27, line: 19, baseType: !26)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !309, file: !310, line: 60, baseType: !192, size: 64, offset: 6720)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ftol", scope: !309, file: !310, line: 61, baseType: !192, size: 64, offset: 6784)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "gtol", scope: !309, file: !310, line: 62, baseType: !192, size: 64, offset: 6848)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "stepmin", scope: !309, file: !310, line: 63, baseType: !192, size: 64, offset: 6912)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "stepmax", scope: !309, file: !310, line: 64, baseType: !192, size: 64, offset: 6976)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "tao", scope: !309, file: !310, line: 66, baseType: !393, size: 64, offset: 7040)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tao", file: !394, line: 118, baseType: !395)
!394 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctao.h", directory: "/home/users/ndemeye/xSDK")
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Tao", file: !394, line: 118, flags: DIFlagFwdDecl)
!397 = !{!398, !399, !400, !401, !402}
!398 = !DILocalVariable(name: "A", arg: 1, scope: !304, file: !291, line: 24, type: !307)
!399 = !DILocalVariable(name: "obj", arg: 2, scope: !304, file: !291, line: 24, type: !80)
!400 = !DILocalVariable(name: "name", arg: 3, scope: !304, file: !291, line: 24, type: !115)
!401 = !DILocalVariable(name: "ierr", scope: !304, file: !291, line: 26, type: !96)
!402 = !DILocalVariable(name: "ierr__", scope: !403, file: !291, line: 30, type: !96)
!403 = distinct !DILexicalBlock(scope: !304, file: !291, line: 30, column: 62)
!404 = !DILocation(line: 0, scope: !304)
!405 = !DILocation(line: 28, column: 3, scope: !406)
!406 = distinct !DILexicalBlock(scope: !407, file: !291, line: 28, column: 3)
!407 = distinct !DILexicalBlock(scope: !408, file: !291, line: 28, column: 3)
!408 = distinct !DILexicalBlock(scope: !304, file: !291, line: 28, column: 3)
!409 = !{!410, !410, i64 0}
!410 = !{!"any pointer", !411, i64 0}
!411 = !{!"omnipotent char", !412, i64 0}
!412 = !{!"Simple C/C++ TBAA"}
!413 = !DILocation(line: 28, column: 3, scope: !407)
!414 = !DILocation(line: 28, column: 3, scope: !415)
!415 = distinct !DILexicalBlock(scope: !416, file: !291, line: 28, column: 3)
!416 = distinct !DILexicalBlock(scope: !406, file: !291, line: 28, column: 3)
!417 = !{!418, !419, i64 1536}
!418 = !{!"", !411, i64 0, !411, i64 512, !411, i64 1024, !411, i64 1280, !419, i64 1536, !419, i64 1540, !411, i64 1544}
!419 = !{!"int", !411, i64 0}
!420 = !DILocation(line: 28, column: 3, scope: !416)
!421 = !DILocation(line: 28, column: 3, scope: !422)
!422 = distinct !DILexicalBlock(scope: !415, file: !291, line: 28, column: 3)
!423 = !{!419, !419, i64 0}
!424 = !{!418, !419, i64 1540}
!425 = !DILocation(line: 29, column: 3, scope: !426)
!426 = distinct !DILexicalBlock(scope: !427, file: !291, line: 29, column: 3)
!427 = distinct !DILexicalBlock(scope: !304, file: !291, line: 29, column: 3)
!428 = !DILocation(line: 29, column: 3, scope: !427)
!429 = !DILocation(line: 29, column: 3, scope: !430)
!430 = distinct !DILexicalBlock(scope: !427, file: !291, line: 29, column: 3)
!431 = !DILocation(line: 29, column: 3, scope: !432)
!432 = distinct !DILexicalBlock(scope: !427, file: !291, line: 29, column: 3)
!433 = !{!434, !419, i64 0}
!434 = !{!"_p_PetscObject", !419, i64 0, !411, i64 8, !410, i64 64, !419, i64 72, !435, i64 80, !435, i64 88, !435, i64 96, !435, i64 104, !436, i64 112, !419, i64 120, !419, i64 124, !410, i64 128, !410, i64 136, !410, i64 144, !410, i64 152, !410, i64 160, !410, i64 168, !410, i64 176, !436, i64 184, !410, i64 192, !410, i64 200, !419, i64 208, !410, i64 216, !436, i64 224, !419, i64 232, !419, i64 236, !410, i64 240, !410, i64 248, !410, i64 256, !410, i64 264, !419, i64 272, !419, i64 276, !410, i64 280, !410, i64 288, !410, i64 296, !410, i64 304, !419, i64 312, !419, i64 316, !410, i64 320, !410, i64 328, !410, i64 336, !410, i64 344, !410, i64 352, !419, i64 360, !411, i64 368, !411, i64 384, !410, i64 392, !410, i64 400, !419, i64 408, !411, i64 416, !411, i64 456, !411, i64 496, !411, i64 536, !410, i64 544, !411, i64 552}
!435 = !{!"double", !411, i64 0}
!436 = !{!"long", !411, i64 0}
!437 = !DILocation(line: 29, column: 3, scope: !438)
!438 = distinct !DILexicalBlock(scope: !439, file: !291, line: 29, column: 3)
!439 = distinct !DILexicalBlock(scope: !432, file: !291, line: 29, column: 3)
!440 = !DILocation(line: 29, column: 3, scope: !439)
!441 = !DILocation(line: 30, column: 10, scope: !304)
