; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/utils/lmvm/diagbrdn/diagbrdn.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/utils/lmvm/diagbrdn/diagbrdn.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!263 = !DIEnumerator(name: "MATOP_CREATE_SUB_MATRICES_MPI", value: 128, isUnsigned: true)
!264 = !DIEnumerator(name: "MATOP_SET_VALUES_BATCH", value: 129, isUnsigned: true)
!265 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT", value: 130, isUnsigned: true)
!266 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_SYMBO", value: 131, isUnsigned: true)
!267 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_NUMER", value: 132, isUnsigned: true)
!268 = !DIEnumerator(name: "MATOP_TRANSPOSE_COLORING_CREAT", value: 133, isUnsigned: true)
!269 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_SPT", value: 134, isUnsigned: true)
!270 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_DEN", value: 135, isUnsigned: true)
!271 = !DIEnumerator(name: "MATOP_RART", value: 136, isUnsigned: true)
!272 = !DIEnumerator(name: "MATOP_RART_SYMBOLIC", value: 137, isUnsigned: true)
!273 = !DIEnumerator(name: "MATOP_RART_NUMERIC", value: 138, isUnsigned: true)
!274 = !DIEnumerator(name: "MATOP_SET_BLOCK_SIZES", value: 139, isUnsigned: true)
!275 = !DIEnumerator(name: "MATOP_AYPX", value: 140, isUnsigned: true)
!276 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!277 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!278 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!279 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!280 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!281 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!282 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 161, baseType: !5, size: 32, elements: !283)
!283 = !{!284, !285, !286, !287, !288, !289, !290, !291}
!284 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!285 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!286 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!287 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!288 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!289 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!290 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!291 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!292 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 1265, baseType: !5, size: 32, elements: !293)
!293 = !{!294, !295, !296}
!294 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!295 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!296 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!297 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 1203, baseType: !5, size: 32, elements: !298)
!298 = !{!299, !300, !301, !302, !303}
!299 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!300 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!301 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!302 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!303 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!304 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 187, baseType: !5, size: 32, elements: !305)
!305 = !{!306, !307, !308, !309, !310, !311, !312}
!306 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!307 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!308 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!309 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!310 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!311 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!312 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!313 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !314, line: 663, baseType: !5, size: 32, elements: !315)
!314 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!315 = !{!316, !317, !318}
!316 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!317 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!318 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!319 = !{!320, !324, !325, !528, !494, !360, !1595, !386}
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !321, line: 330, baseType: !322)
!321 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !321, line: 330, flags: DIFlagFwdDecl)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !328, line: 73, size: 4480, elements: !329)
!328 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!329 = !{!330, !332, !381, !382, !384, !387, !388, !389, !390, !398, !399, !401, !405, !409, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !422, !423, !424, !426, !427, !429, !431, !432, !433, !434, !435, !438, !440, !441, !442, !443, !444, !447, !449, !450, !451, !461, !463, !464, !468, !469, !518, !523, !525, !526, !527}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !327, file: !328, line: 74, baseType: !331, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !91)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !327, file: !328, line: 75, baseType: !333, size: 448, offset: 64)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 448, elements: !379)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !328, line: 53, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !328, line: 45, size: 448, elements: !336)
!336 = !{!337, !343, !351, !356, !363, !367, !374}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !335, file: !328, line: 46, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!341, !325, !342}
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !91)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !335, file: !328, line: 47, baseType: !344, size: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!341, !325, !347}
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !348, line: 16, baseType: !349)
!348 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !348, line: 16, flags: DIFlagFwdDecl)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !335, file: !328, line: 48, baseType: !352, size: 64, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!341, !355}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !335, file: !328, line: 49, baseType: !357, size: 64, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!341, !325, !360, !325}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !362)
!362 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !335, file: !328, line: 50, baseType: !364, size: 64, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!341, !325, !360, !355}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !335, file: !328, line: 51, baseType: !368, size: 64, offset: 320)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!341, !325, !360, !371}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{null}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !335, file: !328, line: 52, baseType: !375, size: 64, offset: 384)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!341, !325, !360, !378}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!379 = !{!380}
!380 = !DISubrange(count: 1)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !327, file: !328, line: 76, baseType: !320, size: 64, offset: 512)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !327, file: !328, line: 77, baseType: !383, size: 32, offset: 576)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !91)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !327, file: !328, line: 78, baseType: !385, size: 64, offset: 640)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !386)
!386 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !327, file: !328, line: 78, baseType: !385, size: 64, offset: 704)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !327, file: !328, line: 78, baseType: !385, size: 64, offset: 768)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !327, file: !328, line: 78, baseType: !385, size: 64, offset: 832)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !327, file: !328, line: 79, baseType: !391, size: 64, offset: 896)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !394, line: 27, baseType: !395)
!394 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !396, line: 43, baseType: !397)
!396 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!397 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !327, file: !328, line: 80, baseType: !383, size: 32, offset: 960)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !327, file: !328, line: 81, baseType: !400, size: 32, offset: 992)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !91)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !327, file: !328, line: 82, baseType: !402, size: 64, offset: 1024)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !327, file: !328, line: 83, baseType: !406, size: 64, offset: 1088)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !407)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !327, file: !328, line: 84, baseType: !410, size: 64, offset: 1152)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !327, file: !328, line: 85, baseType: !410, size: 64, offset: 1216)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !327, file: !328, line: 86, baseType: !410, size: 64, offset: 1280)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !327, file: !328, line: 87, baseType: !410, size: 64, offset: 1344)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !327, file: !328, line: 88, baseType: !325, size: 64, offset: 1408)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !327, file: !328, line: 89, baseType: !391, size: 64, offset: 1472)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !327, file: !328, line: 90, baseType: !410, size: 64, offset: 1536)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !327, file: !328, line: 91, baseType: !410, size: 64, offset: 1600)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !327, file: !328, line: 92, baseType: !383, size: 32, offset: 1664)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !327, file: !328, line: 93, baseType: !324, size: 64, offset: 1728)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !327, file: !328, line: 94, baseType: !421, size: 64, offset: 1792)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !392)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !327, file: !328, line: 95, baseType: !383, size: 32, offset: 1856)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !327, file: !328, line: 95, baseType: !383, size: 32, offset: 1888)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !327, file: !328, line: 96, baseType: !425, size: 64, offset: 1920)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !327, file: !328, line: 96, baseType: !425, size: 64, offset: 1984)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !327, file: !328, line: 97, baseType: !428, size: 64, offset: 2048)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !327, file: !328, line: 97, baseType: !430, size: 64, offset: 2112)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !327, file: !328, line: 98, baseType: !383, size: 32, offset: 2176)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !327, file: !328, line: 98, baseType: !383, size: 32, offset: 2208)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !327, file: !328, line: 99, baseType: !425, size: 64, offset: 2240)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !327, file: !328, line: 99, baseType: !425, size: 64, offset: 2304)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !327, file: !328, line: 100, baseType: !436, size: 64, offset: 2368)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !386)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !327, file: !328, line: 100, baseType: !439, size: 64, offset: 2432)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !327, file: !328, line: 101, baseType: !383, size: 32, offset: 2496)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !327, file: !328, line: 101, baseType: !383, size: 32, offset: 2528)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !327, file: !328, line: 102, baseType: !425, size: 64, offset: 2560)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !327, file: !328, line: 102, baseType: !425, size: 64, offset: 2624)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !327, file: !328, line: 103, baseType: !445, size: 64, offset: 2688)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !437)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !327, file: !328, line: 103, baseType: !448, size: 64, offset: 2752)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !327, file: !328, line: 104, baseType: !378, size: 64, offset: 2816)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !327, file: !328, line: 105, baseType: !383, size: 32, offset: 2880)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !327, file: !328, line: 106, baseType: !452, size: 128, offset: 2944)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !453, size: 128, elements: !459)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !328, line: 64, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !328, line: 61, size: 128, elements: !456)
!456 = !{!457, !458}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !455, file: !328, line: 62, baseType: !371, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !455, file: !328, line: 63, baseType: !324, size: 64, offset: 64)
!459 = !{!460}
!460 = !DISubrange(count: 2)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !327, file: !328, line: 107, baseType: !462, size: 64, offset: 3072)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 64, elements: !459)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !327, file: !328, line: 108, baseType: !324, size: 64, offset: 3136)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !327, file: !328, line: 109, baseType: !465, size: 64, offset: 3200)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!341, !324}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !327, file: !328, line: 111, baseType: !383, size: 32, offset: 3264)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !327, file: !328, line: 112, baseType: !470, size: 320, offset: 3328)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 320, elements: !516)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!341, !474, !325, !324}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !477)
!477 = !{!478, !479, !504, !505, !506, !507, !508, !509, !510, !511, !512}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !476, file: !10, line: 100, baseType: !383, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !476, file: !10, line: 101, baseType: !480, size: 64, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !481)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !483)
!483 = !{!484, !485, !486, !487, !488, !491, !492, !493, !497, !499, !501, !502, !503}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !482, file: !10, line: 84, baseType: !410, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !482, file: !10, line: 85, baseType: !410, size: 64, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !482, file: !10, line: 86, baseType: !324, size: 64, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !482, file: !10, line: 87, baseType: !402, size: 64, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !482, file: !10, line: 88, baseType: !489, size: 64, offset: 256)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !360)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !482, file: !10, line: 89, baseType: !362, size: 8, offset: 320)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !482, file: !10, line: 90, baseType: !410, size: 64, offset: 384)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !482, file: !10, line: 91, baseType: !494, size: 64, offset: 448)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !495, line: 46, baseType: !496)
!495 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!496 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !482, file: !10, line: 92, baseType: !498, size: 32, offset: 512)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !482, file: !10, line: 93, baseType: !500, size: 32, offset: 544)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !482, file: !10, line: 94, baseType: !480, size: 64, offset: 576)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !482, file: !10, line: 95, baseType: !410, size: 64, offset: 640)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !482, file: !10, line: 96, baseType: !324, size: 64, offset: 704)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !476, file: !10, line: 102, baseType: !410, size: 64, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !476, file: !10, line: 102, baseType: !410, size: 64, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !476, file: !10, line: 103, baseType: !410, size: 64, offset: 256)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !476, file: !10, line: 104, baseType: !320, size: 64, offset: 320)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !476, file: !10, line: 105, baseType: !498, size: 32, offset: 384)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !476, file: !10, line: 105, baseType: !498, size: 32, offset: 416)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !476, file: !10, line: 105, baseType: !498, size: 32, offset: 448)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !476, file: !10, line: 106, baseType: !325, size: 64, offset: 512)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !476, file: !10, line: 107, baseType: !513, size: 64, offset: 576)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !514)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!516 = !{!517}
!517 = !DISubrange(count: 5)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !327, file: !328, line: 113, baseType: !519, size: 320, offset: 3648)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !520, size: 320, elements: !516)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!341, !325, !324}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !327, file: !328, line: 114, baseType: !524, size: 320, offset: 3968)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 320, elements: !516)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !327, file: !328, line: 115, baseType: !498, size: 32, offset: 4288)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !327, file: !328, line: 120, baseType: !513, size: 64, offset: 4352)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !327, file: !328, line: 121, baseType: !498, size: 32, offset: 4416)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_LMVM", file: !530, line: 52, baseType: !531)
!530 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/ksp/utils/lmvm/lmvm.h", directory: "/home/users/ndemeye/xSDK")
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !530, line: 27, size: 6208, elements: !532)
!532 = !{!533, !535, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1586, !1591, !1592, !1593, !1594}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !531, file: !530, line: 29, baseType: !534, size: 4480)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !328, line: 122, baseType: !327)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !531, file: !530, line: 29, baseType: !536, size: 320, offset: 4480)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !537, size: 320, elements: !379)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps_LMVM", file: !530, line: 19, size: 320, elements: !538)
!538 = !{!539, !1556, !1557, !1558, !1559}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !537, file: !530, line: 20, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!341, !543, !572, !572}
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !63, line: 16, baseType: !544)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !546, line: 436, size: 23424, elements: !547)
!546 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!547 = !{!548, !549, !1331, !1332, !1333, !1334, !1336, !1337, !1338, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1452, !1453, !1469, !1470, !1471, !1472, !1473, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1508, !1528, !1529, !1531, !1532, !1533, !1534, !1535, !1536, !1554, !1555}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !545, file: !546, line: 437, baseType: !534, size: 4480)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !545, file: !546, line: 437, baseType: !550, size: 9472, offset: 4480)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 9472, elements: !379)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !546, line: 32, size: 9472, elements: !552)
!552 = !{!553, !562, !566, !567, !568, !867, !868, !869, !870, !871, !872, !873, !893, !897, !902, !908, !927, !932, !936, !937, !941, !946, !947, !952, !956, !960, !964, !968, !972, !973, !974, !975, !976, !980, !981, !986, !987, !988, !989, !990, !995, !1002, !1006, !1010, !1014, !1018, !1022, !1023, !1027, !1028, !1032, !1037, !1038, !1039, !1040, !1102, !1110, !1111, !1115, !1116, !1120, !1121, !1125, !1130, !1131, !1135, !1139, !1143, !1144, !1145, !1146, !1147, !1148, !1153, !1154, !1158, !1162, !1166, !1167, !1168, !1172, !1182, !1183, !1187, !1188, !1192, !1193, !1197, !1198, !1202, !1203, !1207, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1221, !1222, !1223, !1224, !1225, !1226, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1241, !1245, !1246, !1247, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1261, !1262, !1263, !1267, !1271, !1272, !1276, !1277, !1278, !1279, !1305, !1309, !1310, !1311, !1312, !1313, !1317, !1318, !1319, !1320, !1321, !1325, !1329, !1330}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !551, file: !546, line: 34, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!341, !543, !383, !557, !383, !557, !559, !561}
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !383)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !446)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !551, file: !546, line: 35, baseType: !563, size: 64, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{!341, !543, !383, !428, !430, !448}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !551, file: !546, line: 36, baseType: !563, size: 64, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !551, file: !546, line: 37, baseType: !540, size: 64, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !551, file: !546, line: 38, baseType: !569, size: 64, offset: 256)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{!341, !543, !572, !572, !572}
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !36, line: 21, baseType: !573)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !575, line: 142, size: 12800, elements: !576)
!575 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!576 = !{!577, !578, !793, !813, !814, !815, !861, !862, !863, !864, !866}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !574, file: !575, line: 143, baseType: !534, size: 4480)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !574, file: !575, line: 143, baseType: !579, size: 5248, offset: 4480)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !580, size: 5248, elements: !379)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !575, line: 23, size: 5248, elements: !581)
!581 = !{!582, !587, !592, !596, !600, !606, !611, !612, !613, !617, !621, !622, !623, !627, !631, !635, !636, !640, !644, !648, !649, !653, !657, !658, !662, !666, !667, !668, !672, !673, !680, !685, !686, !687, !691, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !712, !713, !714, !718, !722, !723, !724, !725, !729, !730, !731, !732, !733, !734, !735, !739, !740, !744, !751, !752, !757, !758, !762, !763, !764, !765, !766, !767, !768, !769, !773, !774, !775, !781, !785, !786, !787}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !580, file: !575, line: 24, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!341, !572, !586}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !580, file: !575, line: 25, baseType: !588, size: 64, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!341, !572, !383, !591}
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !580, file: !575, line: 26, baseType: !593, size: 64, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{!341, !383, !586}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !580, file: !575, line: 27, baseType: !597, size: 64, offset: 192)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{!341, !572, !572, !445}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !580, file: !575, line: 28, baseType: !601, size: 64, offset: 256)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!341, !572, !383, !604, !445}
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !572)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !580, file: !575, line: 29, baseType: !607, size: 64, offset: 320)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{!341, !572, !610, !436}
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !36, line: 155, baseType: !35)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !580, file: !575, line: 30, baseType: !597, size: 64, offset: 384)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !580, file: !575, line: 31, baseType: !601, size: 64, offset: 448)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !580, file: !575, line: 32, baseType: !614, size: 64, offset: 512)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!341, !572, !446}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !580, file: !575, line: 33, baseType: !618, size: 64, offset: 576)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{!341, !572, !572}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !580, file: !575, line: 34, baseType: !614, size: 64, offset: 640)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !580, file: !575, line: 35, baseType: !618, size: 64, offset: 704)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !580, file: !575, line: 36, baseType: !624, size: 64, offset: 768)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{!341, !572, !446, !572}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !580, file: !575, line: 37, baseType: !628, size: 64, offset: 832)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!341, !572, !446, !446, !572}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !580, file: !575, line: 38, baseType: !632, size: 64, offset: 896)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DISubroutineType(types: !634)
!634 = !{!341, !572, !383, !559, !586}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !580, file: !575, line: 39, baseType: !624, size: 64, offset: 960)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !580, file: !575, line: 40, baseType: !637, size: 64, offset: 1024)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{!341, !572, !446, !572, !572}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !580, file: !575, line: 41, baseType: !641, size: 64, offset: 1088)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!341, !572, !446, !446, !446, !572, !572}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !580, file: !575, line: 42, baseType: !645, size: 64, offset: 1152)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{!341, !572, !572, !572}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !580, file: !575, line: 43, baseType: !645, size: 64, offset: 1216)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !580, file: !575, line: 44, baseType: !650, size: 64, offset: 1280)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{!341, !572, !383, !557, !559, !561}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !580, file: !575, line: 45, baseType: !654, size: 64, offset: 1344)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!341, !572}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !580, file: !575, line: 46, baseType: !654, size: 64, offset: 1408)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !580, file: !575, line: 47, baseType: !659, size: 64, offset: 1472)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!341, !572, !448}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !580, file: !575, line: 48, baseType: !663, size: 64, offset: 1536)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!341, !572, !428}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !580, file: !575, line: 49, baseType: !663, size: 64, offset: 1600)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !580, file: !575, line: 50, baseType: !659, size: 64, offset: 1664)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !580, file: !575, line: 51, baseType: !669, size: 64, offset: 1728)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{!341, !572, !428, !436}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !580, file: !575, line: 52, baseType: !669, size: 64, offset: 1792)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !580, file: !575, line: 53, baseType: !674, size: 64, offset: 1856)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!341, !572, !677}
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !678)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !580, file: !575, line: 54, baseType: !681, size: 64, offset: 1920)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!341, !572, !684, !498}
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !36, line: 475, baseType: !43)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !580, file: !575, line: 55, baseType: !650, size: 64, offset: 1984)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !580, file: !575, line: 56, baseType: !654, size: 64, offset: 2048)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !580, file: !575, line: 57, baseType: !688, size: 64, offset: 2112)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!341, !572, !347}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !580, file: !575, line: 58, baseType: !692, size: 64, offset: 2176)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!341, !572, !559}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !580, file: !575, line: 59, baseType: !692, size: 64, offset: 2240)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !580, file: !575, line: 60, baseType: !597, size: 64, offset: 2304)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !580, file: !575, line: 61, baseType: !597, size: 64, offset: 2368)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !580, file: !575, line: 62, baseType: !607, size: 64, offset: 2432)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !580, file: !575, line: 63, baseType: !601, size: 64, offset: 2496)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !580, file: !575, line: 64, baseType: !601, size: 64, offset: 2560)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !580, file: !575, line: 65, baseType: !688, size: 64, offset: 2624)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !580, file: !575, line: 66, baseType: !654, size: 64, offset: 2688)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !580, file: !575, line: 67, baseType: !654, size: 64, offset: 2752)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !580, file: !575, line: 68, baseType: !705, size: 64, offset: 2816)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!341, !572, !708}
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !709, line: 30, baseType: !710)
!709 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !709, line: 30, flags: DIFlagFwdDecl)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !580, file: !575, line: 69, baseType: !650, size: 64, offset: 2880)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !580, file: !575, line: 70, baseType: !654, size: 64, offset: 2944)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !580, file: !575, line: 71, baseType: !715, size: 64, offset: 3008)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!341, !474, !572}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !580, file: !575, line: 72, baseType: !719, size: 64, offset: 3072)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!341, !572, !572, !436}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !580, file: !575, line: 73, baseType: !645, size: 64, offset: 3136)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !580, file: !575, line: 74, baseType: !645, size: 64, offset: 3200)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !580, file: !575, line: 75, baseType: !645, size: 64, offset: 3264)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !580, file: !575, line: 76, baseType: !726, size: 64, offset: 3328)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!341, !572, !383, !557, !445}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !580, file: !575, line: 77, baseType: !654, size: 64, offset: 3392)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !580, file: !575, line: 78, baseType: !654, size: 64, offset: 3456)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !580, file: !575, line: 79, baseType: !654, size: 64, offset: 3520)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !580, file: !575, line: 80, baseType: !654, size: 64, offset: 3584)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !580, file: !575, line: 81, baseType: !614, size: 64, offset: 3648)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !580, file: !575, line: 82, baseType: !654, size: 64, offset: 3712)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !580, file: !575, line: 83, baseType: !736, size: 64, offset: 3776)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!341, !572, !383, !572, !561}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !580, file: !575, line: 84, baseType: !736, size: 64, offset: 3840)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !580, file: !575, line: 85, baseType: !741, size: 64, offset: 3904)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{!341, !572, !572, !445, !445}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !580, file: !575, line: 86, baseType: !745, size: 64, offset: 3968)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!341, !572, !748, !586}
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !709, line: 11, baseType: !749)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !709, line: 11, flags: DIFlagFwdDecl)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !580, file: !575, line: 87, baseType: !745, size: 64, offset: 4032)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !580, file: !575, line: 88, baseType: !753, size: 64, offset: 4096)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!341, !572, !756}
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !580, file: !575, line: 89, baseType: !753, size: 64, offset: 4160)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !580, file: !575, line: 90, baseType: !759, size: 64, offset: 4224)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{!341, !572, !383, !557, !557, !572, !561}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !580, file: !575, line: 91, baseType: !759, size: 64, offset: 4288)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !580, file: !575, line: 92, baseType: !688, size: 64, offset: 4352)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !580, file: !575, line: 93, baseType: !688, size: 64, offset: 4416)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !580, file: !575, line: 94, baseType: !618, size: 64, offset: 4480)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !580, file: !575, line: 95, baseType: !618, size: 64, offset: 4544)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !580, file: !575, line: 96, baseType: !618, size: 64, offset: 4608)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !580, file: !575, line: 97, baseType: !618, size: 64, offset: 4672)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !580, file: !575, line: 98, baseType: !770, size: 64, offset: 4736)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{!341, !572, !498}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !580, file: !575, line: 99, baseType: !659, size: 64, offset: 4800)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !580, file: !575, line: 100, baseType: !659, size: 64, offset: 4864)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !580, file: !575, line: 101, baseType: !776, size: 64, offset: 4928)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{!341, !572, !448, !779}
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !48)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !580, file: !575, line: 102, baseType: !782, size: 64, offset: 4992)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{!341, !572, !756, !779}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !580, file: !575, line: 103, baseType: !659, size: 64, offset: 5056)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !580, file: !575, line: 104, baseType: !753, size: 64, offset: 5120)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !580, file: !575, line: 105, baseType: !788, size: 64, offset: 5184)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{!341, !383, !604, !586, !791}
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !574, file: !575, line: 144, baseType: !794, size: 64, offset: 9728)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !709, line: 60, baseType: !795)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !133, line: 240, size: 640, elements: !797)
!797 = !{!798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !796, file: !133, line: 241, baseType: !320, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !796, file: !133, line: 242, baseType: !400, size: 32, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !796, file: !133, line: 243, baseType: !383, size: 32, offset: 96)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !796, file: !133, line: 243, baseType: !383, size: 32, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !796, file: !133, line: 244, baseType: !383, size: 32, offset: 160)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !796, file: !133, line: 244, baseType: !383, size: 32, offset: 192)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !796, file: !133, line: 245, baseType: !428, size: 64, offset: 256)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !796, file: !133, line: 246, baseType: !498, size: 32, offset: 320)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !796, file: !133, line: 247, baseType: !383, size: 32, offset: 352)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !796, file: !133, line: 251, baseType: !383, size: 32, offset: 384)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !796, file: !133, line: 252, baseType: !708, size: 64, offset: 448)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !796, file: !133, line: 253, baseType: !498, size: 32, offset: 512)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !796, file: !133, line: 254, baseType: !383, size: 32, offset: 544)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !796, file: !133, line: 254, baseType: !383, size: 32, offset: 576)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !796, file: !133, line: 255, baseType: !383, size: 32, offset: 608)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !574, file: !575, line: 145, baseType: !324, size: 64, offset: 9792)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !574, file: !575, line: 146, baseType: !498, size: 32, offset: 9856)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !574, file: !575, line: 147, baseType: !816, size: 1344, offset: 9920)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !575, line: 140, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !575, line: 114, size: 1344, elements: !818)
!818 = !{!819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !837, !838, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !817, file: !575, line: 115, baseType: !383, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !817, file: !575, line: 116, baseType: !383, size: 32, offset: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !817, file: !575, line: 117, baseType: !383, size: 32, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !817, file: !575, line: 118, baseType: !383, size: 32, offset: 96)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !817, file: !575, line: 119, baseType: !383, size: 32, offset: 128)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !817, file: !575, line: 120, baseType: !383, size: 32, offset: 160)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !817, file: !575, line: 121, baseType: !428, size: 64, offset: 192)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !817, file: !575, line: 122, baseType: !445, size: 64, offset: 256)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !817, file: !575, line: 124, baseType: !320, size: 64, offset: 320)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !817, file: !575, line: 125, baseType: !400, size: 32, offset: 384)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !817, file: !575, line: 125, baseType: !400, size: 32, offset: 416)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !817, file: !575, line: 126, baseType: !400, size: 32, offset: 448)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !817, file: !575, line: 126, baseType: !400, size: 32, offset: 480)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !817, file: !575, line: 127, baseType: !833, size: 64, offset: 512)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !321, line: 339, baseType: !835)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !321, line: 339, flags: DIFlagFwdDecl)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !817, file: !575, line: 128, baseType: !833, size: 64, offset: 576)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !817, file: !575, line: 129, baseType: !839, size: 64, offset: 640)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !321, line: 341, baseType: !841)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !321, line: 351, size: 192, elements: !842)
!842 = !{!843, !844, !845, !846, !847}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !841, file: !321, line: 354, baseType: !91, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !841, file: !321, line: 355, baseType: !91, size: 32, offset: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !841, file: !321, line: 356, baseType: !91, size: 32, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !841, file: !321, line: 361, baseType: !91, size: 32, offset: 96)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !841, file: !321, line: 362, baseType: !494, size: 64, offset: 128)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !817, file: !575, line: 130, baseType: !383, size: 32, offset: 704)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !817, file: !575, line: 130, baseType: !383, size: 32, offset: 736)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !817, file: !575, line: 131, baseType: !445, size: 64, offset: 768)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !817, file: !575, line: 131, baseType: !445, size: 64, offset: 832)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !817, file: !575, line: 132, baseType: !428, size: 64, offset: 896)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !817, file: !575, line: 132, baseType: !428, size: 64, offset: 960)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !817, file: !575, line: 133, baseType: !383, size: 32, offset: 1024)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !817, file: !575, line: 134, baseType: !428, size: 64, offset: 1088)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !817, file: !575, line: 135, baseType: !383, size: 32, offset: 1152)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !817, file: !575, line: 136, baseType: !498, size: 32, offset: 1184)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !817, file: !575, line: 137, baseType: !498, size: 32, offset: 1216)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !817, file: !575, line: 138, baseType: !561, size: 32, offset: 1248)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !817, file: !575, line: 139, baseType: !428, size: 64, offset: 1280)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !574, file: !575, line: 147, baseType: !816, size: 1344, offset: 11264)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !574, file: !575, line: 148, baseType: !498, size: 32, offset: 12608)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !574, file: !575, line: 149, baseType: !383, size: 32, offset: 12640)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !574, file: !575, line: 150, baseType: !865, size: 32, offset: 12672)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !36, line: 472, baseType: !55)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !574, file: !575, line: 157, baseType: !410, size: 64, offset: 12736)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !551, file: !546, line: 40, baseType: !540, size: 64, offset: 320)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !551, file: !546, line: 41, baseType: !569, size: 64, offset: 384)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !551, file: !546, line: 42, baseType: !540, size: 64, offset: 448)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !551, file: !546, line: 43, baseType: !569, size: 64, offset: 512)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !551, file: !546, line: 44, baseType: !540, size: 64, offset: 576)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !551, file: !546, line: 46, baseType: !569, size: 64, offset: 640)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !551, file: !546, line: 47, baseType: !874, size: 64, offset: 704)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{!341, !543, !748, !748, !877}
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !879)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !63, line: 1239, baseType: !880)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 1226, size: 704, elements: !881)
!881 = !{!882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !880, file: !63, line: 1227, baseType: !437, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !880, file: !63, line: 1228, baseType: !437, size: 64, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !880, file: !63, line: 1229, baseType: !437, size: 64, offset: 128)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !880, file: !63, line: 1230, baseType: !437, size: 64, offset: 192)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !880, file: !63, line: 1231, baseType: !437, size: 64, offset: 256)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !880, file: !63, line: 1232, baseType: !437, size: 64, offset: 320)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !880, file: !63, line: 1233, baseType: !437, size: 64, offset: 384)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !880, file: !63, line: 1234, baseType: !437, size: 64, offset: 448)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !880, file: !63, line: 1236, baseType: !437, size: 64, offset: 512)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !880, file: !63, line: 1237, baseType: !437, size: 64, offset: 576)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !880, file: !63, line: 1238, baseType: !437, size: 64, offset: 640)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !551, file: !546, line: 48, baseType: !894, size: 64, offset: 768)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{!341, !543, !748, !877}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !551, file: !546, line: 49, baseType: !898, size: 64, offset: 832)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{!341, !543, !572, !437, !901, !437, !383, !383, !572}
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !63, line: 1291, baseType: !62)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !551, file: !546, line: 50, baseType: !903, size: 64, offset: 896)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{!341, !543, !906, !907}
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !63, line: 238, baseType: !75)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !551, file: !546, line: 52, baseType: !909, size: 64, offset: 960)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!341, !543, !912, !913}
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !63, line: 612, baseType: !81)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !63, line: 600, baseType: !915)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 592, size: 640, elements: !916)
!916 = !{!917, !918, !919, !920, !921, !922, !923, !924, !925, !926}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !915, file: !63, line: 593, baseType: !385, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !915, file: !63, line: 594, baseType: !385, size: 64, offset: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !915, file: !63, line: 594, baseType: !385, size: 64, offset: 128)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !915, file: !63, line: 594, baseType: !385, size: 64, offset: 192)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !915, file: !63, line: 595, baseType: !385, size: 64, offset: 256)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !915, file: !63, line: 596, baseType: !385, size: 64, offset: 320)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !915, file: !63, line: 597, baseType: !385, size: 64, offset: 384)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !915, file: !63, line: 598, baseType: !385, size: 64, offset: 448)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !915, file: !63, line: 598, baseType: !385, size: 64, offset: 512)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !915, file: !63, line: 599, baseType: !385, size: 64, offset: 576)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !551, file: !546, line: 53, baseType: !928, size: 64, offset: 1024)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!341, !543, !543, !931}
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !551, file: !546, line: 54, baseType: !933, size: 64, offset: 1088)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{!341, !543, !572}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !551, file: !546, line: 55, baseType: !540, size: 64, offset: 1152)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !551, file: !546, line: 56, baseType: !938, size: 64, offset: 1216)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!341, !543, !610, !436}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !551, file: !546, line: 58, baseType: !942, size: 64, offset: 1280)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{!341, !543, !945}
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !63, line: 424, baseType: !86)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !551, file: !546, line: 59, baseType: !942, size: 64, offset: 1344)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !551, file: !546, line: 60, baseType: !948, size: 64, offset: 1408)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{!341, !543, !951, !498}
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !63, line: 469, baseType: !90)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !551, file: !546, line: 61, baseType: !953, size: 64, offset: 1472)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!341, !543}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !551, file: !546, line: 63, baseType: !957, size: 64, offset: 1536)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!341, !543, !383, !557, !446, !572, !572}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !551, file: !546, line: 64, baseType: !961, size: 64, offset: 1600)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!341, !543, !543, !748, !748, !877}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !551, file: !546, line: 65, baseType: !965, size: 64, offset: 1664)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!341, !543, !543, !877}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !551, file: !546, line: 66, baseType: !969, size: 64, offset: 1728)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!341, !543, !543, !748, !877}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !551, file: !546, line: 67, baseType: !965, size: 64, offset: 1792)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !551, file: !546, line: 69, baseType: !953, size: 64, offset: 1856)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !551, file: !546, line: 70, baseType: !961, size: 64, offset: 1920)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !551, file: !546, line: 71, baseType: !969, size: 64, offset: 1984)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !551, file: !546, line: 72, baseType: !977, size: 64, offset: 2048)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!341, !543, !907}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !551, file: !546, line: 73, baseType: !953, size: 64, offset: 2112)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !551, file: !546, line: 75, baseType: !982, size: 64, offset: 2176)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!341, !543, !985, !907}
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !63, line: 563, baseType: !121)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !551, file: !546, line: 76, baseType: !540, size: 64, offset: 2240)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !551, file: !546, line: 77, baseType: !540, size: 64, offset: 2304)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !551, file: !546, line: 78, baseType: !874, size: 64, offset: 2368)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !551, file: !546, line: 79, baseType: !894, size: 64, offset: 2432)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !551, file: !546, line: 81, baseType: !991, size: 64, offset: 2496)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!341, !543, !446, !543, !994}
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !63, line: 285, baseType: !126)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !551, file: !546, line: 82, baseType: !996, size: 64, offset: 2560)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!341, !543, !383, !999, !999, !906, !1001}
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !748)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !551, file: !546, line: 83, baseType: !1003, size: 64, offset: 2624)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!341, !543, !383, !792, !383}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !551, file: !546, line: 84, baseType: !1007, size: 64, offset: 2688)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!341, !543, !383, !557, !383, !557, !445}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !551, file: !546, line: 85, baseType: !1011, size: 64, offset: 2752)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!341, !543, !543, !994}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !551, file: !546, line: 87, baseType: !1015, size: 64, offset: 2816)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!341, !543, !572, !428}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !551, file: !546, line: 88, baseType: !1019, size: 64, offset: 2880)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!341, !543, !446}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !551, file: !546, line: 89, baseType: !1019, size: 64, offset: 2944)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !551, file: !546, line: 90, baseType: !1024, size: 64, offset: 3008)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!341, !543, !572, !561}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !551, file: !546, line: 91, baseType: !957, size: 64, offset: 3072)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !551, file: !546, line: 93, baseType: !1029, size: 64, offset: 3136)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!341, !543, !677}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !551, file: !546, line: 94, baseType: !1033, size: 64, offset: 3200)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!341, !543, !383, !498, !498, !428, !1036, !1036, !931}
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !551, file: !546, line: 95, baseType: !1033, size: 64, offset: 3264)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !551, file: !546, line: 96, baseType: !1033, size: 64, offset: 3328)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !551, file: !546, line: 97, baseType: !1033, size: 64, offset: 3392)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !551, file: !546, line: 99, baseType: !1041, size: 64, offset: 3456)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!341, !543, !1044, !1047}
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !709, line: 51, baseType: !1045)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !709, line: 51, flags: DIFlagFwdDecl)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !63, line: 1378, baseType: !1048)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !546, line: 609, size: 6208, elements: !1050)
!1050 = !{!1051, !1052, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1071, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1089, !1090, !1091, !1092, !1093, !1095, !1096, !1097, !1098, !1099, !1100, !1101}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1049, file: !546, line: 610, baseType: !534, size: 4480)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1049, file: !546, line: 610, baseType: !1053, size: 32, offset: 4480)
!1053 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 32, elements: !379)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1049, file: !546, line: 611, baseType: !383, size: 32, offset: 4512)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1049, file: !546, line: 611, baseType: !383, size: 32, offset: 4544)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1049, file: !546, line: 611, baseType: !383, size: 32, offset: 4576)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1049, file: !546, line: 612, baseType: !383, size: 32, offset: 4608)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1049, file: !546, line: 613, baseType: !383, size: 32, offset: 4640)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1049, file: !546, line: 614, baseType: !428, size: 64, offset: 4672)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1049, file: !546, line: 615, baseType: !430, size: 64, offset: 4736)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !1049, file: !546, line: 616, baseType: !792, size: 64, offset: 4800)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1049, file: !546, line: 617, baseType: !428, size: 64, offset: 4864)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !1049, file: !546, line: 618, baseType: !1064, size: 64, offset: 4928)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !546, line: 602, baseType: !1066)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !546, line: 598, size: 128, elements: !1067)
!1067 = !{!1068, !1069, !1070}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1066, file: !546, line: 599, baseType: !383, size: 32)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1066, file: !546, line: 600, baseType: !383, size: 32, offset: 32)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1066, file: !546, line: 601, baseType: !445, size: 64, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !1049, file: !546, line: 619, baseType: !1072, size: 64, offset: 4992)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !546, line: 607, baseType: !1074)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !546, line: 604, size: 128, elements: !1075)
!1075 = !{!1076, !1077}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1074, file: !546, line: 605, baseType: !383, size: 32)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1074, file: !546, line: 606, baseType: !445, size: 64, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !1049, file: !546, line: 620, baseType: !445, size: 64, offset: 5056)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !1049, file: !546, line: 621, baseType: !437, size: 64, offset: 5120)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !1049, file: !546, line: 622, baseType: !437, size: 64, offset: 5184)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !1049, file: !546, line: 623, baseType: !572, size: 64, offset: 5248)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !1049, file: !546, line: 623, baseType: !572, size: 64, offset: 5312)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !1049, file: !546, line: 623, baseType: !572, size: 64, offset: 5376)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !1049, file: !546, line: 624, baseType: !498, size: 32, offset: 5440)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1049, file: !546, line: 625, baseType: !1086, size: 64, offset: 5504)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!341}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !1049, file: !546, line: 626, baseType: !324, size: 64, offset: 5568)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !1049, file: !546, line: 627, baseType: !572, size: 64, offset: 5632)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1049, file: !546, line: 628, baseType: !383, size: 32, offset: 5696)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !1049, file: !546, line: 629, baseType: !360, size: 64, offset: 5760)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1049, file: !546, line: 630, baseType: !1094, size: 32, offset: 5824)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !133, line: 213, baseType: !132)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1049, file: !546, line: 631, baseType: !383, size: 32, offset: 5856)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !1049, file: !546, line: 631, baseType: !383, size: 32, offset: 5888)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1049, file: !546, line: 632, baseType: !498, size: 32, offset: 5920)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !1049, file: !546, line: 633, baseType: !498, size: 32, offset: 5952)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !1049, file: !546, line: 634, baseType: !371, size: 64, offset: 6016)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !1049, file: !546, line: 634, baseType: !324, size: 64, offset: 6080)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !1049, file: !546, line: 635, baseType: !391, size: 64, offset: 6144)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !551, file: !546, line: 100, baseType: !1103, size: 64, offset: 3520)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!341, !543, !383, !383, !1106, !1109}
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !133, line: 215, baseType: !1108)
!1108 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !551, file: !546, line: 101, baseType: !953, size: 64, offset: 3584)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !551, file: !546, line: 102, baseType: !1112, size: 64, offset: 3648)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!341, !543, !748, !748, !907}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !551, file: !546, line: 103, baseType: !554, size: 64, offset: 3712)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !551, file: !546, line: 105, baseType: !1117, size: 64, offset: 3776)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!341, !543, !748, !748, !906, !907}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !551, file: !546, line: 106, baseType: !953, size: 64, offset: 3840)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !551, file: !546, line: 107, baseType: !1122, size: 64, offset: 3904)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!341, !543, !347}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !551, file: !546, line: 108, baseType: !1126, size: 64, offset: 3968)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!341, !543, !1129, !906, !907}
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !63, line: 25, baseType: !360)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !551, file: !546, line: 109, baseType: !1086, size: 64, offset: 4032)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !551, file: !546, line: 111, baseType: !1132, size: 64, offset: 4096)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!341, !543, !543, !543, !437, !543}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !551, file: !546, line: 112, baseType: !1136, size: 64, offset: 4160)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!341, !543, !543, !543, !543}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !551, file: !546, line: 113, baseType: !1140, size: 64, offset: 4224)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!341, !543, !708, !708}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !551, file: !546, line: 114, baseType: !554, size: 64, offset: 4288)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !551, file: !546, line: 115, baseType: !957, size: 64, offset: 4352)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !551, file: !546, line: 117, baseType: !1015, size: 64, offset: 4416)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !551, file: !546, line: 118, baseType: !1015, size: 64, offset: 4480)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !551, file: !546, line: 119, baseType: !1126, size: 64, offset: 4544)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !551, file: !546, line: 120, baseType: !1149, size: 64, offset: 4608)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!341, !543, !1152, !931}
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !63, line: 1675, baseType: !137)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !551, file: !546, line: 121, baseType: !1086, size: 64, offset: 4672)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !551, file: !546, line: 123, baseType: !1155, size: 64, offset: 4736)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{!341, !543, !383, !324}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !551, file: !546, line: 124, baseType: !1159, size: 64, offset: 4800)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!341, !543, !1047, !572, !324}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !551, file: !546, line: 125, baseType: !1163, size: 64, offset: 4864)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = !DISubroutineType(types: !1165)
!1165 = !{!341, !474, !543}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !551, file: !546, line: 126, baseType: !540, size: 64, offset: 4928)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !551, file: !546, line: 127, baseType: !540, size: 64, offset: 4992)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !551, file: !546, line: 129, baseType: !1169, size: 64, offset: 5056)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!341, !543, !792}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !551, file: !546, line: 130, baseType: !1173, size: 64, offset: 5120)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = !DISubroutineType(types: !1175)
!1175 = !{!341, !543, !1176, !1176}
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !36, line: 654, baseType: !1177)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !36, line: 653, size: 128, elements: !1179)
!1179 = !{!1180, !1181}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1178, file: !36, line: 653, baseType: !383, size: 32)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1178, file: !36, line: 653, baseType: !572, size: 64, offset: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !551, file: !546, line: 131, baseType: !1173, size: 64, offset: 5184)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !551, file: !546, line: 132, baseType: !1184, size: 64, offset: 5248)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{!341, !543, !428, !428, !428}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !551, file: !546, line: 133, baseType: !1122, size: 64, offset: 5312)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !551, file: !546, line: 135, baseType: !1189, size: 64, offset: 5376)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = !DISubroutineType(types: !1191)
!1191 = !{!341, !543, !437, !931}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !551, file: !546, line: 136, baseType: !1189, size: 64, offset: 5440)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !551, file: !546, line: 137, baseType: !1194, size: 64, offset: 5504)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = !DISubroutineType(types: !1196)
!1196 = !{!341, !543, !931}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !551, file: !546, line: 138, baseType: !554, size: 64, offset: 5568)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !551, file: !546, line: 139, baseType: !1199, size: 64, offset: 5632)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1200 = !DISubroutineType(types: !1201)
!1201 = !{!341, !543, !586, !586}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !551, file: !546, line: 141, baseType: !1086, size: 64, offset: 5696)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !551, file: !546, line: 142, baseType: !1204, size: 64, offset: 5760)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{!341, !543, !543, !437, !543}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !551, file: !546, line: 143, baseType: !1208, size: 64, offset: 5824)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{!341, !543, !543, !543}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !551, file: !546, line: 144, baseType: !1086, size: 64, offset: 5888)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !551, file: !546, line: 145, baseType: !1204, size: 64, offset: 5952)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !551, file: !546, line: 147, baseType: !1208, size: 64, offset: 6016)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !551, file: !546, line: 148, baseType: !1086, size: 64, offset: 6080)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !551, file: !546, line: 149, baseType: !1204, size: 64, offset: 6144)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !551, file: !546, line: 150, baseType: !1208, size: 64, offset: 6208)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !551, file: !546, line: 151, baseType: !1218, size: 64, offset: 6272)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64)
!1219 = !DISubroutineType(types: !1220)
!1220 = !{!341, !543, !498}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !551, file: !546, line: 153, baseType: !953, size: 64, offset: 6336)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !551, file: !546, line: 154, baseType: !953, size: 64, offset: 6400)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !551, file: !546, line: 155, baseType: !953, size: 64, offset: 6464)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !551, file: !546, line: 156, baseType: !953, size: 64, offset: 6528)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !551, file: !546, line: 157, baseType: !1122, size: 64, offset: 6592)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !551, file: !546, line: 159, baseType: !1227, size: 64, offset: 6656)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{!341, !543, !383, !559}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !551, file: !546, line: 160, baseType: !953, size: 64, offset: 6720)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !551, file: !546, line: 161, baseType: !953, size: 64, offset: 6784)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !551, file: !546, line: 162, baseType: !953, size: 64, offset: 6848)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !551, file: !546, line: 163, baseType: !953, size: 64, offset: 6912)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !551, file: !546, line: 165, baseType: !1208, size: 64, offset: 6976)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !551, file: !546, line: 166, baseType: !1208, size: 64, offset: 7040)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !551, file: !546, line: 167, baseType: !1015, size: 64, offset: 7104)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !551, file: !546, line: 168, baseType: !1238, size: 64, offset: 7168)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = !DISubroutineType(types: !1240)
!1240 = !{!341, !543, !572, !383}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !551, file: !546, line: 169, baseType: !1242, size: 64, offset: 7232)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64)
!1243 = !DISubroutineType(types: !1244)
!1244 = !{!341, !543, !931, !428}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !551, file: !546, line: 171, baseType: !977, size: 64, offset: 7296)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !551, file: !546, line: 172, baseType: !953, size: 64, offset: 7360)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !551, file: !546, line: 173, baseType: !1248, size: 64, offset: 7424)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64)
!1249 = !DISubroutineType(types: !1250)
!1250 = !{!341, !543, !428, !1036}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !551, file: !546, line: 174, baseType: !1112, size: 64, offset: 7488)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !551, file: !546, line: 175, baseType: !1112, size: 64, offset: 7552)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !551, file: !546, line: 177, baseType: !540, size: 64, offset: 7616)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !551, file: !546, line: 178, baseType: !903, size: 64, offset: 7680)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !551, file: !546, line: 179, baseType: !540, size: 64, offset: 7744)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !551, file: !546, line: 180, baseType: !569, size: 64, offset: 7808)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !551, file: !546, line: 181, baseType: !1258, size: 64, offset: 7872)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{!341, !543, !320, !906, !907}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !551, file: !546, line: 183, baseType: !1169, size: 64, offset: 7936)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !551, file: !546, line: 184, baseType: !938, size: 64, offset: 8000)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !551, file: !546, line: 185, baseType: !1264, size: 64, offset: 8064)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64)
!1265 = !DISubroutineType(types: !1266)
!1266 = !{!341, !543, !756}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !551, file: !546, line: 186, baseType: !1268, size: 64, offset: 8128)
