; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/section/interface/ftn-auto/sectionf.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/section/interface/ftn-auto/sectionf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._p_PetscSection = type opaque
%struct.ompi_communicator_t = type opaque
%struct._p_IS = type opaque
%struct._p_PetscSF = type opaque
%struct._n_PetscLayout = type { %struct.ompi_communicator_t*, i32, i32, i32, i32, i32, i32*, i32, i32, i32, %struct._p_ISLocalToGlobalMapping*, i32, i32, i32, i32 }
%struct._p_ISLocalToGlobalMapping = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !24, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/vec/is/section/interface/ftn-auto/sectionf.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 170, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 81, baseType: !5, size: 32, elements: !11)
!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!12 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !{!25, !29, !35, !39, !43, !251}
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !26, line: 18, baseType: !27)
!26 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !26, line: 18, flags: DIFlagFwdDecl)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranAddr", file: !31, line: 135, baseType: !32)
!31 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/fortranimpl.h", directory: "/home/users/ndemeye/xSDK")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !33, line: 100, baseType: !34)
!33 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!34 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !36, line: 11, baseType: !37)
!36 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !36, line: 11, flags: DIFlagFwdDecl)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !40, line: 15, baseType: !41)
!40 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !40, line: 15, flags: DIFlagFwdDecl)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !46, line: 73, size: 4480, elements: !47)
!46 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!47 = !{!48, !51, !104, !105, !107, !110, !111, !112, !113, !121, !122, !124, !128, !132, !134, !135, !136, !137, !138, !139, !140, !141, !142, !144, !146, !147, !148, !150, !151, !153, !155, !156, !157, !158, !159, !162, !164, !165, !166, !167, !168, !171, !173, !174, !175, !185, !187, !188, !192, !193, !241, !246, !248, !249, !250}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !45, file: !46, line: 74, baseType: !49, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !50)
!50 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !45, file: !46, line: 75, baseType: !52, size: 448, offset: 64)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 448, elements: !102)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !46, line: 53, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !46, line: 45, size: 448, elements: !55)
!55 = !{!56, !66, !74, !79, !86, !90, !97}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !54, file: !46, line: 46, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{!60, !43, !61}
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !50)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !63, line: 330, baseType: !64)
!63 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !63, line: 330, flags: DIFlagFwdDecl)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !54, file: !46, line: 47, baseType: !67, size: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!60, !43, !70}
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !71, line: 16, baseType: !72)
!71 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !71, line: 16, flags: DIFlagFwdDecl)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !54, file: !46, line: 48, baseType: !75, size: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!60, !78}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !54, file: !46, line: 49, baseType: !80, size: 64, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!60, !43, !83, !43}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!85 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !54, file: !46, line: 50, baseType: !87, size: 64, offset: 256)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!60, !43, !83, !78}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !54, file: !46, line: 51, baseType: !91, size: 64, offset: 320)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!60, !43, !83, !94}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{null}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !54, file: !46, line: 52, baseType: !98, size: 64, offset: 384)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!60, !43, !83, !101}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!102 = !{!103}
!103 = !DISubrange(count: 1)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !45, file: !46, line: 76, baseType: !62, size: 64, offset: 512)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !45, file: !46, line: 77, baseType: !106, size: 32, offset: 576)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !50)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !45, file: !46, line: 78, baseType: !108, size: 64, offset: 640)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !109)
!109 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !45, file: !46, line: 78, baseType: !108, size: 64, offset: 704)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !45, file: !46, line: 78, baseType: !108, size: 64, offset: 768)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !45, file: !46, line: 78, baseType: !108, size: 64, offset: 832)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !45, file: !46, line: 79, baseType: !114, size: 64, offset: 896)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !117, line: 27, baseType: !118)
!117 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !119, line: 43, baseType: !120)
!119 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!120 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !45, file: !46, line: 80, baseType: !106, size: 32, offset: 960)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !45, file: !46, line: 81, baseType: !123, size: 32, offset: 992)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !50)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !45, file: !46, line: 82, baseType: !125, size: 64, offset: 1024)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !45, file: !46, line: 83, baseType: !129, size: 64, offset: 1088)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !45, file: !46, line: 84, baseType: !133, size: 64, offset: 1152)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !45, file: !46, line: 85, baseType: !133, size: 64, offset: 1216)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !45, file: !46, line: 86, baseType: !133, size: 64, offset: 1280)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !45, file: !46, line: 87, baseType: !133, size: 64, offset: 1344)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !45, file: !46, line: 88, baseType: !43, size: 64, offset: 1408)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !45, file: !46, line: 89, baseType: !114, size: 64, offset: 1472)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !45, file: !46, line: 90, baseType: !133, size: 64, offset: 1536)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !45, file: !46, line: 91, baseType: !133, size: 64, offset: 1600)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !45, file: !46, line: 92, baseType: !106, size: 32, offset: 1664)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !45, file: !46, line: 93, baseType: !143, size: 64, offset: 1728)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !45, file: !46, line: 94, baseType: !145, size: 64, offset: 1792)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !115)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !45, file: !46, line: 95, baseType: !106, size: 32, offset: 1856)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !45, file: !46, line: 95, baseType: !106, size: 32, offset: 1888)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !45, file: !46, line: 96, baseType: !149, size: 64, offset: 1920)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !45, file: !46, line: 96, baseType: !149, size: 64, offset: 1984)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !45, file: !46, line: 97, baseType: !152, size: 64, offset: 2048)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !45, file: !46, line: 97, baseType: !154, size: 64, offset: 2112)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !45, file: !46, line: 98, baseType: !106, size: 32, offset: 2176)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !45, file: !46, line: 98, baseType: !106, size: 32, offset: 2208)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !45, file: !46, line: 99, baseType: !149, size: 64, offset: 2240)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !45, file: !46, line: 99, baseType: !149, size: 64, offset: 2304)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !45, file: !46, line: 100, baseType: !160, size: 64, offset: 2368)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !109)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !45, file: !46, line: 100, baseType: !163, size: 64, offset: 2432)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !45, file: !46, line: 101, baseType: !106, size: 32, offset: 2496)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !45, file: !46, line: 101, baseType: !106, size: 32, offset: 2528)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !45, file: !46, line: 102, baseType: !149, size: 64, offset: 2560)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !45, file: !46, line: 102, baseType: !149, size: 64, offset: 2624)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !45, file: !46, line: 103, baseType: !169, size: 64, offset: 2688)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !161)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !45, file: !46, line: 103, baseType: !172, size: 64, offset: 2752)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !45, file: !46, line: 104, baseType: !101, size: 64, offset: 2816)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !45, file: !46, line: 105, baseType: !106, size: 32, offset: 2880)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !45, file: !46, line: 106, baseType: !176, size: 128, offset: 2944)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 128, elements: !183)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !46, line: 64, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !46, line: 61, size: 128, elements: !180)
!180 = !{!181, !182}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !179, file: !46, line: 62, baseType: !94, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !179, file: !46, line: 63, baseType: !143, size: 64, offset: 64)
!183 = !{!184}
!184 = !DISubrange(count: 2)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !45, file: !46, line: 107, baseType: !186, size: 64, offset: 3072)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 64, elements: !183)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !45, file: !46, line: 108, baseType: !143, size: 64, offset: 3136)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !45, file: !46, line: 109, baseType: !189, size: 64, offset: 3200)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!60, !143}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !45, file: !46, line: 111, baseType: !106, size: 32, offset: 3264)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !45, file: !46, line: 112, baseType: !194, size: 320, offset: 3328)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 320, elements: !239)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!60, !198, !43, !143}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !201)
!201 = !{!202, !203, !227, !228, !229, !230, !231, !232, !233, !234, !235}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !200, file: !10, line: 100, baseType: !106, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !200, file: !10, line: 101, baseType: !204, size: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !207)
!207 = !{!208, !209, !210, !211, !212, !215, !216, !217, !220, !222, !224, !225, !226}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !206, file: !10, line: 84, baseType: !133, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !206, file: !10, line: 85, baseType: !133, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !206, file: !10, line: 86, baseType: !143, size: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !206, file: !10, line: 87, baseType: !125, size: 64, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !206, file: !10, line: 88, baseType: !213, size: 64, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !206, file: !10, line: 89, baseType: !85, size: 8, offset: 320)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !206, file: !10, line: 90, baseType: !133, size: 64, offset: 384)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !206, file: !10, line: 91, baseType: !218, size: 64, offset: 448)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !219, line: 46, baseType: !34)
!219 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!220 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !206, file: !10, line: 92, baseType: !221, size: 32, offset: 512)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !206, file: !10, line: 93, baseType: !223, size: 32, offset: 544)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !206, file: !10, line: 94, baseType: !204, size: 64, offset: 576)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !206, file: !10, line: 95, baseType: !133, size: 64, offset: 640)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !206, file: !10, line: 96, baseType: !143, size: 64, offset: 704)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !200, file: !10, line: 102, baseType: !133, size: 64, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !200, file: !10, line: 102, baseType: !133, size: 64, offset: 192)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !200, file: !10, line: 103, baseType: !133, size: 64, offset: 256)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !200, file: !10, line: 104, baseType: !62, size: 64, offset: 320)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !200, file: !10, line: 105, baseType: !221, size: 32, offset: 384)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !200, file: !10, line: 105, baseType: !221, size: 32, offset: 416)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !200, file: !10, line: 105, baseType: !221, size: 32, offset: 448)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !200, file: !10, line: 106, baseType: !43, size: 64, offset: 512)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !200, file: !10, line: 107, baseType: !236, size: 64, offset: 576)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!239 = !{!240}
!240 = !DISubrange(count: 5)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !45, file: !46, line: 113, baseType: !242, size: 320, offset: 3648)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 320, elements: !239)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!60, !43, !143}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !45, file: !46, line: 114, baseType: !247, size: 320, offset: 3968)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 320, elements: !239)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !45, file: !46, line: 115, baseType: !221, size: 32, offset: 4288)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !45, file: !46, line: 120, baseType: !236, size: 64, offset: 4352)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !45, file: !46, line: 121, baseType: !221, size: 32, offset: 4416)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionSym", file: !26, line: 33, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSectionSym", file: !26, line: 33, flags: DIFlagFwdDecl)
!255 = !{i32 7, !"Dwarf Version", i32 4}
!256 = !{i32 2, !"Debug Info Version", i32 3}
!257 = !{i32 1, !"wchar_size", i32 4}
!258 = !{i32 7, !"PIC Level", i32 2}
!259 = !{i32 7, !"uwtable", i32 1}
!260 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!261 = distinct !DISubprogram(name: "petscsectioncreate_", scope: !262, file: !262, line: 362, type: !263, scopeLine: 363, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !267)
!262 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/vec/is/section/interface/ftn-auto/sectionf.c", directory: "/home/users/ndemeye/xSDK")
!263 = !DISubroutineType(types: !264)
!264 = !{null, !265, !266, !265}
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!267 = !{!268, !269, !270}
!268 = !DILocalVariable(name: "comm", arg: 1, scope: !261, file: !262, line: 362, type: !265)
!269 = !DILocalVariable(name: "s", arg: 2, scope: !261, file: !262, line: 362, type: !266)
!270 = !DILocalVariable(name: "__ierr", arg: 3, scope: !261, file: !262, line: 362, type: !265)
!271 = !DILocation(line: 0, scope: !261)
!272 = !DILocation(line: 365, column: 15, scope: !261)
!273 = !{!274, !274, i64 0}
!274 = !{!"int", !275, i64 0}
!275 = !{!"omnipotent char", !276, i64 0}
!276 = !{!"Simple C/C++ TBAA"}
!277 = !DILocation(line: 365, column: 2, scope: !261)
!278 = !DILocation(line: 364, column: 11, scope: !261)
!279 = !DILocation(line: 364, column: 9, scope: !261)
!280 = !DILocation(line: 366, column: 1, scope: !261)
!281 = !DISubprogram(name: "PetscSectionCreate", scope: !282, file: !282, line: 9, type: !283, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!282 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsection.h", directory: "/home/users/ndemeye/xSDK")
!283 = !DISubroutineType(types: !284)
!284 = !{!50, !64, !285}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!286 = !{}
!287 = !DISubprogram(name: "MPI_Comm_f2c", scope: !63, file: !63, line: 1292, type: !288, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!288 = !DISubroutineType(types: !289)
!289 = !{!64, !50}
!290 = distinct !DISubprogram(name: "petscsectioncopy_", scope: !262, file: !262, line: 367, type: !291, scopeLine: 368, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !293)
!291 = !DISubroutineType(types: !292)
!292 = !{null, !25, !25, !265}
!293 = !{!294, !295, !296}
!294 = !DILocalVariable(name: "section", arg: 1, scope: !290, file: !262, line: 367, type: !25)
!295 = !DILocalVariable(name: "newSection", arg: 2, scope: !290, file: !262, line: 367, type: !25)
!296 = !DILocalVariable(name: "__ierr", arg: 3, scope: !290, file: !262, line: 367, type: !265)
!297 = !DILocation(line: 0, scope: !290)
!298 = !DILocation(line: 370, column: 16, scope: !290)
!299 = !{!300, !300, i64 0}
!300 = !{!"long", !275, i64 0}
!301 = !DILocation(line: 370, column: 2, scope: !290)
!302 = !DILocation(line: 371, column: 16, scope: !290)
!303 = !DILocation(line: 371, column: 2, scope: !290)
!304 = !DILocation(line: 369, column: 11, scope: !290)
!305 = !DILocation(line: 369, column: 9, scope: !290)
!306 = !DILocation(line: 372, column: 1, scope: !290)
!307 = !DISubprogram(name: "PetscSectionCopy", scope: !282, file: !282, line: 12, type: !308, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!308 = !DISubroutineType(types: !309)
!309 = !{!50, !27, !27}
!310 = distinct !DISubprogram(name: "petscsectionclone_", scope: !262, file: !262, line: 373, type: !311, scopeLine: 374, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !313)
!311 = !DISubroutineType(types: !312)
!312 = !{null, !25, !266, !265}
!313 = !{!314, !315, !316}
!314 = !DILocalVariable(name: "section", arg: 1, scope: !310, file: !262, line: 373, type: !25)
!315 = !DILocalVariable(name: "newSection", arg: 2, scope: !310, file: !262, line: 373, type: !266)
!316 = !DILocalVariable(name: "__ierr", arg: 3, scope: !310, file: !262, line: 373, type: !265)
!317 = !DILocation(line: 0, scope: !310)
!318 = !DILocation(line: 376, column: 16, scope: !310)
!319 = !DILocation(line: 376, column: 2, scope: !310)
!320 = !DILocation(line: 375, column: 11, scope: !310)
!321 = !DILocation(line: 375, column: 9, scope: !310)
!322 = !DILocation(line: 377, column: 1, scope: !310)
!323 = !DISubprogram(name: "PetscSectionClone", scope: !282, file: !282, line: 10, type: !324, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!324 = !DISubroutineType(types: !325)
!325 = !{!50, !27, !285}
!326 = distinct !DISubprogram(name: "petscsectionsetfromoptions_", scope: !262, file: !262, line: 378, type: !327, scopeLine: 379, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !329)
!327 = !DISubroutineType(types: !328)
!328 = !{null, !25, !265}
!329 = !{!330, !331}
!330 = !DILocalVariable(name: "s", arg: 1, scope: !326, file: !262, line: 378, type: !25)
!331 = !DILocalVariable(name: "__ierr", arg: 2, scope: !326, file: !262, line: 378, type: !265)
!332 = !DILocation(line: 0, scope: !326)
!333 = !DILocation(line: 381, column: 16, scope: !326)
!334 = !DILocation(line: 381, column: 2, scope: !326)
!335 = !DILocation(line: 380, column: 11, scope: !326)
!336 = !DILocation(line: 380, column: 9, scope: !326)
!337 = !DILocation(line: 382, column: 1, scope: !326)
!338 = !DISubprogram(name: "PetscSectionSetFromOptions", scope: !282, file: !282, line: 11, type: !339, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!339 = !DISubroutineType(types: !340)
!340 = !{!50, !27}
!341 = distinct !DISubprogram(name: "petscsectioncompare_", scope: !262, file: !262, line: 383, type: !342, scopeLine: 384, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !345)
!342 = !DISubroutineType(types: !343)
!343 = !{null, !25, !25, !344, !265}
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!345 = !{!346, !347, !348, !349}
!346 = !DILocalVariable(name: "s1", arg: 1, scope: !341, file: !262, line: 383, type: !25)
!347 = !DILocalVariable(name: "s2", arg: 2, scope: !341, file: !262, line: 383, type: !25)
!348 = !DILocalVariable(name: "congruent", arg: 3, scope: !341, file: !262, line: 383, type: !344)
!349 = !DILocalVariable(name: "__ierr", arg: 4, scope: !341, file: !262, line: 383, type: !265)
!350 = !DILocation(line: 0, scope: !341)
!351 = !DILocation(line: 386, column: 16, scope: !341)
!352 = !DILocation(line: 386, column: 2, scope: !341)
!353 = !DILocation(line: 387, column: 16, scope: !341)
!354 = !DILocation(line: 387, column: 2, scope: !341)
!355 = !DILocation(line: 385, column: 11, scope: !341)
!356 = !DILocation(line: 385, column: 9, scope: !341)
!357 = !DILocation(line: 388, column: 1, scope: !341)
!358 = !DISubprogram(name: "PetscSectionCompare", scope: !282, file: !282, line: 13, type: !359, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!359 = !DISubroutineType(types: !360)
!360 = !{!50, !27, !27, !361}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3, size: 64)
!362 = distinct !DISubprogram(name: "petscsectiongetnumfields_", scope: !262, file: !262, line: 389, type: !363, scopeLine: 390, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !365)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !25, !152, !265}
!365 = !{!366, !367, !368}
!366 = !DILocalVariable(name: "s", arg: 1, scope: !362, file: !262, line: 389, type: !25)
!367 = !DILocalVariable(name: "numFields", arg: 2, scope: !362, file: !262, line: 389, type: !152)
!368 = !DILocalVariable(name: "__ierr", arg: 3, scope: !362, file: !262, line: 389, type: !265)
!369 = !DILocation(line: 0, scope: !362)
!370 = !DILocation(line: 392, column: 16, scope: !362)
!371 = !DILocation(line: 392, column: 2, scope: !362)
!372 = !DILocation(line: 391, column: 11, scope: !362)
!373 = !DILocation(line: 391, column: 9, scope: !362)
!374 = !DILocation(line: 393, column: 1, scope: !362)
!375 = !DISubprogram(name: "PetscSectionGetNumFields", scope: !282, file: !282, line: 14, type: !376, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!376 = !DISubroutineType(types: !377)
!377 = !{!50, !27, !265}
!378 = distinct !DISubprogram(name: "petscsectionsetnumfields_", scope: !262, file: !262, line: 394, type: !363, scopeLine: 395, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !379)
!379 = !{!380, !381, !382}
!380 = !DILocalVariable(name: "s", arg: 1, scope: !378, file: !262, line: 394, type: !25)
!381 = !DILocalVariable(name: "numFields", arg: 2, scope: !378, file: !262, line: 394, type: !152)
!382 = !DILocalVariable(name: "__ierr", arg: 3, scope: !378, file: !262, line: 394, type: !265)
!383 = !DILocation(line: 0, scope: !378)
!384 = !DILocation(line: 397, column: 16, scope: !378)
!385 = !DILocation(line: 397, column: 2, scope: !378)
!386 = !DILocation(line: 397, column: 37, scope: !378)
!387 = !DILocation(line: 396, column: 11, scope: !378)
!388 = !DILocation(line: 396, column: 9, scope: !378)
!389 = !DILocation(line: 398, column: 1, scope: !378)
!390 = !DISubprogram(name: "PetscSectionSetNumFields", scope: !282, file: !282, line: 15, type: !391, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!391 = !DISubroutineType(types: !392)
!392 = !{!50, !27, !50}
!393 = distinct !DISubprogram(name: "petscsectiongetfieldcomponents_", scope: !262, file: !262, line: 399, type: !394, scopeLine: 400, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !396)
!394 = !DISubroutineType(types: !395)
!395 = !{null, !25, !152, !152, !265}
!396 = !{!397, !398, !399, !400}
!397 = !DILocalVariable(name: "s", arg: 1, scope: !393, file: !262, line: 399, type: !25)
!398 = !DILocalVariable(name: "field", arg: 2, scope: !393, file: !262, line: 399, type: !152)
!399 = !DILocalVariable(name: "numComp", arg: 3, scope: !393, file: !262, line: 399, type: !152)
!400 = !DILocalVariable(name: "__ierr", arg: 4, scope: !393, file: !262, line: 399, type: !265)
!401 = !DILocation(line: 0, scope: !393)
!402 = !DILocation(line: 402, column: 16, scope: !393)
!403 = !DILocation(line: 402, column: 2, scope: !393)
!404 = !DILocation(line: 402, column: 37, scope: !393)
!405 = !DILocation(line: 401, column: 11, scope: !393)
!406 = !DILocation(line: 401, column: 9, scope: !393)
!407 = !DILocation(line: 403, column: 1, scope: !393)
!408 = !DISubprogram(name: "PetscSectionGetFieldComponents", scope: !282, file: !282, line: 20, type: !409, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!409 = !DISubroutineType(types: !410)
!410 = !{!50, !27, !50, !265}
!411 = distinct !DISubprogram(name: "petscsectionsetfieldcomponents_", scope: !262, file: !262, line: 404, type: !394, scopeLine: 405, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !412)
!412 = !{!413, !414, !415, !416}
!413 = !DILocalVariable(name: "s", arg: 1, scope: !411, file: !262, line: 404, type: !25)
!414 = !DILocalVariable(name: "field", arg: 2, scope: !411, file: !262, line: 404, type: !152)
!415 = !DILocalVariable(name: "numComp", arg: 3, scope: !411, file: !262, line: 404, type: !152)
!416 = !DILocalVariable(name: "__ierr", arg: 4, scope: !411, file: !262, line: 404, type: !265)
!417 = !DILocation(line: 0, scope: !411)
!418 = !DILocation(line: 407, column: 16, scope: !411)
!419 = !DILocation(line: 407, column: 2, scope: !411)
!420 = !DILocation(line: 407, column: 37, scope: !411)
!421 = !DILocation(line: 407, column: 44, scope: !411)
!422 = !DILocation(line: 406, column: 11, scope: !411)
!423 = !DILocation(line: 406, column: 9, scope: !411)
!424 = !DILocation(line: 408, column: 1, scope: !411)
!425 = !DISubprogram(name: "PetscSectionSetFieldComponents", scope: !282, file: !282, line: 21, type: !426, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!426 = !DISubroutineType(types: !427)
!427 = !{!50, !27, !50, !50}
!428 = distinct !DISubprogram(name: "petscsectiongetchart_", scope: !262, file: !262, line: 409, type: !394, scopeLine: 410, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !429)
!429 = !{!430, !431, !432, !433}
!430 = !DILocalVariable(name: "s", arg: 1, scope: !428, file: !262, line: 409, type: !25)
!431 = !DILocalVariable(name: "pStart", arg: 2, scope: !428, file: !262, line: 409, type: !152)
!432 = !DILocalVariable(name: "pEnd", arg: 3, scope: !428, file: !262, line: 409, type: !152)
!433 = !DILocalVariable(name: "__ierr", arg: 4, scope: !428, file: !262, line: 409, type: !265)
!434 = !DILocation(line: 0, scope: !428)
!435 = !DILocation(line: 412, column: 16, scope: !428)
!436 = !DILocation(line: 412, column: 2, scope: !428)
!437 = !DILocation(line: 411, column: 11, scope: !428)
!438 = !DILocation(line: 411, column: 9, scope: !428)
!439 = !DILocation(line: 413, column: 1, scope: !428)
!440 = !DISubprogram(name: "PetscSectionGetChart", scope: !282, file: !282, line: 22, type: !441, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!441 = !DISubroutineType(types: !442)
!442 = !{!50, !27, !265, !265}
!443 = distinct !DISubprogram(name: "petscsectionsetchart_", scope: !262, file: !262, line: 414, type: !394, scopeLine: 415, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !444)
!444 = !{!445, !446, !447, !448}
!445 = !DILocalVariable(name: "s", arg: 1, scope: !443, file: !262, line: 414, type: !25)
!446 = !DILocalVariable(name: "pStart", arg: 2, scope: !443, file: !262, line: 414, type: !152)
!447 = !DILocalVariable(name: "pEnd", arg: 3, scope: !443, file: !262, line: 414, type: !152)
!448 = !DILocalVariable(name: "__ierr", arg: 4, scope: !443, file: !262, line: 414, type: !265)
!449 = !DILocation(line: 0, scope: !443)
!450 = !DILocation(line: 417, column: 16, scope: !443)
!451 = !DILocation(line: 417, column: 2, scope: !443)
!452 = !DILocation(line: 417, column: 37, scope: !443)
!453 = !DILocation(line: 417, column: 45, scope: !443)
!454 = !DILocation(line: 416, column: 11, scope: !443)
!455 = !DILocation(line: 416, column: 9, scope: !443)
!456 = !DILocation(line: 418, column: 1, scope: !443)
!457 = !DISubprogram(name: "PetscSectionSetChart", scope: !282, file: !282, line: 23, type: !426, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!458 = distinct !DISubprogram(name: "petscsectiongetpermutation_", scope: !262, file: !262, line: 419, type: !459, scopeLine: 420, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !462)
!459 = !DISubroutineType(types: !460)
!460 = !{null, !25, !461, !265}
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!462 = !{!463, !464, !465}
!463 = !DILocalVariable(name: "s", arg: 1, scope: !458, file: !262, line: 419, type: !25)
!464 = !DILocalVariable(name: "perm", arg: 2, scope: !458, file: !262, line: 419, type: !461)
!465 = !DILocalVariable(name: "__ierr", arg: 3, scope: !458, file: !262, line: 419, type: !265)
!466 = !DILocation(line: 0, scope: !458)
!467 = !DILocation(line: 422, column: 16, scope: !458)
!468 = !DILocation(line: 422, column: 2, scope: !458)
!469 = !DILocation(line: 421, column: 11, scope: !458)
!470 = !DILocation(line: 421, column: 9, scope: !458)
!471 = !DILocation(line: 423, column: 1, scope: !458)
!472 = !DISubprogram(name: "PetscSectionGetPermutation", scope: !282, file: !282, line: 24, type: !473, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!473 = !DISubroutineType(types: !474)
!474 = !{!50, !27, !475}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!476 = distinct !DISubprogram(name: "petscsectionsetpermutation_", scope: !262, file: !262, line: 424, type: !477, scopeLine: 425, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !479)
!477 = !DISubroutineType(types: !478)
!478 = !{null, !25, !35, !265}
!479 = !{!480, !481, !482}
!480 = !DILocalVariable(name: "s", arg: 1, scope: !476, file: !262, line: 424, type: !25)
!481 = !DILocalVariable(name: "perm", arg: 2, scope: !476, file: !262, line: 424, type: !35)
!482 = !DILocalVariable(name: "__ierr", arg: 3, scope: !476, file: !262, line: 424, type: !265)
!483 = !DILocation(line: 0, scope: !476)
!484 = !DILocation(line: 427, column: 16, scope: !476)
!485 = !DILocation(line: 427, column: 2, scope: !476)
!486 = !DILocation(line: 428, column: 6, scope: !476)
!487 = !DILocation(line: 428, column: 2, scope: !476)
!488 = !DILocation(line: 426, column: 11, scope: !476)
!489 = !DILocation(line: 426, column: 9, scope: !476)
!490 = !DILocation(line: 429, column: 1, scope: !476)
!491 = !DISubprogram(name: "PetscSectionSetPermutation", scope: !282, file: !282, line: 25, type: !492, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!492 = !DISubroutineType(types: !493)
!493 = !{!50, !27, !37}
!494 = distinct !DISubprogram(name: "petscsectiongetpointmajor_", scope: !262, file: !262, line: 430, type: !495, scopeLine: 431, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !497)
!495 = !DISubroutineType(types: !496)
!496 = !{null, !25, !344, !265}
!497 = !{!498, !499, !500}
!498 = !DILocalVariable(name: "s", arg: 1, scope: !494, file: !262, line: 430, type: !25)
!499 = !DILocalVariable(name: "pm", arg: 2, scope: !494, file: !262, line: 430, type: !344)
!500 = !DILocalVariable(name: "__ierr", arg: 3, scope: !494, file: !262, line: 430, type: !265)
!501 = !DILocation(line: 0, scope: !494)
!502 = !DILocation(line: 433, column: 16, scope: !494)
!503 = !DILocation(line: 433, column: 2, scope: !494)
!504 = !DILocation(line: 432, column: 11, scope: !494)
!505 = !DILocation(line: 432, column: 9, scope: !494)
!506 = !DILocation(line: 434, column: 1, scope: !494)
!507 = !DISubprogram(name: "PetscSectionGetPointMajor", scope: !282, file: !282, line: 26, type: !508, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!508 = !DISubroutineType(types: !509)
!509 = !{!50, !27, !361}
!510 = distinct !DISubprogram(name: "petscsectionsetpointmajor_", scope: !262, file: !262, line: 435, type: !495, scopeLine: 436, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !511)
!511 = !{!512, !513, !514}
!512 = !DILocalVariable(name: "s", arg: 1, scope: !510, file: !262, line: 435, type: !25)
!513 = !DILocalVariable(name: "pm", arg: 2, scope: !510, file: !262, line: 435, type: !344)
!514 = !DILocalVariable(name: "__ierr", arg: 3, scope: !510, file: !262, line: 435, type: !265)
!515 = !DILocation(line: 0, scope: !510)
!516 = !DILocation(line: 438, column: 16, scope: !510)
!517 = !DILocation(line: 438, column: 2, scope: !510)
!518 = !DILocation(line: 438, column: 37, scope: !510)
!519 = !{!275, !275, i64 0}
!520 = !DILocation(line: 437, column: 11, scope: !510)
!521 = !DILocation(line: 437, column: 9, scope: !510)
!522 = !DILocation(line: 439, column: 1, scope: !510)
!523 = !DISubprogram(name: "PetscSectionSetPointMajor", scope: !282, file: !282, line: 27, type: !524, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!524 = !DISubroutineType(types: !525)
!525 = !{!50, !27, !3}
!526 = distinct !DISubprogram(name: "petscsectiongetincludesconstraints_", scope: !262, file: !262, line: 440, type: !495, scopeLine: 441, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !527)
!527 = !{!528, !529, !530}
!528 = !DILocalVariable(name: "s", arg: 1, scope: !526, file: !262, line: 440, type: !25)
!529 = !DILocalVariable(name: "includesConstraints", arg: 2, scope: !526, file: !262, line: 440, type: !344)
!530 = !DILocalVariable(name: "__ierr", arg: 3, scope: !526, file: !262, line: 440, type: !265)
!531 = !DILocation(line: 0, scope: !526)
!532 = !DILocation(line: 443, column: 16, scope: !526)
!533 = !DILocation(line: 443, column: 2, scope: !526)
!534 = !DILocation(line: 442, column: 11, scope: !526)
!535 = !DILocation(line: 442, column: 9, scope: !526)
!536 = !DILocation(line: 444, column: 1, scope: !526)
!537 = !DISubprogram(name: "PetscSectionGetIncludesConstraints", scope: !282, file: !282, line: 28, type: !508, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!538 = distinct !DISubprogram(name: "petscsectionsetincludesconstraints_", scope: !262, file: !262, line: 445, type: !495, scopeLine: 446, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !539)
!539 = !{!540, !541, !542}
!540 = !DILocalVariable(name: "s", arg: 1, scope: !538, file: !262, line: 445, type: !25)
!541 = !DILocalVariable(name: "includesConstraints", arg: 2, scope: !538, file: !262, line: 445, type: !344)
!542 = !DILocalVariable(name: "__ierr", arg: 3, scope: !538, file: !262, line: 445, type: !265)
!543 = !DILocation(line: 0, scope: !538)
!544 = !DILocation(line: 448, column: 16, scope: !538)
!545 = !DILocation(line: 448, column: 2, scope: !538)
!546 = !DILocation(line: 448, column: 37, scope: !538)
!547 = !DILocation(line: 447, column: 11, scope: !538)
!548 = !DILocation(line: 447, column: 9, scope: !538)
!549 = !DILocation(line: 449, column: 1, scope: !538)
!550 = !DISubprogram(name: "PetscSectionSetIncludesConstraints", scope: !282, file: !282, line: 29, type: !524, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!551 = distinct !DISubprogram(name: "petscsectiongetdof_", scope: !262, file: !262, line: 450, type: !394, scopeLine: 451, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !552)
!552 = !{!553, !554, !555, !556}
!553 = !DILocalVariable(name: "s", arg: 1, scope: !551, file: !262, line: 450, type: !25)
!554 = !DILocalVariable(name: "point", arg: 2, scope: !551, file: !262, line: 450, type: !152)
!555 = !DILocalVariable(name: "numDof", arg: 3, scope: !551, file: !262, line: 450, type: !152)
!556 = !DILocalVariable(name: "__ierr", arg: 4, scope: !551, file: !262, line: 450, type: !265)
!557 = !DILocation(line: 0, scope: !551)
!558 = !DILocation(line: 453, column: 16, scope: !551)
!559 = !DILocation(line: 453, column: 2, scope: !551)
!560 = !DILocation(line: 453, column: 37, scope: !551)
!561 = !DILocation(line: 452, column: 11, scope: !551)
!562 = !DILocation(line: 452, column: 9, scope: !551)
!563 = !DILocation(line: 454, column: 1, scope: !551)
!564 = !DISubprogram(name: "PetscSectionGetDof", scope: !282, file: !282, line: 30, type: !409, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!565 = distinct !DISubprogram(name: "petscsectionsetdof_", scope: !262, file: !262, line: 455, type: !394, scopeLine: 456, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !566)
!566 = !{!567, !568, !569, !570}
!567 = !DILocalVariable(name: "s", arg: 1, scope: !565, file: !262, line: 455, type: !25)
!568 = !DILocalVariable(name: "point", arg: 2, scope: !565, file: !262, line: 455, type: !152)
!569 = !DILocalVariable(name: "numDof", arg: 3, scope: !565, file: !262, line: 455, type: !152)
!570 = !DILocalVariable(name: "__ierr", arg: 4, scope: !565, file: !262, line: 455, type: !265)
!571 = !DILocation(line: 0, scope: !565)
!572 = !DILocation(line: 458, column: 16, scope: !565)
!573 = !DILocation(line: 458, column: 2, scope: !565)
!574 = !DILocation(line: 458, column: 37, scope: !565)
!575 = !DILocation(line: 458, column: 44, scope: !565)
!576 = !DILocation(line: 457, column: 11, scope: !565)
!577 = !DILocation(line: 457, column: 9, scope: !565)
!578 = !DILocation(line: 459, column: 1, scope: !565)
!579 = !DISubprogram(name: "PetscSectionSetDof", scope: !282, file: !282, line: 31, type: !426, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!580 = distinct !DISubprogram(name: "petscsectionadddof_", scope: !262, file: !262, line: 460, type: !394, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !581)
!581 = !{!582, !583, !584, !585}
!582 = !DILocalVariable(name: "s", arg: 1, scope: !580, file: !262, line: 460, type: !25)
!583 = !DILocalVariable(name: "point", arg: 2, scope: !580, file: !262, line: 460, type: !152)
!584 = !DILocalVariable(name: "numDof", arg: 3, scope: !580, file: !262, line: 460, type: !152)
!585 = !DILocalVariable(name: "__ierr", arg: 4, scope: !580, file: !262, line: 460, type: !265)
!586 = !DILocation(line: 0, scope: !580)
!587 = !DILocation(line: 463, column: 16, scope: !580)
!588 = !DILocation(line: 463, column: 2, scope: !580)
!589 = !DILocation(line: 463, column: 37, scope: !580)
!590 = !DILocation(line: 463, column: 44, scope: !580)
!591 = !DILocation(line: 462, column: 11, scope: !580)
!592 = !DILocation(line: 462, column: 9, scope: !580)
!593 = !DILocation(line: 464, column: 1, scope: !580)
!594 = !DISubprogram(name: "PetscSectionAddDof", scope: !282, file: !282, line: 32, type: !426, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!595 = distinct !DISubprogram(name: "petscsectiongetfielddof_", scope: !262, file: !262, line: 465, type: !596, scopeLine: 466, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !598)
!596 = !DISubroutineType(types: !597)
!597 = !{null, !25, !152, !152, !152, !265}
!598 = !{!599, !600, !601, !602, !603}
!599 = !DILocalVariable(name: "s", arg: 1, scope: !595, file: !262, line: 465, type: !25)
!600 = !DILocalVariable(name: "point", arg: 2, scope: !595, file: !262, line: 465, type: !152)
!601 = !DILocalVariable(name: "field", arg: 3, scope: !595, file: !262, line: 465, type: !152)
!602 = !DILocalVariable(name: "numDof", arg: 4, scope: !595, file: !262, line: 465, type: !152)
!603 = !DILocalVariable(name: "__ierr", arg: 5, scope: !595, file: !262, line: 465, type: !265)
!604 = !DILocation(line: 0, scope: !595)
!605 = !DILocation(line: 468, column: 16, scope: !595)
!606 = !DILocation(line: 468, column: 2, scope: !595)
!607 = !DILocation(line: 468, column: 37, scope: !595)
!608 = !DILocation(line: 468, column: 44, scope: !595)
!609 = !DILocation(line: 467, column: 11, scope: !595)
!610 = !DILocation(line: 467, column: 9, scope: !595)
!611 = !DILocation(line: 469, column: 1, scope: !595)
!612 = !DISubprogram(name: "PetscSectionGetFieldDof", scope: !282, file: !282, line: 33, type: !613, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!613 = !DISubroutineType(types: !614)
!614 = !{!50, !27, !50, !50, !265}
!615 = distinct !DISubprogram(name: "petscsectionsetfielddof_", scope: !262, file: !262, line: 470, type: !596, scopeLine: 471, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !616)
!616 = !{!617, !618, !619, !620, !621}
!617 = !DILocalVariable(name: "s", arg: 1, scope: !615, file: !262, line: 470, type: !25)
!618 = !DILocalVariable(name: "point", arg: 2, scope: !615, file: !262, line: 470, type: !152)
!619 = !DILocalVariable(name: "field", arg: 3, scope: !615, file: !262, line: 470, type: !152)
!620 = !DILocalVariable(name: "numDof", arg: 4, scope: !615, file: !262, line: 470, type: !152)
!621 = !DILocalVariable(name: "__ierr", arg: 5, scope: !615, file: !262, line: 470, type: !265)
!622 = !DILocation(line: 0, scope: !615)
!623 = !DILocation(line: 473, column: 16, scope: !615)
!624 = !DILocation(line: 473, column: 2, scope: !615)
!625 = !DILocation(line: 473, column: 37, scope: !615)
!626 = !DILocation(line: 473, column: 44, scope: !615)
!627 = !DILocation(line: 473, column: 51, scope: !615)
!628 = !DILocation(line: 472, column: 11, scope: !615)
!629 = !DILocation(line: 472, column: 9, scope: !615)
!630 = !DILocation(line: 474, column: 1, scope: !615)
!631 = !DISubprogram(name: "PetscSectionSetFieldDof", scope: !282, file: !282, line: 34, type: !632, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!632 = !DISubroutineType(types: !633)
!633 = !{!50, !27, !50, !50, !50}
!634 = distinct !DISubprogram(name: "petscsectionaddfielddof_", scope: !262, file: !262, line: 475, type: !596, scopeLine: 476, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !635)
!635 = !{!636, !637, !638, !639, !640}
!636 = !DILocalVariable(name: "s", arg: 1, scope: !634, file: !262, line: 475, type: !25)
!637 = !DILocalVariable(name: "point", arg: 2, scope: !634, file: !262, line: 475, type: !152)
!638 = !DILocalVariable(name: "field", arg: 3, scope: !634, file: !262, line: 475, type: !152)
!639 = !DILocalVariable(name: "numDof", arg: 4, scope: !634, file: !262, line: 475, type: !152)
!640 = !DILocalVariable(name: "__ierr", arg: 5, scope: !634, file: !262, line: 475, type: !265)
!641 = !DILocation(line: 0, scope: !634)
!642 = !DILocation(line: 478, column: 16, scope: !634)
!643 = !DILocation(line: 478, column: 2, scope: !634)
!644 = !DILocation(line: 478, column: 37, scope: !634)
!645 = !DILocation(line: 478, column: 44, scope: !634)
!646 = !DILocation(line: 478, column: 51, scope: !634)
!647 = !DILocation(line: 477, column: 11, scope: !634)
!648 = !DILocation(line: 477, column: 9, scope: !634)
!649 = !DILocation(line: 479, column: 1, scope: !634)
!650 = !DISubprogram(name: "PetscSectionAddFieldDof", scope: !282, file: !282, line: 35, type: !632, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!651 = distinct !DISubprogram(name: "petscsectiongetconstraintdof_", scope: !262, file: !262, line: 480, type: !394, scopeLine: 481, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !652)
!652 = !{!653, !654, !655, !656}
!653 = !DILocalVariable(name: "s", arg: 1, scope: !651, file: !262, line: 480, type: !25)
!654 = !DILocalVariable(name: "point", arg: 2, scope: !651, file: !262, line: 480, type: !152)
!655 = !DILocalVariable(name: "numDof", arg: 3, scope: !651, file: !262, line: 480, type: !152)
!656 = !DILocalVariable(name: "__ierr", arg: 4, scope: !651, file: !262, line: 480, type: !265)
!657 = !DILocation(line: 0, scope: !651)
!658 = !DILocation(line: 483, column: 16, scope: !651)
!659 = !DILocation(line: 483, column: 2, scope: !651)
!660 = !DILocation(line: 483, column: 37, scope: !651)
!661 = !DILocation(line: 482, column: 11, scope: !651)
!662 = !DILocation(line: 482, column: 9, scope: !651)
!663 = !DILocation(line: 484, column: 1, scope: !651)
!664 = !DISubprogram(name: "PetscSectionGetConstraintDof", scope: !282, file: !282, line: 37, type: !409, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!665 = distinct !DISubprogram(name: "petscsectionsetconstraintdof_", scope: !262, file: !262, line: 485, type: !394, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !666)
!666 = !{!667, !668, !669, !670}
!667 = !DILocalVariable(name: "s", arg: 1, scope: !665, file: !262, line: 485, type: !25)
!668 = !DILocalVariable(name: "point", arg: 2, scope: !665, file: !262, line: 485, type: !152)
!669 = !DILocalVariable(name: "numDof", arg: 3, scope: !665, file: !262, line: 485, type: !152)
!670 = !DILocalVariable(name: "__ierr", arg: 4, scope: !665, file: !262, line: 485, type: !265)
!671 = !DILocation(line: 0, scope: !665)
!672 = !DILocation(line: 488, column: 16, scope: !665)
!673 = !DILocation(line: 488, column: 2, scope: !665)
!674 = !DILocation(line: 488, column: 37, scope: !665)
!675 = !DILocation(line: 488, column: 44, scope: !665)
!676 = !DILocation(line: 487, column: 11, scope: !665)
!677 = !DILocation(line: 487, column: 9, scope: !665)
!678 = !DILocation(line: 489, column: 1, scope: !665)
!679 = !DISubprogram(name: "PetscSectionSetConstraintDof", scope: !282, file: !282, line: 38, type: !426, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!680 = distinct !DISubprogram(name: "petscsectionaddconstraintdof_", scope: !262, file: !262, line: 490, type: !394, scopeLine: 491, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !681)
!681 = !{!682, !683, !684, !685}
!682 = !DILocalVariable(name: "s", arg: 1, scope: !680, file: !262, line: 490, type: !25)
!683 = !DILocalVariable(name: "point", arg: 2, scope: !680, file: !262, line: 490, type: !152)
!684 = !DILocalVariable(name: "numDof", arg: 3, scope: !680, file: !262, line: 490, type: !152)
!685 = !DILocalVariable(name: "__ierr", arg: 4, scope: !680, file: !262, line: 490, type: !265)
!686 = !DILocation(line: 0, scope: !680)
!687 = !DILocation(line: 493, column: 16, scope: !680)
!688 = !DILocation(line: 493, column: 2, scope: !680)
!689 = !DILocation(line: 493, column: 37, scope: !680)
!690 = !DILocation(line: 493, column: 44, scope: !680)
!691 = !DILocation(line: 492, column: 11, scope: !680)
!692 = !DILocation(line: 492, column: 9, scope: !680)
!693 = !DILocation(line: 494, column: 1, scope: !680)
!694 = !DISubprogram(name: "PetscSectionAddConstraintDof", scope: !282, file: !282, line: 39, type: !426, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!695 = distinct !DISubprogram(name: "petscsectiongetfieldconstraintdof_", scope: !262, file: !262, line: 495, type: !596, scopeLine: 496, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !696)
!696 = !{!697, !698, !699, !700, !701}
!697 = !DILocalVariable(name: "s", arg: 1, scope: !695, file: !262, line: 495, type: !25)
!698 = !DILocalVariable(name: "point", arg: 2, scope: !695, file: !262, line: 495, type: !152)
!699 = !DILocalVariable(name: "field", arg: 3, scope: !695, file: !262, line: 495, type: !152)
!700 = !DILocalVariable(name: "numDof", arg: 4, scope: !695, file: !262, line: 495, type: !152)
!701 = !DILocalVariable(name: "__ierr", arg: 5, scope: !695, file: !262, line: 495, type: !265)
!702 = !DILocation(line: 0, scope: !695)
!703 = !DILocation(line: 498, column: 16, scope: !695)
!704 = !DILocation(line: 498, column: 2, scope: !695)
!705 = !DILocation(line: 498, column: 37, scope: !695)
!706 = !DILocation(line: 498, column: 44, scope: !695)
!707 = !DILocation(line: 497, column: 11, scope: !695)
!708 = !DILocation(line: 497, column: 9, scope: !695)
!709 = !DILocation(line: 499, column: 1, scope: !695)
!710 = !DISubprogram(name: "PetscSectionGetFieldConstraintDof", scope: !282, file: !282, line: 40, type: !613, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!711 = distinct !DISubprogram(name: "petscsectionsetfieldconstraintdof_", scope: !262, file: !262, line: 500, type: !596, scopeLine: 501, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !712)
!712 = !{!713, !714, !715, !716, !717}
!713 = !DILocalVariable(name: "s", arg: 1, scope: !711, file: !262, line: 500, type: !25)
!714 = !DILocalVariable(name: "point", arg: 2, scope: !711, file: !262, line: 500, type: !152)
!715 = !DILocalVariable(name: "field", arg: 3, scope: !711, file: !262, line: 500, type: !152)
!716 = !DILocalVariable(name: "numDof", arg: 4, scope: !711, file: !262, line: 500, type: !152)
!717 = !DILocalVariable(name: "__ierr", arg: 5, scope: !711, file: !262, line: 500, type: !265)
!718 = !DILocation(line: 0, scope: !711)
!719 = !DILocation(line: 503, column: 16, scope: !711)
!720 = !DILocation(line: 503, column: 2, scope: !711)
!721 = !DILocation(line: 503, column: 37, scope: !711)
!722 = !DILocation(line: 503, column: 44, scope: !711)
!723 = !DILocation(line: 503, column: 51, scope: !711)
!724 = !DILocation(line: 502, column: 11, scope: !711)
!725 = !DILocation(line: 502, column: 9, scope: !711)
!726 = !DILocation(line: 504, column: 1, scope: !711)
!727 = !DISubprogram(name: "PetscSectionSetFieldConstraintDof", scope: !282, file: !282, line: 41, type: !632, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!728 = distinct !DISubprogram(name: "petscsectionaddfieldconstraintdof_", scope: !262, file: !262, line: 505, type: !596, scopeLine: 506, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !729)
!729 = !{!730, !731, !732, !733, !734}
!730 = !DILocalVariable(name: "s", arg: 1, scope: !728, file: !262, line: 505, type: !25)
!731 = !DILocalVariable(name: "point", arg: 2, scope: !728, file: !262, line: 505, type: !152)
!732 = !DILocalVariable(name: "field", arg: 3, scope: !728, file: !262, line: 505, type: !152)
!733 = !DILocalVariable(name: "numDof", arg: 4, scope: !728, file: !262, line: 505, type: !152)
!734 = !DILocalVariable(name: "__ierr", arg: 5, scope: !728, file: !262, line: 505, type: !265)
!735 = !DILocation(line: 0, scope: !728)
!736 = !DILocation(line: 508, column: 16, scope: !728)
!737 = !DILocation(line: 508, column: 2, scope: !728)
!738 = !DILocation(line: 508, column: 37, scope: !728)
!739 = !DILocation(line: 508, column: 44, scope: !728)
!740 = !DILocation(line: 508, column: 51, scope: !728)
!741 = !DILocation(line: 507, column: 11, scope: !728)
!742 = !DILocation(line: 507, column: 9, scope: !728)
!743 = !DILocation(line: 509, column: 1, scope: !728)
!744 = !DISubprogram(name: "PetscSectionAddFieldConstraintDof", scope: !282, file: !282, line: 42, type: !632, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!745 = distinct !DISubprogram(name: "petscsectionsetupbc_", scope: !262, file: !262, line: 510, type: !327, scopeLine: 511, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !746)
!746 = !{!747, !748}
!747 = !DILocalVariable(name: "s", arg: 1, scope: !745, file: !262, line: 510, type: !25)
!748 = !DILocalVariable(name: "__ierr", arg: 2, scope: !745, file: !262, line: 510, type: !265)
!749 = !DILocation(line: 0, scope: !745)
!750 = !DILocation(line: 513, column: 16, scope: !745)
!751 = !DILocation(line: 513, column: 2, scope: !745)
!752 = !DILocation(line: 512, column: 11, scope: !745)
!753 = !DILocation(line: 512, column: 9, scope: !745)
!754 = !DILocation(line: 514, column: 1, scope: !745)
!755 = !DISubprogram(name: "PetscSectionSetUpBC", scope: !282, file: !282, line: 47, type: !339, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!756 = distinct !DISubprogram(name: "petscsectionsetup_", scope: !262, file: !262, line: 515, type: !327, scopeLine: 516, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !757)
!757 = !{!758, !759}
!758 = !DILocalVariable(name: "s", arg: 1, scope: !756, file: !262, line: 515, type: !25)
!759 = !DILocalVariable(name: "__ierr", arg: 2, scope: !756, file: !262, line: 515, type: !265)
!760 = !DILocation(line: 0, scope: !756)
!761 = !DILocation(line: 518, column: 16, scope: !756)
!762 = !DILocation(line: 518, column: 2, scope: !756)
!763 = !DILocation(line: 517, column: 11, scope: !756)
!764 = !DILocation(line: 517, column: 9, scope: !756)
!765 = !DILocation(line: 519, column: 1, scope: !756)
!766 = !DISubprogram(name: "PetscSectionSetUp", scope: !282, file: !282, line: 48, type: !339, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!767 = distinct !DISubprogram(name: "petscsectiongetmaxdof_", scope: !262, file: !262, line: 520, type: !363, scopeLine: 521, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !768)
!768 = !{!769, !770, !771}
!769 = !DILocalVariable(name: "s", arg: 1, scope: !767, file: !262, line: 520, type: !25)
!770 = !DILocalVariable(name: "maxDof", arg: 2, scope: !767, file: !262, line: 520, type: !152)
!771 = !DILocalVariable(name: "__ierr", arg: 3, scope: !767, file: !262, line: 520, type: !265)
!772 = !DILocation(line: 0, scope: !767)
!773 = !DILocation(line: 523, column: 16, scope: !767)
!774 = !DILocation(line: 523, column: 2, scope: !767)
!775 = !DILocation(line: 522, column: 11, scope: !767)
!776 = !DILocation(line: 522, column: 9, scope: !767)
!777 = !DILocation(line: 524, column: 1, scope: !767)
!778 = !DISubprogram(name: "PetscSectionGetMaxDof", scope: !282, file: !282, line: 49, type: !376, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!779 = distinct !DISubprogram(name: "petscsectiongetstoragesize_", scope: !262, file: !262, line: 525, type: !363, scopeLine: 526, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !780)
!780 = !{!781, !782, !783}
!781 = !DILocalVariable(name: "s", arg: 1, scope: !779, file: !262, line: 525, type: !25)
!782 = !DILocalVariable(name: "size", arg: 2, scope: !779, file: !262, line: 525, type: !152)
!783 = !DILocalVariable(name: "__ierr", arg: 3, scope: !779, file: !262, line: 525, type: !265)
!784 = !DILocation(line: 0, scope: !779)
!785 = !DILocation(line: 528, column: 16, scope: !779)
!786 = !DILocation(line: 528, column: 2, scope: !779)
!787 = !DILocation(line: 527, column: 11, scope: !779)
!788 = !DILocation(line: 527, column: 9, scope: !779)
!789 = !DILocation(line: 529, column: 1, scope: !779)
!790 = !DISubprogram(name: "PetscSectionGetStorageSize", scope: !282, file: !282, line: 50, type: !376, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!791 = distinct !DISubprogram(name: "petscsectiongetconstrainedstoragesize_", scope: !262, file: !262, line: 530, type: !363, scopeLine: 531, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !792)
!792 = !{!793, !794, !795}
!793 = !DILocalVariable(name: "s", arg: 1, scope: !791, file: !262, line: 530, type: !25)
!794 = !DILocalVariable(name: "size", arg: 2, scope: !791, file: !262, line: 530, type: !152)
!795 = !DILocalVariable(name: "__ierr", arg: 3, scope: !791, file: !262, line: 530, type: !265)
!796 = !DILocation(line: 0, scope: !791)
!797 = !DILocation(line: 533, column: 16, scope: !791)
!798 = !DILocation(line: 533, column: 2, scope: !791)
!799 = !DILocation(line: 532, column: 11, scope: !791)
!800 = !DILocation(line: 532, column: 9, scope: !791)
!801 = !DILocation(line: 534, column: 1, scope: !791)
!802 = !DISubprogram(name: "PetscSectionGetConstrainedStorageSize", scope: !282, file: !282, line: 51, type: !376, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!803 = distinct !DISubprogram(name: "petscsectioncreateglobalsection_", scope: !262, file: !262, line: 535, type: !804, scopeLine: 536, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !806)
!804 = !DISubroutineType(types: !805)
!805 = !{null, !25, !39, !344, !344, !266, !265}
!806 = !{!807, !808, !809, !810, !811, !812}
!807 = !DILocalVariable(name: "s", arg: 1, scope: !803, file: !262, line: 535, type: !25)
!808 = !DILocalVariable(name: "sf", arg: 2, scope: !803, file: !262, line: 535, type: !39)
!809 = !DILocalVariable(name: "includeConstraints", arg: 3, scope: !803, file: !262, line: 535, type: !344)
!810 = !DILocalVariable(name: "localOffsets", arg: 4, scope: !803, file: !262, line: 535, type: !344)
!811 = !DILocalVariable(name: "gsection", arg: 5, scope: !803, file: !262, line: 535, type: !266)
!812 = !DILocalVariable(name: "__ierr", arg: 6, scope: !803, file: !262, line: 535, type: !265)
!813 = !DILocation(line: 0, scope: !803)
!814 = !DILocation(line: 538, column: 16, scope: !803)
!815 = !DILocation(line: 538, column: 2, scope: !803)
!816 = !DILocation(line: 539, column: 11, scope: !803)
!817 = !DILocation(line: 539, column: 2, scope: !803)
!818 = !DILocation(line: 539, column: 33, scope: !803)
!819 = !DILocation(line: 539, column: 53, scope: !803)
!820 = !DILocation(line: 537, column: 11, scope: !803)
!821 = !DILocation(line: 537, column: 9, scope: !803)
!822 = !DILocation(line: 540, column: 1, scope: !803)
!823 = !DISubprogram(name: "PetscSectionCreateGlobalSection", scope: !282, file: !282, line: 62, type: !824, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!824 = !DISubroutineType(types: !825)
!825 = !{!50, !27, !41, !3, !3, !285}
!826 = distinct !DISubprogram(name: "petscsectioncreateglobalsectioncensored_", scope: !262, file: !262, line: 541, type: !827, scopeLine: 542, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !829)
!827 = !DISubroutineType(types: !828)
!828 = !{null, !25, !39, !344, !152, !152, !266, !265}
!829 = !{!830, !831, !832, !833, !834, !835, !836}
!830 = !DILocalVariable(name: "s", arg: 1, scope: !826, file: !262, line: 541, type: !25)
!831 = !DILocalVariable(name: "sf", arg: 2, scope: !826, file: !262, line: 541, type: !39)
!832 = !DILocalVariable(name: "includeConstraints", arg: 3, scope: !826, file: !262, line: 541, type: !344)
!833 = !DILocalVariable(name: "numExcludes", arg: 4, scope: !826, file: !262, line: 541, type: !152)
!834 = !DILocalVariable(name: "excludes", arg: 5, scope: !826, file: !262, line: 541, type: !152)
!835 = !DILocalVariable(name: "gsection", arg: 6, scope: !826, file: !262, line: 541, type: !266)
!836 = !DILocalVariable(name: "__ierr", arg: 7, scope: !826, file: !262, line: 541, type: !265)
!837 = !DILocation(line: 0, scope: !826)
!838 = !DILocation(line: 544, column: 16, scope: !826)
!839 = !DILocation(line: 544, column: 2, scope: !826)
!840 = !DILocation(line: 545, column: 11, scope: !826)
!841 = !DILocation(line: 545, column: 2, scope: !826)
!842 = !DILocation(line: 545, column: 33, scope: !826)
!843 = !DILocation(line: 545, column: 53, scope: !826)
!844 = !DILocation(line: 543, column: 11, scope: !826)
!845 = !DILocation(line: 543, column: 9, scope: !826)
!846 = !DILocation(line: 546, column: 1, scope: !826)
!847 = !DISubprogram(name: "PetscSectionCreateGlobalSectionCensored", scope: !282, file: !282, line: 63, type: !848, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!848 = !DISubroutineType(types: !849)
!849 = !{!50, !27, !41, !3, !50, !850, !285}
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!852 = distinct !DISubprogram(name: "petscsectiongetpointlayout_", scope: !262, file: !262, line: 547, type: !853, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !879)
!853 = !DISubroutineType(types: !854)
!854 = !{null, !265, !25, !855, !265}
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !36, line: 60, baseType: !857)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !859, line: 240, size: 640, elements: !860)
!859 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!860 = !{!861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !875, !876, !877, !878}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !858, file: !859, line: 241, baseType: !62, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !858, file: !859, line: 242, baseType: !123, size: 32, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !858, file: !859, line: 243, baseType: !106, size: 32, offset: 96)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !858, file: !859, line: 243, baseType: !106, size: 32, offset: 128)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !858, file: !859, line: 244, baseType: !106, size: 32, offset: 160)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !858, file: !859, line: 244, baseType: !106, size: 32, offset: 192)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !858, file: !859, line: 245, baseType: !152, size: 64, offset: 256)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !858, file: !859, line: 246, baseType: !221, size: 32, offset: 320)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !858, file: !859, line: 247, baseType: !106, size: 32, offset: 352)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !858, file: !859, line: 251, baseType: !106, size: 32, offset: 384)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !858, file: !859, line: 252, baseType: !872, size: 64, offset: 448)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !36, line: 30, baseType: !873)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !36, line: 30, flags: DIFlagFwdDecl)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !858, file: !859, line: 253, baseType: !221, size: 32, offset: 512)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !858, file: !859, line: 254, baseType: !106, size: 32, offset: 544)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !858, file: !859, line: 254, baseType: !106, size: 32, offset: 576)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !858, file: !859, line: 255, baseType: !106, size: 32, offset: 608)
!879 = !{!880, !881, !882, !883}
!880 = !DILocalVariable(name: "comm", arg: 1, scope: !852, file: !262, line: 547, type: !265)
!881 = !DILocalVariable(name: "s", arg: 2, scope: !852, file: !262, line: 547, type: !25)
!882 = !DILocalVariable(name: "layout", arg: 3, scope: !852, file: !262, line: 547, type: !855)
!883 = !DILocalVariable(name: "__ierr", arg: 4, scope: !852, file: !262, line: 547, type: !265)
!884 = !DILocation(line: 0, scope: !852)
!885 = !DILocation(line: 550, column: 15, scope: !852)
!886 = !DILocation(line: 550, column: 2, scope: !852)
!887 = !DILocation(line: 551, column: 16, scope: !852)
!888 = !DILocation(line: 551, column: 2, scope: !852)
!889 = !DILocation(line: 549, column: 11, scope: !852)
!890 = !DILocation(line: 549, column: 9, scope: !852)
!891 = !DILocation(line: 552, column: 1, scope: !852)
!892 = !DISubprogram(name: "PetscSectionGetPointLayout", scope: !282, file: !282, line: 67, type: !893, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!893 = !DISubroutineType(types: !894)
!894 = !{!50, !64, !27, !895}
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!896 = distinct !DISubprogram(name: "petscsectiongetvaluelayout_", scope: !262, file: !262, line: 553, type: !853, scopeLine: 554, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !897)
!897 = !{!898, !899, !900, !901}
!898 = !DILocalVariable(name: "comm", arg: 1, scope: !896, file: !262, line: 553, type: !265)
!899 = !DILocalVariable(name: "s", arg: 2, scope: !896, file: !262, line: 553, type: !25)
!900 = !DILocalVariable(name: "layout", arg: 3, scope: !896, file: !262, line: 553, type: !855)
!901 = !DILocalVariable(name: "__ierr", arg: 4, scope: !896, file: !262, line: 553, type: !265)
!902 = !DILocation(line: 0, scope: !896)
!903 = !DILocation(line: 556, column: 15, scope: !896)
!904 = !DILocation(line: 556, column: 2, scope: !896)
!905 = !DILocation(line: 557, column: 16, scope: !896)
!906 = !DILocation(line: 557, column: 2, scope: !896)
!907 = !DILocation(line: 555, column: 11, scope: !896)
!908 = !DILocation(line: 555, column: 9, scope: !896)
!909 = !DILocation(line: 558, column: 1, scope: !896)
!910 = !DISubprogram(name: "PetscSectionGetValueLayout", scope: !282, file: !282, line: 68, type: !893, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!911 = distinct !DISubprogram(name: "petscsectiongetoffset_", scope: !262, file: !262, line: 559, type: !394, scopeLine: 560, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !912)
!912 = !{!913, !914, !915, !916}
!913 = !DILocalVariable(name: "s", arg: 1, scope: !911, file: !262, line: 559, type: !25)
!914 = !DILocalVariable(name: "point", arg: 2, scope: !911, file: !262, line: 559, type: !152)
!915 = !DILocalVariable(name: "offset", arg: 3, scope: !911, file: !262, line: 559, type: !152)
!916 = !DILocalVariable(name: "__ierr", arg: 4, scope: !911, file: !262, line: 559, type: !265)
!917 = !DILocation(line: 0, scope: !911)
!918 = !DILocation(line: 562, column: 16, scope: !911)
!919 = !DILocation(line: 562, column: 2, scope: !911)
!920 = !DILocation(line: 562, column: 37, scope: !911)
!921 = !DILocation(line: 561, column: 11, scope: !911)
!922 = !DILocation(line: 561, column: 9, scope: !911)
!923 = !DILocation(line: 563, column: 1, scope: !911)
!924 = !DISubprogram(name: "PetscSectionGetOffset", scope: !282, file: !282, line: 52, type: !409, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !286)
!925 = distinct !DISubprogram(name: "petscsectionsetoffset_", scope: !262, file: !262, line: 564, type: !394, scopeLine: 565, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !926)
