; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/color/utils/bipartite.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/color/utils/bipartite.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!257 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!258 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!259 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!260 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!261 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!262 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 161, baseType: !5, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272}
!265 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1345, baseType: !5, size: 32, elements: !295)
!295 = !{!296, !297, !298, !299}
!296 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_RANDOM", value: 0, isUnsigned: true)
!297 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_LEXICAL", value: 1, isUnsigned: true)
!298 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_LF", value: 2, isUnsigned: true)
!299 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_SL", value: 3, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !301, line: 663, baseType: !5, size: 32, elements: !302)
!301 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!302 = !{!303, !304, !305}
!303 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!304 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!305 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!306 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !307)
!307 = !{!308, !309, !310}
!308 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!309 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!310 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!311 = !{!312, !316, !317, !320, !520, !355}
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !313, line: 330, baseType: !314)
!313 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !313, line: 330, flags: DIFlagFwdDecl)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !318, line: 46, baseType: !319)
!318 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!319 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !323, line: 73, size: 4480, elements: !324)
!323 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!324 = !{!325, !327, !376, !377, !379, !382, !383, !384, !385, !393, !394, !396, !400, !404, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !417, !418, !419, !421, !422, !424, !426, !427, !428, !429, !430, !433, !435, !436, !437, !438, !439, !442, !444, !445, !446, !456, !458, !459, !463, !464, !510, !515, !517, !518, !519}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !322, file: !323, line: 74, baseType: !326, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !322, file: !323, line: 75, baseType: !328, size: 448, offset: 64)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 448, elements: !374)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !323, line: 53, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 45, size: 448, elements: !331)
!331 = !{!332, !338, !346, !351, !358, !362, !369}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !330, file: !323, line: 46, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!336, !320, !337}
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !330, file: !323, line: 47, baseType: !339, size: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!336, !320, !342}
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !343, line: 16, baseType: !344)
!343 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !343, line: 16, flags: DIFlagFwdDecl)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !330, file: !323, line: 48, baseType: !347, size: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!336, !350}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !330, file: !323, line: 49, baseType: !352, size: 64, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!336, !320, !355, !320}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !357)
!357 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !330, file: !323, line: 50, baseType: !359, size: 64, offset: 256)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!336, !320, !355, !350}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !330, file: !323, line: 51, baseType: !363, size: 64, offset: 320)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!336, !320, !355, !366}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{null}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !330, file: !323, line: 52, baseType: !370, size: 64, offset: 384)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!336, !320, !355, !373}
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!374 = !{!375}
!375 = !DISubrange(count: 1)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !322, file: !323, line: 76, baseType: !312, size: 64, offset: 512)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !322, file: !323, line: 77, baseType: !378, size: 32, offset: 576)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !322, file: !323, line: 78, baseType: !380, size: 64, offset: 640)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !381)
!381 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !322, file: !323, line: 78, baseType: !380, size: 64, offset: 704)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !322, file: !323, line: 78, baseType: !380, size: 64, offset: 768)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !322, file: !323, line: 78, baseType: !380, size: 64, offset: 832)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !322, file: !323, line: 79, baseType: !386, size: 64, offset: 896)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !389, line: 27, baseType: !390)
!389 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !391, line: 43, baseType: !392)
!391 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!392 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !322, file: !323, line: 80, baseType: !378, size: 32, offset: 960)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !322, file: !323, line: 81, baseType: !395, size: 32, offset: 992)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !322, file: !323, line: 82, baseType: !397, size: 64, offset: 1024)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !322, file: !323, line: 83, baseType: !401, size: 64, offset: 1088)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !322, file: !323, line: 84, baseType: !405, size: 64, offset: 1152)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !322, file: !323, line: 85, baseType: !405, size: 64, offset: 1216)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !322, file: !323, line: 86, baseType: !405, size: 64, offset: 1280)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !322, file: !323, line: 87, baseType: !405, size: 64, offset: 1344)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !322, file: !323, line: 88, baseType: !320, size: 64, offset: 1408)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !322, file: !323, line: 89, baseType: !386, size: 64, offset: 1472)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !322, file: !323, line: 90, baseType: !405, size: 64, offset: 1536)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !322, file: !323, line: 91, baseType: !405, size: 64, offset: 1600)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !322, file: !323, line: 92, baseType: !378, size: 32, offset: 1664)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !322, file: !323, line: 93, baseType: !316, size: 64, offset: 1728)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !322, file: !323, line: 94, baseType: !416, size: 64, offset: 1792)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !387)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !322, file: !323, line: 95, baseType: !378, size: 32, offset: 1856)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !322, file: !323, line: 95, baseType: !378, size: 32, offset: 1888)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !322, file: !323, line: 96, baseType: !420, size: 64, offset: 1920)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !322, file: !323, line: 96, baseType: !420, size: 64, offset: 1984)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !322, file: !323, line: 97, baseType: !423, size: 64, offset: 2048)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !322, file: !323, line: 97, baseType: !425, size: 64, offset: 2112)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !322, file: !323, line: 98, baseType: !378, size: 32, offset: 2176)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !322, file: !323, line: 98, baseType: !378, size: 32, offset: 2208)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !322, file: !323, line: 99, baseType: !420, size: 64, offset: 2240)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !322, file: !323, line: 99, baseType: !420, size: 64, offset: 2304)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !322, file: !323, line: 100, baseType: !431, size: 64, offset: 2368)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !381)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !322, file: !323, line: 100, baseType: !434, size: 64, offset: 2432)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !322, file: !323, line: 101, baseType: !378, size: 32, offset: 2496)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !322, file: !323, line: 101, baseType: !378, size: 32, offset: 2528)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !322, file: !323, line: 102, baseType: !420, size: 64, offset: 2560)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !322, file: !323, line: 102, baseType: !420, size: 64, offset: 2624)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !322, file: !323, line: 103, baseType: !440, size: 64, offset: 2688)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !432)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !322, file: !323, line: 103, baseType: !443, size: 64, offset: 2752)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !322, file: !323, line: 104, baseType: !373, size: 64, offset: 2816)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !322, file: !323, line: 105, baseType: !378, size: 32, offset: 2880)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !322, file: !323, line: 106, baseType: !447, size: 128, offset: 2944)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 128, elements: !454)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !323, line: 64, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 61, size: 128, elements: !451)
!451 = !{!452, !453}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !450, file: !323, line: 62, baseType: !366, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !450, file: !323, line: 63, baseType: !316, size: 64, offset: 64)
!454 = !{!455}
!455 = !DISubrange(count: 2)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !322, file: !323, line: 107, baseType: !457, size: 64, offset: 3072)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 64, elements: !454)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !322, file: !323, line: 108, baseType: !316, size: 64, offset: 3136)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !322, file: !323, line: 109, baseType: !460, size: 64, offset: 3200)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!336, !316}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !322, file: !323, line: 111, baseType: !378, size: 32, offset: 3264)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !322, file: !323, line: 112, baseType: !465, size: 320, offset: 3328)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 320, elements: !508)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!336, !469, !320, !316}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !472)
!472 = !{!473, !474, !496, !497, !498, !499, !500, !501, !502, !503, !504}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !471, file: !10, line: 100, baseType: !378, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !471, file: !10, line: 101, baseType: !475, size: 64, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !476)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !478)
!478 = !{!479, !480, !481, !482, !483, !486, !487, !488, !489, !491, !493, !494, !495}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !477, file: !10, line: 84, baseType: !405, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !477, file: !10, line: 85, baseType: !405, size: 64, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !477, file: !10, line: 86, baseType: !316, size: 64, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !477, file: !10, line: 87, baseType: !397, size: 64, offset: 192)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !477, file: !10, line: 88, baseType: !484, size: 64, offset: 256)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !355)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !477, file: !10, line: 89, baseType: !357, size: 8, offset: 320)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !477, file: !10, line: 90, baseType: !405, size: 64, offset: 384)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !477, file: !10, line: 91, baseType: !317, size: 64, offset: 448)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !477, file: !10, line: 92, baseType: !490, size: 32, offset: 512)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !477, file: !10, line: 93, baseType: !492, size: 32, offset: 544)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !477, file: !10, line: 94, baseType: !475, size: 64, offset: 576)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !477, file: !10, line: 95, baseType: !405, size: 64, offset: 640)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !477, file: !10, line: 96, baseType: !316, size: 64, offset: 704)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !471, file: !10, line: 102, baseType: !405, size: 64, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !471, file: !10, line: 102, baseType: !405, size: 64, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !471, file: !10, line: 103, baseType: !405, size: 64, offset: 256)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !471, file: !10, line: 104, baseType: !312, size: 64, offset: 320)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !471, file: !10, line: 105, baseType: !490, size: 32, offset: 384)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !471, file: !10, line: 105, baseType: !490, size: 32, offset: 416)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !471, file: !10, line: 105, baseType: !490, size: 32, offset: 448)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !471, file: !10, line: 106, baseType: !320, size: 64, offset: 512)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !471, file: !10, line: 107, baseType: !505, size: 64, offset: 576)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!508 = !{!509}
!509 = !DISubrange(count: 5)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !322, file: !323, line: 113, baseType: !511, size: 320, offset: 3648)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 320, elements: !508)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!336, !320, !316}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !322, file: !323, line: 114, baseType: !516, size: 320, offset: 3968)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 320, elements: !508)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !322, file: !323, line: 115, baseType: !490, size: 32, offset: 4288)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !322, file: !323, line: 120, baseType: !505, size: 64, offset: 4352)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !322, file: !323, line: 121, baseType: !490, size: 32, offset: 4416)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !313, line: 331, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !313, line: 331, flags: DIFlagFwdDecl)
!523 = !{i32 7, !"Dwarf Version", i32 4}
!524 = !{i32 2, !"Debug Info Version", i32 3}
!525 = !{i32 1, !"wchar_size", i32 4}
!526 = !{i32 7, !"PIC Level", i32 2}
!527 = !{i32 7, !"uwtable", i32 1}
!528 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!529 = distinct !DISubprogram(name: "MatColoringCreateBipartiteGraph", scope: !530, file: !530, line: 4, type: !531, scopeLine: 5, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1345)
!530 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/color/utils/bipartite.c", directory: "/home/users/ndemeye/xSDK")
!531 = !DISubroutineType(types: !532)
!532 = !{!336, !533, !1340, !1340}
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatColoring", file: !36, line: 1312, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatColoring", file: !536, line: 647, size: 5248, elements: !537)
!536 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!537 = !{!538, !540, !569, !1331, !1332, !1333, !1334, !1335, !1337, !1338, !1339}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !535, file: !536, line: 648, baseType: !539, size: 4480)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !323, line: 122, baseType: !322)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !535, file: !536, line: 648, baseType: !541, size: 320, offset: 4480)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !542, size: 320, elements: !374)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatColoringOps", file: !536, line: 639, size: 320, elements: !543)
!543 = !{!544, !548, !552, !556, !565}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !542, file: !536, line: 640, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{!336, !533}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !542, file: !536, line: 641, baseType: !549, size: 64, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!336, !469, !533}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !542, file: !536, line: 642, baseType: !553, size: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{!336, !533, !342}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !542, file: !536, line: 643, baseType: !557, size: 64, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!336, !533, !560}
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !562, line: 51, baseType: !563)
!562 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !562, line: 51, flags: DIFlagFwdDecl)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "weights", scope: !542, file: !536, line: 644, baseType: !566, size: 64, offset: 256)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!336, !533, !434, !425}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !535, file: !536, line: 649, baseType: !570, size: 64, offset: 4800)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !571)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !536, line: 436, size: 23424, elements: !573)
!573 = !{!574, !575, !1077, !1097, !1098, !1099, !1101, !1102, !1103, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1227, !1228, !1244, !1245, !1246, !1247, !1248, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1283, !1303, !1304, !1306, !1307, !1308, !1309, !1310, !1311, !1329, !1330}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !572, file: !536, line: 437, baseType: !539, size: 4480)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !572, file: !536, line: 437, baseType: !576, size: 9472, offset: 4480)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !577, size: 9472, elements: !374)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !536, line: 32, size: 9472, elements: !578)
!578 = !{!579, !588, !592, !593, !600, !604, !605, !606, !607, !608, !609, !610, !633, !637, !642, !648, !667, !672, !676, !677, !682, !687, !688, !693, !697, !701, !705, !709, !713, !714, !715, !716, !717, !721, !722, !727, !728, !729, !730, !731, !736, !743, !748, !752, !756, !760, !764, !765, !769, !770, !777, !782, !783, !784, !785, !844, !851, !852, !856, !857, !861, !862, !866, !871, !872, !876, !880, !887, !888, !889, !890, !891, !892, !897, !898, !902, !906, !910, !911, !912, !916, !926, !927, !931, !932, !936, !937, !941, !942, !947, !948, !952, !956, !957, !958, !959, !960, !961, !962, !966, !967, !968, !969, !970, !971, !975, !976, !977, !978, !979, !980, !981, !982, !986, !990, !991, !992, !996, !997, !998, !999, !1000, !1001, !1002, !1006, !1007, !1008, !1013, !1017, !1018, !1022, !1023, !1024, !1025, !1051, !1055, !1056, !1057, !1058, !1059, !1063, !1064, !1065, !1066, !1067, !1071, !1075, !1076}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !577, file: !536, line: 34, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{!336, !570, !378, !583, !378, !583, !585, !587}
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !378)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !441)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !577, file: !536, line: 35, baseType: !589, size: 64, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{!336, !570, !378, !423, !425, !443}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !577, file: !536, line: 36, baseType: !589, size: 64, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !577, file: !536, line: 37, baseType: !594, size: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!336, !570, !597, !597}
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !598)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !577, file: !536, line: 38, baseType: !601, size: 64, offset: 256)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!336, !570, !597, !597, !597}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !577, file: !536, line: 40, baseType: !594, size: 64, offset: 320)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !577, file: !536, line: 41, baseType: !601, size: 64, offset: 384)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !577, file: !536, line: 42, baseType: !594, size: 64, offset: 448)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !577, file: !536, line: 43, baseType: !601, size: 64, offset: 512)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !577, file: !536, line: 44, baseType: !594, size: 64, offset: 576)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !577, file: !536, line: 46, baseType: !601, size: 64, offset: 640)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !577, file: !536, line: 47, baseType: !611, size: 64, offset: 704)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!336, !570, !614, !614, !617}
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !562, line: 11, baseType: !615)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !562, line: 11, flags: DIFlagFwdDecl)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !619)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !620)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !621)
!621 = !{!622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !620, file: !36, line: 1227, baseType: !432, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !620, file: !36, line: 1228, baseType: !432, size: 64, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !620, file: !36, line: 1229, baseType: !432, size: 64, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !620, file: !36, line: 1230, baseType: !432, size: 64, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !620, file: !36, line: 1231, baseType: !432, size: 64, offset: 256)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !620, file: !36, line: 1232, baseType: !432, size: 64, offset: 320)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !620, file: !36, line: 1233, baseType: !432, size: 64, offset: 384)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !620, file: !36, line: 1234, baseType: !432, size: 64, offset: 448)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !620, file: !36, line: 1236, baseType: !432, size: 64, offset: 512)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !620, file: !36, line: 1237, baseType: !432, size: 64, offset: 576)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !620, file: !36, line: 1238, baseType: !432, size: 64, offset: 640)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !577, file: !536, line: 48, baseType: !634, size: 64, offset: 768)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!336, !570, !614, !617}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !577, file: !536, line: 49, baseType: !638, size: 64, offset: 832)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!336, !570, !597, !432, !641, !432, !378, !378, !597}
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !577, file: !536, line: 50, baseType: !643, size: 64, offset: 896)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!336, !570, !646, !647}
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !577, file: !536, line: 52, baseType: !649, size: 64, offset: 960)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{!336, !570, !652, !653}
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !656)
!656 = !{!657, !658, !659, !660, !661, !662, !663, !664, !665, !666}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !655, file: !36, line: 593, baseType: !380, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !655, file: !36, line: 594, baseType: !380, size: 64, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !655, file: !36, line: 594, baseType: !380, size: 64, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !655, file: !36, line: 594, baseType: !380, size: 64, offset: 192)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !655, file: !36, line: 595, baseType: !380, size: 64, offset: 256)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !655, file: !36, line: 596, baseType: !380, size: 64, offset: 320)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !655, file: !36, line: 597, baseType: !380, size: 64, offset: 384)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !655, file: !36, line: 598, baseType: !380, size: 64, offset: 448)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !655, file: !36, line: 598, baseType: !380, size: 64, offset: 512)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !655, file: !36, line: 599, baseType: !380, size: 64, offset: 576)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !577, file: !536, line: 53, baseType: !668, size: 64, offset: 1024)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!336, !570, !570, !671}
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !577, file: !536, line: 54, baseType: !673, size: 64, offset: 1088)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!336, !570, !597}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !577, file: !536, line: 55, baseType: !594, size: 64, offset: 1152)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !577, file: !536, line: 56, baseType: !678, size: 64, offset: 1216)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{!336, !570, !681, !431}
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !577, file: !536, line: 58, baseType: !683, size: 64, offset: 1280)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{!336, !570, !686}
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !577, file: !536, line: 59, baseType: !683, size: 64, offset: 1344)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !577, file: !536, line: 60, baseType: !689, size: 64, offset: 1408)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!336, !570, !692, !490}
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !577, file: !536, line: 61, baseType: !694, size: 64, offset: 1472)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!336, !570}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !577, file: !536, line: 63, baseType: !698, size: 64, offset: 1536)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!336, !570, !378, !583, !441, !597, !597}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !577, file: !536, line: 64, baseType: !702, size: 64, offset: 1600)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!336, !570, !570, !614, !614, !617}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !577, file: !536, line: 65, baseType: !706, size: 64, offset: 1664)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!336, !570, !570, !617}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !577, file: !536, line: 66, baseType: !710, size: 64, offset: 1728)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!336, !570, !570, !614, !617}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !577, file: !536, line: 67, baseType: !706, size: 64, offset: 1792)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !577, file: !536, line: 69, baseType: !694, size: 64, offset: 1856)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !577, file: !536, line: 70, baseType: !702, size: 64, offset: 1920)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !577, file: !536, line: 71, baseType: !710, size: 64, offset: 1984)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !577, file: !536, line: 72, baseType: !718, size: 64, offset: 2048)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!336, !570, !647}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !577, file: !536, line: 73, baseType: !694, size: 64, offset: 2112)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !577, file: !536, line: 75, baseType: !723, size: 64, offset: 2176)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!336, !570, !726, !647}
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !577, file: !536, line: 76, baseType: !594, size: 64, offset: 2240)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !577, file: !536, line: 77, baseType: !594, size: 64, offset: 2304)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !577, file: !536, line: 78, baseType: !611, size: 64, offset: 2368)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !577, file: !536, line: 79, baseType: !634, size: 64, offset: 2432)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !577, file: !536, line: 81, baseType: !732, size: 64, offset: 2496)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!336, !570, !441, !570, !735}
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !577, file: !536, line: 82, baseType: !737, size: 64, offset: 2560)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!336, !570, !378, !740, !740, !646, !742}
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !614)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !577, file: !536, line: 83, baseType: !744, size: 64, offset: 2624)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!336, !570, !378, !747, !378}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !577, file: !536, line: 84, baseType: !749, size: 64, offset: 2688)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!336, !570, !378, !583, !378, !583, !440}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !577, file: !536, line: 85, baseType: !753, size: 64, offset: 2752)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!336, !570, !570, !735}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !577, file: !536, line: 87, baseType: !757, size: 64, offset: 2816)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{!336, !570, !597, !423}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !577, file: !536, line: 88, baseType: !761, size: 64, offset: 2880)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!336, !570, !441}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !577, file: !536, line: 89, baseType: !761, size: 64, offset: 2944)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !577, file: !536, line: 90, baseType: !766, size: 64, offset: 3008)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{!336, !570, !597, !587}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !577, file: !536, line: 91, baseType: !698, size: 64, offset: 3072)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !577, file: !536, line: 93, baseType: !771, size: 64, offset: 3136)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{!336, !570, !774}
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !775)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !577, file: !536, line: 94, baseType: !778, size: 64, offset: 3200)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!336, !570, !378, !490, !490, !423, !781, !781, !671}
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !577, file: !536, line: 95, baseType: !778, size: 64, offset: 3264)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !577, file: !536, line: 96, baseType: !778, size: 64, offset: 3328)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !577, file: !536, line: 97, baseType: !778, size: 64, offset: 3392)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !577, file: !536, line: 99, baseType: !786, size: 64, offset: 3456)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!336, !570, !561, !789}
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !536, line: 609, size: 6208, elements: !792)
!792 = !{!793, !794, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !813, !820, !821, !822, !823, !824, !825, !826, !827, !831, !832, !833, !834, !835, !837, !838, !839, !840, !841, !842, !843}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !791, file: !536, line: 610, baseType: !539, size: 4480)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !791, file: !536, line: 610, baseType: !795, size: 32, offset: 4480)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !374)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !791, file: !536, line: 611, baseType: !378, size: 32, offset: 4512)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !791, file: !536, line: 611, baseType: !378, size: 32, offset: 4544)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !791, file: !536, line: 611, baseType: !378, size: 32, offset: 4576)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !791, file: !536, line: 612, baseType: !378, size: 32, offset: 4608)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !791, file: !536, line: 613, baseType: !378, size: 32, offset: 4640)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !791, file: !536, line: 614, baseType: !423, size: 64, offset: 4672)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !791, file: !536, line: 615, baseType: !425, size: 64, offset: 4736)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !791, file: !536, line: 616, baseType: !747, size: 64, offset: 4800)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !791, file: !536, line: 617, baseType: !423, size: 64, offset: 4864)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !791, file: !536, line: 618, baseType: !806, size: 64, offset: 4928)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !536, line: 602, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !536, line: 598, size: 128, elements: !809)
!809 = !{!810, !811, !812}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !808, file: !536, line: 599, baseType: !378, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !808, file: !536, line: 600, baseType: !378, size: 32, offset: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !808, file: !536, line: 601, baseType: !440, size: 64, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !791, file: !536, line: 619, baseType: !814, size: 64, offset: 4992)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !536, line: 607, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !536, line: 604, size: 128, elements: !817)
!817 = !{!818, !819}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !816, file: !536, line: 605, baseType: !378, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !816, file: !536, line: 606, baseType: !440, size: 64, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !791, file: !536, line: 620, baseType: !440, size: 64, offset: 5056)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !791, file: !536, line: 621, baseType: !432, size: 64, offset: 5120)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !791, file: !536, line: 622, baseType: !432, size: 64, offset: 5184)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !791, file: !536, line: 623, baseType: !597, size: 64, offset: 5248)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !791, file: !536, line: 623, baseType: !597, size: 64, offset: 5312)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !791, file: !536, line: 623, baseType: !597, size: 64, offset: 5376)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !791, file: !536, line: 624, baseType: !490, size: 32, offset: 5440)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !791, file: !536, line: 625, baseType: !828, size: 64, offset: 5504)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DISubroutineType(types: !830)
!830 = !{!336}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !791, file: !536, line: 626, baseType: !316, size: 64, offset: 5568)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !791, file: !536, line: 627, baseType: !597, size: 64, offset: 5632)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !791, file: !536, line: 628, baseType: !378, size: 32, offset: 5696)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !791, file: !536, line: 629, baseType: !355, size: 64, offset: 5760)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !791, file: !536, line: 630, baseType: !836, size: 32, offset: 5824)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !791, file: !536, line: 631, baseType: !378, size: 32, offset: 5856)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !791, file: !536, line: 631, baseType: !378, size: 32, offset: 5888)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !791, file: !536, line: 632, baseType: !490, size: 32, offset: 5920)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !791, file: !536, line: 633, baseType: !490, size: 32, offset: 5952)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !791, file: !536, line: 634, baseType: !366, size: 64, offset: 6016)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !791, file: !536, line: 634, baseType: !316, size: 64, offset: 6080)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !791, file: !536, line: 635, baseType: !386, size: 64, offset: 6144)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !577, file: !536, line: 100, baseType: !845, size: 64, offset: 3520)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{!336, !570, !378, !378, !848, !560}
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !850)
!850 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !577, file: !536, line: 101, baseType: !694, size: 64, offset: 3584)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !577, file: !536, line: 102, baseType: !853, size: 64, offset: 3648)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{!336, !570, !614, !614, !647}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !577, file: !536, line: 103, baseType: !580, size: 64, offset: 3712)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !577, file: !536, line: 105, baseType: !858, size: 64, offset: 3776)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{!336, !570, !614, !614, !646, !647}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !577, file: !536, line: 106, baseType: !694, size: 64, offset: 3840)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !577, file: !536, line: 107, baseType: !863, size: 64, offset: 3904)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{!336, !570, !342}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !577, file: !536, line: 108, baseType: !867, size: 64, offset: 3968)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DISubroutineType(types: !869)
!869 = !{!336, !570, !870, !646, !647}
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !355)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !577, file: !536, line: 109, baseType: !828, size: 64, offset: 4032)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !577, file: !536, line: 111, baseType: !873, size: 64, offset: 4096)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{!336, !570, !570, !570, !432, !570}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !577, file: !536, line: 112, baseType: !877, size: 64, offset: 4160)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DISubroutineType(types: !879)
!879 = !{!336, !570, !570, !570, !570}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !577, file: !536, line: 113, baseType: !881, size: 64, offset: 4224)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!336, !570, !884, !884}
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !562, line: 30, baseType: !885)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !562, line: 30, flags: DIFlagFwdDecl)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !577, file: !536, line: 114, baseType: !580, size: 64, offset: 4288)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !577, file: !536, line: 115, baseType: !698, size: 64, offset: 4352)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !577, file: !536, line: 117, baseType: !757, size: 64, offset: 4416)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !577, file: !536, line: 118, baseType: !757, size: 64, offset: 4480)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !577, file: !536, line: 119, baseType: !867, size: 64, offset: 4544)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !577, file: !536, line: 120, baseType: !893, size: 64, offset: 4608)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DISubroutineType(types: !895)
!895 = !{!336, !570, !896, !671}
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !577, file: !536, line: 121, baseType: !828, size: 64, offset: 4672)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !577, file: !536, line: 123, baseType: !899, size: 64, offset: 4736)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{!336, !570, !378, !316}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !577, file: !536, line: 124, baseType: !903, size: 64, offset: 4800)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{!336, !570, !789, !597, !316}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !577, file: !536, line: 125, baseType: !907, size: 64, offset: 4864)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!336, !469, !570}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !577, file: !536, line: 126, baseType: !594, size: 64, offset: 4928)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !577, file: !536, line: 127, baseType: !594, size: 64, offset: 4992)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !577, file: !536, line: 129, baseType: !913, size: 64, offset: 5056)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{!336, !570, !747}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !577, file: !536, line: 130, baseType: !917, size: 64, offset: 5120)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{!336, !570, !920, !920}
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !921)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !923)
!923 = !{!924, !925}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !922, file: !60, line: 653, baseType: !378, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !922, file: !60, line: 653, baseType: !597, size: 64, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !577, file: !536, line: 131, baseType: !917, size: 64, offset: 5184)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !577, file: !536, line: 132, baseType: !928, size: 64, offset: 5248)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!336, !570, !423, !423, !423}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !577, file: !536, line: 133, baseType: !863, size: 64, offset: 5312)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !577, file: !536, line: 135, baseType: !933, size: 64, offset: 5376)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{!336, !570, !432, !671}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !577, file: !536, line: 136, baseType: !933, size: 64, offset: 5440)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !577, file: !536, line: 137, baseType: !938, size: 64, offset: 5504)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!336, !570, !671}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !577, file: !536, line: 138, baseType: !580, size: 64, offset: 5568)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !577, file: !536, line: 139, baseType: !943, size: 64, offset: 5632)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!336, !570, !946, !946}
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !577, file: !536, line: 141, baseType: !828, size: 64, offset: 5696)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !577, file: !536, line: 142, baseType: !949, size: 64, offset: 5760)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!336, !570, !570, !432, !570}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !577, file: !536, line: 143, baseType: !953, size: 64, offset: 5824)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!336, !570, !570, !570}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !577, file: !536, line: 144, baseType: !828, size: 64, offset: 5888)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !577, file: !536, line: 145, baseType: !949, size: 64, offset: 5952)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !577, file: !536, line: 147, baseType: !953, size: 64, offset: 6016)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !577, file: !536, line: 148, baseType: !828, size: 64, offset: 6080)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !577, file: !536, line: 149, baseType: !949, size: 64, offset: 6144)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !577, file: !536, line: 150, baseType: !953, size: 64, offset: 6208)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !577, file: !536, line: 151, baseType: !963, size: 64, offset: 6272)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!336, !570, !490}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !577, file: !536, line: 153, baseType: !694, size: 64, offset: 6336)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !577, file: !536, line: 154, baseType: !694, size: 64, offset: 6400)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !577, file: !536, line: 155, baseType: !694, size: 64, offset: 6464)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !577, file: !536, line: 156, baseType: !694, size: 64, offset: 6528)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !577, file: !536, line: 157, baseType: !863, size: 64, offset: 6592)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !577, file: !536, line: 159, baseType: !972, size: 64, offset: 6656)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!336, !570, !378, !585}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !577, file: !536, line: 160, baseType: !694, size: 64, offset: 6720)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !577, file: !536, line: 161, baseType: !694, size: 64, offset: 6784)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !577, file: !536, line: 162, baseType: !694, size: 64, offset: 6848)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !577, file: !536, line: 163, baseType: !694, size: 64, offset: 6912)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !577, file: !536, line: 165, baseType: !953, size: 64, offset: 6976)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !577, file: !536, line: 166, baseType: !953, size: 64, offset: 7040)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !577, file: !536, line: 167, baseType: !757, size: 64, offset: 7104)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !577, file: !536, line: 168, baseType: !983, size: 64, offset: 7168)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!336, !570, !597, !378}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !577, file: !536, line: 169, baseType: !987, size: 64, offset: 7232)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!336, !570, !671, !423}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !577, file: !536, line: 171, baseType: !718, size: 64, offset: 7296)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !577, file: !536, line: 172, baseType: !694, size: 64, offset: 7360)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !577, file: !536, line: 173, baseType: !993, size: 64, offset: 7424)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!336, !570, !423, !781}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !577, file: !536, line: 174, baseType: !853, size: 64, offset: 7488)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !577, file: !536, line: 175, baseType: !853, size: 64, offset: 7552)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !577, file: !536, line: 177, baseType: !594, size: 64, offset: 7616)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !577, file: !536, line: 178, baseType: !643, size: 64, offset: 7680)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !577, file: !536, line: 179, baseType: !594, size: 64, offset: 7744)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !577, file: !536, line: 180, baseType: !601, size: 64, offset: 7808)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !577, file: !536, line: 181, baseType: !1003, size: 64, offset: 7872)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!336, !570, !312, !646, !647}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !577, file: !536, line: 183, baseType: !913, size: 64, offset: 7936)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !577, file: !536, line: 184, baseType: !678, size: 64, offset: 8000)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !577, file: !536, line: 185, baseType: !1009, size: 64, offset: 8064)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!336, !570, !1012}
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !577, file: !536, line: 186, baseType: !1014, size: 64, offset: 8128)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!336, !570, !378, !583, !440}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !577, file: !536, line: 187, baseType: !737, size: 64, offset: 8192)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !577, file: !536, line: 189, baseType: !1019, size: 64, offset: 8256)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!336, !570, !378, !378, !423, !585}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !577, file: !536, line: 190, baseType: !828, size: 64, offset: 8320)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !577, file: !536, line: 191, baseType: !949, size: 64, offset: 8384)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !577, file: !536, line: 192, baseType: !953, size: 64, offset: 8448)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !577, file: !536, line: 193, baseType: !1026, size: 64, offset: 8512)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!336, !570, !561, !1029}
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1030)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !536, line: 660, size: 5312, elements: !1032)
!1032 = !{!1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1031, file: !536, line: 661, baseType: !539, size: 4480)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1031, file: !536, line: 661, baseType: !795, size: 32, offset: 4480)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1031, file: !536, line: 662, baseType: !378, size: 32, offset: 4512)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1031, file: !536, line: 662, baseType: !378, size: 32, offset: 4544)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1031, file: !536, line: 662, baseType: !378, size: 32, offset: 4576)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1031, file: !536, line: 663, baseType: !378, size: 32, offset: 4608)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1031, file: !536, line: 664, baseType: !378, size: 32, offset: 4640)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1031, file: !536, line: 665, baseType: !423, size: 64, offset: 4672)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1031, file: !536, line: 666, baseType: !423, size: 64, offset: 4736)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1031, file: !536, line: 667, baseType: !378, size: 32, offset: 4800)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1031, file: !536, line: 668, baseType: !836, size: 32, offset: 4832)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1031, file: !536, line: 670, baseType: !423, size: 64, offset: 4864)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1031, file: !536, line: 670, baseType: !423, size: 64, offset: 4928)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1031, file: !536, line: 671, baseType: !423, size: 64, offset: 4992)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1031, file: !536, line: 672, baseType: !423, size: 64, offset: 5056)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1031, file: !536, line: 673, baseType: !423, size: 64, offset: 5120)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1031, file: !536, line: 674, baseType: !378, size: 32, offset: 5184)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1031, file: !536, line: 675, baseType: !423, size: 64, offset: 5248)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !577, file: !536, line: 195, baseType: !1052, size: 64, offset: 8576)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!336, !1029, !570, !570}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !577, file: !536, line: 196, baseType: !1052, size: 64, offset: 8640)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !577, file: !536, line: 197, baseType: !828, size: 64, offset: 8704)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !577, file: !536, line: 198, baseType: !949, size: 64, offset: 8768)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !577, file: !536, line: 199, baseType: !953, size: 64, offset: 8832)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !577, file: !536, line: 201, baseType: !1060, size: 64, offset: 8896)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!336, !570, !378, !378}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !577, file: !536, line: 202, baseType: !732, size: 64, offset: 8960)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !577, file: !536, line: 203, baseType: !601, size: 64, offset: 9024)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !577, file: !536, line: 204, baseType: !786, size: 64, offset: 9088)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !577, file: !536, line: 205, baseType: !913, size: 64, offset: 9152)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !577, file: !536, line: 206, baseType: !1068, size: 64, offset: 9216)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!336, !312, !570, !378, !646, !647}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !577, file: !536, line: 208, baseType: !1072, size: 64, offset: 9280)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!336, !378, !742}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !577, file: !536, line: 209, baseType: !953, size: 64, offset: 9344)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !577, file: !536, line: 210, baseType: !749, size: 64, offset: 9408)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !572, file: !536, line: 438, baseType: !1078, size: 64, offset: 13952)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !562, line: 60, baseType: !1079)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1081)
!1081 = !{!1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1080, file: !114, line: 241, baseType: !312, size: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1080, file: !114, line: 242, baseType: !395, size: 32, offset: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1080, file: !114, line: 243, baseType: !378, size: 32, offset: 96)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1080, file: !114, line: 243, baseType: !378, size: 32, offset: 128)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1080, file: !114, line: 244, baseType: !378, size: 32, offset: 160)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1080, file: !114, line: 244, baseType: !378, size: 32, offset: 192)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1080, file: !114, line: 245, baseType: !423, size: 64, offset: 256)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1080, file: !114, line: 246, baseType: !490, size: 32, offset: 320)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1080, file: !114, line: 247, baseType: !378, size: 32, offset: 352)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1080, file: !114, line: 251, baseType: !378, size: 32, offset: 384)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1080, file: !114, line: 252, baseType: !884, size: 64, offset: 448)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1080, file: !114, line: 253, baseType: !490, size: 32, offset: 512)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1080, file: !114, line: 254, baseType: !378, size: 32, offset: 544)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1080, file: !114, line: 254, baseType: !378, size: 32, offset: 576)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1080, file: !114, line: 255, baseType: !378, size: 32, offset: 608)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !572, file: !536, line: 438, baseType: !1078, size: 64, offset: 14016)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !572, file: !536, line: 439, baseType: !316, size: 64, offset: 14080)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !572, file: !536, line: 440, baseType: !1100, size: 32, offset: 14144)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !572, file: !536, line: 441, baseType: !490, size: 32, offset: 14176)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !572, file: !536, line: 442, baseType: !490, size: 32, offset: 14208)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !572, file: !536, line: 443, baseType: !1104, size: 448, offset: 14272)
!1104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1105, size: 448, elements: !1106)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !355)
!1106 = !{!1107}
!1107 = !DISubrange(count: 7)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !572, file: !536, line: 444, baseType: !490, size: 32, offset: 14720)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !572, file: !536, line: 445, baseType: !490, size: 32, offset: 14752)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !572, file: !536, line: 446, baseType: !378, size: 32, offset: 14784)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !572, file: !536, line: 447, baseType: !416, size: 64, offset: 14848)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !572, file: !536, line: 448, baseType: !416, size: 64, offset: 14912)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !572, file: !536, line: 449, baseType: !654, size: 640, offset: 14976)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !572, file: !536, line: 450, baseType: !587, size: 32, offset: 15616)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !572, file: !536, line: 451, baseType: !1116, size: 2880, offset: 15680)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !536, line: 318, baseType: !1117)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !536, line: 319, size: 2880, elements: !1118)
!1118 = !{!1119, !1120, !1121, !1122, !1123, !1124, !1125, !1138, !1139, !1144, !1149, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1164, !1165, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1197, !1198, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1221, !1222, !1223, !1224, !1225}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1117, file: !536, line: 320, baseType: !378, size: 32)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1117, file: !536, line: 321, baseType: !378, size: 32, offset: 32)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1117, file: !536, line: 322, baseType: !378, size: 32, offset: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1117, file: !536, line: 323, baseType: !378, size: 32, offset: 96)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1117, file: !536, line: 324, baseType: !378, size: 32, offset: 128)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1117, file: !536, line: 325, baseType: !378, size: 32, offset: 160)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1117, file: !536, line: 326, baseType: !1126, size: 64, offset: 192)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !536, line: 293, baseType: !1127)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !536, line: 295, size: 448, elements: !1129)
!1129 = !{!1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1128, file: !536, line: 296, baseType: !1126, size: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1128, file: !536, line: 297, baseType: !440, size: 64, offset: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1128, file: !536, line: 297, baseType: !440, size: 64, offset: 128)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1128, file: !536, line: 298, baseType: !423, size: 64, offset: 192)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1128, file: !536, line: 298, baseType: !423, size: 64, offset: 256)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1128, file: !536, line: 299, baseType: !378, size: 32, offset: 320)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1128, file: !536, line: 300, baseType: !378, size: 32, offset: 352)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1128, file: !536, line: 301, baseType: !378, size: 32, offset: 384)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1117, file: !536, line: 326, baseType: !1126, size: 64, offset: 256)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1117, file: !536, line: 328, baseType: !1140, size: 64, offset: 320)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!336, !570, !1143, !423}
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1117, file: !536, line: 329, baseType: !1145, size: 64, offset: 384)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!336, !1143, !1148, !425, !425, !443, !423}
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1117, file: !536, line: 330, baseType: !1150, size: 64, offset: 448)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!336, !1143}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1117, file: !536, line: 331, baseType: !1150, size: 64, offset: 512)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1117, file: !536, line: 334, baseType: !312, size: 64, offset: 576)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1117, file: !536, line: 335, baseType: !395, size: 32, offset: 640)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1117, file: !536, line: 335, baseType: !395, size: 32, offset: 672)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1117, file: !536, line: 336, baseType: !395, size: 32, offset: 704)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1117, file: !536, line: 336, baseType: !395, size: 32, offset: 736)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1117, file: !536, line: 337, baseType: !1160, size: 64, offset: 768)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !313, line: 339, baseType: !1162)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !313, line: 339, flags: DIFlagFwdDecl)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1117, file: !536, line: 338, baseType: !1160, size: 64, offset: 832)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1117, file: !536, line: 339, baseType: !1166, size: 64, offset: 896)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !313, line: 341, baseType: !1168)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !313, line: 351, size: 192, elements: !1169)
!1169 = !{!1170, !1171, !1172, !1173, !1174}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1168, file: !313, line: 354, baseType: !72, size: 32)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1168, file: !313, line: 355, baseType: !72, size: 32, offset: 32)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1168, file: !313, line: 356, baseType: !72, size: 32, offset: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1168, file: !313, line: 361, baseType: !72, size: 32, offset: 96)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1168, file: !313, line: 362, baseType: !317, size: 64, offset: 128)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1117, file: !536, line: 340, baseType: !378, size: 32, offset: 960)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1117, file: !536, line: 340, baseType: !378, size: 32, offset: 992)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1117, file: !536, line: 341, baseType: !440, size: 64, offset: 1024)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1117, file: !536, line: 342, baseType: !423, size: 64, offset: 1088)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1117, file: !536, line: 343, baseType: !443, size: 64, offset: 1152)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1117, file: !536, line: 344, baseType: !425, size: 64, offset: 1216)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1117, file: !536, line: 345, baseType: !378, size: 32, offset: 1280)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1117, file: !536, line: 346, baseType: !1148, size: 64, offset: 1344)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1117, file: !536, line: 347, baseType: !490, size: 32, offset: 1408)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1117, file: !536, line: 348, baseType: !378, size: 32, offset: 1440)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1117, file: !536, line: 351, baseType: !490, size: 32, offset: 1472)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1117, file: !536, line: 352, baseType: !490, size: 32, offset: 1504)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1117, file: !536, line: 353, baseType: !395, size: 32, offset: 1536)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1117, file: !536, line: 354, baseType: !395, size: 32, offset: 1568)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1117, file: !536, line: 355, baseType: !1148, size: 64, offset: 1600)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1117, file: !536, line: 356, baseType: !1148, size: 64, offset: 1664)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1117, file: !536, line: 357, baseType: !1192, size: 64, offset: 1728)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !536, line: 310, baseType: !1194)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !536, line: 308, size: 32, elements: !1195)
!1195 = !{!1196}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1194, file: !536, line: 309, baseType: !378, size: 32)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1117, file: !536, line: 357, baseType: !1192, size: 64, offset: 1792)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1117, file: !536, line: 358, baseType: !1199, size: 64, offset: 1856)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !536, line: 316, baseType: !1201)
!1201 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !536, line: 312, size: 128, elements: !1202)
!1202 = !{!1203, !1204, !1205}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1201, file: !536, line: 313, baseType: !316, size: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1201, file: !536, line: 314, baseType: !378, size: 32, offset: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1201, file: !536, line: 315, baseType: !357, size: 8, offset: 96)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1117, file: !536, line: 359, baseType: !1199, size: 64, offset: 1920)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1117, file: !536, line: 360, baseType: !1199, size: 64, offset: 1984)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1117, file: !536, line: 361, baseType: !378, size: 32, offset: 2048)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1117, file: !536, line: 362, baseType: !395, size: 32, offset: 2080)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1117, file: !536, line: 363, baseType: !378, size: 32, offset: 2112)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1117, file: !536, line: 364, baseType: !1148, size: 64, offset: 2176)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1117, file: !536, line: 365, baseType: !1166, size: 64, offset: 2240)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1117, file: !536, line: 366, baseType: !395, size: 32, offset: 2304)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1117, file: !536, line: 367, baseType: !395, size: 32, offset: 2336)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1117, file: !536, line: 368, baseType: !1160, size: 64, offset: 2368)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1117, file: !536, line: 369, baseType: !1160, size: 64, offset: 2432)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1117, file: !536, line: 370, baseType: !1218, size: 64, offset: 2496)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1219)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64)
!1220 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1117, file: !536, line: 371, baseType: !1218, size: 64, offset: 2560)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1117, file: !536, line: 372, baseType: !1218, size: 64, offset: 2624)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1117, file: !536, line: 373, baseType: !520, size: 64, offset: 2688)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1117, file: !536, line: 374, baseType: !317, size: 64, offset: 2752)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1117, file: !536, line: 375, baseType: !1226, size: 64, offset: 2816)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !572, file: !536, line: 451, baseType: !1116, size: 2880, offset: 18560)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !572, file: !536, line: 452, baseType: !1229, size: 64, offset: 21440)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1230)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64)
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !536, line: 681, size: 4864, elements: !1232)
!1232 = !{!1233, !1234, !1235, !1236, !1237, !1238, !1239, !1243}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1231, file: !536, line: 682, baseType: !539, size: 4480)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1231, file: !536, line: 682, baseType: !795, size: 32, offset: 4480)
