; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/error/errstop.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/error/errstop.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.ompi_communicator_t = type opaque
%struct._n_PetscOptions = type opaque

@petscstack = external local_unnamed_addr global %struct.PetscStack*, align 8
@__func__.PetscMPIAbortErrorHandler = private unnamed_addr constant [26 x i8] c"PetscMPIAbortErrorHandler\00", align 1
@.str = private unnamed_addr constant [77 x i8] c"/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/error/errstop.c\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c" \00", align 1
@PetscErrorPrintf = external local_unnamed_addr global i32 (i8*, ...)*, align 8
@.str.2 = private unnamed_addr constant [15 x i8] c"%s() at %s:%d\0A\00", align 1
@.str.3 = private unnamed_addr constant [48 x i8] c"Out of memory. This could be due to allocating\0A\00", align 1

!110 = !DILocation(line: 53, column: 9, scope: !111)
!111 = distinct !DILexicalBlock(scope: !106, file: !28, line: 52, column: 10)
!112 = !DILocation(line: 53, column: 81, scope: !111)
!113 = !{!114, !114, i64 0}
!114 = !{!"double", !63, i64 0}
!115 = !DILocation(line: 53, column: 85, scope: !111)
!116 = !DILocation(line: 53, column: 7, scope: !111)
!117 = !DILocation(line: 54, column: 11, scope: !118)
!118 = distinct !DILexicalBlock(scope: !111, file: !28, line: 54, column: 11)
!119 = !DILocation(line: 54, column: 11, scope: !111)
!120 = !DILocation(line: 54, column: 33, scope: !118)
!121 = !DILocation(line: 54, column: 17, scope: !118)
!122 = !DILocation(line: 55, column: 14, scope: !118)
!123 = !DILocation(line: 55, column: 12, scope: !118)
!124 = !DILocation(line: 58, column: 7, scope: !125)
!125 = distinct !DILexicalBlock(scope: !126, file: !28, line: 57, column: 34)
!126 = distinct !DILexicalBlock(scope: !92, file: !28, line: 57, column: 14)
!127 = !DILocation(line: 58, column: 5, scope: !125)
!128 = !DILocation(line: 59, column: 7, scope: !125)
!129 = !DILocation(line: 59, column: 5, scope: !125)
!130 = !DILocation(line: 60, column: 7, scope: !125)
!131 = !DILocation(line: 60, column: 5, scope: !125)
!132 = !DILocation(line: 61, column: 3, scope: !125)
!133 = !DILocation(line: 61, column: 36, scope: !134)
!134 = distinct !DILexicalBlock(scope: !126, file: !28, line: 61, column: 14)
!135 = !DILocation(line: 61, column: 34, scope: !134)
!136 = !DILocation(line: 62, column: 10, scope: !134)
!137 = !DILocation(line: 62, column: 8, scope: !134)
!138 = !DILocation(line: 64, column: 3, scope: !56)
!139 = !DILocation(line: 0, scope: !56)
!140 = !DILocation(line: 64, column: 3, scope: !141)
!141 = distinct !DILexicalBlock(scope: !56, file: !28, line: 64, column: 3)
!142 = !DILocation(line: 64, column: 3, scope: !143)
!143 = distinct !DILexicalBlock(scope: !56, file: !28, line: 64, column: 3)
!144 = !DILocation(line: 64, column: 3, scope: !27)
!145 = !DILocation(line: 65, column: 3, scope: !146)
!146 = distinct !DILexicalBlock(scope: !147, file: !28, line: 65, column: 3)
!147 = distinct !DILexicalBlock(scope: !148, file: !28, line: 65, column: 3)
!148 = distinct !DILexicalBlock(scope: !27, file: !28, line: 65, column: 3)
!149 = !DILocation(line: 65, column: 3, scope: !147)
!150 = !DILocation(line: 65, column: 3, scope: !151)
!151 = distinct !DILexicalBlock(scope: !152, file: !28, line: 65, column: 3)
!152 = distinct !DILexicalBlock(scope: !146, file: !28, line: 65, column: 3)
!153 = !DILocation(line: 65, column: 3, scope: !152)
!154 = !DILocation(line: 65, column: 3, scope: !155)
!155 = distinct !DILexicalBlock(scope: !156, file: !28, line: 65, column: 3)
!156 = distinct !DILexicalBlock(scope: !151, file: !28, line: 65, column: 3)
!157 = !{!79, !63, i64 1544}
!158 = !DILocation(line: 65, column: 3, scope: !156)
!159 = !DILocation(line: 65, column: 3, scope: !160)
!160 = distinct !DILexicalBlock(scope: !155, file: !28, line: 65, column: 3)
!161 = !DILocation(line: 65, column: 3, scope: !162)
!162 = distinct !DILexicalBlock(scope: !151, file: !28, line: 65, column: 3)
!163 = !DILocation(line: 65, column: 3, scope: !164)
!164 = distinct !DILexicalBlock(scope: !162, file: !28, line: 65, column: 3)
!165 = !DILocation(line: 65, column: 3, scope: !166)
!166 = distinct !DILexicalBlock(scope: !167, file: !28, line: 65, column: 3)
!167 = distinct !DILexicalBlock(scope: !164, file: !28, line: 65, column: 3)
!168 = !DILocation(line: 65, column: 3, scope: !167)
!169 = !DILocation(line: 65, column: 3, scope: !170)
!170 = distinct !DILexicalBlock(scope: !166, file: !28, line: 65, column: 3)
!171 = !DILocation(line: 66, column: 1, scope: !27)
!172 = !DISubprogram(name: "PetscMallocGetCurrentUsage", scope: !173, file: !173, line: 1319, type: !174, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !177)
!173 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!174 = !DISubroutineType(types: !175)
!175 = !{!17, !176}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!177 = !{}
!178 = !DISubprogram(name: "PetscMemoryGetCurrentUsage", scope: !173, file: !173, line: 1415, type: !174, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !177)
!179 = !DISubprogram(name: "PetscOptionsGetBool", scope: !180, file: !180, line: 20, type: !181, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !177)
!180 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!181 = !DISubroutineType(types: !182)
!182 = !{!17, !183, !18, !18, !185, !185}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !180, line: 10, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!186 = !DISubprogram(name: "PetscOptionsHasName", scope: !180, file: !180, line: 19, type: !187, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !177)
!187 = !DISubroutineType(types: !188)
!188 = !{!17, !183, !18, !18, !185}
!189 = !DISubprogram(name: "PetscMallocView", scope: !173, file: !173, line: 1318, type: !190, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !177)
!190 = !DISubroutineType(types: !191)
!191 = !{!17, !192}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !194, line: 245, size: 1728, elements: !195)
!194 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/libio.h", directory: "")
!195 = !{!196, !197, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !216, !217, !218, !219, !223, !225, !227, !231, !234, !236, !237, !238, !239, !240, !244, !245}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !193, file: !194, line: 246, baseType: !17, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !193, file: !194, line: 251, baseType: !198, size: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !193, file: !194, line: 252, baseType: !198, size: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !193, file: !194, line: 253, baseType: !198, size: 64, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !193, file: !194, line: 254, baseType: !198, size: 64, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !193, file: !194, line: 255, baseType: !198, size: 64, offset: 320)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !193, file: !194, line: 256, baseType: !198, size: 64, offset: 384)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !193, file: !194, line: 257, baseType: !198, size: 64, offset: 448)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !193, file: !194, line: 258, baseType: !198, size: 64, offset: 512)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !193, file: !194, line: 260, baseType: !198, size: 64, offset: 576)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !193, file: !194, line: 261, baseType: !198, size: 64, offset: 640)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !193, file: !194, line: 262, baseType: !198, size: 64, offset: 704)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !193, file: !194, line: 264, baseType: !210, size: 64, offset: 768)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !194, line: 160, size: 192, elements: !212)
!212 = !{!213, !214, !215}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !211, file: !194, line: 161, baseType: !210, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !211, file: !194, line: 162, baseType: !192, size: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !211, file: !194, line: 166, baseType: !17, size: 32, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !193, file: !194, line: 266, baseType: !192, size: 64, offset: 832)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !193, file: !194, line: 268, baseType: !17, size: 32, offset: 896)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !193, file: !194, line: 272, baseType: !17, size: 32, offset: 928)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !193, file: !194, line: 274, baseType: !220, size: 64, offset: 960)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !221, line: 140, baseType: !222)
!221 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!222 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !193, file: !194, line: 278, baseType: !224, size: 16, offset: 1024)
!224 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !193, file: !194, line: 279, baseType: !226, size: 8, offset: 1040)
!226 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !193, file: !194, line: 280, baseType: !228, size: 8, offset: 1048)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 1)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !193, file: !194, line: 284, baseType: !232, size: 64, offset: 1088)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !194, line: 154, baseType: null)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !193, file: !194, line: 293, baseType: !235, size: 64, offset: 1152)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !221, line: 141, baseType: !222)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !193, file: !194, line: 301, baseType: !37, size: 64, offset: 1216)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !193, file: !194, line: 302, baseType: !37, size: 64, offset: 1280)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !193, file: !194, line: 303, baseType: !37, size: 64, offset: 1344)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !193, file: !194, line: 304, baseType: !37, size: 64, offset: 1408)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !193, file: !194, line: 306, baseType: !241, size: 64, offset: 1472)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !242, line: 46, baseType: !243)
!242 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!243 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !193, file: !194, line: 307, baseType: !17, size: 32, offset: 1536)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !193, file: !194, line: 309, baseType: !246, size: 160, offset: 1568)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 160, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 20)
!249 = !DISubprogram(name: "PetscMallocDump", scope: !173, file: !173, line: 1317, type: !190, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !177)
!250 = !DISubprogram(name: "PetscAbortFindSourceFile_Private", scope: !4, file: !4, line: 509, type: !251, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !177)
!251 = !DISubroutineType(types: !252)
!252 = !{!17, !18, !253}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!254 = !DISubprogram(name: "PetscSleep", scope: !173, file: !173, line: 1420, type: !255, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !177)
!255 = !DISubroutineType(types: !256)
!256 = !{!17, !53}
!257 = !DISubprogram(name: "MPI_Abort", scope: !33, file: !33, line: 1195, type: !258, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !177)
!258 = !DISubroutineType(types: !259)
!259 = !{!17, !34, !17}
