; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/fileio/fretrieve.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/fileio/fretrieve.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_datatype_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct._p_PetscObject = type opaque
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.ompi_op_t = type opaque

@petscstack = external local_unnamed_addr global %struct.PetscStack*, align 8
@__func__.Petsc_DelTmpShared = private unnamed_addr constant [19 x i8] c"Petsc_DelTmpShared\00", align 1
@.str = private unnamed_addr constant [80 x i8] c"/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/fileio/fretrieve.c\00", align 1
@.str.1 = private unnamed_addr constant [45 x i8] c"Deleting tmp/shared data in an MPI_Comm %ld\0A\00", align 1

!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !7, line: 170, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 170, baseType: !16, size: 32, elements: !17)
!16 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!17 = !{!18, !19}
!18 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!20 = distinct !DICompileUnit(language: DW_LANG_C99, file: !21, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !22, retainedTypes: !29, globals: !51, splitDebugInlining: false, nameTableKind: None)
!21 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/fileio/fretrieve.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!22 = !{!23, !15}
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !24, line: 663, baseType: !16, size: 32, elements: !25)
!24 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!25 = !{!26, !27, !28}
!26 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!27 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!28 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!29 = !{!30, !33, !34, !35, !9, !8, !37, !39, !40, !41, !44, !45, !48, !14, !16}
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !7, line: 430, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !7, line: 430, flags: DIFlagFwdDecl)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!34 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !42, line: 46, baseType: !43)
!42 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!43 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !7, line: 49, baseType: !8)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !10, line: 331, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !10, line: 331, flags: DIFlagFwdDecl)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !10, line: 338, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !10, line: 338, flags: DIFlagFwdDecl)
!51 = !{!0, !52}
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "Petsc_WD_keyval", scope: !54, file: !3, line: 247, type: !44, isLocal: true, isDefinition: true)
!54 = distinct !DISubprogram(name: "PetscSharedWorkingDirectory", scope: !3, file: !3, line: 241, type: !4, scopeLine: 242, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !55)
!55 = !{!56, !57, !58, !59, !60, !61, !63, !64, !65, !66, !67, !68, !124, !125, !127, !133, !134, !136, !138, !142, !145, !146, !148, !151, !152, !158, !160, !162, !165, !166, !168, !170, !172, !175, !176, !181, !184, !185, !187, !191, !192, !194, !197, !198, !200, !203, !204, !206, !209, !210}
!56 = !DILocalVariable(name: "comm", arg: 1, scope: !54, file: !3, line: 241, type: !9)
!57 = !DILocalVariable(name: "shared", arg: 2, scope: !54, file: !3, line: 241, type: !13)
!58 = !DILocalVariable(name: "ierr", scope: !54, file: !3, line: 243, type: !6)
!59 = !DILocalVariable(name: "size", scope: !54, file: !3, line: 244, type: !44)
!60 = !DILocalVariable(name: "rank", scope: !54, file: !3, line: 244, type: !44)
!61 = !DILocalVariable(name: "tagvalp", scope: !54, file: !3, line: 244, type: !62)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!63 = !DILocalVariable(name: "sum", scope: !54, file: !3, line: 244, type: !44)
!64 = !DILocalVariable(name: "cnt", scope: !54, file: !3, line: 244, type: !44)
!65 = !DILocalVariable(name: "i", scope: !54, file: !3, line: 244, type: !44)
!66 = !DILocalVariable(name: "flg", scope: !54, file: !3, line: 245, type: !14)
!67 = !DILocalVariable(name: "iflg", scope: !54, file: !3, line: 245, type: !14)
!68 = !DILocalVariable(name: "fd", scope: !54, file: !3, line: 246, type: !69)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !71, line: 7, baseType: !72)
!71 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !73, line: 245, size: 1728, elements: !74)
!73 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/libio.h", directory: "")
!74 = !{!75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !95, !96, !97, !98, !101, !103, !105, !109, !112, !114, !115, !116, !117, !118, !119, !120}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !72, file: !73, line: 246, baseType: !8, size: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !72, file: !73, line: 251, baseType: !35, size: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !72, file: !73, line: 252, baseType: !35, size: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !72, file: !73, line: 253, baseType: !35, size: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !72, file: !73, line: 254, baseType: !35, size: 64, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !72, file: !73, line: 255, baseType: !35, size: 64, offset: 320)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !72, file: !73, line: 256, baseType: !35, size: 64, offset: 384)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !72, file: !73, line: 257, baseType: !35, size: 64, offset: 448)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !72, file: !73, line: 258, baseType: !35, size: 64, offset: 512)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !72, file: !73, line: 260, baseType: !35, size: 64, offset: 576)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !72, file: !73, line: 261, baseType: !35, size: 64, offset: 640)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !72, file: !73, line: 262, baseType: !35, size: 64, offset: 704)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !72, file: !73, line: 264, baseType: !88, size: 64, offset: 768)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !73, line: 160, size: 192, elements: !90)
!90 = !{!91, !92, !94}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !89, file: !73, line: 161, baseType: !88, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !89, file: !73, line: 162, baseType: !93, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !89, file: !73, line: 166, baseType: !8, size: 32, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !72, file: !73, line: 266, baseType: !93, size: 64, offset: 832)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !72, file: !73, line: 268, baseType: !8, size: 32, offset: 896)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !72, file: !73, line: 272, baseType: !8, size: 32, offset: 928)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !72, file: !73, line: 274, baseType: !99, size: 64, offset: 960)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !100, line: 140, baseType: !34)
!100 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !72, file: !73, line: 278, baseType: !102, size: 16, offset: 1024)
!102 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !72, file: !73, line: 279, baseType: !104, size: 8, offset: 1040)
!104 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !72, file: !73, line: 280, baseType: !106, size: 8, offset: 1048)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 1)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !72, file: !73, line: 284, baseType: !110, size: 64, offset: 1088)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !73, line: 154, baseType: null)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !72, file: !73, line: 293, baseType: !113, size: 64, offset: 1152)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !100, line: 141, baseType: !34)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !72, file: !73, line: 301, baseType: !33, size: 64, offset: 1216)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !72, file: !73, line: 302, baseType: !33, size: 64, offset: 1280)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !72, file: !73, line: 303, baseType: !33, size: 64, offset: 1344)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !72, file: !73, line: 304, baseType: !33, size: 64, offset: 1408)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !72, file: !73, line: 306, baseType: !41, size: 64, offset: 1472)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !72, file: !73, line: 307, baseType: !8, size: 32, offset: 1536)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !72, file: !73, line: 309, baseType: !121, size: 160, offset: 1568)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 160, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 20)
!124 = !DILocalVariable(name: "err", scope: !54, file: !3, line: 248, type: !8)
!125 = !DILocalVariable(name: "_7_errorcode", scope: !126, file: !3, line: 251, type: !6)
!126 = distinct !DILexicalBlock(scope: !54, file: !3, line: 251, column: 36)
!127 = !DILocalVariable(name: "_7_errorstring", scope: !128, file: !3, line: 251, type: !130)
!128 = distinct !DILexicalBlock(scope: !129, file: !3, line: 251, column: 36)
!129 = distinct !DILexicalBlock(scope: !126, file: !3, line: 251, column: 36)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 2048, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 256)
!133 = !DILocalVariable(name: "_7_resultlen", scope: !128, file: !3, line: 251, type: !44)
!134 = !DILocalVariable(name: "ierr__", scope: !135, file: !3, line: 257, type: !6)
!135 = distinct !DILexicalBlock(scope: !54, file: !3, line: 257, column: 80)
!136 = !DILocalVariable(name: "ierr__", scope: !137, file: !3, line: 263, type: !6)
!137 = distinct !DILexicalBlock(scope: !54, file: !3, line: 263, column: 84)
!138 = !DILocalVariable(name: "_7_errorcode", scope: !139, file: !3, line: 270, type: !6)
!139 = distinct !DILexicalBlock(scope: !140, file: !3, line: 270, column: 99)
!140 = distinct !DILexicalBlock(scope: !141, file: !3, line: 269, column: 46)
!141 = distinct !DILexicalBlock(scope: !54, file: !3, line: 269, column: 7)
!142 = !DILocalVariable(name: "_7_errorstring", scope: !143, file: !3, line: 270, type: !130)
!143 = distinct !DILexicalBlock(scope: !144, file: !3, line: 270, column: 99)
!144 = distinct !DILexicalBlock(scope: !139, file: !3, line: 270, column: 99)
!145 = !DILocalVariable(name: "_7_resultlen", scope: !143, file: !3, line: 270, type: !44)
!146 = !DILocalVariable(name: "_7_errorcode", scope: !147, file: !3, line: 273, type: !6)
!147 = distinct !DILexicalBlock(scope: !54, file: !3, line: 273, column: 79)
!148 = !DILocalVariable(name: "_7_errorstring", scope: !149, file: !3, line: 273, type: !130)
!149 = distinct !DILexicalBlock(scope: !150, file: !3, line: 273, column: 79)
!150 = distinct !DILexicalBlock(scope: !147, file: !3, line: 273, column: 79)
!151 = !DILocalVariable(name: "_7_resultlen", scope: !149, file: !3, line: 273, type: !44)
!152 = !DILocalVariable(name: "filename", scope: !153, file: !3, line: 275, type: !155)
!153 = distinct !DILexicalBlock(scope: !154, file: !3, line: 274, column: 14)
!154 = distinct !DILexicalBlock(scope: !54, file: !3, line: 274, column: 7)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 32768, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 4096)
!158 = !DILocalVariable(name: "ierr__", scope: !159, file: !3, line: 278, type: !6)
!159 = distinct !DILexicalBlock(scope: !153, file: !3, line: 278, column: 37)
!160 = !DILocalVariable(name: "_7_errorcode", scope: !161, file: !3, line: 279, type: !6)
!161 = distinct !DILexicalBlock(scope: !153, file: !3, line: 279, column: 60)
!162 = !DILocalVariable(name: "_7_errorstring", scope: !163, file: !3, line: 279, type: !130)
!163 = distinct !DILexicalBlock(scope: !164, file: !3, line: 279, column: 60)
!164 = distinct !DILexicalBlock(scope: !161, file: !3, line: 279, column: 60)
!165 = !DILocalVariable(name: "_7_resultlen", scope: !163, file: !3, line: 279, type: !44)
!166 = !DILocalVariable(name: "ierr__", scope: !167, file: !3, line: 281, type: !6)
!167 = distinct !DILexicalBlock(scope: !153, file: !3, line: 281, column: 51)
!168 = !DILocalVariable(name: "ierr__", scope: !169, file: !3, line: 282, type: !6)
!169 = distinct !DILexicalBlock(scope: !153, file: !3, line: 282, column: 53)
!170 = !DILocalVariable(name: "_7_errorcode", scope: !171, file: !3, line: 283, type: !6)
