; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/gmreig.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/gmreig.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque

!68 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!69 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!70 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!72 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 70, baseType: !5, size: 32, elements: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!105 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 451, baseType: !26, size: 32, elements: !108)
!108 = !{!109, !110, !111, !112, !113}
!109 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!110 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!111 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!112 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!113 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 297, baseType: !5, size: 32, elements: !115)
!115 = !{!116, !117, !118}
!116 = !DIEnumerator(name: "KSP_GMRES_CGS_REFINE_NEVER", value: 0, isUnsigned: true)
!117 = !DIEnumerator(name: "KSP_GMRES_CGS_REFINE_IFNEEDED", value: 1, isUnsigned: true)
!118 = !DIEnumerator(name: "KSP_GMRES_CGS_REFINE_ALWAYS", value: 2, isUnsigned: true)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !120, line: 663, baseType: !5, size: 32, elements: !121)
!120 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!121 = !{!122, !123, !124}
!122 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!123 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!124 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !120, line: 726, baseType: !5, size: 32, elements: !126)
!126 = !{!127, !128}
!127 = !DIEnumerator(name: "PETSC_FP_TRAP_OFF", value: 0, isUnsigned: true)
!128 = !DIEnumerator(name: "PETSC_FP_TRAP_ON", value: 1, isUnsigned: true)
!129 = !{!130, !181, !260, !202, !331, !26, !178, !622, !250}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP_GMRES", file: !132, line: 55, baseType: !133)
!132 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/ksp/impls/gmres/gmresimpl.h", directory: "/home/users/ndemeye/xSDK")
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !132, line: 53, size: 1600, elements: !134)
!134 = !{!135, !140, !141, !142, !143, !144, !145, !146, !148, !149, !150, !152, !153, !604, !606, !607, !608, !609, !610, !611, !612, !614, !615, !616, !617, !618, !619, !620, !621}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "hh_origin", scope: !133, file: !132, line: 54, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !139)
!139 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "hes_origin", scope: !133, file: !132, line: 54, baseType: !136, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "hes_ritz", scope: !133, file: !132, line: 54, baseType: !136, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "cc_origin", scope: !133, file: !132, line: 54, baseType: !136, size: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "ss_origin", scope: !133, file: !132, line: 54, baseType: !136, size: 64, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "rs_origin", scope: !133, file: !132, line: 54, baseType: !136, size: 64, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "orthogwork", scope: !133, file: !132, line: 54, baseType: !136, size: 64, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "Dsvd", scope: !133, file: !132, line: 54, baseType: !147, size: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "Rsvd", scope: !133, file: !132, line: 54, baseType: !136, size: 64, offset: 512)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "haptol", scope: !133, file: !132, line: 54, baseType: !138, size: 64, offset: 576)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "max_k", scope: !133, file: !132, line: 54, baseType: !151, size: 32, offset: 640)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nextra_vecs", scope: !133, file: !132, line: 54, baseType: !151, size: 32, offset: 672)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "orthog", scope: !133, file: !132, line: 54, baseType: !154, size: 64, offset: 704)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!157, !158, !151}
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !33, line: 22, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !102, line: 75, size: 12800, elements: !161)
!161 = !{!162, !365, !419, !424, !425, !426, !427, !457, !458, !459, !460, !461, !463, !468, !469, !470, !471, !472, !473, !474, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !497, !503, !504, !505, !506, !511, !512, !513, !514, !519, !520, !521, !522, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !574, !575, !576, !577, !578, !585, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !601, !602, !603}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !160, file: !102, line: 76, baseType: !163, size: 4480)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !164, line: 122, baseType: !165)
!164 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !164, line: 73, size: 4480, elements: !166)
!166 = !{!167, !169, !223, !224, !225, !227, !228, !229, !230, !238, !239, !241, !245, !249, !251, !252, !253, !254, !255, !256, !257, !258, !259, !261, !263, !264, !265, !267, !268, !270, !272, !273, !274, !275, !276, !277, !279, !280, !281, !282, !283, !284, !286, !287, !288, !298, !300, !301, !305, !306, !355, !360, !362, !363, !364}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !165, file: !164, line: 74, baseType: !168, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !165, file: !164, line: 75, baseType: !170, size: 448, offset: 64)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 448, elements: !221)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !164, line: 53, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 45, size: 448, elements: !173)
!173 = !{!174, !185, !193, !198, !205, !209, !216}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !172, file: !164, line: 46, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!157, !178, !180}
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !182, line: 330, baseType: !183)
!182 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !182, line: 330, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !172, file: !164, line: 47, baseType: !186, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!157, !178, !189}
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !190, line: 16, baseType: !191)
!190 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !190, line: 16, flags: DIFlagFwdDecl)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !172, file: !164, line: 48, baseType: !194, size: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!157, !197}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !172, file: !164, line: 49, baseType: !199, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!157, !178, !202, !178}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!204 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !172, file: !164, line: 50, baseType: !206, size: 64, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!157, !178, !202, !197}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !172, file: !164, line: 51, baseType: !210, size: 64, offset: 320)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!157, !178, !202, !213}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{null}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !172, file: !164, line: 52, baseType: !217, size: 64, offset: 384)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!157, !178, !202, !220}
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!221 = !{!222}
!222 = !DISubrange(count: 1)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !165, file: !164, line: 76, baseType: !181, size: 64, offset: 512)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !165, file: !164, line: 77, baseType: !151, size: 32, offset: 576)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !165, file: !164, line: 78, baseType: !226, size: 64, offset: 640)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !139)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !165, file: !164, line: 78, baseType: !226, size: 64, offset: 704)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !165, file: !164, line: 78, baseType: !226, size: 64, offset: 768)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !165, file: !164, line: 78, baseType: !226, size: 64, offset: 832)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !165, file: !164, line: 79, baseType: !231, size: 64, offset: 896)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !234, line: 27, baseType: !235)
!234 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !236, line: 43, baseType: !237)
!236 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!237 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !165, file: !164, line: 80, baseType: !151, size: 32, offset: 960)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !165, file: !164, line: 81, baseType: !240, size: 32, offset: 992)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !165, file: !164, line: 82, baseType: !242, size: 64, offset: 1024)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !165, file: !164, line: 83, baseType: !246, size: 64, offset: 1088)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !165, file: !164, line: 84, baseType: !250, size: 64, offset: 1152)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !165, file: !164, line: 85, baseType: !250, size: 64, offset: 1216)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !165, file: !164, line: 86, baseType: !250, size: 64, offset: 1280)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !165, file: !164, line: 87, baseType: !250, size: 64, offset: 1344)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !165, file: !164, line: 88, baseType: !178, size: 64, offset: 1408)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !165, file: !164, line: 89, baseType: !231, size: 64, offset: 1472)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !165, file: !164, line: 90, baseType: !250, size: 64, offset: 1536)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !165, file: !164, line: 91, baseType: !250, size: 64, offset: 1600)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !165, file: !164, line: 92, baseType: !151, size: 32, offset: 1664)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !165, file: !164, line: 93, baseType: !260, size: 64, offset: 1728)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !165, file: !164, line: 94, baseType: !262, size: 64, offset: 1792)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !232)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !165, file: !164, line: 95, baseType: !151, size: 32, offset: 1856)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !165, file: !164, line: 95, baseType: !151, size: 32, offset: 1888)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !165, file: !164, line: 96, baseType: !266, size: 64, offset: 1920)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !165, file: !164, line: 96, baseType: !266, size: 64, offset: 1984)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !165, file: !164, line: 97, baseType: !269, size: 64, offset: 2048)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !165, file: !164, line: 97, baseType: !271, size: 64, offset: 2112)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !165, file: !164, line: 98, baseType: !151, size: 32, offset: 2176)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !165, file: !164, line: 98, baseType: !151, size: 32, offset: 2208)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !165, file: !164, line: 99, baseType: !266, size: 64, offset: 2240)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !165, file: !164, line: 99, baseType: !266, size: 64, offset: 2304)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !165, file: !164, line: 100, baseType: !147, size: 64, offset: 2368)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !165, file: !164, line: 100, baseType: !278, size: 64, offset: 2432)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !165, file: !164, line: 101, baseType: !151, size: 32, offset: 2496)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !165, file: !164, line: 101, baseType: !151, size: 32, offset: 2528)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !165, file: !164, line: 102, baseType: !266, size: 64, offset: 2560)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !165, file: !164, line: 102, baseType: !266, size: 64, offset: 2624)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !165, file: !164, line: 103, baseType: !136, size: 64, offset: 2688)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !165, file: !164, line: 103, baseType: !285, size: 64, offset: 2752)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !165, file: !164, line: 104, baseType: !220, size: 64, offset: 2816)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !165, file: !164, line: 105, baseType: !151, size: 32, offset: 2880)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !165, file: !164, line: 106, baseType: !289, size: 128, offset: 2944)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 128, elements: !296)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !164, line: 64, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 61, size: 128, elements: !293)
!293 = !{!294, !295}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !292, file: !164, line: 62, baseType: !213, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !292, file: !164, line: 63, baseType: !260, size: 64, offset: 64)
!296 = !{!297}
!297 = !DISubrange(count: 2)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !165, file: !164, line: 107, baseType: !299, size: 64, offset: 3072)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 64, elements: !296)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !165, file: !164, line: 108, baseType: !260, size: 64, offset: 3136)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !165, file: !164, line: 109, baseType: !302, size: 64, offset: 3200)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!157, !260}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !165, file: !164, line: 111, baseType: !151, size: 32, offset: 3264)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !165, file: !164, line: 112, baseType: !307, size: 320, offset: 3328)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 320, elements: !353)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!157, !311, !178, !260}
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !314)
!314 = !{!315, !316, !341, !342, !343, !344, !345, !346, !347, !348, !349}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !313, file: !10, line: 100, baseType: !151, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !313, file: !10, line: 101, baseType: !317, size: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !320)
!320 = !{!321, !322, !323, !324, !325, !328, !329, !330, !334, !336, !338, !339, !340}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !319, file: !10, line: 84, baseType: !250, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !319, file: !10, line: 85, baseType: !250, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !319, file: !10, line: 86, baseType: !260, size: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !319, file: !10, line: 87, baseType: !242, size: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !319, file: !10, line: 88, baseType: !326, size: 64, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !319, file: !10, line: 89, baseType: !204, size: 8, offset: 320)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !319, file: !10, line: 90, baseType: !250, size: 64, offset: 384)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !319, file: !10, line: 91, baseType: !331, size: 64, offset: 448)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !332, line: 46, baseType: !333)
!332 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!333 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !319, file: !10, line: 92, baseType: !335, size: 32, offset: 512)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !319, file: !10, line: 93, baseType: !337, size: 32, offset: 544)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !319, file: !10, line: 94, baseType: !317, size: 64, offset: 576)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !319, file: !10, line: 95, baseType: !250, size: 64, offset: 640)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !319, file: !10, line: 96, baseType: !260, size: 64, offset: 704)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !313, file: !10, line: 102, baseType: !250, size: 64, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !313, file: !10, line: 102, baseType: !250, size: 64, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !313, file: !10, line: 103, baseType: !250, size: 64, offset: 256)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !313, file: !10, line: 104, baseType: !181, size: 64, offset: 320)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !313, file: !10, line: 105, baseType: !335, size: 32, offset: 384)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !313, file: !10, line: 105, baseType: !335, size: 32, offset: 416)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !313, file: !10, line: 105, baseType: !335, size: 32, offset: 448)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !313, file: !10, line: 106, baseType: !178, size: 64, offset: 512)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !313, file: !10, line: 107, baseType: !350, size: 64, offset: 576)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!353 = !{!354}
!354 = !DISubrange(count: 5)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !165, file: !164, line: 113, baseType: !356, size: 320, offset: 3648)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 320, elements: !353)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!157, !178, !260}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !165, file: !164, line: 114, baseType: !361, size: 320, offset: 3968)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 320, elements: !353)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !165, file: !164, line: 115, baseType: !335, size: 32, offset: 4288)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !165, file: !164, line: 120, baseType: !350, size: 64, offset: 4352)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !165, file: !164, line: 121, baseType: !335, size: 32, offset: 4416)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !160, file: !102, line: 76, baseType: !366, size: 896, offset: 4480)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 896, elements: !221)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !102, line: 18, size: 896, elements: !368)
!368 = !{!369, !378, !382, !386, !394, !395, !399, !400, !404, !408, !412, !413, !417, !418}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !367, file: !102, line: 19, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!157, !158, !373, !377}
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !374, line: 21, baseType: !375)
!374 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !374, line: 21, flags: DIFlagFwdDecl)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !367, file: !102, line: 22, baseType: !379, size: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!157, !158, !373, !373, !377}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !367, file: !102, line: 25, baseType: !383, size: 64, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!157, !158}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !367, file: !102, line: 26, baseType: !387, size: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!157, !158, !390, !390}
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !391, line: 16, baseType: !392)
!391 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !391, line: 16, flags: DIFlagFwdDecl)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !367, file: !102, line: 27, baseType: !383, size: 64, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !367, file: !102, line: 28, baseType: !396, size: 64, offset: 320)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!157, !311, !158}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !367, file: !102, line: 29, baseType: !383, size: 64, offset: 384)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !367, file: !102, line: 30, baseType: !401, size: 64, offset: 448)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!157, !158, !147, !147}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !367, file: !102, line: 31, baseType: !405, size: 64, offset: 512)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!157, !158, !151, !147, !147, !269}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !367, file: !102, line: 32, baseType: !409, size: 64, offset: 576)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!157, !158, !335, !335, !269, !377, !147, !147}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !367, file: !102, line: 33, baseType: !383, size: 64, offset: 640)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !367, file: !102, line: 34, baseType: !414, size: 64, offset: 704)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!157, !158, !189}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !367, file: !102, line: 35, baseType: !383, size: 64, offset: 768)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !367, file: !102, line: 36, baseType: !414, size: 64, offset: 832)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !160, file: !102, line: 77, baseType: !420, size: 64, offset: 5376)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !421, line: 14, baseType: !422)
!421 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !421, line: 14, flags: DIFlagFwdDecl)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !160, file: !102, line: 78, baseType: !335, size: 32, offset: 5440)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !160, file: !102, line: 79, baseType: !335, size: 32, offset: 5472)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !160, file: !102, line: 81, baseType: !151, size: 32, offset: 5504)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !160, file: !102, line: 82, baseType: !428, size: 64, offset: 5568)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !33, line: 752, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !102, line: 54, size: 5184, elements: !431)
!431 = !{!432, !433, !453, !454, !455, !456}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !430, file: !102, line: 55, baseType: !163, size: 4480)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !430, file: !102, line: 55, baseType: !434, size: 448, offset: 4480)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 448, elements: !221)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !102, line: 41, size: 448, elements: !436)
!436 = !{!437, !441, !442, !446, !447, !448, !452}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !435, file: !102, line: 42, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!157, !428, !373, !373}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !435, file: !102, line: 43, baseType: !438, size: 64, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !435, file: !102, line: 44, baseType: !443, size: 64, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!157, !428}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !435, file: !102, line: 45, baseType: !443, size: 64, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !435, file: !102, line: 46, baseType: !443, size: 64, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !435, file: !102, line: 47, baseType: !449, size: 64, offset: 320)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!157, !428, !189}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !435, file: !102, line: 48, baseType: !443, size: 64, offset: 384)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !430, file: !102, line: 56, baseType: !158, size: 64, offset: 4928)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !430, file: !102, line: 57, baseType: !390, size: 64, offset: 4992)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !430, file: !102, line: 58, baseType: !262, size: 64, offset: 5056)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !430, file: !102, line: 59, baseType: !260, size: 64, offset: 5120)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !160, file: !102, line: 83, baseType: !335, size: 32, offset: 5632)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !160, file: !102, line: 84, baseType: !335, size: 32, offset: 5664)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !160, file: !102, line: 85, baseType: !335, size: 32, offset: 5696)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !160, file: !102, line: 86, baseType: !335, size: 32, offset: 5728)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !160, file: !102, line: 87, baseType: !462, size: 32, offset: 5760)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !24)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !160, file: !102, line: 88, baseType: !464, size: 384, offset: 5792)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 384, elements: !465)
!465 = !{!466, !467}
!466 = !DISubrange(count: 4)
!467 = !DISubrange(count: 3)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !160, file: !102, line: 89, baseType: !138, size: 64, offset: 6208)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !160, file: !102, line: 90, baseType: !138, size: 64, offset: 6272)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !160, file: !102, line: 91, baseType: !138, size: 64, offset: 6336)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !160, file: !102, line: 92, baseType: !138, size: 64, offset: 6400)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !160, file: !102, line: 93, baseType: !138, size: 64, offset: 6464)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !160, file: !102, line: 94, baseType: !138, size: 64, offset: 6528)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !160, file: !102, line: 95, baseType: !475, size: 32, offset: 6592)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !33, line: 540, baseType: !32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !160, file: !102, line: 96, baseType: !335, size: 32, offset: 6624)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !160, file: !102, line: 98, baseType: !373, size: 64, offset: 6656)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !160, file: !102, line: 98, baseType: !373, size: 64, offset: 6720)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !160, file: !102, line: 102, baseType: !147, size: 64, offset: 6784)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !160, file: !102, line: 103, baseType: !147, size: 64, offset: 6848)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !160, file: !102, line: 104, baseType: !151, size: 32, offset: 6912)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !160, file: !102, line: 105, baseType: !151, size: 32, offset: 6944)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !160, file: !102, line: 106, baseType: !335, size: 32, offset: 6976)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !160, file: !102, line: 107, baseType: !147, size: 64, offset: 7040)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !160, file: !102, line: 108, baseType: !147, size: 64, offset: 7104)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !160, file: !102, line: 109, baseType: !151, size: 32, offset: 7168)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !160, file: !102, line: 110, baseType: !151, size: 32, offset: 7200)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !160, file: !102, line: 111, baseType: !335, size: 32, offset: 7232)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !160, file: !102, line: 113, baseType: !151, size: 32, offset: 7264)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !160, file: !102, line: 114, baseType: !335, size: 32, offset: 7296)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !160, file: !102, line: 117, baseType: !151, size: 32, offset: 7328)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !160, file: !102, line: 120, baseType: !493, size: 320, offset: 7360)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 320, elements: !353)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{!157, !158, !151, !138, !260}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !160, file: !102, line: 121, baseType: !498, size: 320, offset: 7680)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 320, elements: !353)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{!157, !502}
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !160, file: !102, line: 122, baseType: !361, size: 320, offset: 8000)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !160, file: !102, line: 123, baseType: !151, size: 32, offset: 8320)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !160, file: !102, line: 124, baseType: !335, size: 32, offset: 8352)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !160, file: !102, line: 126, baseType: !507, size: 320, offset: 8384)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !508, size: 320, elements: !353)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!157, !158, !260}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !160, file: !102, line: 127, baseType: !498, size: 320, offset: 8704)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !160, file: !102, line: 128, baseType: !361, size: 320, offset: 9024)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !160, file: !102, line: 129, baseType: !151, size: 32, offset: 9344)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !160, file: !102, line: 131, baseType: !515, size: 64, offset: 9408)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{!157, !158, !151, !138, !518, !260}
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !160, file: !102, line: 132, baseType: !302, size: 64, offset: 9472)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !160, file: !102, line: 133, baseType: !260, size: 64, offset: 9536)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !160, file: !102, line: 135, baseType: !260, size: 64, offset: 9600)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !160, file: !102, line: 137, baseType: !523, size: 64, offset: 9664)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !524)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !25, line: 11, flags: DIFlagFwdDecl)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !160, file: !102, line: 139, baseType: !260, size: 64, offset: 9728)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !160, file: !102, line: 142, baseType: !335, size: 32, offset: 9792)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !160, file: !102, line: 142, baseType: !335, size: 32, offset: 9824)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !160, file: !102, line: 142, baseType: !335, size: 32, offset: 9856)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !160, file: !102, line: 142, baseType: !335, size: 32, offset: 9888)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !160, file: !102, line: 142, baseType: !335, size: 32, offset: 9920)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !160, file: !102, line: 142, baseType: !335, size: 32, offset: 9952)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !160, file: !102, line: 142, baseType: !335, size: 32, offset: 9984)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !160, file: !102, line: 142, baseType: !335, size: 32, offset: 10016)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !160, file: !102, line: 142, baseType: !335, size: 32, offset: 10048)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !160, file: !102, line: 142, baseType: !335, size: 32, offset: 10080)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !160, file: !102, line: 142, baseType: !335, size: 32, offset: 10112)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !160, file: !102, line: 142, baseType: !335, size: 32, offset: 10144)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !160, file: !102, line: 142, baseType: !335, size: 32, offset: 10176)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !160, file: !102, line: 142, baseType: !335, size: 32, offset: 10208)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !160, file: !102, line: 143, baseType: !189, size: 64, offset: 10240)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !160, file: !102, line: 143, baseType: !189, size: 64, offset: 10304)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !160, file: !102, line: 143, baseType: !189, size: 64, offset: 10368)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !160, file: !102, line: 143, baseType: !189, size: 64, offset: 10432)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !160, file: !102, line: 143, baseType: !189, size: 64, offset: 10496)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !160, file: !102, line: 143, baseType: !189, size: 64, offset: 10560)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !160, file: !102, line: 143, baseType: !189, size: 64, offset: 10624)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !160, file: !102, line: 143, baseType: !189, size: 64, offset: 10688)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !160, file: !102, line: 143, baseType: !189, size: 64, offset: 10752)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !160, file: !102, line: 143, baseType: !189, size: 64, offset: 10816)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !160, file: !102, line: 143, baseType: !189, size: 64, offset: 10880)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !160, file: !102, line: 143, baseType: !189, size: 64, offset: 10944)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !160, file: !102, line: 143, baseType: !189, size: 64, offset: 11008)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !160, file: !102, line: 143, baseType: !189, size: 64, offset: 11072)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !160, file: !102, line: 144, baseType: !556, size: 32, offset: 11136)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !57, line: 162, baseType: !56)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !160, file: !102, line: 144, baseType: !556, size: 32, offset: 11168)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !160, file: !102, line: 144, baseType: !556, size: 32, offset: 11200)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !160, file: !102, line: 144, baseType: !556, size: 32, offset: 11232)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !160, file: !102, line: 144, baseType: !556, size: 32, offset: 11264)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !160, file: !102, line: 144, baseType: !556, size: 32, offset: 11296)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !160, file: !102, line: 144, baseType: !556, size: 32, offset: 11328)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !160, file: !102, line: 144, baseType: !556, size: 32, offset: 11360)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !160, file: !102, line: 144, baseType: !556, size: 32, offset: 11392)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !160, file: !102, line: 144, baseType: !556, size: 32, offset: 11424)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !160, file: !102, line: 144, baseType: !556, size: 32, offset: 11456)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !160, file: !102, line: 144, baseType: !556, size: 32, offset: 11488)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !160, file: !102, line: 144, baseType: !556, size: 32, offset: 11520)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !160, file: !102, line: 144, baseType: !556, size: 32, offset: 11552)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !160, file: !102, line: 147, baseType: !151, size: 32, offset: 11584)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !160, file: !102, line: 148, baseType: !377, size: 64, offset: 11648)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !160, file: !102, line: 150, baseType: !573, size: 32, offset: 11712)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !102, line: 70, baseType: !101)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !160, file: !102, line: 151, baseType: !335, size: 32, offset: 11744)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !160, file: !102, line: 153, baseType: !151, size: 32, offset: 11776)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !160, file: !102, line: 154, baseType: !151, size: 32, offset: 11808)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !160, file: !102, line: 156, baseType: !335, size: 32, offset: 11840)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !160, file: !102, line: 161, baseType: !579, size: 192, offset: 11904)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !160, file: !102, line: 157, size: 192, elements: !580)
!580 = !{!581, !582, !583, !584}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !579, file: !102, line: 158, baseType: !390, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !579, file: !102, line: 158, baseType: !390, size: 64, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !579, file: !102, line: 159, baseType: !335, size: 32, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !579, file: !102, line: 160, baseType: !335, size: 32, offset: 160)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !160, file: !102, line: 163, baseType: !586, size: 32, offset: 12096)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !33, line: 451, baseType: !107)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !160, file: !102, line: 165, baseType: !462, size: 32, offset: 12128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !160, file: !102, line: 166, baseType: !586, size: 32, offset: 12160)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !160, file: !102, line: 171, baseType: !335, size: 32, offset: 12192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !160, file: !102, line: 172, baseType: !335, size: 32, offset: 12224)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !160, file: !102, line: 173, baseType: !335, size: 32, offset: 12256)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !160, file: !102, line: 174, baseType: !373, size: 64, offset: 12288)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !160, file: !102, line: 175, baseType: !373, size: 64, offset: 12352)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !160, file: !102, line: 177, baseType: !151, size: 32, offset: 12416)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !160, file: !102, line: 178, baseType: !335, size: 32, offset: 12448)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !160, file: !102, line: 180, baseType: !189, size: 64, offset: 12480)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !160, file: !102, line: 182, baseType: !598, size: 64, offset: 12544)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{!157, !158, !373, !373, !260}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !160, file: !102, line: 183, baseType: !598, size: 64, offset: 12608)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !160, file: !102, line: 184, baseType: !260, size: 64, offset: 12672)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !160, file: !102, line: 184, baseType: !260, size: 64, offset: 12736)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "cgstype", scope: !133, file: !132, line: 54, baseType: !605, size: 32, offset: 768)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGMRESCGSRefinementType", file: !33, line: 297, baseType: !114)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !133, file: !132, line: 54, baseType: !377, size: 64, offset: 832)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "vecb", scope: !133, file: !132, line: 54, baseType: !377, size: 64, offset: 896)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "q_preallocate", scope: !133, file: !132, line: 54, baseType: !151, size: 32, offset: 960)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "delta_allocate", scope: !133, file: !132, line: 54, baseType: !151, size: 32, offset: 992)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "vv_allocated", scope: !133, file: !132, line: 54, baseType: !151, size: 32, offset: 1024)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_allocated", scope: !133, file: !132, line: 54, baseType: !151, size: 32, offset: 1056)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "user_work", scope: !133, file: !132, line: 54, baseType: !613, size: 64, offset: 1088)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "mwork_alloc", scope: !133, file: !132, line: 54, baseType: !269, size: 64, offset: 1152)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "nwork_alloc", scope: !133, file: !132, line: 54, baseType: !151, size: 32, offset: 1216)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !133, file: !132, line: 54, baseType: !151, size: 32, offset: 1248)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "fullcycle", scope: !133, file: !132, line: 54, baseType: !151, size: 32, offset: 1280)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "nrs", scope: !133, file: !132, line: 54, baseType: !136, size: 64, offset: 1344)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "sol_temp", scope: !133, file: !132, line: 54, baseType: !373, size: 64, offset: 1408)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !133, file: !132, line: 54, baseType: !138, size: 64, offset: 1472)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "breakdowntol", scope: !133, file: !132, line: 54, baseType: !138, size: 64, offset: 1536)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBLASInt", file: !4, line: 140, baseType: !26)
!623 = !{i32 7, !"Dwarf Version", i32 4}
!624 = !{i32 2, !"Debug Info Version", i32 3}
!625 = !{i32 1, !"wchar_size", i32 4}
!626 = !{i32 7, !"PIC Level", i32 2}
!627 = !{i32 7, !"uwtable", i32 1}
!628 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!629 = distinct !DISubprogram(name: "KSPComputeExtremeSingularValues_GMRES", scope: !630, file: !630, line: 5, type: !402, scopeLine: 6, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !631)
!630 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/gmreig.c", directory: "/home/users/ndemeye/xSDK")
!631 = !{!632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !651, !653, !655, !657, !659, !661, !665, !667}
!632 = !DILocalVariable(name: "ksp", arg: 1, scope: !629, file: !630, line: 5, type: !158)
!633 = !DILocalVariable(name: "emax", arg: 2, scope: !629, file: !630, line: 5, type: !147)
!634 = !DILocalVariable(name: "emin", arg: 3, scope: !629, file: !630, line: 5, type: !147)
!635 = !DILocalVariable(name: "gmres", scope: !629, file: !630, line: 7, type: !130)
!636 = !DILocalVariable(name: "ierr", scope: !629, file: !630, line: 8, type: !157)
!637 = !DILocalVariable(name: "n", scope: !629, file: !630, line: 9, type: !151)
!638 = !DILocalVariable(name: "i", scope: !629, file: !630, line: 9, type: !151)
!639 = !DILocalVariable(name: "N", scope: !629, file: !630, line: 9, type: !151)
!640 = !DILocalVariable(name: "bn", scope: !629, file: !630, line: 10, type: !622)
!641 = !DILocalVariable(name: "bN", scope: !629, file: !630, line: 10, type: !622)
!642 = !DILocalVariable(name: "lwork", scope: !629, file: !630, line: 10, type: !622)
!643 = !DILocalVariable(name: "idummy", scope: !629, file: !630, line: 10, type: !622)
!644 = !DILocalVariable(name: "lierr", scope: !629, file: !630, line: 10, type: !622)
!645 = !DILocalVariable(name: "R", scope: !629, file: !630, line: 11, type: !136)
!646 = !DILocalVariable(name: "work", scope: !629, file: !630, line: 11, type: !136)
!647 = !DILocalVariable(name: "sdummy", scope: !629, file: !630, line: 11, type: !137)
!648 = !DILocalVariable(name: "realpart", scope: !629, file: !630, line: 12, type: !147)
!649 = !DILocalVariable(name: "ierr__", scope: !650, file: !630, line: 15, type: !157)
!650 = distinct !DILexicalBlock(scope: !629, file: !630, line: 15, column: 34)
!651 = !DILocalVariable(name: "ierr__", scope: !652, file: !630, line: 16, type: !157)
!652 = distinct !DILexicalBlock(scope: !629, file: !630, line: 16, column: 34)
!653 = !DILocalVariable(name: "ierr__", scope: !654, file: !630, line: 17, type: !157)
!654 = distinct !DILexicalBlock(scope: !629, file: !630, line: 17, column: 39)
!655 = !DILocalVariable(name: "ierr__", scope: !656, file: !630, line: 18, type: !157)
!656 = distinct !DILexicalBlock(scope: !629, file: !630, line: 18, column: 38)
!657 = !DILocalVariable(name: "ierr__", scope: !658, file: !630, line: 24, type: !157)
!658 = distinct !DILexicalBlock(scope: !629, file: !630, line: 24, column: 78)
!659 = !DILocalVariable(name: "ierr__", scope: !660, file: !630, line: 30, type: !157)
!660 = distinct !DILexicalBlock(scope: !629, file: !630, line: 30, column: 45)
!661 = !DILocalVariable(name: "_7_ierr", scope: !662, file: !630, line: 32, type: !157)
!662 = distinct !DILexicalBlock(scope: !663, file: !630, line: 32, column: 3)
!663 = distinct !DILexicalBlock(scope: !664, file: !630, line: 32, column: 3)
!664 = distinct !DILexicalBlock(scope: !629, file: !630, line: 32, column: 3)
!665 = !DILocalVariable(name: "ierr__", scope: !666, file: !630, line: 32, type: !157)
