; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/interface/snesut.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/interface/snesut.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_SNES = type { %struct._p_PetscObject, [1 x %struct._SNESOps], %struct._p_DM*, i32, %struct._p_SNES*, i32, i32, i8*, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Mat*, i8*, %struct._p_KSP*, %struct._p_LineSearch*, i32, i32, %struct._p_Vec*, %struct._p_Vec*, i8*, double, [5 x i32 (%struct._p_SNES*, i32, double, i8*)*], [5 x i32 (i8**)*], [5 x i8*], i32, i8*, i32, [5 x i32 (%struct._p_SNES*, i8*)*], [5 x i32 (i8**)*], [5 x i8*], i32, i32, i32, i8*, i32, i32, i32, i32, i32, double, double, double, double, double, double, double, double, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct._p_Vec**, i32, double*, i32*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, double, double, %struct._p_Vec**, i32, i32, i32, i32, double, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "prev", scope: !2, file: !3, line: 459, type: !133, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "SNESMonitorRange", scope: !3, file: !3, line: 453, type: !4, scopeLine: 454, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !531, retainedNodes: !614)
!3 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/snes/interface/snesut.c", directory: "/home/users/ndemeye/xSDK")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !9, !78, !133, !473}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !7, line: 14, baseType: !8)
!7 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!8 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !10, line: 18, baseType: !11)
!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsnes.h", directory: "/home/users/ndemeye/xSDK")
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !13, line: 38, size: 11648, elements: !14)
!13 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/snesimpl.h", directory: "/home/users/ndemeye/xSDK")
!14 = !{!15, !244, !331, !336, !337, !338, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !361, !365, !366, !374, !375, !376, !377, !378, !383, !385, !386, !387, !388, !389, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !433, !440, !441, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !12, file: !13, line: 39, baseType: !16, size: 4480)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !17, line: 122, baseType: !18)
!17 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !17, line: 73, size: 4480, elements: !19)
!19 = !{!20, !22, !76, !77, !79, !82, !83, !84, !85, !93, !94, !96, !100, !104, !106, !107, !108, !109, !110, !111, !112, !113, !114, !116, !118, !119, !120, !122, !123, !125, !127, !128, !129, !130, !131, !134, !136, !137, !138, !139, !140, !143, !145, !146, !147, !157, !159, !160, !164, !165, !234, !239, !241, !242, !243}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !18, file: !17, line: 74, baseType: !21, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !7, line: 32, baseType: !8)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !18, file: !17, line: 75, baseType: !23, size: 448, offset: 64)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 448, elements: !74)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !17, line: 53, baseType: !25)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 45, size: 448, elements: !26)
!26 = !{!27, !38, !46, !51, !58, !62, !69}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !25, file: !17, line: 46, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DISubroutineType(types: !30)
!30 = !{!6, !31, !33}
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !7, line: 430, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !35, line: 330, baseType: !36)
!35 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !35, line: 330, flags: DIFlagFwdDecl)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !25, file: !17, line: 47, baseType: !39, size: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{!6, !31, !42}
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !43, line: 16, baseType: !44)
!43 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !43, line: 16, flags: DIFlagFwdDecl)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !25, file: !17, line: 48, baseType: !47, size: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!6, !50}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !25, file: !17, line: 49, baseType: !52, size: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!6, !31, !55, !31}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!57 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !25, file: !17, line: 50, baseType: !59, size: 64, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!6, !31, !55, !50}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !25, file: !17, line: 51, baseType: !63, size: 64, offset: 320)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{!6, !31, !55, !66}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{null}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !25, file: !17, line: 52, baseType: !70, size: 64, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!6, !31, !55, !73}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!74 = !{!75}
!75 = !DISubrange(count: 1)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !18, file: !17, line: 76, baseType: !34, size: 64, offset: 512)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !18, file: !17, line: 77, baseType: !78, size: 32, offset: 576)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !7, line: 102, baseType: !8)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !18, file: !17, line: 78, baseType: !80, size: 64, offset: 640)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !7, line: 360, baseType: !81)
!81 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !18, file: !17, line: 78, baseType: !80, size: 64, offset: 704)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !18, file: !17, line: 78, baseType: !80, size: 64, offset: 768)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !18, file: !17, line: 78, baseType: !80, size: 64, offset: 832)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !18, file: !17, line: 79, baseType: !86, size: 64, offset: 896)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !7, line: 442, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !7, line: 90, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !89, line: 27, baseType: !90)
!89 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !91, line: 43, baseType: !92)
!91 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!92 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !18, file: !17, line: 80, baseType: !78, size: 32, offset: 960)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !18, file: !17, line: 81, baseType: !95, size: 32, offset: 992)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !7, line: 49, baseType: !8)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !18, file: !17, line: 82, baseType: !97, size: 64, offset: 1024)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !7, line: 465, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !7, line: 465, flags: DIFlagFwdDecl)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !18, file: !17, line: 83, baseType: !101, size: 64, offset: 1088)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !7, line: 496, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !7, line: 496, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !18, file: !17, line: 84, baseType: !105, size: 64, offset: 1152)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !18, file: !17, line: 85, baseType: !105, size: 64, offset: 1216)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !18, file: !17, line: 86, baseType: !105, size: 64, offset: 1280)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !18, file: !17, line: 87, baseType: !105, size: 64, offset: 1344)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !18, file: !17, line: 88, baseType: !31, size: 64, offset: 1408)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !18, file: !17, line: 89, baseType: !86, size: 64, offset: 1472)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !18, file: !17, line: 90, baseType: !105, size: 64, offset: 1536)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !18, file: !17, line: 91, baseType: !105, size: 64, offset: 1600)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !18, file: !17, line: 92, baseType: !78, size: 32, offset: 1664)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !18, file: !17, line: 93, baseType: !115, size: 64, offset: 1728)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !18, file: !17, line: 94, baseType: !117, size: 64, offset: 1792)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !7, line: 455, baseType: !87)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !18, file: !17, line: 95, baseType: !78, size: 32, offset: 1856)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !18, file: !17, line: 95, baseType: !78, size: 32, offset: 1888)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !18, file: !17, line: 96, baseType: !121, size: 64, offset: 1920)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !18, file: !17, line: 96, baseType: !121, size: 64, offset: 1984)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !18, file: !17, line: 97, baseType: !124, size: 64, offset: 2048)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !18, file: !17, line: 97, baseType: !126, size: 64, offset: 2112)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !18, file: !17, line: 98, baseType: !78, size: 32, offset: 2176)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !18, file: !17, line: 98, baseType: !78, size: 32, offset: 2208)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !18, file: !17, line: 99, baseType: !121, size: 64, offset: 2240)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !18, file: !17, line: 99, baseType: !121, size: 64, offset: 2304)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !18, file: !17, line: 100, baseType: !132, size: 64, offset: 2368)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !7, line: 189, baseType: !81)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !18, file: !17, line: 100, baseType: !135, size: 64, offset: 2432)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !18, file: !17, line: 101, baseType: !78, size: 32, offset: 2496)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !18, file: !17, line: 101, baseType: !78, size: 32, offset: 2528)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !18, file: !17, line: 102, baseType: !121, size: 64, offset: 2560)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !18, file: !17, line: 102, baseType: !121, size: 64, offset: 2624)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !18, file: !17, line: 103, baseType: !141, size: 64, offset: 2688)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !7, line: 305, baseType: !133)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !18, file: !17, line: 103, baseType: !144, size: 64, offset: 2752)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !18, file: !17, line: 104, baseType: !73, size: 64, offset: 2816)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !18, file: !17, line: 105, baseType: !78, size: 32, offset: 2880)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !18, file: !17, line: 106, baseType: !148, size: 128, offset: 2944)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 128, elements: !155)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !17, line: 64, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 61, size: 128, elements: !152)
!152 = !{!153, !154}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !151, file: !17, line: 62, baseType: !66, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !151, file: !17, line: 63, baseType: !115, size: 64, offset: 64)
!155 = !{!156}
!156 = !DISubrange(count: 2)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !18, file: !17, line: 107, baseType: !158, size: 64, offset: 3072)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 64, elements: !155)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !18, file: !17, line: 108, baseType: !115, size: 64, offset: 3136)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !18, file: !17, line: 109, baseType: !161, size: 64, offset: 3200)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!6, !115}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !18, file: !17, line: 111, baseType: !78, size: 32, offset: 3264)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !18, file: !17, line: 112, baseType: !166, size: 320, offset: 3328)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 320, elements: !232)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!6, !170, !31, !115}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !172, line: 108, baseType: !173)
!172 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !172, line: 99, size: 640, elements: !174)
!174 = !{!175, !176, !220, !221, !222, !223, !224, !225, !226, !227, !228}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !173, file: !172, line: 100, baseType: !78, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !173, file: !172, line: 101, baseType: !177, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !172, line: 82, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !172, line: 83, size: 768, elements: !180)
!180 = !{!181, !182, !183, !184, !185, !188, !189, !190, !194, !201, !217, !218, !219}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !179, file: !172, line: 84, baseType: !105, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !179, file: !172, line: 85, baseType: !105, size: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !179, file: !172, line: 86, baseType: !115, size: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !179, file: !172, line: 87, baseType: !97, size: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !179, file: !172, line: 88, baseType: !186, size: 64, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !179, file: !172, line: 89, baseType: !57, size: 8, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !179, file: !172, line: 90, baseType: !105, size: 64, offset: 384)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !179, file: !172, line: 91, baseType: !191, size: 64, offset: 448)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !192, line: 46, baseType: !193)
!192 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!193 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !179, file: !172, line: 92, baseType: !195, size: 32, offset: 512)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !7, line: 170, baseType: !196)
!196 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 170, baseType: !197, size: 32, elements: !198)
!197 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!198 = !{!199, !200}
!199 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!200 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !179, file: !172, line: 93, baseType: !202, size: 32, offset: 544)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !172, line: 81, baseType: !203)
!203 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !172, line: 81, baseType: !197, size: 32, elements: !204)
!204 = !{!205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216}
!205 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!206 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!207 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!208 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!209 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!210 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!211 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!212 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!213 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!214 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!215 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!216 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !179, file: !172, line: 94, baseType: !177, size: 64, offset: 576)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !179, file: !172, line: 95, baseType: !105, size: 64, offset: 640)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !179, file: !172, line: 96, baseType: !115, size: 64, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !173, file: !172, line: 102, baseType: !105, size: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !173, file: !172, line: 102, baseType: !105, size: 64, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !173, file: !172, line: 103, baseType: !105, size: 64, offset: 256)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !173, file: !172, line: 104, baseType: !34, size: 64, offset: 320)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !173, file: !172, line: 105, baseType: !195, size: 32, offset: 384)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !173, file: !172, line: 105, baseType: !195, size: 32, offset: 416)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !173, file: !172, line: 105, baseType: !195, size: 32, offset: 448)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !173, file: !172, line: 106, baseType: !31, size: 64, offset: 512)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !173, file: !172, line: 107, baseType: !229, size: 64, offset: 576)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !172, line: 10, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !172, line: 10, flags: DIFlagFwdDecl)
!232 = !{!233}
!233 = !DISubrange(count: 5)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !18, file: !17, line: 113, baseType: !235, size: 320, offset: 3648)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 320, elements: !232)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!6, !31, !115}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !18, file: !17, line: 114, baseType: !240, size: 320, offset: 3968)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 320, elements: !232)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !18, file: !17, line: 115, baseType: !195, size: 32, offset: 4288)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !18, file: !17, line: 120, baseType: !229, size: 64, offset: 4352)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !18, file: !17, line: 121, baseType: !195, size: 32, offset: 4416)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !12, file: !13, line: 39, baseType: !245, size: 1088, offset: 4480)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 1088, elements: !74)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SNESOps", file: !13, line: 12, size: 1088, elements: !247)
!247 = !{!248, !256, !260, !264, !289, !290, !294, !295, !299, !303, !304, !305, !310, !314, !318, !322, !330}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "computeinitialguess", scope: !246, file: !13, line: 13, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!6, !9, !252, !115}
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !253, line: 21, baseType: !254)
!253 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !253, line: 21, flags: DIFlagFwdDecl)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "computescaling", scope: !246, file: !13, line: 14, baseType: !257, size: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!6, !252, !252, !115}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !246, file: !13, line: 15, baseType: !261, size: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{!6, !9, !78}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !246, file: !13, line: 16, baseType: !265, size: 64, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!6, !9, !78, !133, !133, !133, !268, !115}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESConvergedReason", file: !10, line: 257, baseType: !270)
!270 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 238, baseType: !8, size: 32, elements: !271)
!271 = !{!272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288}
!272 = !DIEnumerator(name: "SNES_CONVERGED_FNORM_ABS", value: 2)
!273 = !DIEnumerator(name: "SNES_CONVERGED_FNORM_RELATIVE", value: 3)
!274 = !DIEnumerator(name: "SNES_CONVERGED_SNORM_RELATIVE", value: 4)
!275 = !DIEnumerator(name: "SNES_CONVERGED_ITS", value: 5)
!276 = !DIEnumerator(name: "SNES_DIVERGED_FUNCTION_DOMAIN", value: -1)
!277 = !DIEnumerator(name: "SNES_DIVERGED_FUNCTION_COUNT", value: -2)
!278 = !DIEnumerator(name: "SNES_DIVERGED_LINEAR_SOLVE", value: -3)
!279 = !DIEnumerator(name: "SNES_DIVERGED_FNORM_NAN", value: -4)
!280 = !DIEnumerator(name: "SNES_DIVERGED_MAX_IT", value: -5)
!281 = !DIEnumerator(name: "SNES_DIVERGED_LINE_SEARCH", value: -6)
!282 = !DIEnumerator(name: "SNES_DIVERGED_INNER", value: -7)
!283 = !DIEnumerator(name: "SNES_DIVERGED_LOCAL_MIN", value: -8)
!284 = !DIEnumerator(name: "SNES_DIVERGED_DTOL", value: -9)
!285 = !DIEnumerator(name: "SNES_DIVERGED_JACOBIAN_DOMAIN", value: -10)
!286 = !DIEnumerator(name: "SNES_DIVERGED_TR_DELTA", value: -11)
!287 = !DIEnumerator(name: "SNES_CONVERGED_TR_DELTA", value: -11)
!288 = !DIEnumerator(name: "SNES_CONVERGED_ITERATING", value: 0)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !246, file: !13, line: 17, baseType: !161, size: 64, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !246, file: !13, line: 18, baseType: !291, size: 64, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!6, !9}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !246, file: !13, line: 19, baseType: !291, size: 64, offset: 384)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !246, file: !13, line: 20, baseType: !296, size: 64, offset: 448)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!6, !9, !42}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !246, file: !13, line: 21, baseType: !300, size: 64, offset: 512)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!6, !170, !9}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !246, file: !13, line: 22, baseType: !291, size: 64, offset: 576)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !246, file: !13, line: 23, baseType: !291, size: 64, offset: 640)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "usercompute", scope: !246, file: !13, line: 24, baseType: !306, size: 64, offset: 704)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!6, !9, !309}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "userdestroy", scope: !246, file: !13, line: 25, baseType: !311, size: 64, offset: 768)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!6, !309}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !246, file: !13, line: 26, baseType: !315, size: 64, offset: 832)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!6, !9, !252, !252}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "computepfunction", scope: !246, file: !13, line: 27, baseType: !319, size: 64, offset: 896)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!6, !9, !252, !252, !115}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "computepjacobian", scope: !246, file: !13, line: 28, baseType: !323, size: 64, offset: 960)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!6, !9, !252, !326, !326, !115}
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !327, line: 16, baseType: !328)
!327 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !327, line: 16, flags: DIFlagFwdDecl)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !246, file: !13, line: 29, baseType: !296, size: 64, offset: 1024)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !12, file: !13, line: 40, baseType: !332, size: 64, offset: 5568)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !333, line: 14, baseType: !334)
!333 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !333, line: 14, flags: DIFlagFwdDecl)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !12, file: !13, line: 41, baseType: !195, size: 32, offset: 5632)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "npc", scope: !12, file: !13, line: 42, baseType: !9, size: 64, offset: 5696)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "npcside", scope: !12, file: !13, line: 43, baseType: !339, size: 32, offset: 5760)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !340, line: 85, baseType: !341)
!340 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpctypes.h", directory: "/home/users/ndemeye/xSDK")
!341 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !340, line: 85, baseType: !8, size: 32, elements: !342)
!342 = !{!343, !344, !345, !346}
!343 = !DIEnumerator(name: "PC_SIDE_DEFAULT", value: -1)
!344 = !DIEnumerator(name: "PC_LEFT", value: 0)
!345 = !DIEnumerator(name: "PC_RIGHT", value: 1)
!346 = !DIEnumerator(name: "PC_SYMMETRIC", value: 2)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "usesnpc", scope: !12, file: !13, line: 44, baseType: !195, size: 32, offset: 5792)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !12, file: !13, line: 47, baseType: !115, size: 64, offset: 5824)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !12, file: !13, line: 49, baseType: !252, size: 64, offset: 5888)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !12, file: !13, line: 50, baseType: !252, size: 64, offset: 5952)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !12, file: !13, line: 52, baseType: !252, size: 64, offset: 6016)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !12, file: !13, line: 54, baseType: !326, size: 64, offset: 6080)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !12, file: !13, line: 55, baseType: !326, size: 64, offset: 6144)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "picard", scope: !12, file: !13, line: 56, baseType: !326, size: 64, offset: 6208)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "initialguessP", scope: !12, file: !13, line: 57, baseType: !115, size: 64, offset: 6272)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !12, file: !13, line: 58, baseType: !357, size: 64, offset: 6336)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !358, line: 22, baseType: !359)
!358 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !358, line: 22, flags: DIFlagFwdDecl)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !12, file: !13, line: 59, baseType: !362, size: 64, offset: 6400)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearch", file: !10, line: 526, baseType: !363)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_LineSearch", file: !10, line: 526, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "usesksp", scope: !12, file: !13, line: 60, baseType: !195, size: 32, offset: 6464)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "matstruct", scope: !12, file: !13, line: 61, baseType: !367, size: 32, offset: 6496)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !327, line: 285, baseType: !368)
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !327, line: 285, baseType: !197, size: 32, elements: !369)
!369 = !{!370, !371, !372, !373}
!370 = !DIEnumerator(name: "DIFFERENT_NONZERO_PATTERN", value: 0, isUnsigned: true)
!371 = !DIEnumerator(name: "SUBSET_NONZERO_PATTERN", value: 1, isUnsigned: true)
!372 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!373 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_update", scope: !12, file: !13, line: 63, baseType: !252, size: 64, offset: 6528)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "scaling", scope: !12, file: !13, line: 65, baseType: !252, size: 64, offset: 6592)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "scaP", scope: !12, file: !13, line: 66, baseType: !115, size: 64, offset: 6656)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !12, file: !13, line: 68, baseType: !133, size: 64, offset: 6720)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !12, file: !13, line: 74, baseType: !379, size: 320, offset: 6784)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 320, elements: !232)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!6, !9, !78, !133, !115}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !12, file: !13, line: 75, baseType: !384, size: 320, offset: 7104)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 320, elements: !232)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !12, file: !13, line: 76, baseType: !240, size: 320, offset: 7424)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !12, file: !13, line: 77, baseType: !78, size: 32, offset: 7744)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !12, file: !13, line: 78, baseType: !115, size: 64, offset: 7808)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !12, file: !13, line: 79, baseType: !269, size: 32, offset: 7872)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !12, file: !13, line: 80, baseType: !390, size: 320, offset: 7936)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 320, elements: !232)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!6, !9, !115}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !12, file: !13, line: 81, baseType: !384, size: 320, offset: 8256)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !12, file: !13, line: 82, baseType: !240, size: 320, offset: 8576)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !12, file: !13, line: 83, baseType: !78, size: 32, offset: 8896)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !12, file: !13, line: 84, baseType: !195, size: 32, offset: 8928)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !12, file: !13, line: 88, baseType: !195, size: 32, offset: 8960)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !12, file: !13, line: 89, baseType: !115, size: 64, offset: 9024)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !12, file: !13, line: 93, baseType: !78, size: 32, offset: 9088)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !12, file: !13, line: 94, baseType: !78, size: 32, offset: 9120)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !12, file: !13, line: 95, baseType: !78, size: 32, offset: 9152)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !12, file: !13, line: 96, baseType: !78, size: 32, offset: 9184)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "linear_its", scope: !12, file: !13, line: 97, baseType: !78, size: 32, offset: 9216)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !12, file: !13, line: 98, baseType: !133, size: 64, offset: 9280)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !12, file: !13, line: 99, baseType: !133, size: 64, offset: 9344)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !12, file: !13, line: 100, baseType: !133, size: 64, offset: 9408)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !12, file: !13, line: 101, baseType: !133, size: 64, offset: 9472)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !12, file: !13, line: 102, baseType: !133, size: 64, offset: 9536)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !12, file: !13, line: 103, baseType: !133, size: 64, offset: 9600)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "stol", scope: !12, file: !13, line: 104, baseType: !133, size: 64, offset: 9664)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "deltatol", scope: !12, file: !13, line: 105, baseType: !133, size: 64, offset: 9728)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "forceiteration", scope: !12, file: !13, line: 106, baseType: !195, size: 32, offset: 9792)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "lagpreconditioner", scope: !12, file: !13, line: 107, baseType: !78, size: 32, offset: 9824)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "lagjacobian", scope: !12, file: !13, line: 108, baseType: !78, size: 32, offset: 9856)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "jac_iter", scope: !12, file: !13, line: 109, baseType: !78, size: 32, offset: 9888)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "lagjac_persist", scope: !12, file: !13, line: 110, baseType: !195, size: 32, offset: 9920)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "pre_iter", scope: !12, file: !13, line: 111, baseType: !78, size: 32, offset: 9952)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "lagpre_persist", scope: !12, file: !13, line: 112, baseType: !195, size: 32, offset: 9984)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "gridsequence", scope: !12, file: !13, line: 113, baseType: !78, size: 32, offset: 10016)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "tolerancesset", scope: !12, file: !13, line: 115, baseType: !195, size: 32, offset: 10048)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_init_set", scope: !12, file: !13, line: 117, baseType: !195, size: 32, offset: 10080)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "normschedule", scope: !12, file: !13, line: 119, baseType: !424, size: 32, offset: 10112)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESNormSchedule", file: !10, line: 411, baseType: !425)
!425 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 406, baseType: !8, size: 32, elements: !426)
!426 = !{!427, !428, !429, !430, !431, !432}
!427 = !DIEnumerator(name: "SNES_NORM_DEFAULT", value: -1)
!428 = !DIEnumerator(name: "SNES_NORM_NONE", value: 0)
!429 = !DIEnumerator(name: "SNES_NORM_ALWAYS", value: 1)
!430 = !DIEnumerator(name: "SNES_NORM_INITIAL_ONLY", value: 2)
!431 = !DIEnumerator(name: "SNES_NORM_FINAL_ONLY", value: 3)
!432 = !DIEnumerator(name: "SNES_NORM_INITIAL_FINAL_ONLY", value: 4)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !12, file: !13, line: 120, baseType: !434, size: 32, offset: 10144)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESFunctionType", file: !10, line: 495, baseType: !435)
!435 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 493, baseType: !8, size: 32, elements: !436)
!436 = !{!437, !438, !439}
!437 = !DIEnumerator(name: "SNES_FUNCTION_DEFAULT", value: -1)
!438 = !DIEnumerator(name: "SNES_FUNCTION_UNPRECONDITIONED", value: 0)
!439 = !DIEnumerator(name: "SNES_FUNCTION_PRECONDITIONED", value: 1)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !12, file: !13, line: 124, baseType: !78, size: 32, offset: 10176)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !12, file: !13, line: 125, baseType: !442, size: 64, offset: 10240)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !12, file: !13, line: 129, baseType: !78, size: 32, offset: 10304)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist", scope: !12, file: !13, line: 130, baseType: !132, size: 64, offset: 10368)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_its", scope: !12, file: !13, line: 132, baseType: !124, size: 64, offset: 10432)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_len", scope: !12, file: !13, line: 133, baseType: !78, size: 32, offset: 10496)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_max", scope: !12, file: !13, line: 134, baseType: !78, size: 32, offset: 10528)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_reset", scope: !12, file: !13, line: 135, baseType: !195, size: 32, offset: 10560)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_alloc", scope: !12, file: !13, line: 136, baseType: !195, size: 32, offset: 10592)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "counters_reset", scope: !12, file: !13, line: 137, baseType: !195, size: 32, offset: 10624)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "numFailures", scope: !12, file: !13, line: 140, baseType: !78, size: 32, offset: 10656)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "maxFailures", scope: !12, file: !13, line: 141, baseType: !78, size: 32, offset: 10688)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "numLinearSolveFailures", scope: !12, file: !13, line: 143, baseType: !78, size: 32, offset: 10720)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "maxLinearSolveFailures", scope: !12, file: !13, line: 144, baseType: !78, size: 32, offset: 10752)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "domainerror", scope: !12, file: !13, line: 146, baseType: !195, size: 32, offset: 10784)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "jacobiandomainerror", scope: !12, file: !13, line: 147, baseType: !195, size: 32, offset: 10816)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "checkjacdomainerror", scope: !12, file: !13, line: 148, baseType: !195, size: 32, offset: 10848)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_ewconv", scope: !12, file: !13, line: 150, baseType: !195, size: 32, offset: 10880)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "kspconvctx", scope: !12, file: !13, line: 151, baseType: !115, size: 64, offset: 10944)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !12, file: !13, line: 154, baseType: !133, size: 64, offset: 11008)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !12, file: !13, line: 155, baseType: !133, size: 64, offset: 11072)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "vwork", scope: !12, file: !13, line: 157, baseType: !442, size: 64, offset: 11136)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "nvwork", scope: !12, file: !13, line: 158, baseType: !78, size: 32, offset: 11200)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !12, file: !13, line: 160, baseType: !195, size: 32, offset: 11232)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "mf_operator", scope: !12, file: !13, line: 161, baseType: !195, size: 32, offset: 11264)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "mf_version", scope: !12, file: !13, line: 162, baseType: !78, size: 32, offset: 11296)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "vizerotolerance", scope: !12, file: !13, line: 164, baseType: !133, size: 64, offset: 11328)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "xl", scope: !12, file: !13, line: 165, baseType: !252, size: 64, offset: 11392)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "xu", scope: !12, file: !13, line: 165, baseType: !252, size: 64, offset: 11456)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ntruebounds", scope: !12, file: !13, line: 166, baseType: !78, size: 32, offset: 11520)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "usersetbounds", scope: !12, file: !13, line: 167, baseType: !195, size: 32, offset: 11552)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "alwayscomputesfinalresidual", scope: !12, file: !13, line: 169, baseType: !195, size: 32, offset: 11584)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerAndFormat", file: !475, line: 178, baseType: !476)
!475 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewer.h", directory: "/home/users/ndemeye/xSDK")
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !475, line: 178, size: 256, elements: !477)
!477 = !{!478, !479, !525, !530}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !476, file: !475, line: 178, baseType: !42, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !476, file: !475, line: 178, baseType: !480, size: 32, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !475, line: 162, baseType: !481)
!481 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !475, line: 119, baseType: !197, size: 32, elements: !482)
!482 = !{!483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524}
!483 = !DIEnumerator(name: "PETSC_VIEWER_DEFAULT", value: 0, isUnsigned: true)
!484 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATLAB", value: 1, isUnsigned: true)
!485 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATHEMATICA", value: 2, isUnsigned: true)
!486 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!487 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!488 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!489 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!490 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!491 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!492 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!493 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!494 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!495 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!496 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!497 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!498 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!499 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!500 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!501 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!502 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!503 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!504 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!505 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!506 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!507 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!508 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!509 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!510 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!511 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!512 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!513 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!514 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!515 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!516 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!517 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!518 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!519 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!520 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!521 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!522 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!523 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!524 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "lg", scope: !476, file: !475, line: 178, baseType: !526, size: 64, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDrawLG", file: !527, line: 43, baseType: !528)
!527 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdrawtypes.h", directory: "/home/users/ndemeye/xSDK")
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDrawLG", file: !527, line: 43, flags: DIFlagFwdDecl)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !476, file: !475, line: 178, baseType: !115, size: 64, offset: 192)
!531 = distinct !DICompileUnit(language: DW_LANG_C99, file: !532, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !533, retainedTypes: !605, globals: !613, splitDebugInlining: false, nameTableKind: None)
!532 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/interface/snesut.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!533 = !{!196, !203, !270, !341, !368, !425, !435, !481, !534, !540, !560, !567, !590, !595, !601}
!534 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !535, line: 663, baseType: !197, size: 32, elements: !536)
!535 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!536 = !{!537, !538, !539}
!537 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!538 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!539 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!540 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 385, baseType: !197, size: 32, elements: !541)
!541 = !{!542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559}
!542 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!543 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!544 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!545 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!546 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!547 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!548 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!549 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!550 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!551 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!552 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!553 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!554 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!555 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!556 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!557 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!558 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!559 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!560 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !253, line: 155, baseType: !197, size: 32, elements: !561)
!561 = !{!562, !563, !564, !565, !566}
!562 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!563 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!564 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!565 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!566 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!567 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !358, line: 517, baseType: !8, size: 32, elements: !568)
!568 = !{!569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589}
!569 = !DIEnumerator(name: "KSP_CONVERGED_RTOL_NORMAL", value: 1)
!570 = !DIEnumerator(name: "KSP_CONVERGED_ATOL_NORMAL", value: 9)
!571 = !DIEnumerator(name: "KSP_CONVERGED_RTOL", value: 2)
!572 = !DIEnumerator(name: "KSP_CONVERGED_ATOL", value: 3)
!573 = !DIEnumerator(name: "KSP_CONVERGED_ITS", value: 4)
!574 = !DIEnumerator(name: "KSP_CONVERGED_CG_NEG_CURVE", value: 5)
!575 = !DIEnumerator(name: "KSP_CONVERGED_CG_CONSTRAINED", value: 6)
