; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/aij/mpi/mpiov.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/aij/mpi/mpiov.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 248, baseType: !5, size: 32, elements: !301)
!301 = !{!302, !303}
!302 = !DIEnumerator(name: "MAT_DO_NOT_GET_VALUES", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "MAT_GET_VALUES", value: 1, isUnsigned: true)
!304 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !305)
!305 = !{!306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323}
!306 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!307 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!308 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!309 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!310 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!311 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!312 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!313 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!314 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!315 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!316 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!317 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!318 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!319 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!320 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!321 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!322 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!323 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!324 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !325, line: 624, baseType: !5, size: 32, elements: !326)
!325 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!326 = !{!327, !328, !329, !330}
!327 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!328 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!329 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!330 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!331 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !332)
!332 = !{!333, !334, !335}
!333 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!334 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!335 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!336 = !{!337, !355, !435, !375, !544, !1359, !425, !72, !510, !1211, !415, !1459, !999, !400, !398, !514, !1404, !1462, !1463, !407, !377, !5, !512}
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !340, line: 73, size: 4480, elements: !341)
!340 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!341 = !{!342, !344, !396, !397, !399, !402, !403, !404, !405, !413, !414, !416, !420, !424, !426, !427, !428, !429, !430, !431, !432, !433, !434, !436, !438, !439, !440, !442, !443, !445, !447, !448, !449, !450, !451, !454, !456, !457, !458, !459, !460, !463, !465, !466, !467, !477, !479, !480, !484, !485, !534, !539, !541, !542, !543}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !339, file: !340, line: 74, baseType: !343, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !339, file: !340, line: 75, baseType: !345, size: 448, offset: 64)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !346, size: 448, elements: !394)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !340, line: 53, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !340, line: 45, size: 448, elements: !348)
!348 = !{!349, !358, !366, !371, !378, !382, !389}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !347, file: !340, line: 46, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!353, !337, !354}
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !325, line: 330, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !325, line: 330, flags: DIFlagFwdDecl)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !347, file: !340, line: 47, baseType: !359, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!353, !337, !362}
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !363, line: 16, baseType: !364)
!363 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !363, line: 16, flags: DIFlagFwdDecl)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !347, file: !340, line: 48, baseType: !367, size: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{!353, !370}
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !347, file: !340, line: 49, baseType: !372, size: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!353, !337, !375, !337}
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !377)
!377 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !347, file: !340, line: 50, baseType: !379, size: 64, offset: 256)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!353, !337, !375, !370}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !347, file: !340, line: 51, baseType: !383, size: 64, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!353, !337, !375, !386}
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{null}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !347, file: !340, line: 52, baseType: !390, size: 64, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!353, !337, !375, !393}
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!394 = !{!395}
!395 = !DISubrange(count: 1)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !339, file: !340, line: 76, baseType: !355, size: 64, offset: 512)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !339, file: !340, line: 77, baseType: !398, size: 32, offset: 576)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !339, file: !340, line: 78, baseType: !400, size: 64, offset: 640)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !401)
!401 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !339, file: !340, line: 78, baseType: !400, size: 64, offset: 704)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !339, file: !340, line: 78, baseType: !400, size: 64, offset: 768)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !339, file: !340, line: 78, baseType: !400, size: 64, offset: 832)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !339, file: !340, line: 79, baseType: !406, size: 64, offset: 896)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !407)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !409, line: 27, baseType: !410)
!409 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !411, line: 43, baseType: !412)
!411 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!412 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !339, file: !340, line: 80, baseType: !398, size: 32, offset: 960)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !339, file: !340, line: 81, baseType: !415, size: 32, offset: 992)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !339, file: !340, line: 82, baseType: !417, size: 64, offset: 1024)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !339, file: !340, line: 83, baseType: !421, size: 64, offset: 1088)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !422)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !339, file: !340, line: 84, baseType: !425, size: 64, offset: 1152)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !339, file: !340, line: 85, baseType: !425, size: 64, offset: 1216)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !339, file: !340, line: 86, baseType: !425, size: 64, offset: 1280)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !339, file: !340, line: 87, baseType: !425, size: 64, offset: 1344)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !339, file: !340, line: 88, baseType: !337, size: 64, offset: 1408)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !339, file: !340, line: 89, baseType: !406, size: 64, offset: 1472)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !339, file: !340, line: 90, baseType: !425, size: 64, offset: 1536)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !339, file: !340, line: 91, baseType: !425, size: 64, offset: 1600)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !339, file: !340, line: 92, baseType: !398, size: 32, offset: 1664)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !339, file: !340, line: 93, baseType: !435, size: 64, offset: 1728)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !339, file: !340, line: 94, baseType: !437, size: 64, offset: 1792)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !407)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !339, file: !340, line: 95, baseType: !398, size: 32, offset: 1856)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !339, file: !340, line: 95, baseType: !398, size: 32, offset: 1888)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !339, file: !340, line: 96, baseType: !441, size: 64, offset: 1920)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !339, file: !340, line: 96, baseType: !441, size: 64, offset: 1984)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !339, file: !340, line: 97, baseType: !444, size: 64, offset: 2048)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !339, file: !340, line: 97, baseType: !446, size: 64, offset: 2112)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !339, file: !340, line: 98, baseType: !398, size: 32, offset: 2176)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !339, file: !340, line: 98, baseType: !398, size: 32, offset: 2208)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !339, file: !340, line: 99, baseType: !441, size: 64, offset: 2240)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !339, file: !340, line: 99, baseType: !441, size: 64, offset: 2304)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !339, file: !340, line: 100, baseType: !452, size: 64, offset: 2368)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !401)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !339, file: !340, line: 100, baseType: !455, size: 64, offset: 2432)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !339, file: !340, line: 101, baseType: !398, size: 32, offset: 2496)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !339, file: !340, line: 101, baseType: !398, size: 32, offset: 2528)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !339, file: !340, line: 102, baseType: !441, size: 64, offset: 2560)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !339, file: !340, line: 102, baseType: !441, size: 64, offset: 2624)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !339, file: !340, line: 103, baseType: !461, size: 64, offset: 2688)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !453)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !339, file: !340, line: 103, baseType: !464, size: 64, offset: 2752)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !339, file: !340, line: 104, baseType: !393, size: 64, offset: 2816)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !339, file: !340, line: 105, baseType: !398, size: 32, offset: 2880)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !339, file: !340, line: 106, baseType: !468, size: 128, offset: 2944)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 128, elements: !475)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !340, line: 64, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !340, line: 61, size: 128, elements: !472)
!472 = !{!473, !474}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !471, file: !340, line: 62, baseType: !386, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !471, file: !340, line: 63, baseType: !435, size: 64, offset: 64)
!475 = !{!476}
!476 = !DISubrange(count: 2)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !339, file: !340, line: 107, baseType: !478, size: 64, offset: 3072)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 64, elements: !475)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !339, file: !340, line: 108, baseType: !435, size: 64, offset: 3136)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !339, file: !340, line: 109, baseType: !481, size: 64, offset: 3200)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!353, !435}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !339, file: !340, line: 111, baseType: !398, size: 32, offset: 3264)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !339, file: !340, line: 112, baseType: !486, size: 320, offset: 3328)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !487, size: 320, elements: !532)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!353, !490, !337, !435}
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !493)
!493 = !{!494, !495, !520, !521, !522, !523, !524, !525, !526, !527, !528}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !492, file: !10, line: 100, baseType: !398, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !492, file: !10, line: 101, baseType: !496, size: 64, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !497)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !499)
!499 = !{!500, !501, !502, !503, !504, !507, !508, !509, !513, !515, !517, !518, !519}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !498, file: !10, line: 84, baseType: !425, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !498, file: !10, line: 85, baseType: !425, size: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !498, file: !10, line: 86, baseType: !435, size: 64, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !498, file: !10, line: 87, baseType: !417, size: 64, offset: 192)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !498, file: !10, line: 88, baseType: !505, size: 64, offset: 256)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !375)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !498, file: !10, line: 89, baseType: !377, size: 8, offset: 320)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !498, file: !10, line: 90, baseType: !425, size: 64, offset: 384)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !498, file: !10, line: 91, baseType: !510, size: 64, offset: 448)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !511, line: 46, baseType: !512)
!511 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!512 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !498, file: !10, line: 92, baseType: !514, size: 32, offset: 512)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !498, file: !10, line: 93, baseType: !516, size: 32, offset: 544)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !498, file: !10, line: 94, baseType: !496, size: 64, offset: 576)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !498, file: !10, line: 95, baseType: !425, size: 64, offset: 640)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !498, file: !10, line: 96, baseType: !435, size: 64, offset: 704)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !492, file: !10, line: 102, baseType: !425, size: 64, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !492, file: !10, line: 102, baseType: !425, size: 64, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !492, file: !10, line: 103, baseType: !425, size: 64, offset: 256)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !492, file: !10, line: 104, baseType: !355, size: 64, offset: 320)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !492, file: !10, line: 105, baseType: !514, size: 32, offset: 384)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !492, file: !10, line: 105, baseType: !514, size: 32, offset: 416)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !492, file: !10, line: 105, baseType: !514, size: 32, offset: 448)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !492, file: !10, line: 106, baseType: !337, size: 64, offset: 512)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !492, file: !10, line: 107, baseType: !529, size: 64, offset: 576)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!532 = !{!533}
!533 = !DISubrange(count: 5)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !339, file: !340, line: 113, baseType: !535, size: 320, offset: 3648)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 320, elements: !532)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!353, !337, !435}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !339, file: !340, line: 114, baseType: !540, size: 320, offset: 3968)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 320, elements: !532)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !339, file: !340, line: 115, baseType: !514, size: 32, offset: 4288)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !339, file: !340, line: 120, baseType: !529, size: 64, offset: 4352)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !339, file: !340, line: 121, baseType: !514, size: 32, offset: 4416)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_MPIAIJ", file: !546, line: 70, baseType: !547)
!546 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/aij/mpi/mpiaij.h", directory: "/home/users/ndemeye/xSDK")
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !546, line: 34, size: 1344, elements: !548)
!548 = !{!549, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1344, !1345, !1346, !1347, !1353, !1354, !1355, !1356, !1357, !1358}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !547, file: !546, line: 35, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !551)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !553, line: 436, size: 23424, elements: !554)
!553 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!554 = !{!555, !557, !1064, !1084, !1085, !1086, !1088, !1089, !1090, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1217, !1218, !1234, !1235, !1236, !1237, !1238, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1273, !1293, !1294, !1296, !1297, !1298, !1299, !1300, !1301, !1319, !1320}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !552, file: !553, line: 437, baseType: !556, size: 4480)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !340, line: 122, baseType: !339)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !552, file: !553, line: 437, baseType: !558, size: 9472, offset: 4480)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 9472, elements: !394)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !553, line: 32, size: 9472, elements: !560)
!560 = !{!561, !570, !574, !575, !582, !586, !587, !588, !589, !590, !591, !592, !616, !620, !625, !631, !650, !655, !659, !660, !665, !670, !671, !676, !680, !684, !688, !692, !696, !697, !698, !699, !700, !704, !705, !710, !711, !712, !713, !714, !719, !726, !731, !735, !739, !743, !747, !748, !752, !753, !760, !765, !766, !767, !768, !830, !838, !839, !843, !844, !848, !849, !853, !858, !859, !863, !867, !874, !875, !876, !877, !878, !879, !884, !885, !889, !893, !897, !898, !899, !903, !913, !914, !918, !919, !923, !924, !928, !929, !934, !935, !939, !943, !944, !945, !946, !947, !948, !949, !953, !954, !955, !956, !957, !958, !962, !963, !964, !965, !966, !967, !968, !969, !973, !977, !978, !979, !983, !984, !985, !986, !987, !988, !989, !993, !994, !995, !1000, !1004, !1005, !1009, !1010, !1011, !1012, !1038, !1042, !1043, !1044, !1045, !1046, !1050, !1051, !1052, !1053, !1054, !1058, !1062, !1063}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !559, file: !553, line: 34, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!353, !550, !398, !565, !398, !565, !567, !569}
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !398)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !462)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !559, file: !553, line: 35, baseType: !571, size: 64, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{!353, !550, !398, !444, !446, !464}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !559, file: !553, line: 36, baseType: !571, size: 64, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !559, file: !553, line: 37, baseType: !576, size: 64, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!353, !550, !579, !579}
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !580)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !559, file: !553, line: 38, baseType: !583, size: 64, offset: 256)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!353, !550, !579, !579, !579}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !559, file: !553, line: 40, baseType: !576, size: 64, offset: 320)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !559, file: !553, line: 41, baseType: !583, size: 64, offset: 384)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !559, file: !553, line: 42, baseType: !576, size: 64, offset: 448)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !559, file: !553, line: 43, baseType: !583, size: 64, offset: 512)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !559, file: !553, line: 44, baseType: !576, size: 64, offset: 576)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !559, file: !553, line: 46, baseType: !583, size: 64, offset: 640)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !559, file: !553, line: 47, baseType: !593, size: 64, offset: 704)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{!353, !550, !596, !596, !600}
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !597, line: 11, baseType: !598)
!597 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !597, line: 11, flags: DIFlagFwdDecl)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !604)
!604 = !{!605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !603, file: !36, line: 1227, baseType: !453, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !603, file: !36, line: 1228, baseType: !453, size: 64, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !603, file: !36, line: 1229, baseType: !453, size: 64, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !603, file: !36, line: 1230, baseType: !453, size: 64, offset: 192)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !603, file: !36, line: 1231, baseType: !453, size: 64, offset: 256)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !603, file: !36, line: 1232, baseType: !453, size: 64, offset: 320)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !603, file: !36, line: 1233, baseType: !453, size: 64, offset: 384)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !603, file: !36, line: 1234, baseType: !453, size: 64, offset: 448)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !603, file: !36, line: 1236, baseType: !453, size: 64, offset: 512)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !603, file: !36, line: 1237, baseType: !453, size: 64, offset: 576)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !603, file: !36, line: 1238, baseType: !453, size: 64, offset: 640)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !559, file: !553, line: 48, baseType: !617, size: 64, offset: 768)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{!353, !550, !596, !600}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !559, file: !553, line: 49, baseType: !621, size: 64, offset: 832)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!353, !550, !579, !453, !624, !453, !398, !398, !579}
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !559, file: !553, line: 50, baseType: !626, size: 64, offset: 896)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!353, !550, !629, !630}
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !559, file: !553, line: 52, baseType: !632, size: 64, offset: 960)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DISubroutineType(types: !634)
!634 = !{!353, !550, !635, !636}
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !638)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !639)
!639 = !{!640, !641, !642, !643, !644, !645, !646, !647, !648, !649}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !638, file: !36, line: 593, baseType: !400, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !638, file: !36, line: 594, baseType: !400, size: 64, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !638, file: !36, line: 594, baseType: !400, size: 64, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !638, file: !36, line: 594, baseType: !400, size: 64, offset: 192)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !638, file: !36, line: 595, baseType: !400, size: 64, offset: 256)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !638, file: !36, line: 596, baseType: !400, size: 64, offset: 320)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !638, file: !36, line: 597, baseType: !400, size: 64, offset: 384)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !638, file: !36, line: 598, baseType: !400, size: 64, offset: 448)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !638, file: !36, line: 598, baseType: !400, size: 64, offset: 512)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !638, file: !36, line: 599, baseType: !400, size: 64, offset: 576)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !559, file: !553, line: 53, baseType: !651, size: 64, offset: 1024)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!353, !550, !550, !654}
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !559, file: !553, line: 54, baseType: !656, size: 64, offset: 1088)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!353, !550, !579}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !559, file: !553, line: 55, baseType: !576, size: 64, offset: 1152)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !559, file: !553, line: 56, baseType: !661, size: 64, offset: 1216)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!353, !550, !664, !452}
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !559, file: !553, line: 58, baseType: !666, size: 64, offset: 1280)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!353, !550, !669}
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !559, file: !553, line: 59, baseType: !666, size: 64, offset: 1344)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !559, file: !553, line: 60, baseType: !672, size: 64, offset: 1408)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!353, !550, !675, !514}
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !559, file: !553, line: 61, baseType: !677, size: 64, offset: 1472)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!353, !550}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !559, file: !553, line: 63, baseType: !681, size: 64, offset: 1536)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!353, !550, !398, !565, !462, !579, !579}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !559, file: !553, line: 64, baseType: !685, size: 64, offset: 1600)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DISubroutineType(types: !687)
!687 = !{!353, !550, !550, !596, !596, !600}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !559, file: !553, line: 65, baseType: !689, size: 64, offset: 1664)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!353, !550, !550, !600}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !559, file: !553, line: 66, baseType: !693, size: 64, offset: 1728)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{!353, !550, !550, !596, !600}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !559, file: !553, line: 67, baseType: !689, size: 64, offset: 1792)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !559, file: !553, line: 69, baseType: !677, size: 64, offset: 1856)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !559, file: !553, line: 70, baseType: !685, size: 64, offset: 1920)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !559, file: !553, line: 71, baseType: !693, size: 64, offset: 1984)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !559, file: !553, line: 72, baseType: !701, size: 64, offset: 2048)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!353, !550, !630}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !559, file: !553, line: 73, baseType: !677, size: 64, offset: 2112)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !559, file: !553, line: 75, baseType: !706, size: 64, offset: 2176)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!353, !550, !709, !630}
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !559, file: !553, line: 76, baseType: !576, size: 64, offset: 2240)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !559, file: !553, line: 77, baseType: !576, size: 64, offset: 2304)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !559, file: !553, line: 78, baseType: !593, size: 64, offset: 2368)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !559, file: !553, line: 79, baseType: !617, size: 64, offset: 2432)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !559, file: !553, line: 81, baseType: !715, size: 64, offset: 2496)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!353, !550, !462, !550, !718}
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !559, file: !553, line: 82, baseType: !720, size: 64, offset: 2560)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!353, !550, !398, !723, !723, !629, !725}
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !596)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !559, file: !553, line: 83, baseType: !727, size: 64, offset: 2624)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{!353, !550, !398, !730, !398}
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !559, file: !553, line: 84, baseType: !732, size: 64, offset: 2688)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!353, !550, !398, !565, !398, !565, !461}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !559, file: !553, line: 85, baseType: !736, size: 64, offset: 2752)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!353, !550, !550, !718}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !559, file: !553, line: 87, baseType: !740, size: 64, offset: 2816)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{!353, !550, !579, !444}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !559, file: !553, line: 88, baseType: !744, size: 64, offset: 2880)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!353, !550, !462}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !559, file: !553, line: 89, baseType: !744, size: 64, offset: 2944)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !559, file: !553, line: 90, baseType: !749, size: 64, offset: 3008)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!353, !550, !579, !569}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !559, file: !553, line: 91, baseType: !681, size: 64, offset: 3072)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !559, file: !553, line: 93, baseType: !754, size: 64, offset: 3136)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{!353, !550, !757}
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !758)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !559, file: !553, line: 94, baseType: !761, size: 64, offset: 3200)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!353, !550, !398, !514, !514, !444, !764, !764, !654}
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !559, file: !553, line: 95, baseType: !761, size: 64, offset: 3264)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !559, file: !553, line: 96, baseType: !761, size: 64, offset: 3328)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !559, file: !553, line: 97, baseType: !761, size: 64, offset: 3392)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !559, file: !553, line: 99, baseType: !769, size: 64, offset: 3456)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{!353, !550, !772, !775}
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !597, line: 51, baseType: !773)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !597, line: 51, flags: DIFlagFwdDecl)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !776)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !553, line: 609, size: 6208, elements: !778)
!778 = !{!779, !780, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !799, !806, !807, !808, !809, !810, !811, !812, !813, !817, !818, !819, !820, !821, !823, !824, !825, !826, !827, !828, !829}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !777, file: !553, line: 610, baseType: !556, size: 4480)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !777, file: !553, line: 610, baseType: !781, size: 32, offset: 4480)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !394)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !777, file: !553, line: 611, baseType: !398, size: 32, offset: 4512)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !777, file: !553, line: 611, baseType: !398, size: 32, offset: 4544)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !777, file: !553, line: 611, baseType: !398, size: 32, offset: 4576)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !777, file: !553, line: 612, baseType: !398, size: 32, offset: 4608)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !777, file: !553, line: 613, baseType: !398, size: 32, offset: 4640)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !777, file: !553, line: 614, baseType: !444, size: 64, offset: 4672)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !777, file: !553, line: 615, baseType: !446, size: 64, offset: 4736)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !777, file: !553, line: 616, baseType: !730, size: 64, offset: 4800)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !777, file: !553, line: 617, baseType: !444, size: 64, offset: 4864)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !777, file: !553, line: 618, baseType: !792, size: 64, offset: 4928)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !553, line: 602, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !553, line: 598, size: 128, elements: !795)
!795 = !{!796, !797, !798}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !794, file: !553, line: 599, baseType: !398, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !794, file: !553, line: 600, baseType: !398, size: 32, offset: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !794, file: !553, line: 601, baseType: !461, size: 64, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !777, file: !553, line: 619, baseType: !800, size: 64, offset: 4992)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !553, line: 607, baseType: !802)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !553, line: 604, size: 128, elements: !803)
!803 = !{!804, !805}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !802, file: !553, line: 605, baseType: !398, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !802, file: !553, line: 606, baseType: !461, size: 64, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !777, file: !553, line: 620, baseType: !461, size: 64, offset: 5056)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !777, file: !553, line: 621, baseType: !453, size: 64, offset: 5120)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !777, file: !553, line: 622, baseType: !453, size: 64, offset: 5184)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !777, file: !553, line: 623, baseType: !579, size: 64, offset: 5248)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !777, file: !553, line: 623, baseType: !579, size: 64, offset: 5312)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !777, file: !553, line: 623, baseType: !579, size: 64, offset: 5376)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !777, file: !553, line: 624, baseType: !514, size: 32, offset: 5440)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !777, file: !553, line: 625, baseType: !814, size: 64, offset: 5504)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{!353}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !777, file: !553, line: 626, baseType: !435, size: 64, offset: 5568)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !777, file: !553, line: 627, baseType: !579, size: 64, offset: 5632)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !777, file: !553, line: 628, baseType: !398, size: 32, offset: 5696)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !777, file: !553, line: 629, baseType: !375, size: 64, offset: 5760)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !777, file: !553, line: 630, baseType: !822, size: 32, offset: 5824)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !777, file: !553, line: 631, baseType: !398, size: 32, offset: 5856)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !777, file: !553, line: 631, baseType: !398, size: 32, offset: 5888)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !777, file: !553, line: 632, baseType: !514, size: 32, offset: 5920)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !777, file: !553, line: 633, baseType: !514, size: 32, offset: 5952)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !777, file: !553, line: 634, baseType: !386, size: 64, offset: 6016)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !777, file: !553, line: 634, baseType: !435, size: 64, offset: 6080)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !777, file: !553, line: 635, baseType: !406, size: 64, offset: 6144)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !559, file: !553, line: 100, baseType: !831, size: 64, offset: 3520)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{!353, !550, !398, !398, !834, !837}
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !836)
!836 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !559, file: !553, line: 101, baseType: !677, size: 64, offset: 3584)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !559, file: !553, line: 102, baseType: !840, size: 64, offset: 3648)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{!353, !550, !596, !596, !630}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !559, file: !553, line: 103, baseType: !562, size: 64, offset: 3712)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !559, file: !553, line: 105, baseType: !845, size: 64, offset: 3776)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{!353, !550, !596, !596, !629, !630}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !559, file: !553, line: 106, baseType: !677, size: 64, offset: 3840)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !559, file: !553, line: 107, baseType: !850, size: 64, offset: 3904)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!353, !550, !362}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !559, file: !553, line: 108, baseType: !854, size: 64, offset: 3968)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{!353, !550, !857, !629, !630}
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !375)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !559, file: !553, line: 109, baseType: !814, size: 64, offset: 4032)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !559, file: !553, line: 111, baseType: !860, size: 64, offset: 4096)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{!353, !550, !550, !550, !453, !550}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !559, file: !553, line: 112, baseType: !864, size: 64, offset: 4160)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{!353, !550, !550, !550, !550}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !559, file: !553, line: 113, baseType: !868, size: 64, offset: 4224)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!353, !550, !871, !871}
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !597, line: 30, baseType: !872)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !597, line: 30, flags: DIFlagFwdDecl)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !559, file: !553, line: 114, baseType: !562, size: 64, offset: 4288)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !559, file: !553, line: 115, baseType: !681, size: 64, offset: 4352)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !559, file: !553, line: 117, baseType: !740, size: 64, offset: 4416)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !559, file: !553, line: 118, baseType: !740, size: 64, offset: 4480)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !559, file: !553, line: 119, baseType: !854, size: 64, offset: 4544)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !559, file: !553, line: 120, baseType: !880, size: 64, offset: 4608)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DISubroutineType(types: !882)
!882 = !{!353, !550, !883, !654}
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !559, file: !553, line: 121, baseType: !814, size: 64, offset: 4672)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !559, file: !553, line: 123, baseType: !886, size: 64, offset: 4736)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DISubroutineType(types: !888)
!888 = !{!353, !550, !398, !435}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !559, file: !553, line: 124, baseType: !890, size: 64, offset: 4800)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{!353, !550, !775, !579, !435}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !559, file: !553, line: 125, baseType: !894, size: 64, offset: 4864)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{!353, !490, !550}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !559, file: !553, line: 126, baseType: !576, size: 64, offset: 4928)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !559, file: !553, line: 127, baseType: !576, size: 64, offset: 4992)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !559, file: !553, line: 129, baseType: !900, size: 64, offset: 5056)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DISubroutineType(types: !902)
!902 = !{!353, !550, !730}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !559, file: !553, line: 130, baseType: !904, size: 64, offset: 5120)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{!353, !550, !907, !907}
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !908)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !910)
!910 = !{!911, !912}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !909, file: !60, line: 653, baseType: !398, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !909, file: !60, line: 653, baseType: !579, size: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !559, file: !553, line: 131, baseType: !904, size: 64, offset: 5184)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !559, file: !553, line: 132, baseType: !915, size: 64, offset: 5248)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!353, !550, !444, !444, !444}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !559, file: !553, line: 133, baseType: !850, size: 64, offset: 5312)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !559, file: !553, line: 135, baseType: !920, size: 64, offset: 5376)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{!353, !550, !453, !654}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !559, file: !553, line: 136, baseType: !920, size: 64, offset: 5440)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !559, file: !553, line: 137, baseType: !925, size: 64, offset: 5504)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!353, !550, !654}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !559, file: !553, line: 138, baseType: !562, size: 64, offset: 5568)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !559, file: !553, line: 139, baseType: !930, size: 64, offset: 5632)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{!353, !550, !933, !933}
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !559, file: !553, line: 141, baseType: !814, size: 64, offset: 5696)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !559, file: !553, line: 142, baseType: !936, size: 64, offset: 5760)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!353, !550, !550, !453, !550}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !559, file: !553, line: 143, baseType: !940, size: 64, offset: 5824)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{!353, !550, !550, !550}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !559, file: !553, line: 144, baseType: !814, size: 64, offset: 5888)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !559, file: !553, line: 145, baseType: !936, size: 64, offset: 5952)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !559, file: !553, line: 147, baseType: !940, size: 64, offset: 6016)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !559, file: !553, line: 148, baseType: !814, size: 64, offset: 6080)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !559, file: !553, line: 149, baseType: !936, size: 64, offset: 6144)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !559, file: !553, line: 150, baseType: !940, size: 64, offset: 6208)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !559, file: !553, line: 151, baseType: !950, size: 64, offset: 6272)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{!353, !550, !514}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !559, file: !553, line: 153, baseType: !677, size: 64, offset: 6336)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !559, file: !553, line: 154, baseType: !677, size: 64, offset: 6400)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !559, file: !553, line: 155, baseType: !677, size: 64, offset: 6464)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !559, file: !553, line: 156, baseType: !677, size: 64, offset: 6528)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !559, file: !553, line: 157, baseType: !850, size: 64, offset: 6592)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !559, file: !553, line: 159, baseType: !959, size: 64, offset: 6656)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!353, !550, !398, !567}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !559, file: !553, line: 160, baseType: !677, size: 64, offset: 6720)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !559, file: !553, line: 161, baseType: !677, size: 64, offset: 6784)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !559, file: !553, line: 162, baseType: !677, size: 64, offset: 6848)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !559, file: !553, line: 163, baseType: !677, size: 64, offset: 6912)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !559, file: !553, line: 165, baseType: !940, size: 64, offset: 6976)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !559, file: !553, line: 166, baseType: !940, size: 64, offset: 7040)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !559, file: !553, line: 167, baseType: !740, size: 64, offset: 7104)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !559, file: !553, line: 168, baseType: !970, size: 64, offset: 7168)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!353, !550, !579, !398}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !559, file: !553, line: 169, baseType: !974, size: 64, offset: 7232)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!353, !550, !654, !444}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !559, file: !553, line: 171, baseType: !701, size: 64, offset: 7296)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !559, file: !553, line: 172, baseType: !677, size: 64, offset: 7360)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !559, file: !553, line: 173, baseType: !980, size: 64, offset: 7424)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!353, !550, !444, !764}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !559, file: !553, line: 174, baseType: !840, size: 64, offset: 7488)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !559, file: !553, line: 175, baseType: !840, size: 64, offset: 7552)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !559, file: !553, line: 177, baseType: !576, size: 64, offset: 7616)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !559, file: !553, line: 178, baseType: !626, size: 64, offset: 7680)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !559, file: !553, line: 179, baseType: !576, size: 64, offset: 7744)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !559, file: !553, line: 180, baseType: !583, size: 64, offset: 7808)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !559, file: !553, line: 181, baseType: !990, size: 64, offset: 7872)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!353, !550, !355, !629, !630}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !559, file: !553, line: 183, baseType: !900, size: 64, offset: 7936)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !559, file: !553, line: 184, baseType: !661, size: 64, offset: 8000)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !559, file: !553, line: 185, baseType: !996, size: 64, offset: 8064)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!353, !550, !999}
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !559, file: !553, line: 186, baseType: !1001, size: 64, offset: 8128)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!353, !550, !398, !565, !461}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !559, file: !553, line: 187, baseType: !720, size: 64, offset: 8192)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !559, file: !553, line: 189, baseType: !1006, size: 64, offset: 8256)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!353, !550, !398, !398, !444, !567}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !559, file: !553, line: 190, baseType: !814, size: 64, offset: 8320)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !559, file: !553, line: 191, baseType: !936, size: 64, offset: 8384)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !559, file: !553, line: 192, baseType: !940, size: 64, offset: 8448)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !559, file: !553, line: 193, baseType: !1013, size: 64, offset: 8512)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!353, !550, !772, !1016}
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1017)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !553, line: 660, size: 5312, elements: !1019)
!1019 = !{!1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1018, file: !553, line: 661, baseType: !556, size: 4480)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1018, file: !553, line: 661, baseType: !781, size: 32, offset: 4480)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1018, file: !553, line: 662, baseType: !398, size: 32, offset: 4512)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1018, file: !553, line: 662, baseType: !398, size: 32, offset: 4544)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1018, file: !553, line: 662, baseType: !398, size: 32, offset: 4576)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1018, file: !553, line: 663, baseType: !398, size: 32, offset: 4608)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1018, file: !553, line: 664, baseType: !398, size: 32, offset: 4640)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1018, file: !553, line: 665, baseType: !444, size: 64, offset: 4672)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1018, file: !553, line: 666, baseType: !444, size: 64, offset: 4736)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1018, file: !553, line: 667, baseType: !398, size: 32, offset: 4800)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1018, file: !553, line: 668, baseType: !822, size: 32, offset: 4832)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1018, file: !553, line: 670, baseType: !444, size: 64, offset: 4864)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1018, file: !553, line: 670, baseType: !444, size: 64, offset: 4928)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1018, file: !553, line: 671, baseType: !444, size: 64, offset: 4992)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1018, file: !553, line: 672, baseType: !444, size: 64, offset: 5056)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1018, file: !553, line: 673, baseType: !444, size: 64, offset: 5120)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1018, file: !553, line: 674, baseType: !398, size: 32, offset: 5184)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1018, file: !553, line: 675, baseType: !444, size: 64, offset: 5248)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !559, file: !553, line: 195, baseType: !1039, size: 64, offset: 8576)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!353, !1016, !550, !550}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !559, file: !553, line: 196, baseType: !1039, size: 64, offset: 8640)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !559, file: !553, line: 197, baseType: !814, size: 64, offset: 8704)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !559, file: !553, line: 198, baseType: !936, size: 64, offset: 8768)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !559, file: !553, line: 199, baseType: !940, size: 64, offset: 8832)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !559, file: !553, line: 201, baseType: !1047, size: 64, offset: 8896)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!353, !550, !398, !398}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !559, file: !553, line: 202, baseType: !715, size: 64, offset: 8960)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !559, file: !553, line: 203, baseType: !583, size: 64, offset: 9024)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !559, file: !553, line: 204, baseType: !769, size: 64, offset: 9088)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !559, file: !553, line: 205, baseType: !900, size: 64, offset: 9152)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !559, file: !553, line: 206, baseType: !1055, size: 64, offset: 9216)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!353, !355, !550, !398, !629, !630}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !559, file: !553, line: 208, baseType: !1059, size: 64, offset: 9280)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!353, !398, !725}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !559, file: !553, line: 209, baseType: !940, size: 64, offset: 9344)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !559, file: !553, line: 210, baseType: !732, size: 64, offset: 9408)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !552, file: !553, line: 438, baseType: !1065, size: 64, offset: 13952)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !597, line: 60, baseType: !1066)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1068)
!1068 = !{!1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1067, file: !114, line: 241, baseType: !355, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1067, file: !114, line: 242, baseType: !415, size: 32, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1067, file: !114, line: 243, baseType: !398, size: 32, offset: 96)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1067, file: !114, line: 243, baseType: !398, size: 32, offset: 128)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1067, file: !114, line: 244, baseType: !398, size: 32, offset: 160)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1067, file: !114, line: 244, baseType: !398, size: 32, offset: 192)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1067, file: !114, line: 245, baseType: !444, size: 64, offset: 256)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1067, file: !114, line: 246, baseType: !514, size: 32, offset: 320)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1067, file: !114, line: 247, baseType: !398, size: 32, offset: 352)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1067, file: !114, line: 251, baseType: !398, size: 32, offset: 384)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1067, file: !114, line: 252, baseType: !871, size: 64, offset: 448)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1067, file: !114, line: 253, baseType: !514, size: 32, offset: 512)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1067, file: !114, line: 254, baseType: !398, size: 32, offset: 544)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1067, file: !114, line: 254, baseType: !398, size: 32, offset: 576)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1067, file: !114, line: 255, baseType: !398, size: 32, offset: 608)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !552, file: !553, line: 438, baseType: !1065, size: 64, offset: 14016)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !552, file: !553, line: 439, baseType: !435, size: 64, offset: 14080)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !552, file: !553, line: 440, baseType: !1087, size: 32, offset: 14144)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !552, file: !553, line: 441, baseType: !514, size: 32, offset: 14176)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !552, file: !553, line: 442, baseType: !514, size: 32, offset: 14208)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !552, file: !553, line: 443, baseType: !1091, size: 448, offset: 14272)
!1091 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1092, size: 448, elements: !1093)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !375)
!1093 = !{!1094}
!1094 = !DISubrange(count: 7)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !552, file: !553, line: 444, baseType: !514, size: 32, offset: 14720)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !552, file: !553, line: 445, baseType: !514, size: 32, offset: 14752)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !552, file: !553, line: 446, baseType: !398, size: 32, offset: 14784)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !552, file: !553, line: 447, baseType: !437, size: 64, offset: 14848)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !552, file: !553, line: 448, baseType: !437, size: 64, offset: 14912)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !552, file: !553, line: 449, baseType: !637, size: 640, offset: 14976)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !552, file: !553, line: 450, baseType: !569, size: 32, offset: 15616)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !552, file: !553, line: 451, baseType: !1103, size: 2880, offset: 15680)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !553, line: 318, baseType: !1104)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !553, line: 319, size: 2880, elements: !1105)
!1105 = !{!1106, !1107, !1108, !1109, !1110, !1111, !1112, !1125, !1126, !1131, !1136, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1151, !1152, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1184, !1185, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1208, !1209, !1210, !1214, !1215}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1104, file: !553, line: 320, baseType: !398, size: 32)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1104, file: !553, line: 321, baseType: !398, size: 32, offset: 32)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1104, file: !553, line: 322, baseType: !398, size: 32, offset: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1104, file: !553, line: 323, baseType: !398, size: 32, offset: 96)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1104, file: !553, line: 324, baseType: !398, size: 32, offset: 128)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1104, file: !553, line: 325, baseType: !398, size: 32, offset: 160)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1104, file: !553, line: 326, baseType: !1113, size: 64, offset: 192)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !553, line: 293, baseType: !1114)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !553, line: 295, size: 448, elements: !1116)
!1116 = !{!1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1115, file: !553, line: 296, baseType: !1113, size: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1115, file: !553, line: 297, baseType: !461, size: 64, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1115, file: !553, line: 297, baseType: !461, size: 64, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1115, file: !553, line: 298, baseType: !444, size: 64, offset: 192)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1115, file: !553, line: 298, baseType: !444, size: 64, offset: 256)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1115, file: !553, line: 299, baseType: !398, size: 32, offset: 320)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1115, file: !553, line: 300, baseType: !398, size: 32, offset: 352)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1115, file: !553, line: 301, baseType: !398, size: 32, offset: 384)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1104, file: !553, line: 326, baseType: !1113, size: 64, offset: 256)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1104, file: !553, line: 328, baseType: !1127, size: 64, offset: 320)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!353, !550, !1130, !444}
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1104, file: !553, line: 329, baseType: !1132, size: 64, offset: 384)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!353, !1130, !1135, !446, !446, !464, !444}
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1104, file: !553, line: 330, baseType: !1137, size: 64, offset: 448)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!353, !1130}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1104, file: !553, line: 331, baseType: !1137, size: 64, offset: 512)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1104, file: !553, line: 334, baseType: !355, size: 64, offset: 576)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1104, file: !553, line: 335, baseType: !415, size: 32, offset: 640)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1104, file: !553, line: 335, baseType: !415, size: 32, offset: 672)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1104, file: !553, line: 336, baseType: !415, size: 32, offset: 704)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1104, file: !553, line: 336, baseType: !415, size: 32, offset: 736)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1104, file: !553, line: 337, baseType: !1147, size: 64, offset: 768)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !325, line: 339, baseType: !1149)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !325, line: 339, flags: DIFlagFwdDecl)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1104, file: !553, line: 338, baseType: !1147, size: 64, offset: 832)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1104, file: !553, line: 339, baseType: !1153, size: 64, offset: 896)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !325, line: 341, baseType: !1155)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !325, line: 351, size: 192, elements: !1156)
!1156 = !{!1157, !1158, !1159, !1160, !1161}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1155, file: !325, line: 354, baseType: !72, size: 32)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1155, file: !325, line: 355, baseType: !72, size: 32, offset: 32)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1155, file: !325, line: 356, baseType: !72, size: 32, offset: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1155, file: !325, line: 361, baseType: !72, size: 32, offset: 96)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1155, file: !325, line: 362, baseType: !510, size: 64, offset: 128)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1104, file: !553, line: 340, baseType: !398, size: 32, offset: 960)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1104, file: !553, line: 340, baseType: !398, size: 32, offset: 992)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1104, file: !553, line: 341, baseType: !461, size: 64, offset: 1024)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1104, file: !553, line: 342, baseType: !444, size: 64, offset: 1088)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1104, file: !553, line: 343, baseType: !464, size: 64, offset: 1152)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1104, file: !553, line: 344, baseType: !446, size: 64, offset: 1216)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1104, file: !553, line: 345, baseType: !398, size: 32, offset: 1280)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1104, file: !553, line: 346, baseType: !1135, size: 64, offset: 1344)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1104, file: !553, line: 347, baseType: !514, size: 32, offset: 1408)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1104, file: !553, line: 348, baseType: !398, size: 32, offset: 1440)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1104, file: !553, line: 351, baseType: !514, size: 32, offset: 1472)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1104, file: !553, line: 352, baseType: !514, size: 32, offset: 1504)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1104, file: !553, line: 353, baseType: !415, size: 32, offset: 1536)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1104, file: !553, line: 354, baseType: !415, size: 32, offset: 1568)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1104, file: !553, line: 355, baseType: !1135, size: 64, offset: 1600)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1104, file: !553, line: 356, baseType: !1135, size: 64, offset: 1664)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1104, file: !553, line: 357, baseType: !1179, size: 64, offset: 1728)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !553, line: 310, baseType: !1181)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !553, line: 308, size: 32, elements: !1182)
!1182 = !{!1183}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1181, file: !553, line: 309, baseType: !398, size: 32)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1104, file: !553, line: 357, baseType: !1179, size: 64, offset: 1792)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1104, file: !553, line: 358, baseType: !1186, size: 64, offset: 1856)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !553, line: 316, baseType: !1188)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !553, line: 312, size: 128, elements: !1189)
!1189 = !{!1190, !1191, !1192}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1188, file: !553, line: 313, baseType: !435, size: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1188, file: !553, line: 314, baseType: !398, size: 32, offset: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1188, file: !553, line: 315, baseType: !377, size: 8, offset: 96)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1104, file: !553, line: 359, baseType: !1186, size: 64, offset: 1920)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1104, file: !553, line: 360, baseType: !1186, size: 64, offset: 1984)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1104, file: !553, line: 361, baseType: !398, size: 32, offset: 2048)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1104, file: !553, line: 362, baseType: !415, size: 32, offset: 2080)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1104, file: !553, line: 363, baseType: !398, size: 32, offset: 2112)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1104, file: !553, line: 364, baseType: !1135, size: 64, offset: 2176)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1104, file: !553, line: 365, baseType: !1153, size: 64, offset: 2240)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1104, file: !553, line: 366, baseType: !415, size: 32, offset: 2304)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1104, file: !553, line: 367, baseType: !415, size: 32, offset: 2336)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1104, file: !553, line: 368, baseType: !1147, size: 64, offset: 2368)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1104, file: !553, line: 369, baseType: !1147, size: 64, offset: 2432)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1104, file: !553, line: 370, baseType: !1205, size: 64, offset: 2496)
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1206)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1104, file: !553, line: 371, baseType: !1205, size: 64, offset: 2560)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1104, file: !553, line: 372, baseType: !1205, size: 64, offset: 2624)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1104, file: !553, line: 373, baseType: !1211, size: 64, offset: 2688)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !325, line: 331, baseType: !1212)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1213 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !325, line: 331, flags: DIFlagFwdDecl)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1104, file: !553, line: 374, baseType: !510, size: 64, offset: 2752)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1104, file: !553, line: 375, baseType: !1216, size: 64, offset: 2816)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !552, file: !553, line: 451, baseType: !1103, size: 2880, offset: 18560)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !552, file: !553, line: 452, baseType: !1219, size: 64, offset: 21440)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1220)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !553, line: 681, size: 4864, elements: !1222)
!1222 = !{!1223, !1224, !1225, !1226, !1227, !1228, !1229, !1233}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1221, file: !553, line: 682, baseType: !556, size: 4480)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1221, file: !553, line: 682, baseType: !781, size: 32, offset: 4480)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1221, file: !553, line: 683, baseType: !514, size: 32, offset: 4512)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1221, file: !553, line: 684, baseType: !398, size: 32, offset: 4544)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1221, file: !553, line: 685, baseType: !933, size: 64, offset: 4608)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1221, file: !553, line: 686, baseType: !461, size: 64, offset: 4672)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1221, file: !553, line: 687, baseType: !1230, size: 64, offset: 4736)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64)
!1231 = !DISubroutineType(types: !1232)
!1232 = !{!353, !1219, !579, !435}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1221, file: !553, line: 688, baseType: !435, size: 64, offset: 4800)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !552, file: !553, line: 453, baseType: !1219, size: 64, offset: 21504)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !552, file: !553, line: 454, baseType: !1219, size: 64, offset: 21568)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !552, file: !553, line: 455, baseType: !398, size: 32, offset: 21632)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "preallocated", scope: !552, file: !553, line: 456, baseType: !514, size: 32, offset: 21664)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !552, file: !553, line: 457, baseType: !1239, size: 320, offset: 21696)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStencilInfo", file: !553, line: 399, baseType: !1240)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !553, line: 394, size: 320, elements: !1241)
