; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/aij/mpi/mmaij.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/aij/mpi/mmaij.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Vec = type { %struct._p_PetscObject, [1 x %struct._VecOps], %struct._n_PetscLayout*, i8*, i32, %struct.VecStash, %struct.VecStash, i32, i32, i32, i8* }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!294 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!295 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!296 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!297 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!298 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!299 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !81, line: 161, baseType: !7, size: 32, elements: !300)
!300 = !{!301, !302, !303, !304, !305, !306, !307, !308}
!301 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!302 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!303 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!304 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!305 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!306 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!307 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!308 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!309 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !81, line: 1265, baseType: !7, size: 32, elements: !310)
!310 = !{!311, !312, !313}
!311 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!312 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!313 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!314 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !81, line: 1203, baseType: !7, size: 32, elements: !315)
!315 = !{!316, !317, !318, !319, !320}
!316 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!317 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!318 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!319 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!320 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!321 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !81, line: 187, baseType: !7, size: 32, elements: !322)
!322 = !{!323, !324, !325, !326, !327, !328, !329}
!323 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!324 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!325 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!326 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!327 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!328 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!329 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!330 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !331, line: 663, baseType: !7, size: 32, elements: !332)
!331 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!332 = !{!333, !334, !335}
!333 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!334 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!335 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!336 = !{!337, !1724, !368, !449, !524, !365, !389, !1824, !412, !526}
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_MPIAIJ", file: !339, line: 70, baseType: !340)
!339 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/aij/mpi/mpiaij.h", directory: "/home/users/ndemeye/xSDK")
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !339, line: 34, size: 1344, elements: !341)
!341 = !{!342, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1709, !1710, !1711, !1712, !1718, !1719, !1720, !1721, !1722, !1723}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !340, file: !339, line: 35, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !81, line: 16, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !346, line: 436, size: 23424, elements: !347)
!346 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!347 = !{!348, !558, !1461, !1462, !1463, !1464, !1466, !1467, !1468, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1582, !1583, !1599, !1600, !1601, !1602, !1603, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1638, !1658, !1659, !1661, !1662, !1663, !1664, !1665, !1666, !1684, !1685}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !345, file: !346, line: 437, baseType: !349, size: 4480)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !350, line: 122, baseType: !351)
!350 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !350, line: 73, size: 4480, elements: !352)
!352 = !{!353, !355, !410, !411, !413, !416, !417, !418, !419, !427, !428, !430, !434, !438, !440, !441, !442, !443, !444, !445, !446, !447, !448, !450, !452, !453, !454, !456, !457, !459, !461, !462, !463, !464, !465, !468, !470, !471, !472, !473, !474, !477, !479, !480, !481, !491, !493, !494, !498, !499, !548, !553, !555, !556, !557}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !351, file: !350, line: 74, baseType: !354, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !109)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !351, file: !350, line: 75, baseType: !356, size: 448, offset: 64)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 448, elements: !408)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !350, line: 53, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !350, line: 45, size: 448, elements: !359)
!359 = !{!360, !372, !380, !385, !392, !396, !403}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !358, file: !350, line: 46, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!364, !365, !367}
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !109)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !369, line: 330, baseType: !370)
!369 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !369, line: 330, flags: DIFlagFwdDecl)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !358, file: !350, line: 47, baseType: !373, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!364, !365, !376}
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !377, line: 16, baseType: !378)
!377 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !377, line: 16, flags: DIFlagFwdDecl)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !358, file: !350, line: 48, baseType: !381, size: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!364, !384}
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !358, file: !350, line: 49, baseType: !386, size: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!364, !365, !389, !365}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !391)
!391 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !358, file: !350, line: 50, baseType: !393, size: 64, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!364, !365, !389, !384}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !358, file: !350, line: 51, baseType: !397, size: 64, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!364, !365, !389, !400}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{null}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !358, file: !350, line: 52, baseType: !404, size: 64, offset: 384)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!364, !365, !389, !407}
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!408 = !{!409}
!409 = !DISubrange(count: 1)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !351, file: !350, line: 76, baseType: !368, size: 64, offset: 512)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !351, file: !350, line: 77, baseType: !412, size: 32, offset: 576)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !109)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !351, file: !350, line: 78, baseType: !414, size: 64, offset: 640)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !415)
!415 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !351, file: !350, line: 78, baseType: !414, size: 64, offset: 704)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !351, file: !350, line: 78, baseType: !414, size: 64, offset: 768)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !351, file: !350, line: 78, baseType: !414, size: 64, offset: 832)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !351, file: !350, line: 79, baseType: !420, size: 64, offset: 896)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !421)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !422)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !423, line: 27, baseType: !424)
!423 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !425, line: 43, baseType: !426)
!425 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!426 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !351, file: !350, line: 80, baseType: !412, size: 32, offset: 960)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !351, file: !350, line: 81, baseType: !429, size: 32, offset: 992)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !109)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !351, file: !350, line: 82, baseType: !431, size: 64, offset: 1024)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !351, file: !350, line: 83, baseType: !435, size: 64, offset: 1088)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !436)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !351, file: !350, line: 84, baseType: !439, size: 64, offset: 1152)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !351, file: !350, line: 85, baseType: !439, size: 64, offset: 1216)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !351, file: !350, line: 86, baseType: !439, size: 64, offset: 1280)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !351, file: !350, line: 87, baseType: !439, size: 64, offset: 1344)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !351, file: !350, line: 88, baseType: !365, size: 64, offset: 1408)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !351, file: !350, line: 89, baseType: !420, size: 64, offset: 1472)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !351, file: !350, line: 90, baseType: !439, size: 64, offset: 1536)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !351, file: !350, line: 91, baseType: !439, size: 64, offset: 1600)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !351, file: !350, line: 92, baseType: !412, size: 32, offset: 1664)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !351, file: !350, line: 93, baseType: !449, size: 64, offset: 1728)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !351, file: !350, line: 94, baseType: !451, size: 64, offset: 1792)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !421)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !351, file: !350, line: 95, baseType: !412, size: 32, offset: 1856)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !351, file: !350, line: 95, baseType: !412, size: 32, offset: 1888)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !351, file: !350, line: 96, baseType: !455, size: 64, offset: 1920)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !351, file: !350, line: 96, baseType: !455, size: 64, offset: 1984)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !351, file: !350, line: 97, baseType: !458, size: 64, offset: 2048)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !351, file: !350, line: 97, baseType: !460, size: 64, offset: 2112)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !351, file: !350, line: 98, baseType: !412, size: 32, offset: 2176)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !351, file: !350, line: 98, baseType: !412, size: 32, offset: 2208)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !351, file: !350, line: 99, baseType: !455, size: 64, offset: 2240)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !351, file: !350, line: 99, baseType: !455, size: 64, offset: 2304)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !351, file: !350, line: 100, baseType: !466, size: 64, offset: 2368)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !415)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !351, file: !350, line: 100, baseType: !469, size: 64, offset: 2432)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !351, file: !350, line: 101, baseType: !412, size: 32, offset: 2496)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !351, file: !350, line: 101, baseType: !412, size: 32, offset: 2528)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !351, file: !350, line: 102, baseType: !455, size: 64, offset: 2560)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !351, file: !350, line: 102, baseType: !455, size: 64, offset: 2624)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !351, file: !350, line: 103, baseType: !475, size: 64, offset: 2688)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !467)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !351, file: !350, line: 103, baseType: !478, size: 64, offset: 2752)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !351, file: !350, line: 104, baseType: !407, size: 64, offset: 2816)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !351, file: !350, line: 105, baseType: !412, size: 32, offset: 2880)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !351, file: !350, line: 106, baseType: !482, size: 128, offset: 2944)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !483, size: 128, elements: !489)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !350, line: 64, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !350, line: 61, size: 128, elements: !486)
!486 = !{!487, !488}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !485, file: !350, line: 62, baseType: !400, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !485, file: !350, line: 63, baseType: !449, size: 64, offset: 64)
!489 = !{!490}
!490 = !DISubrange(count: 2)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !351, file: !350, line: 107, baseType: !492, size: 64, offset: 3072)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 64, elements: !489)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !351, file: !350, line: 108, baseType: !449, size: 64, offset: 3136)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !351, file: !350, line: 109, baseType: !495, size: 64, offset: 3200)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{!364, !449}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !351, file: !350, line: 111, baseType: !412, size: 32, offset: 3264)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !351, file: !350, line: 112, baseType: !500, size: 320, offset: 3328)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 320, elements: !546)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!364, !504, !365, !449}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !506)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !507)
!507 = !{!508, !509, !534, !535, !536, !537, !538, !539, !540, !541, !542}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !506, file: !12, line: 100, baseType: !412, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !506, file: !12, line: 101, baseType: !510, size: 64, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !511)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !513)
!513 = !{!514, !515, !516, !517, !518, !521, !522, !523, !527, !529, !531, !532, !533}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !512, file: !12, line: 84, baseType: !439, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !512, file: !12, line: 85, baseType: !439, size: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !512, file: !12, line: 86, baseType: !449, size: 64, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !512, file: !12, line: 87, baseType: !431, size: 64, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !512, file: !12, line: 88, baseType: !519, size: 64, offset: 256)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !389)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !512, file: !12, line: 89, baseType: !391, size: 8, offset: 320)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !512, file: !12, line: 90, baseType: !439, size: 64, offset: 384)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !512, file: !12, line: 91, baseType: !524, size: 64, offset: 448)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !525, line: 46, baseType: !526)
!525 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!526 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !512, file: !12, line: 92, baseType: !528, size: 32, offset: 512)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !512, file: !12, line: 93, baseType: !530, size: 32, offset: 544)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !512, file: !12, line: 94, baseType: !510, size: 64, offset: 576)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !512, file: !12, line: 95, baseType: !439, size: 64, offset: 640)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !512, file: !12, line: 96, baseType: !449, size: 64, offset: 704)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !506, file: !12, line: 102, baseType: !439, size: 64, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !506, file: !12, line: 102, baseType: !439, size: 64, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !506, file: !12, line: 103, baseType: !439, size: 64, offset: 256)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !506, file: !12, line: 104, baseType: !368, size: 64, offset: 320)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !506, file: !12, line: 105, baseType: !528, size: 32, offset: 384)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !506, file: !12, line: 105, baseType: !528, size: 32, offset: 416)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !506, file: !12, line: 105, baseType: !528, size: 32, offset: 448)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !506, file: !12, line: 106, baseType: !365, size: 64, offset: 512)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !506, file: !12, line: 107, baseType: !543, size: 64, offset: 576)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !544)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!546 = !{!547}
!547 = !DISubrange(count: 5)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !351, file: !350, line: 113, baseType: !549, size: 320, offset: 3648)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 320, elements: !546)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!364, !365, !449}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !351, file: !350, line: 114, baseType: !554, size: 320, offset: 3968)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !449, size: 320, elements: !546)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !351, file: !350, line: 115, baseType: !528, size: 32, offset: 4288)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !351, file: !350, line: 120, baseType: !543, size: 64, offset: 4352)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !351, file: !350, line: 121, baseType: !528, size: 32, offset: 4416)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !345, file: !346, line: 437, baseType: !559, size: 9472, offset: 4480)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !560, size: 9472, elements: !408)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !346, line: 32, size: 9472, elements: !561)
!561 = !{!562, !571, !575, !576, !986, !990, !991, !992, !993, !994, !995, !996, !1016, !1020, !1025, !1031, !1050, !1054, !1058, !1059, !1063, !1068, !1069, !1074, !1078, !1082, !1086, !1090, !1094, !1095, !1096, !1097, !1098, !1102, !1103, !1108, !1109, !1110, !1111, !1112, !1117, !1124, !1128, !1132, !1136, !1140, !1144, !1145, !1149, !1150, !1154, !1158, !1159, !1160, !1161, !1235, !1240, !1241, !1245, !1246, !1250, !1251, !1255, !1260, !1261, !1265, !1269, !1273, !1274, !1275, !1276, !1277, !1278, !1283, !1284, !1288, !1292, !1296, !1297, !1298, !1302, !1312, !1313, !1317, !1318, !1322, !1323, !1327, !1328, !1332, !1333, !1337, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1351, !1352, !1353, !1354, !1355, !1356, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1371, !1375, !1376, !1377, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1391, !1392, !1393, !1397, !1401, !1402, !1406, !1407, !1408, !1409, !1435, !1439, !1440, !1441, !1442, !1443, !1447, !1448, !1449, !1450, !1451, !1455, !1459, !1460}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !560, file: !346, line: 34, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{!364, !343, !412, !566, !412, !566, !568, !570}
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !412)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !476)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !26)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !560, file: !346, line: 35, baseType: !572, size: 64, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!364, !343, !412, !458, !460, !478}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !560, file: !346, line: 36, baseType: !572, size: 64, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !560, file: !346, line: 37, baseType: !577, size: 64, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!364, !343, !580, !580}
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !38, line: 21, baseType: !581)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !583, line: 142, size: 12800, elements: !584)
!583 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!584 = !{!585, !586, !931, !932, !933, !934, !980, !981, !982, !983, !985}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !582, file: !583, line: 143, baseType: !349, size: 4480)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !582, file: !583, line: 143, baseType: !587, size: 5248, offset: 4480)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 5248, elements: !408)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !583, line: 23, size: 5248, elements: !589)
!589 = !{!590, !595, !600, !604, !608, !614, !619, !620, !621, !625, !629, !630, !631, !635, !639, !643, !644, !648, !652, !656, !657, !661, !665, !666, !670, !674, !675, !676, !680, !681, !688, !693, !694, !695, !699, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !751, !752, !753, !757, !761, !762, !763, !764, !768, !769, !770, !771, !772, !773, !774, !778, !779, !783, !890, !891, !896, !897, !901, !902, !903, !904, !905, !906, !907, !908, !912, !913, !914, !920, !924, !925, !926}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !588, file: !583, line: 24, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!364, !580, !594}
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !588, file: !583, line: 25, baseType: !596, size: 64, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{!364, !580, !412, !599}
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !588, file: !583, line: 26, baseType: !601, size: 64, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!364, !412, !594}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !588, file: !583, line: 27, baseType: !605, size: 64, offset: 192)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!364, !580, !580, !475}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !588, file: !583, line: 28, baseType: !609, size: 64, offset: 256)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{!364, !580, !412, !612, !475}
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !580)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !588, file: !583, line: 29, baseType: !615, size: 64, offset: 320)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!364, !580, !618, !466}
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !38, line: 155, baseType: !37)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !588, file: !583, line: 30, baseType: !605, size: 64, offset: 384)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !588, file: !583, line: 31, baseType: !609, size: 64, offset: 448)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !588, file: !583, line: 32, baseType: !622, size: 64, offset: 512)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!364, !580, !476}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !588, file: !583, line: 33, baseType: !626, size: 64, offset: 576)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!364, !580, !580}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !588, file: !583, line: 34, baseType: !622, size: 64, offset: 640)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !588, file: !583, line: 35, baseType: !626, size: 64, offset: 704)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !588, file: !583, line: 36, baseType: !632, size: 64, offset: 768)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DISubroutineType(types: !634)
!634 = !{!364, !580, !476, !580}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !588, file: !583, line: 37, baseType: !636, size: 64, offset: 832)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{!364, !580, !476, !476, !580}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !588, file: !583, line: 38, baseType: !640, size: 64, offset: 896)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!364, !580, !412, !568, !594}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !588, file: !583, line: 39, baseType: !632, size: 64, offset: 960)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !588, file: !583, line: 40, baseType: !645, size: 64, offset: 1024)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{!364, !580, !476, !580, !580}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !588, file: !583, line: 41, baseType: !649, size: 64, offset: 1088)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{!364, !580, !476, !476, !476, !580, !580}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !588, file: !583, line: 42, baseType: !653, size: 64, offset: 1152)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{!364, !580, !580, !580}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !588, file: !583, line: 43, baseType: !653, size: 64, offset: 1216)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !588, file: !583, line: 44, baseType: !658, size: 64, offset: 1280)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!364, !580, !412, !566, !568, !570}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !588, file: !583, line: 45, baseType: !662, size: 64, offset: 1344)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{!364, !580}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !588, file: !583, line: 46, baseType: !662, size: 64, offset: 1408)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !588, file: !583, line: 47, baseType: !667, size: 64, offset: 1472)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!364, !580, !478}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !588, file: !583, line: 48, baseType: !671, size: 64, offset: 1536)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!364, !580, !458}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !588, file: !583, line: 49, baseType: !671, size: 64, offset: 1600)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !588, file: !583, line: 50, baseType: !667, size: 64, offset: 1664)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !588, file: !583, line: 51, baseType: !677, size: 64, offset: 1728)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!364, !580, !458, !466}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !588, file: !583, line: 52, baseType: !677, size: 64, offset: 1792)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !588, file: !583, line: 53, baseType: !682, size: 64, offset: 1856)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!364, !580, !685}
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !686)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !588, file: !583, line: 54, baseType: !689, size: 64, offset: 1920)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!364, !580, !692, !528}
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !38, line: 475, baseType: !45)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !588, file: !583, line: 55, baseType: !658, size: 64, offset: 1984)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !588, file: !583, line: 56, baseType: !662, size: 64, offset: 2048)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !588, file: !583, line: 57, baseType: !696, size: 64, offset: 2112)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!364, !580, !376}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !588, file: !583, line: 58, baseType: !700, size: 64, offset: 2176)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!364, !580, !568}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !588, file: !583, line: 59, baseType: !700, size: 64, offset: 2240)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !588, file: !583, line: 60, baseType: !605, size: 64, offset: 2304)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !588, file: !583, line: 61, baseType: !605, size: 64, offset: 2368)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !588, file: !583, line: 62, baseType: !615, size: 64, offset: 2432)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !588, file: !583, line: 63, baseType: !609, size: 64, offset: 2496)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !588, file: !583, line: 64, baseType: !609, size: 64, offset: 2560)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !588, file: !583, line: 65, baseType: !696, size: 64, offset: 2624)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !588, file: !583, line: 66, baseType: !662, size: 64, offset: 2688)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !588, file: !583, line: 67, baseType: !662, size: 64, offset: 2752)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !588, file: !583, line: 68, baseType: !713, size: 64, offset: 2816)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!364, !580, !716}
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !717, line: 30, baseType: !718)
!717 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !61, line: 73, size: 5440, elements: !720)
!720 = !{!721, !722, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !719, file: !61, line: 74, baseType: !349, size: 4480)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !719, file: !61, line: 74, baseType: !723, size: 256, offset: 4480)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !724, size: 256, elements: !408)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ISLocalToGlobalMappingOps", file: !61, line: 66, size: 256, elements: !725)
!725 = !{!726, !730, !735, !736}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingsetup", scope: !724, file: !61, line: 67, baseType: !727, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{!364, !716}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingapply", scope: !724, file: !61, line: 68, baseType: !731, size: 64, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!364, !716, !734, !412, !566, !458, !458}
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISGlobalToLocalMappingMode", file: !51, line: 149, baseType: !50)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingapplyblock", scope: !724, file: !61, line: 69, baseType: !731, size: 64, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !724, file: !61, line: 70, baseType: !727, size: 64, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !719, file: !61, line: 75, baseType: !412, size: 32, offset: 4736)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !719, file: !61, line: 76, baseType: !412, size: 32, offset: 4768)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "indices", scope: !719, file: !61, line: 77, baseType: !458, size: 64, offset: 4800)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "globalstart", scope: !719, file: !61, line: 78, baseType: !412, size: 32, offset: 4864)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "globalend", scope: !719, file: !61, line: 79, baseType: !412, size: 32, offset: 4896)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "info_cached", scope: !719, file: !61, line: 80, baseType: !528, size: 32, offset: 4928)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "info_free", scope: !719, file: !61, line: 81, baseType: !528, size: 32, offset: 4960)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "info_nproc", scope: !719, file: !61, line: 82, baseType: !412, size: 32, offset: 4992)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "info_procs", scope: !719, file: !61, line: 83, baseType: !458, size: 64, offset: 5056)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "info_numprocs", scope: !719, file: !61, line: 84, baseType: !458, size: 64, offset: 5120)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "info_indices", scope: !719, file: !61, line: 85, baseType: !460, size: 64, offset: 5184)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "info_nodec", scope: !719, file: !61, line: 86, baseType: !458, size: 64, offset: 5248)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "info_nodei", scope: !719, file: !61, line: 87, baseType: !460, size: 64, offset: 5312)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !719, file: !61, line: 88, baseType: !449, size: 64, offset: 5376)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !588, file: !583, line: 69, baseType: !658, size: 64, offset: 2880)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !588, file: !583, line: 70, baseType: !662, size: 64, offset: 2944)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !588, file: !583, line: 71, baseType: !754, size: 64, offset: 3008)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{!364, !504, !580}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !588, file: !583, line: 72, baseType: !758, size: 64, offset: 3072)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!364, !580, !580, !466}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !588, file: !583, line: 73, baseType: !653, size: 64, offset: 3136)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !588, file: !583, line: 74, baseType: !653, size: 64, offset: 3200)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !588, file: !583, line: 75, baseType: !653, size: 64, offset: 3264)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !588, file: !583, line: 76, baseType: !765, size: 64, offset: 3328)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!364, !580, !412, !566, !475}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !588, file: !583, line: 77, baseType: !662, size: 64, offset: 3392)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !588, file: !583, line: 78, baseType: !662, size: 64, offset: 3456)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !588, file: !583, line: 79, baseType: !662, size: 64, offset: 3520)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !588, file: !583, line: 80, baseType: !662, size: 64, offset: 3584)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !588, file: !583, line: 81, baseType: !622, size: 64, offset: 3648)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !588, file: !583, line: 82, baseType: !662, size: 64, offset: 3712)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !588, file: !583, line: 83, baseType: !775, size: 64, offset: 3776)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{!364, !580, !412, !580, !570}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !588, file: !583, line: 84, baseType: !775, size: 64, offset: 3840)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !588, file: !583, line: 85, baseType: !780, size: 64, offset: 3904)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{!364, !580, !580, !475, !475}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !588, file: !583, line: 86, baseType: !784, size: 64, offset: 3968)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{!364, !580, !787, !594}
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !717, line: 11, baseType: !788)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !61, line: 50, size: 7104, elements: !790)
!790 = !{!791, !792, !857, !877, !878, !879, !880, !881, !882, !883, !884, !887}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !789, file: !61, line: 51, baseType: !349, size: 4480)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !789, file: !61, line: 51, baseType: !793, size: 1536, offset: 4480)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !794, size: 1536, elements: !408)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ISOps", file: !61, line: 21, size: 1536, elements: !795)
!795 = !{!796, !801, !802, !807, !811, !812, !817, !821, !822, !826, !827, !831, !832, !837, !841, !845, !849, !850, !851, !852, !853, !854, !855, !856}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "getindices", scope: !794, file: !61, line: 22, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{!364, !787, !800}
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "restoreindices", scope: !794, file: !61, line: 23, baseType: !797, size: 64, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "invertpermutation", scope: !794, file: !61, line: 24, baseType: !803, size: 64, offset: 128)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DISubroutineType(types: !805)
!805 = !{!364, !787, !412, !806}
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "sort", scope: !794, file: !61, line: 25, baseType: !808, size: 64, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DISubroutineType(types: !810)
!810 = !{!364, !787}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "sortremovedups", scope: !794, file: !61, line: 26, baseType: !808, size: 64, offset: 256)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "sorted", scope: !794, file: !61, line: 27, baseType: !813, size: 64, offset: 320)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{!364, !787, !816}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !794, file: !61, line: 28, baseType: !818, size: 64, offset: 384)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!364, !787, !806}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !794, file: !61, line: 29, baseType: !808, size: 64, offset: 448)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !794, file: !61, line: 30, baseType: !823, size: 64, offset: 512)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{!364, !787, !376}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !794, file: !61, line: 31, baseType: !823, size: 64, offset: 576)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !794, file: !61, line: 32, baseType: !828, size: 64, offset: 640)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DISubroutineType(types: !830)
!830 = !{!364, !787, !787}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "togeneral", scope: !794, file: !61, line: 33, baseType: !808, size: 64, offset: 704)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "oncomm", scope: !794, file: !61, line: 34, baseType: !833, size: 64, offset: 768)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{!364, !787, !368, !836, !806}
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscCopyMode", file: !6, line: 327, baseType: !55)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksize", scope: !794, file: !61, line: 35, baseType: !838, size: 64, offset: 832)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!364, !787, !412}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "contiguous", scope: !794, file: !61, line: 36, baseType: !842, size: 64, offset: 896)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!364, !787, !412, !412, !458, !816}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "locate", scope: !794, file: !61, line: 37, baseType: !846, size: 64, offset: 960)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!364, !787, !412, !458}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "sortedlocal", scope: !794, file: !61, line: 38, baseType: !813, size: 64, offset: 1024)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "sortedglobal", scope: !794, file: !61, line: 39, baseType: !813, size: 64, offset: 1088)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "uniquelocal", scope: !794, file: !61, line: 40, baseType: !813, size: 64, offset: 1152)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "uniqueglobal", scope: !794, file: !61, line: 41, baseType: !813, size: 64, offset: 1216)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "permlocal", scope: !794, file: !61, line: 42, baseType: !813, size: 64, offset: 1280)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "permglobal", scope: !794, file: !61, line: 43, baseType: !813, size: 64, offset: 1344)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "intervallocal", scope: !794, file: !61, line: 44, baseType: !813, size: 64, offset: 1408)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "intervalglobal", scope: !794, file: !61, line: 45, baseType: !813, size: 64, offset: 1472)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !789, file: !61, line: 52, baseType: !858, size: 64, offset: 6016)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !717, line: 60, baseType: !859)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !51, line: 240, size: 640, elements: !861)
!861 = !{!862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !860, file: !51, line: 241, baseType: !368, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !860, file: !51, line: 242, baseType: !429, size: 32, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !860, file: !51, line: 243, baseType: !412, size: 32, offset: 96)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !860, file: !51, line: 243, baseType: !412, size: 32, offset: 128)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !860, file: !51, line: 244, baseType: !412, size: 32, offset: 160)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !860, file: !51, line: 244, baseType: !412, size: 32, offset: 192)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !860, file: !51, line: 245, baseType: !458, size: 64, offset: 256)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !860, file: !51, line: 246, baseType: !528, size: 32, offset: 320)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !860, file: !51, line: 247, baseType: !412, size: 32, offset: 352)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !860, file: !51, line: 251, baseType: !412, size: 32, offset: 384)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !860, file: !51, line: 252, baseType: !716, size: 64, offset: 448)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !860, file: !51, line: 253, baseType: !528, size: 32, offset: 512)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !860, file: !51, line: 254, baseType: !412, size: 32, offset: 544)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !860, file: !51, line: 254, baseType: !412, size: 32, offset: 576)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !860, file: !51, line: 255, baseType: !412, size: 32, offset: 608)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !789, file: !61, line: 53, baseType: !412, size: 32, offset: 6080)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !789, file: !61, line: 53, baseType: !412, size: 32, offset: 6112)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !789, file: !61, line: 54, baseType: !449, size: 64, offset: 6144)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !789, file: !61, line: 55, baseType: !458, size: 64, offset: 6208)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !789, file: !61, line: 55, baseType: !458, size: 64, offset: 6272)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "local_offset", scope: !789, file: !61, line: 56, baseType: !412, size: 32, offset: 6336)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "complement", scope: !789, file: !61, line: 57, baseType: !787, size: 64, offset: 6400)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "info_permanent", scope: !789, file: !61, line: 58, baseType: !885, size: 320, offset: 6464)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 320, elements: !886)
!886 = !{!490, !547}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !789, file: !61, line: 59, baseType: !888, size: 320, offset: 6784)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !889, size: 320, elements: !886)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISInfoBool", file: !61, line: 48, baseType: !60)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !588, file: !583, line: 87, baseType: !784, size: 64, offset: 4032)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !588, file: !583, line: 88, baseType: !892, size: 64, offset: 4096)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DISubroutineType(types: !894)
!894 = !{!364, !580, !895}
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !588, file: !583, line: 89, baseType: !892, size: 64, offset: 4160)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !588, file: !583, line: 90, baseType: !898, size: 64, offset: 4224)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{!364, !580, !412, !566, !566, !580, !570}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !588, file: !583, line: 91, baseType: !898, size: 64, offset: 4288)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !588, file: !583, line: 92, baseType: !696, size: 64, offset: 4352)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !588, file: !583, line: 93, baseType: !696, size: 64, offset: 4416)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !588, file: !583, line: 94, baseType: !626, size: 64, offset: 4480)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !588, file: !583, line: 95, baseType: !626, size: 64, offset: 4544)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !588, file: !583, line: 96, baseType: !626, size: 64, offset: 4608)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !588, file: !583, line: 97, baseType: !626, size: 64, offset: 4672)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !588, file: !583, line: 98, baseType: !909, size: 64, offset: 4736)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!364, !580, !528}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !588, file: !583, line: 99, baseType: !667, size: 64, offset: 4800)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !588, file: !583, line: 100, baseType: !667, size: 64, offset: 4864)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !588, file: !583, line: 101, baseType: !915, size: 64, offset: 4928)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!364, !580, !478, !918}
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !6, line: 701, baseType: !66)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !588, file: !583, line: 102, baseType: !921, size: 64, offset: 4992)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{!364, !580, !895, !918}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !588, file: !583, line: 103, baseType: !667, size: 64, offset: 5056)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !588, file: !583, line: 104, baseType: !892, size: 64, offset: 5120)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !588, file: !583, line: 105, baseType: !927, size: 64, offset: 5184)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{!364, !412, !612, !594, !930}
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !582, file: !583, line: 144, baseType: !858, size: 64, offset: 9728)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !582, file: !583, line: 145, baseType: !449, size: 64, offset: 9792)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !582, file: !583, line: 146, baseType: !528, size: 32, offset: 9856)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !582, file: !583, line: 147, baseType: !935, size: 1344, offset: 9920)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !583, line: 140, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !583, line: 114, size: 1344, elements: !937)
!937 = !{!938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !956, !957, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !936, file: !583, line: 115, baseType: !412, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !936, file: !583, line: 116, baseType: !412, size: 32, offset: 32)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !936, file: !583, line: 117, baseType: !412, size: 32, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !936, file: !583, line: 118, baseType: !412, size: 32, offset: 96)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !936, file: !583, line: 119, baseType: !412, size: 32, offset: 128)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !936, file: !583, line: 120, baseType: !412, size: 32, offset: 160)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !936, file: !583, line: 121, baseType: !458, size: 64, offset: 192)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !936, file: !583, line: 122, baseType: !475, size: 64, offset: 256)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !936, file: !583, line: 124, baseType: !368, size: 64, offset: 320)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !936, file: !583, line: 125, baseType: !429, size: 32, offset: 384)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !936, file: !583, line: 125, baseType: !429, size: 32, offset: 416)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !936, file: !583, line: 126, baseType: !429, size: 32, offset: 448)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !936, file: !583, line: 126, baseType: !429, size: 32, offset: 480)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !936, file: !583, line: 127, baseType: !952, size: 64, offset: 512)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !369, line: 339, baseType: !954)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !369, line: 339, flags: DIFlagFwdDecl)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !936, file: !583, line: 128, baseType: !952, size: 64, offset: 576)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !936, file: !583, line: 129, baseType: !958, size: 64, offset: 640)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !369, line: 341, baseType: !960)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !369, line: 351, size: 192, elements: !961)
!961 = !{!962, !963, !964, !965, !966}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !960, file: !369, line: 354, baseType: !109, size: 32)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !960, file: !369, line: 355, baseType: !109, size: 32, offset: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !960, file: !369, line: 356, baseType: !109, size: 32, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !960, file: !369, line: 361, baseType: !109, size: 32, offset: 96)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !960, file: !369, line: 362, baseType: !524, size: 64, offset: 128)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !936, file: !583, line: 130, baseType: !412, size: 32, offset: 704)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !936, file: !583, line: 130, baseType: !412, size: 32, offset: 736)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !936, file: !583, line: 131, baseType: !475, size: 64, offset: 768)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !936, file: !583, line: 131, baseType: !475, size: 64, offset: 832)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !936, file: !583, line: 132, baseType: !458, size: 64, offset: 896)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !936, file: !583, line: 132, baseType: !458, size: 64, offset: 960)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !936, file: !583, line: 133, baseType: !412, size: 32, offset: 1024)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !936, file: !583, line: 134, baseType: !458, size: 64, offset: 1088)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !936, file: !583, line: 135, baseType: !412, size: 32, offset: 1152)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !936, file: !583, line: 136, baseType: !528, size: 32, offset: 1184)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !936, file: !583, line: 137, baseType: !528, size: 32, offset: 1216)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !936, file: !583, line: 138, baseType: !570, size: 32, offset: 1248)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !936, file: !583, line: 139, baseType: !458, size: 64, offset: 1280)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !582, file: !583, line: 147, baseType: !935, size: 1344, offset: 11264)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !582, file: !583, line: 148, baseType: !528, size: 32, offset: 12608)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !582, file: !583, line: 149, baseType: !412, size: 32, offset: 12640)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !582, file: !583, line: 150, baseType: !984, size: 32, offset: 12672)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !38, line: 472, baseType: !73)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !582, file: !583, line: 157, baseType: !439, size: 64, offset: 12736)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !560, file: !346, line: 38, baseType: !987, size: 64, offset: 256)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!364, !343, !580, !580, !580}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !560, file: !346, line: 40, baseType: !577, size: 64, offset: 320)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !560, file: !346, line: 41, baseType: !987, size: 64, offset: 384)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !560, file: !346, line: 42, baseType: !577, size: 64, offset: 448)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !560, file: !346, line: 43, baseType: !987, size: 64, offset: 512)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !560, file: !346, line: 44, baseType: !577, size: 64, offset: 576)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !560, file: !346, line: 46, baseType: !987, size: 64, offset: 640)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !560, file: !346, line: 47, baseType: !997, size: 64, offset: 704)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!364, !343, !787, !787, !1000}
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1002)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !81, line: 1239, baseType: !1003)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !81, line: 1226, size: 704, elements: !1004)
!1004 = !{!1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !1003, file: !81, line: 1227, baseType: !467, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !1003, file: !81, line: 1228, baseType: !467, size: 64, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !1003, file: !81, line: 1229, baseType: !467, size: 64, offset: 128)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !1003, file: !81, line: 1230, baseType: !467, size: 64, offset: 192)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !1003, file: !81, line: 1231, baseType: !467, size: 64, offset: 256)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !1003, file: !81, line: 1232, baseType: !467, size: 64, offset: 320)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !1003, file: !81, line: 1233, baseType: !467, size: 64, offset: 384)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !1003, file: !81, line: 1234, baseType: !467, size: 64, offset: 448)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !1003, file: !81, line: 1236, baseType: !467, size: 64, offset: 512)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !1003, file: !81, line: 1237, baseType: !467, size: 64, offset: 576)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !1003, file: !81, line: 1238, baseType: !467, size: 64, offset: 640)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !560, file: !346, line: 48, baseType: !1017, size: 64, offset: 768)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!364, !343, !787, !1000}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !560, file: !346, line: 49, baseType: !1021, size: 64, offset: 832)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!364, !343, !580, !467, !1024, !467, !412, !412, !580}
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !81, line: 1291, baseType: !80)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !560, file: !346, line: 50, baseType: !1026, size: 64, offset: 896)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!364, !343, !1029, !1030}
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !81, line: 238, baseType: !93)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !560, file: !346, line: 52, baseType: !1032, size: 64, offset: 960)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!364, !343, !1035, !1036}
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !81, line: 612, baseType: !99)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !81, line: 600, baseType: !1038)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !81, line: 592, size: 640, elements: !1039)
!1039 = !{!1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !1038, file: !81, line: 593, baseType: !414, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !1038, file: !81, line: 594, baseType: !414, size: 64, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !1038, file: !81, line: 594, baseType: !414, size: 64, offset: 128)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !1038, file: !81, line: 594, baseType: !414, size: 64, offset: 192)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !1038, file: !81, line: 595, baseType: !414, size: 64, offset: 256)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !1038, file: !81, line: 596, baseType: !414, size: 64, offset: 320)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !1038, file: !81, line: 597, baseType: !414, size: 64, offset: 384)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !1038, file: !81, line: 598, baseType: !414, size: 64, offset: 448)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !1038, file: !81, line: 598, baseType: !414, size: 64, offset: 512)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !1038, file: !81, line: 599, baseType: !414, size: 64, offset: 576)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !560, file: !346, line: 53, baseType: !1051, size: 64, offset: 1024)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!364, !343, !343, !816}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !560, file: !346, line: 54, baseType: !1055, size: 64, offset: 1088)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!364, !343, !580}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !560, file: !346, line: 55, baseType: !577, size: 64, offset: 1152)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !560, file: !346, line: 56, baseType: !1060, size: 64, offset: 1216)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!364, !343, !618, !466}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !560, file: !346, line: 58, baseType: !1064, size: 64, offset: 1280)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!364, !343, !1067}
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !81, line: 424, baseType: !104)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !560, file: !346, line: 59, baseType: !1064, size: 64, offset: 1344)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !560, file: !346, line: 60, baseType: !1070, size: 64, offset: 1408)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!364, !343, !1073, !528}
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !81, line: 469, baseType: !108)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !560, file: !346, line: 61, baseType: !1075, size: 64, offset: 1472)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!364, !343}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !560, file: !346, line: 63, baseType: !1079, size: 64, offset: 1536)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DISubroutineType(types: !1081)
!1081 = !{!364, !343, !412, !566, !476, !580, !580}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !560, file: !346, line: 64, baseType: !1083, size: 64, offset: 1600)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!364, !343, !343, !787, !787, !1000}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !560, file: !346, line: 65, baseType: !1087, size: 64, offset: 1664)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!364, !343, !343, !1000}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !560, file: !346, line: 66, baseType: !1091, size: 64, offset: 1728)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!364, !343, !343, !787, !1000}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !560, file: !346, line: 67, baseType: !1087, size: 64, offset: 1792)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !560, file: !346, line: 69, baseType: !1075, size: 64, offset: 1856)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !560, file: !346, line: 70, baseType: !1083, size: 64, offset: 1920)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !560, file: !346, line: 71, baseType: !1091, size: 64, offset: 1984)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !560, file: !346, line: 72, baseType: !1099, size: 64, offset: 2048)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!364, !343, !1030}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !560, file: !346, line: 73, baseType: !1075, size: 64, offset: 2112)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !560, file: !346, line: 75, baseType: !1104, size: 64, offset: 2176)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!364, !343, !1107, !1030}
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !81, line: 563, baseType: !139)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !560, file: !346, line: 76, baseType: !577, size: 64, offset: 2240)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !560, file: !346, line: 77, baseType: !577, size: 64, offset: 2304)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !560, file: !346, line: 78, baseType: !997, size: 64, offset: 2368)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !560, file: !346, line: 79, baseType: !1017, size: 64, offset: 2432)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !560, file: !346, line: 81, baseType: !1113, size: 64, offset: 2496)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = !DISubroutineType(types: !1115)
!1115 = !{!364, !343, !476, !343, !1116}
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !81, line: 285, baseType: !144)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !560, file: !346, line: 82, baseType: !1118, size: 64, offset: 2560)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!364, !343, !412, !1121, !1121, !1029, !1123}
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !787)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !560, file: !346, line: 83, baseType: !1125, size: 64, offset: 2624)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!364, !343, !412, !806, !412}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !560, file: !346, line: 84, baseType: !1129, size: 64, offset: 2688)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!364, !343, !412, !566, !412, !566, !475}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !560, file: !346, line: 85, baseType: !1133, size: 64, offset: 2752)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{!364, !343, !343, !1116}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !560, file: !346, line: 87, baseType: !1137, size: 64, offset: 2816)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!364, !343, !580, !458}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !560, file: !346, line: 88, baseType: !1141, size: 64, offset: 2880)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!364, !343, !476}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !560, file: !346, line: 89, baseType: !1141, size: 64, offset: 2944)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !560, file: !346, line: 90, baseType: !1146, size: 64, offset: 3008)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{!364, !343, !580, !570}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !560, file: !346, line: 91, baseType: !1079, size: 64, offset: 3072)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !560, file: !346, line: 93, baseType: !1151, size: 64, offset: 3136)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{!364, !343, !685}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !560, file: !346, line: 94, baseType: !1155, size: 64, offset: 3200)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{!364, !343, !412, !528, !528, !458, !800, !800, !816}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !560, file: !346, line: 95, baseType: !1155, size: 64, offset: 3264)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !560, file: !346, line: 96, baseType: !1155, size: 64, offset: 3328)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !560, file: !346, line: 97, baseType: !1155, size: 64, offset: 3392)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !560, file: !346, line: 99, baseType: !1162, size: 64, offset: 3456)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!364, !343, !1165, !1181}
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !717, line: 51, baseType: !1166)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !61, line: 91, size: 384, elements: !1168)
!1168 = !{!1169, !1170, !1171, !1172, !1173, !1177, !1178, !1180}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !1167, file: !61, line: 92, baseType: !412, size: 32)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1167, file: !61, line: 93, baseType: !412, size: 32, offset: 32)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "is", scope: !1167, file: !61, line: 94, baseType: !806, size: 64, offset: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1167, file: !61, line: 95, baseType: !368, size: 64, offset: 128)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !1167, file: !61, line: 96, baseType: !1174, size: 64, offset: 192)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !51, line: 215, baseType: !1176)
!1176 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1167, file: !61, line: 97, baseType: !412, size: 32, offset: 256)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1167, file: !61, line: 98, baseType: !1179, size: 32, offset: 288)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !51, line: 213, baseType: !150)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !1167, file: !61, line: 99, baseType: !528, size: 32, offset: 320)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !81, line: 1378, baseType: !1182)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !346, line: 609, size: 6208, elements: !1184)
!1184 = !{!1185, !1186, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1205, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1183, file: !346, line: 610, baseType: !349, size: 4480)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1183, file: !346, line: 610, baseType: !1187, size: 32, offset: 4480)
!1187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 32, elements: !408)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1183, file: !346, line: 611, baseType: !412, size: 32, offset: 4512)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1183, file: !346, line: 611, baseType: !412, size: 32, offset: 4544)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1183, file: !346, line: 611, baseType: !412, size: 32, offset: 4576)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1183, file: !346, line: 612, baseType: !412, size: 32, offset: 4608)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1183, file: !346, line: 613, baseType: !412, size: 32, offset: 4640)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1183, file: !346, line: 614, baseType: !458, size: 64, offset: 4672)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1183, file: !346, line: 615, baseType: !460, size: 64, offset: 4736)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !1183, file: !346, line: 616, baseType: !806, size: 64, offset: 4800)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1183, file: !346, line: 617, baseType: !458, size: 64, offset: 4864)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !1183, file: !346, line: 618, baseType: !1198, size: 64, offset: 4928)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !346, line: 602, baseType: !1200)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !346, line: 598, size: 128, elements: !1201)
!1201 = !{!1202, !1203, !1204}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1200, file: !346, line: 599, baseType: !412, size: 32)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1200, file: !346, line: 600, baseType: !412, size: 32, offset: 32)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1200, file: !346, line: 601, baseType: !475, size: 64, offset: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !1183, file: !346, line: 619, baseType: !1206, size: 64, offset: 4992)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !346, line: 607, baseType: !1208)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !346, line: 604, size: 128, elements: !1209)
!1209 = !{!1210, !1211}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1208, file: !346, line: 605, baseType: !412, size: 32)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1208, file: !346, line: 606, baseType: !475, size: 64, offset: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !1183, file: !346, line: 620, baseType: !475, size: 64, offset: 5056)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !1183, file: !346, line: 621, baseType: !467, size: 64, offset: 5120)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !1183, file: !346, line: 622, baseType: !467, size: 64, offset: 5184)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !1183, file: !346, line: 623, baseType: !580, size: 64, offset: 5248)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !1183, file: !346, line: 623, baseType: !580, size: 64, offset: 5312)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !1183, file: !346, line: 623, baseType: !580, size: 64, offset: 5376)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !1183, file: !346, line: 624, baseType: !528, size: 32, offset: 5440)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1183, file: !346, line: 625, baseType: !1220, size: 64, offset: 5504)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DISubroutineType(types: !1222)
!1222 = !{!364}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !1183, file: !346, line: 626, baseType: !449, size: 64, offset: 5568)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !1183, file: !346, line: 627, baseType: !580, size: 64, offset: 5632)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1183, file: !346, line: 628, baseType: !412, size: 32, offset: 5696)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !1183, file: !346, line: 629, baseType: !389, size: 64, offset: 5760)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1183, file: !346, line: 630, baseType: !1179, size: 32, offset: 5824)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1183, file: !346, line: 631, baseType: !412, size: 32, offset: 5856)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !1183, file: !346, line: 631, baseType: !412, size: 32, offset: 5888)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1183, file: !346, line: 632, baseType: !528, size: 32, offset: 5920)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !1183, file: !346, line: 633, baseType: !528, size: 32, offset: 5952)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !1183, file: !346, line: 634, baseType: !400, size: 64, offset: 6016)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !1183, file: !346, line: 634, baseType: !449, size: 64, offset: 6080)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !1183, file: !346, line: 635, baseType: !420, size: 64, offset: 6144)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !560, file: !346, line: 100, baseType: !1236, size: 64, offset: 3520)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1237 = !DISubroutineType(types: !1238)
!1238 = !{!364, !343, !412, !412, !1174, !1239}
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !560, file: !346, line: 101, baseType: !1075, size: 64, offset: 3584)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !560, file: !346, line: 102, baseType: !1242, size: 64, offset: 3648)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64)
!1243 = !DISubroutineType(types: !1244)
!1244 = !{!364, !343, !787, !787, !1030}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !560, file: !346, line: 103, baseType: !563, size: 64, offset: 3712)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !560, file: !346, line: 105, baseType: !1247, size: 64, offset: 3776)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64)
!1248 = !DISubroutineType(types: !1249)
!1249 = !{!364, !343, !787, !787, !1029, !1030}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !560, file: !346, line: 106, baseType: !1075, size: 64, offset: 3840)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !560, file: !346, line: 107, baseType: !1252, size: 64, offset: 3904)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64)
!1253 = !DISubroutineType(types: !1254)
!1254 = !{!364, !343, !376}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !560, file: !346, line: 108, baseType: !1256, size: 64, offset: 3968)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64)
!1257 = !DISubroutineType(types: !1258)
!1258 = !{!364, !343, !1259, !1029, !1030}
!1259 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !81, line: 25, baseType: !389)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !560, file: !346, line: 109, baseType: !1220, size: 64, offset: 4032)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !560, file: !346, line: 111, baseType: !1262, size: 64, offset: 4096)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64)
!1263 = !DISubroutineType(types: !1264)
!1264 = !{!364, !343, !343, !343, !467, !343}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !560, file: !346, line: 112, baseType: !1266, size: 64, offset: 4160)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!364, !343, !343, !343, !343}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !560, file: !346, line: 113, baseType: !1270, size: 64, offset: 4224)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64)
!1271 = !DISubroutineType(types: !1272)
!1272 = !{!364, !343, !716, !716}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !560, file: !346, line: 114, baseType: !563, size: 64, offset: 4288)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !560, file: !346, line: 115, baseType: !1079, size: 64, offset: 4352)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !560, file: !346, line: 117, baseType: !1137, size: 64, offset: 4416)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !560, file: !346, line: 118, baseType: !1137, size: 64, offset: 4480)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !560, file: !346, line: 119, baseType: !1256, size: 64, offset: 4544)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !560, file: !346, line: 120, baseType: !1279, size: 64, offset: 4608)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64)
!1280 = !DISubroutineType(types: !1281)
!1281 = !{!364, !343, !1282, !816}
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !81, line: 1675, baseType: !154)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !560, file: !346, line: 121, baseType: !1220, size: 64, offset: 4672)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !560, file: !346, line: 123, baseType: !1285, size: 64, offset: 4736)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{!364, !343, !412, !449}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !560, file: !346, line: 124, baseType: !1289, size: 64, offset: 4800)
