; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/shell/taoshell.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/shell/taoshell.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque

!31 = !DIEnumerator(name: "TAO_CONVERGED_STEPTOL", value: 6)
!32 = !DIEnumerator(name: "TAO_CONVERGED_MINF", value: 7)
!33 = !DIEnumerator(name: "TAO_CONVERGED_USER", value: 8)
!34 = !DIEnumerator(name: "TAO_DIVERGED_MAXITS", value: -2)
!35 = !DIEnumerator(name: "TAO_DIVERGED_NAN", value: -4)
!36 = !DIEnumerator(name: "TAO_DIVERGED_MAXFCN", value: -5)
!37 = !DIEnumerator(name: "TAO_DIVERGED_LS_FAILURE", value: -6)
!38 = !DIEnumerator(name: "TAO_DIVERGED_TR_REDUCTION", value: -7)
!39 = !DIEnumerator(name: "TAO_DIVERGED_USER", value: -8)
!40 = !DIEnumerator(name: "TAO_CONTINUE_ITERATING", value: 0)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 26, baseType: !5, size: 32, elements: !42)
!42 = !{!43, !44, !45}
!43 = !DIEnumerator(name: "TAO_SUBSET_SUBVEC", value: 0, isUnsigned: true)
!44 = !DIEnumerator(name: "TAO_SUBSET_MASK", value: 1, isUnsigned: true)
!45 = !DIEnumerator(name: "TAO_SUBSET_MATRIXFREE", value: 2, isUnsigned: true)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 663, baseType: !5, size: 32, elements: !48)
!47 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!48 = !{!49, !50, !51}
!49 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!50 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!51 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !53)
!53 = !{!54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71}
!54 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!55 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!56 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!57 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!60 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!61 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!62 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!63 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!64 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!65 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!66 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!67 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!68 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!69 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!70 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!72 = !{!73, !107, !188, !104, !128, !263}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tao_Shell", file: !75, line: 3, baseType: !76)
!75 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/tao/shell/taoshell.c", directory: "/home/users/ndemeye/xSDK")
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_TaoShell", file: !75, line: 5, size: 128, elements: !77)
!77 = !{!78, !520}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !76, file: !75, line: 7, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!82, !83}
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tao", file: !25, line: 118, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Tao", file: !86, line: 45, size: 14656, elements: !87)
!86 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/taoimpl.h", directory: "/home/users/ndemeye/xSDK")
!87 = !{!88, !297, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !387, !393, !395, !396, !397, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !472, !473, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !512, !513, !514, !515, !516, !517, !518, !519}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !85, file: !86, line: 46, baseType: !89, size: 4480)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !90, line: 122, baseType: !91)
!90 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !90, line: 73, size: 4480, elements: !92)
!92 = !{!93, !95, !149, !150, !152, !155, !156, !157, !158, !166, !167, !169, !173, !177, !179, !180, !181, !182, !183, !184, !185, !186, !187, !189, !191, !192, !193, !195, !196, !198, !200, !201, !202, !203, !204, !207, !209, !210, !211, !212, !213, !216, !218, !219, !220, !230, !232, !233, !237, !238, !287, !292, !294, !295, !296}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !91, file: !90, line: 74, baseType: !94, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !91, file: !90, line: 75, baseType: !96, size: 448, offset: 64)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 448, elements: !147)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !90, line: 53, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !90, line: 45, size: 448, elements: !99)
!99 = !{!100, !111, !119, !124, !131, !135, !142}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !98, file: !90, line: 46, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!82, !104, !106}
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !108, line: 330, baseType: !109)
!108 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !108, line: 330, flags: DIFlagFwdDecl)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !98, file: !90, line: 47, baseType: !112, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!82, !104, !115}
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !116, line: 16, baseType: !117)
!116 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !116, line: 16, flags: DIFlagFwdDecl)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !98, file: !90, line: 48, baseType: !120, size: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!82, !123}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !98, file: !90, line: 49, baseType: !125, size: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!82, !104, !128, !104}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!130 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !98, file: !90, line: 50, baseType: !132, size: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!82, !104, !128, !123}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !98, file: !90, line: 51, baseType: !136, size: 64, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!82, !104, !128, !139}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{null}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !98, file: !90, line: 52, baseType: !143, size: 64, offset: 384)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!82, !104, !128, !146}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!147 = !{!148}
!148 = !DISubrange(count: 1)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !91, file: !90, line: 76, baseType: !107, size: 64, offset: 512)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !91, file: !90, line: 77, baseType: !151, size: 32, offset: 576)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !91, file: !90, line: 78, baseType: !153, size: 64, offset: 640)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !154)
!154 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !91, file: !90, line: 78, baseType: !153, size: 64, offset: 704)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !91, file: !90, line: 78, baseType: !153, size: 64, offset: 768)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !91, file: !90, line: 78, baseType: !153, size: 64, offset: 832)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !91, file: !90, line: 79, baseType: !159, size: 64, offset: 896)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !162, line: 27, baseType: !163)
!162 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !164, line: 43, baseType: !165)
!164 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!165 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !91, file: !90, line: 80, baseType: !151, size: 32, offset: 960)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !91, file: !90, line: 81, baseType: !168, size: 32, offset: 992)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !91, file: !90, line: 82, baseType: !170, size: 64, offset: 1024)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !91, file: !90, line: 83, baseType: !174, size: 64, offset: 1088)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !91, file: !90, line: 84, baseType: !178, size: 64, offset: 1152)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !91, file: !90, line: 85, baseType: !178, size: 64, offset: 1216)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !91, file: !90, line: 86, baseType: !178, size: 64, offset: 1280)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !91, file: !90, line: 87, baseType: !178, size: 64, offset: 1344)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !91, file: !90, line: 88, baseType: !104, size: 64, offset: 1408)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !91, file: !90, line: 89, baseType: !159, size: 64, offset: 1472)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !91, file: !90, line: 90, baseType: !178, size: 64, offset: 1536)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !91, file: !90, line: 91, baseType: !178, size: 64, offset: 1600)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !91, file: !90, line: 92, baseType: !151, size: 32, offset: 1664)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !91, file: !90, line: 93, baseType: !188, size: 64, offset: 1728)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !91, file: !90, line: 94, baseType: !190, size: 64, offset: 1792)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !160)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !91, file: !90, line: 95, baseType: !151, size: 32, offset: 1856)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !91, file: !90, line: 95, baseType: !151, size: 32, offset: 1888)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !91, file: !90, line: 96, baseType: !194, size: 64, offset: 1920)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !91, file: !90, line: 96, baseType: !194, size: 64, offset: 1984)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !91, file: !90, line: 97, baseType: !197, size: 64, offset: 2048)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !91, file: !90, line: 97, baseType: !199, size: 64, offset: 2112)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !91, file: !90, line: 98, baseType: !151, size: 32, offset: 2176)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !91, file: !90, line: 98, baseType: !151, size: 32, offset: 2208)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !91, file: !90, line: 99, baseType: !194, size: 64, offset: 2240)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !91, file: !90, line: 99, baseType: !194, size: 64, offset: 2304)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !91, file: !90, line: 100, baseType: !205, size: 64, offset: 2368)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !154)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !91, file: !90, line: 100, baseType: !208, size: 64, offset: 2432)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !91, file: !90, line: 101, baseType: !151, size: 32, offset: 2496)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !91, file: !90, line: 101, baseType: !151, size: 32, offset: 2528)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !91, file: !90, line: 102, baseType: !194, size: 64, offset: 2560)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !91, file: !90, line: 102, baseType: !194, size: 64, offset: 2624)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !91, file: !90, line: 103, baseType: !214, size: 64, offset: 2688)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !206)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !91, file: !90, line: 103, baseType: !217, size: 64, offset: 2752)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !91, file: !90, line: 104, baseType: !146, size: 64, offset: 2816)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !91, file: !90, line: 105, baseType: !151, size: 32, offset: 2880)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !91, file: !90, line: 106, baseType: !221, size: 128, offset: 2944)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 128, elements: !228)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !90, line: 64, baseType: !224)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !90, line: 61, size: 128, elements: !225)
!225 = !{!226, !227}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !224, file: !90, line: 62, baseType: !139, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !224, file: !90, line: 63, baseType: !188, size: 64, offset: 64)
!228 = !{!229}
!229 = !DISubrange(count: 2)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !91, file: !90, line: 107, baseType: !231, size: 64, offset: 3072)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 64, elements: !228)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !91, file: !90, line: 108, baseType: !188, size: 64, offset: 3136)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !91, file: !90, line: 109, baseType: !234, size: 64, offset: 3200)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!82, !188}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !91, file: !90, line: 111, baseType: !151, size: 32, offset: 3264)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !91, file: !90, line: 112, baseType: !239, size: 320, offset: 3328)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 320, elements: !285)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!82, !243, !104, !188}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !246)
!246 = !{!247, !248, !273, !274, !275, !276, !277, !278, !279, !280, !281}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !245, file: !10, line: 100, baseType: !151, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !245, file: !10, line: 101, baseType: !249, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !252)
!252 = !{!253, !254, !255, !256, !257, !260, !261, !262, !266, !268, !270, !271, !272}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !251, file: !10, line: 84, baseType: !178, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !251, file: !10, line: 85, baseType: !178, size: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !251, file: !10, line: 86, baseType: !188, size: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !251, file: !10, line: 87, baseType: !170, size: 64, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !251, file: !10, line: 88, baseType: !258, size: 64, offset: 256)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !251, file: !10, line: 89, baseType: !130, size: 8, offset: 320)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !251, file: !10, line: 90, baseType: !178, size: 64, offset: 384)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !251, file: !10, line: 91, baseType: !263, size: 64, offset: 448)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !264, line: 46, baseType: !265)
!264 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!265 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !251, file: !10, line: 92, baseType: !267, size: 32, offset: 512)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !251, file: !10, line: 93, baseType: !269, size: 32, offset: 544)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !251, file: !10, line: 94, baseType: !249, size: 64, offset: 576)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !251, file: !10, line: 95, baseType: !178, size: 64, offset: 640)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !251, file: !10, line: 96, baseType: !188, size: 64, offset: 704)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !245, file: !10, line: 102, baseType: !178, size: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !245, file: !10, line: 102, baseType: !178, size: 64, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !245, file: !10, line: 103, baseType: !178, size: 64, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !245, file: !10, line: 104, baseType: !107, size: 64, offset: 320)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !245, file: !10, line: 105, baseType: !267, size: 32, offset: 384)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !245, file: !10, line: 105, baseType: !267, size: 32, offset: 416)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !245, file: !10, line: 105, baseType: !267, size: 32, offset: 448)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !245, file: !10, line: 106, baseType: !104, size: 64, offset: 512)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !245, file: !10, line: 107, baseType: !282, size: 64, offset: 576)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!285 = !{!286}
!286 = !DISubrange(count: 5)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !91, file: !90, line: 113, baseType: !288, size: 320, offset: 3648)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 320, elements: !285)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!82, !104, !188}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !91, file: !90, line: 114, baseType: !293, size: 320, offset: 3968)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 320, elements: !285)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !91, file: !90, line: 115, baseType: !267, size: 32, offset: 4288)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !91, file: !90, line: 120, baseType: !282, size: 64, offset: 4352)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !91, file: !90, line: 121, baseType: !267, size: 32, offset: 4416)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !85, file: !86, line: 46, baseType: !298, size: 1536, offset: 4480)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 1536, elements: !147)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TaoOps", file: !86, line: 13, size: 1536, elements: !300)
!300 = !{!301, !309, !313, !317, !325, !326, !327, !328, !329, !330, !331, !335, !339, !340, !341, !342, !346, !350, !351, !355, !356, !357, !361, !365}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !299, file: !86, line: 15, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!82, !83, !305, !205, !188}
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !306, line: 21, baseType: !307)
!306 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !306, line: 21, flags: DIFlagFwdDecl)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgradient", scope: !299, file: !86, line: 16, baseType: !310, size: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!82, !83, !305, !205, !305, !188}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "computegradient", scope: !299, file: !86, line: 17, baseType: !314, size: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!82, !83, !305, !305, !188}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "computehessian", scope: !299, file: !86, line: 18, baseType: !318, size: 64, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!82, !83, !305, !321, !321, !188}
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !322, line: 16, baseType: !323)
!322 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !322, line: 16, flags: DIFlagFwdDecl)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidual", scope: !299, file: !86, line: 19, baseType: !314, size: 64, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidualjacobian", scope: !299, file: !86, line: 20, baseType: !318, size: 64, offset: 320)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "computeconstraints", scope: !299, file: !86, line: 21, baseType: !314, size: 64, offset: 384)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "computeinequalityconstraints", scope: !299, file: !86, line: 22, baseType: !314, size: 64, offset: 448)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "computeequalityconstraints", scope: !299, file: !86, line: 23, baseType: !314, size: 64, offset: 512)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobian", scope: !299, file: !86, line: 24, baseType: !318, size: 64, offset: 576)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianstate", scope: !299, file: !86, line: 25, baseType: !332, size: 64, offset: 640)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!82, !83, !305, !321, !321, !321, !188}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobiandesign", scope: !299, file: !86, line: 26, baseType: !336, size: 64, offset: 704)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!82, !83, !305, !321, !188}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianinequality", scope: !299, file: !86, line: 27, baseType: !318, size: 64, offset: 768)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianequality", scope: !299, file: !86, line: 28, baseType: !318, size: 64, offset: 832)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "computebounds", scope: !299, file: !86, line: 29, baseType: !314, size: 64, offset: 896)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !299, file: !86, line: 30, baseType: !343, size: 64, offset: 960)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!82, !83, !151, !188}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "convergencetest", scope: !299, file: !86, line: 31, baseType: !347, size: 64, offset: 1024)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!82, !83, !188}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "convergencedestroy", scope: !299, file: !86, line: 32, baseType: !234, size: 64, offset: 1088)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "computedual", scope: !299, file: !86, line: 35, baseType: !352, size: 64, offset: 1152)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!82, !83, !305, !305}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !299, file: !86, line: 36, baseType: !79, size: 64, offset: 1216)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !299, file: !86, line: 37, baseType: !79, size: 64, offset: 1280)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !299, file: !86, line: 38, baseType: !358, size: 64, offset: 1344)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!82, !83, !115}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !299, file: !86, line: 39, baseType: !362, size: 64, offset: 1408)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!82, !243, !83}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !299, file: !86, line: 40, baseType: !79, size: 64, offset: 1472)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !85, file: !86, line: 47, baseType: !188, size: 64, offset: 6016)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "user_objP", scope: !85, file: !86, line: 48, baseType: !188, size: 64, offset: 6080)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "user_objgradP", scope: !85, file: !86, line: 49, baseType: !188, size: 64, offset: 6144)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "user_gradP", scope: !85, file: !86, line: 50, baseType: !188, size: 64, offset: 6208)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "user_hessP", scope: !85, file: !86, line: 51, baseType: !188, size: 64, offset: 6272)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsresP", scope: !85, file: !86, line: 52, baseType: !188, size: 64, offset: 6336)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsjacP", scope: !85, file: !86, line: 53, baseType: !188, size: 64, offset: 6400)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "user_conP", scope: !85, file: !86, line: 54, baseType: !188, size: 64, offset: 6464)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_equalityP", scope: !85, file: !86, line: 55, baseType: !188, size: 64, offset: 6528)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_inequalityP", scope: !85, file: !86, line: 56, baseType: !188, size: 64, offset: 6592)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "user_jacP", scope: !85, file: !86, line: 57, baseType: !188, size: 64, offset: 6656)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_equalityP", scope: !85, file: !86, line: 58, baseType: !188, size: 64, offset: 6720)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_inequalityP", scope: !85, file: !86, line: 59, baseType: !188, size: 64, offset: 6784)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_stateP", scope: !85, file: !86, line: 60, baseType: !188, size: 64, offset: 6848)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_designP", scope: !85, file: !86, line: 61, baseType: !188, size: 64, offset: 6912)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "user_boundsP", scope: !85, file: !86, line: 62, baseType: !188, size: 64, offset: 6976)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "user_update", scope: !85, file: !86, line: 63, baseType: !188, size: 64, offset: 7040)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !85, file: !86, line: 65, baseType: !384, size: 640, offset: 7104)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 640, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 10)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !85, file: !86, line: 66, baseType: !388, size: 640, offset: 7744)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 640, elements: !385)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!82, !392}
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !85, file: !86, line: 67, baseType: !394, size: 640, offset: 8384)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 640, elements: !385)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !85, file: !86, line: 68, baseType: !151, size: 32, offset: 9024)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !85, file: !86, line: 69, baseType: !188, size: 64, offset: 9088)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !85, file: !86, line: 70, baseType: !398, size: 32, offset: 9152)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoConvergedReason", file: !25, line: 196, baseType: !24)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !85, file: !86, line: 72, baseType: !267, size: 32, offset: 9184)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !85, file: !86, line: 73, baseType: !188, size: 64, offset: 9216)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "solution", scope: !85, file: !86, line: 75, baseType: !305, size: 64, offset: 9280)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !85, file: !86, line: 76, baseType: !305, size: 64, offset: 9344)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "stepdirection", scope: !85, file: !86, line: 77, baseType: !305, size: 64, offset: 9408)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "XL", scope: !85, file: !86, line: 78, baseType: !305, size: 64, offset: 9472)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "XU", scope: !85, file: !86, line: 79, baseType: !305, size: 64, offset: 9536)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "IL", scope: !85, file: !86, line: 80, baseType: !305, size: 64, offset: 9600)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "IU", scope: !85, file: !86, line: 81, baseType: !305, size: 64, offset: 9664)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "DI", scope: !85, file: !86, line: 82, baseType: !305, size: 64, offset: 9728)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "DE", scope: !85, file: !86, line: 83, baseType: !305, size: 64, offset: 9792)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "hessian", scope: !85, file: !86, line: 84, baseType: !321, size: 64, offset: 9856)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "hessian_pre", scope: !85, file: !86, line: 85, baseType: !321, size: 64, offset: 9920)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm", scope: !85, file: !86, line: 86, baseType: !321, size: 64, offset: 9984)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm_tmp", scope: !85, file: !86, line: 87, baseType: !305, size: 64, offset: 10048)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ls_res", scope: !85, file: !86, line: 88, baseType: !305, size: 64, offset: 10112)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac", scope: !85, file: !86, line: 89, baseType: !321, size: 64, offset: 10176)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac_pre", scope: !85, file: !86, line: 90, baseType: !321, size: 64, offset: 10240)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_v", scope: !85, file: !86, line: 91, baseType: !305, size: 64, offset: 10304)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_n", scope: !85, file: !86, line: 92, baseType: !151, size: 32, offset: 10368)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_rows", scope: !85, file: !86, line: 93, baseType: !197, size: 64, offset: 10432)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_cols", scope: !85, file: !86, line: 94, baseType: !197, size: 64, offset: 10496)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_w", scope: !85, file: !86, line: 95, baseType: !205, size: 64, offset: 10560)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !85, file: !86, line: 96, baseType: !305, size: 64, offset: 10624)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_equality", scope: !85, file: !86, line: 97, baseType: !305, size: 64, offset: 10688)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_inequality", scope: !85, file: !86, line: 98, baseType: !305, size: 64, offset: 10752)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !85, file: !86, line: 99, baseType: !321, size: 64, offset: 10816)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !85, file: !86, line: 100, baseType: !321, size: 64, offset: 10880)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality", scope: !85, file: !86, line: 101, baseType: !321, size: 64, offset: 10944)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality_pre", scope: !85, file: !86, line: 102, baseType: !321, size: 64, offset: 11008)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality", scope: !85, file: !86, line: 103, baseType: !321, size: 64, offset: 11072)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality_pre", scope: !85, file: !86, line: 104, baseType: !321, size: 64, offset: 11136)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state", scope: !85, file: !86, line: 105, baseType: !321, size: 64, offset: 11200)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_inv", scope: !85, file: !86, line: 106, baseType: !321, size: 64, offset: 11264)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design", scope: !85, file: !86, line: 107, baseType: !321, size: 64, offset: 11328)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_pre", scope: !85, file: !86, line: 108, baseType: !321, size: 64, offset: 11392)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design_pre", scope: !85, file: !86, line: 109, baseType: !321, size: 64, offset: 11456)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "state_is", scope: !85, file: !86, line: 110, baseType: !437, size: 64, offset: 11520)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !438, line: 11, baseType: !439)
!438 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !438, line: 11, flags: DIFlagFwdDecl)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "design_is", scope: !85, file: !86, line: 111, baseType: !437, size: 64, offset: 11584)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !85, file: !86, line: 112, baseType: !206, size: 64, offset: 11648)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !85, file: !86, line: 113, baseType: !206, size: 64, offset: 11712)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "gnorm0", scope: !85, file: !86, line: 114, baseType: !206, size: 64, offset: 11776)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm", scope: !85, file: !86, line: 115, baseType: !206, size: 64, offset: 11840)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm0", scope: !85, file: !86, line: 116, baseType: !206, size: 64, offset: 11904)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !85, file: !86, line: 117, baseType: !206, size: 64, offset: 11968)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !85, file: !86, line: 119, baseType: !151, size: 32, offset: 12032)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !85, file: !86, line: 120, baseType: !151, size: 32, offset: 12064)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "max_constraints", scope: !85, file: !86, line: 121, baseType: !151, size: 32, offset: 12096)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !85, file: !86, line: 122, baseType: !151, size: 32, offset: 12128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ngrads", scope: !85, file: !86, line: 123, baseType: !151, size: 32, offset: 12160)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncgrads", scope: !85, file: !86, line: 124, baseType: !151, size: 32, offset: 12192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "nhess", scope: !85, file: !86, line: 125, baseType: !151, size: 32, offset: 12224)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !85, file: !86, line: 126, baseType: !151, size: 32, offset: 12256)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ntotalits", scope: !85, file: !86, line: 127, baseType: !151, size: 32, offset: 12288)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "nconstraints", scope: !85, file: !86, line: 128, baseType: !151, size: 32, offset: 12320)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "niconstraints", scope: !85, file: !86, line: 129, baseType: !151, size: 32, offset: 12352)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "neconstraints", scope: !85, file: !86, line: 130, baseType: !151, size: 32, offset: 12384)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "njac", scope: !85, file: !86, line: 131, baseType: !151, size: 32, offset: 12416)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "njac_equality", scope: !85, file: !86, line: 132, baseType: !151, size: 32, offset: 12448)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "njac_inequality", scope: !85, file: !86, line: 133, baseType: !151, size: 32, offset: 12480)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "njac_state", scope: !85, file: !86, line: 134, baseType: !151, size: 32, offset: 12512)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "njac_design", scope: !85, file: !86, line: 135, baseType: !151, size: 32, offset: 12544)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_its", scope: !85, file: !86, line: 137, baseType: !151, size: 32, offset: 12576)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_tot_its", scope: !85, file: !86, line: 138, baseType: !151, size: 32, offset: 12608)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !85, file: !86, line: 140, baseType: !468, size: 64, offset: 12672)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearch", file: !469, line: 5, baseType: !470)
!469 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctaolinesearch.h", directory: "/home/users/ndemeye/xSDK")
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TaoLineSearch", file: !469, line: 5, flags: DIFlagFwdDecl)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "lsflag", scope: !85, file: !86, line: 141, baseType: !267, size: 32, offset: 12736)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !85, file: !86, line: 142, baseType: !474, size: 64, offset: 12800)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !475, line: 22, baseType: !476)
!475 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !475, line: 22, flags: DIFlagFwdDecl)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "trust0", scope: !85, file: !86, line: 143, baseType: !206, size: 64, offset: 12864)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !85, file: !86, line: 144, baseType: !206, size: 64, offset: 12928)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "gatol", scope: !85, file: !86, line: 146, baseType: !206, size: 64, offset: 12992)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "grtol", scope: !85, file: !86, line: 147, baseType: !206, size: 64, offset: 13056)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "gttol", scope: !85, file: !86, line: 148, baseType: !206, size: 64, offset: 13120)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "catol", scope: !85, file: !86, line: 149, baseType: !206, size: 64, offset: 13184)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "crtol", scope: !85, file: !86, line: 150, baseType: !206, size: 64, offset: 13248)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "steptol", scope: !85, file: !86, line: 151, baseType: !206, size: 64, offset: 13312)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "fmin", scope: !85, file: !86, line: 152, baseType: !206, size: 64, offset: 13376)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs_changed", scope: !85, file: !86, line: 153, baseType: !267, size: 32, offset: 13440)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "max_it_changed", scope: !85, file: !86, line: 154, baseType: !267, size: 32, offset: 13472)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "gatol_changed", scope: !85, file: !86, line: 155, baseType: !267, size: 32, offset: 13504)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "grtol_changed", scope: !85, file: !86, line: 156, baseType: !267, size: 32, offset: 13536)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "gttol_changed", scope: !85, file: !86, line: 157, baseType: !267, size: 32, offset: 13568)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "fmin_changed", scope: !85, file: !86, line: 158, baseType: !267, size: 32, offset: 13600)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "catol_changed", scope: !85, file: !86, line: 159, baseType: !267, size: 32, offset: 13632)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "crtol_changed", scope: !85, file: !86, line: 160, baseType: !267, size: 32, offset: 13664)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "steptol_changed", scope: !85, file: !86, line: 161, baseType: !267, size: 32, offset: 13696)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "trust0_changed", scope: !85, file: !86, line: 162, baseType: !267, size: 32, offset: 13728)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "printreason", scope: !85, file: !86, line: 163, baseType: !267, size: 32, offset: 13760)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "viewsolution", scope: !85, file: !86, line: 164, baseType: !267, size: 32, offset: 13792)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "viewgradient", scope: !85, file: !86, line: 165, baseType: !267, size: 32, offset: 13824)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "viewconstraints", scope: !85, file: !86, line: 166, baseType: !267, size: 32, offset: 13856)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "viewhessian", scope: !85, file: !86, line: 167, baseType: !267, size: 32, offset: 13888)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "viewjacobian", scope: !85, file: !86, line: 168, baseType: !267, size: 32, offset: 13920)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "bounded", scope: !85, file: !86, line: 169, baseType: !267, size: 32, offset: 13952)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "constrained", scope: !85, file: !86, line: 170, baseType: !267, size: 32, offset: 13984)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "eq_constrained", scope: !85, file: !86, line: 171, baseType: !267, size: 32, offset: 14016)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_constrained", scope: !85, file: !86, line: 172, baseType: !267, size: 32, offset: 14048)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_doublesided", scope: !85, file: !86, line: 173, baseType: !267, size: 32, offset: 14080)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "header_printed", scope: !85, file: !86, line: 174, baseType: !267, size: 32, offset: 14112)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "recycle", scope: !85, file: !86, line: 175, baseType: !267, size: 32, offset: 14144)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "subset_type", scope: !85, file: !86, line: 177, baseType: !511, size: 32, offset: 14176)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoSubsetType", file: !25, line: 26, baseType: !41)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "hist_max", scope: !85, file: !86, line: 178, baseType: !151, size: 32, offset: 14208)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "hist_obj", scope: !85, file: !86, line: 179, baseType: !205, size: 64, offset: 14272)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "hist_resid", scope: !85, file: !86, line: 180, baseType: !205, size: 64, offset: 14336)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "hist_cnorm", scope: !85, file: !86, line: 181, baseType: !205, size: 64, offset: 14400)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "hist_lits", scope: !85, file: !86, line: 182, baseType: !197, size: 64, offset: 14464)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "hist_len", scope: !85, file: !86, line: 183, baseType: !151, size: 32, offset: 14528)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "hist_reset", scope: !85, file: !86, line: 184, baseType: !267, size: 32, offset: 14560)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "hist_malloc", scope: !85, file: !86, line: 185, baseType: !267, size: 32, offset: 14592)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !76, file: !75, line: 8, baseType: !188, size: 64, offset: 64)
!521 = !{i32 7, !"Dwarf Version", i32 4}
!522 = !{i32 2, !"Debug Info Version", i32 3}
!523 = !{i32 1, !"wchar_size", i32 4}
!524 = !{i32 7, !"PIC Level", i32 2}
!525 = !{i32 7, !"uwtable", i32 1}
!526 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!527 = distinct !DISubprogram(name: "TaoShellSetSolve", scope: !75, file: !75, line: 34, type: !528, scopeLine: 35, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !530)
!528 = !DISubroutineType(types: !529)
!529 = !{!82, !83, !79}
!530 = !{!531, !532, !533}
!531 = !DILocalVariable(name: "tao", arg: 1, scope: !527, file: !75, line: 34, type: !83)
!532 = !DILocalVariable(name: "solve", arg: 2, scope: !527, file: !75, line: 34, type: !79)
!533 = !DILocalVariable(name: "shell", scope: !527, file: !75, line: 36, type: !73)
!534 = !DILocation(line: 0, scope: !527)
!535 = !DILocation(line: 36, column: 58, scope: !527)
!536 = !{!537, !542, i64 1152}
!537 = !{!"_p_Tao", !538, i64 0, !540, i64 560, !542, i64 752, !542, i64 760, !542, i64 768, !542, i64 776, !542, i64 784, !542, i64 792, !542, i64 800, !542, i64 808, !542, i64 816, !542, i64 824, !542, i64 832, !542, i64 840, !542, i64 848, !542, i64 856, !542, i64 864, !542, i64 872, !542, i64 880, !540, i64 888, !540, i64 968, !540, i64 1048, !539, i64 1128, !542, i64 1136, !540, i64 1144, !540, i64 1148, !542, i64 1152, !542, i64 1160, !542, i64 1168, !542, i64 1176, !542, i64 1184, !542, i64 1192, !542, i64 1200, !542, i64 1208, !542, i64 1216, !542, i64 1224, !542, i64 1232, !542, i64 1240, !542, i64 1248, !542, i64 1256, !542, i64 1264, !542, i64 1272, !542, i64 1280, !542, i64 1288, !539, i64 1296, !542, i64 1304, !542, i64 1312, !542, i64 1320, !542, i64 1328, !542, i64 1336, !542, i64 1344, !542, i64 1352, !542, i64 1360, !542, i64 1368, !542, i64 1376, !542, i64 1384, !542, i64 1392, !542, i64 1400, !542, i64 1408, !542, i64 1416, !542, i64 1424, !542, i64 1432, !542, i64 1440, !542, i64 1448, !543, i64 1456, !543, i64 1464, !543, i64 1472, !543, i64 1480, !543, i64 1488, !543, i64 1496, !539, i64 1504, !539, i64 1508, !539, i64 1512, !539, i64 1516, !539, i64 1520, !539, i64 1524, !539, i64 1528, !539, i64 1532, !539, i64 1536, !539, i64 1540, !539, i64 1544, !539, i64 1548, !539, i64 1552, !539, i64 1556, !539, i64 1560, !539, i64 1564, !539, i64 1568, !539, i64 1572, !539, i64 1576, !542, i64 1584, !540, i64 1592, !542, i64 1600, !543, i64 1608, !543, i64 1616, !543, i64 1624, !543, i64 1632, !543, i64 1640, !543, i64 1648, !543, i64 1656, !543, i64 1664, !543, i64 1672, !540, i64 1680, !540, i64 1684, !540, i64 1688, !540, i64 1692, !540, i64 1696, !540, i64 1700, !540, i64 1704, !540, i64 1708, !540, i64 1712, !540, i64 1716, !540, i64 1720, !540, i64 1724, !540, i64 1728, !540, i64 1732, !540, i64 1736, !540, i64 1740, !540, i64 1744, !540, i64 1748, !540, i64 1752, !540, i64 1756, !540, i64 1760, !540, i64 1764, !540, i64 1768, !540, i64 1772, !539, i64 1776, !542, i64 1784, !542, i64 1792, !542, i64 1800, !542, i64 1808, !539, i64 1816, !540, i64 1820, !540, i64 1824}
