; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/quadratic/impls/bqpip/bqpip.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/quadratic/impls/bqpip/bqpip.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque

!163 = !DIEnumerator(name: "MATOP_GET_ROW_MIN", value: 111, isUnsigned: true)
!164 = !DIEnumerator(name: "MATOP_GET_COLUMN_VECTOR", value: 112, isUnsigned: true)
!165 = !DIEnumerator(name: "MATOP_MISSING_DIAGONAL", value: 113, isUnsigned: true)
!166 = !DIEnumerator(name: "MATOP_GET_SEQ_NONZERO_STRUCTUR", value: 114, isUnsigned: true)
!167 = !DIEnumerator(name: "MATOP_CREATE", value: 115, isUnsigned: true)
!168 = !DIEnumerator(name: "MATOP_GET_GHOSTS", value: 116, isUnsigned: true)
!169 = !DIEnumerator(name: "MATOP_GET_LOCAL_SUB_MATRIX", value: 117, isUnsigned: true)
!170 = !DIEnumerator(name: "MATOP_RESTORE_LOCALSUB_MATRIX", value: 118, isUnsigned: true)
!171 = !DIEnumerator(name: "MATOP_MULT_DIAGONAL_BLOCK", value: 119, isUnsigned: true)
!172 = !DIEnumerator(name: "MATOP_HERMITIAN_TRANSPOSE", value: 120, isUnsigned: true)
!173 = !DIEnumerator(name: "MATOP_MULT_HERMITIAN_TRANSPOSE", value: 121, isUnsigned: true)
!174 = !DIEnumerator(name: "MATOP_MULT_HERMITIAN_TRANS_ADD", value: 122, isUnsigned: true)
!175 = !DIEnumerator(name: "MATOP_GET_MULTI_PROC_BLOCK", value: 123, isUnsigned: true)
!176 = !DIEnumerator(name: "MATOP_FIND_NONZERO_ROWS", value: 124, isUnsigned: true)
!177 = !DIEnumerator(name: "MATOP_GET_COLUMN_NORMS", value: 125, isUnsigned: true)
!178 = !DIEnumerator(name: "MATOP_INVERT_BLOCK_DIAGONAL", value: 126, isUnsigned: true)
!179 = !DIEnumerator(name: "MATOP_CREATE_SUB_MATRICES_MPI", value: 128, isUnsigned: true)
!180 = !DIEnumerator(name: "MATOP_SET_VALUES_BATCH", value: 129, isUnsigned: true)
!181 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT", value: 130, isUnsigned: true)
!182 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_SYMBO", value: 131, isUnsigned: true)
!183 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_NUMER", value: 132, isUnsigned: true)
!184 = !DIEnumerator(name: "MATOP_TRANSPOSE_COLORING_CREAT", value: 133, isUnsigned: true)
!185 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_SPT", value: 134, isUnsigned: true)
!186 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_DEN", value: 135, isUnsigned: true)
!187 = !DIEnumerator(name: "MATOP_RART", value: 136, isUnsigned: true)
!188 = !DIEnumerator(name: "MATOP_RART_SYMBOLIC", value: 137, isUnsigned: true)
!189 = !DIEnumerator(name: "MATOP_RART_NUMERIC", value: 138, isUnsigned: true)
!190 = !DIEnumerator(name: "MATOP_SET_BLOCK_SIZES", value: 139, isUnsigned: true)
!191 = !DIEnumerator(name: "MATOP_AYPX", value: 140, isUnsigned: true)
!192 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!193 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!194 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!195 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!196 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!197 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!198 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 580, baseType: !5, size: 32, elements: !199)
!199 = !{!200, !201, !202, !203, !204, !205, !206, !207, !208}
!200 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!201 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!202 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!203 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!204 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!205 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!206 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!207 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!208 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!209 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !53, line: 424, baseType: !5, size: 32, elements: !210)
!210 = !{!211, !212}
!211 = !DIEnumerator(name: "MAT_FLUSH_ASSEMBLY", value: 1, isUnsigned: true)
!212 = !DIEnumerator(name: "MAT_FINAL_ASSEMBLY", value: 0, isUnsigned: true)
!213 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !214, line: 155, baseType: !5, size: 32, elements: !215)
!214 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!215 = !{!216, !217, !218, !219, !220}
!216 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!217 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!218 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!219 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!220 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!221 = !{!222, !225, !243, !324, !264, !430}
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !223, line: 46, baseType: !224)
!223 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!224 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !228, line: 73, size: 4480, elements: !229)
!228 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!229 = !{!230, !232, !285, !286, !288, !291, !292, !293, !294, !302, !303, !305, !309, !313, !315, !316, !317, !318, !319, !320, !321, !322, !323, !325, !327, !328, !329, !331, !332, !334, !336, !337, !338, !339, !340, !343, !345, !346, !347, !348, !349, !352, !354, !355, !356, !366, !368, !369, !373, !374, !420, !425, !427, !428, !429}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !227, file: !228, line: 74, baseType: !231, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !227, file: !228, line: 75, baseType: !233, size: 448, offset: 64)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 448, elements: !283)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !228, line: 53, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !228, line: 45, size: 448, elements: !236)
!236 = !{!237, !247, !255, !260, !267, !271, !278}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !235, file: !228, line: 46, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!241, !225, !242}
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !244, line: 330, baseType: !245)
!244 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !244, line: 330, flags: DIFlagFwdDecl)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !235, file: !228, line: 47, baseType: !248, size: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{!241, !225, !251}
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !252, line: 16, baseType: !253)
!252 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !252, line: 16, flags: DIFlagFwdDecl)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !235, file: !228, line: 48, baseType: !256, size: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!241, !259}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !235, file: !228, line: 49, baseType: !261, size: 64, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{!241, !225, !264, !225}
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !266)
!266 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !235, file: !228, line: 50, baseType: !268, size: 64, offset: 256)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!241, !225, !264, !259}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !235, file: !228, line: 51, baseType: !272, size: 64, offset: 320)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!241, !225, !264, !275}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{null}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !235, file: !228, line: 52, baseType: !279, size: 64, offset: 384)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!241, !225, !264, !282}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!283 = !{!284}
!284 = !DISubrange(count: 1)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !227, file: !228, line: 76, baseType: !243, size: 64, offset: 512)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !227, file: !228, line: 77, baseType: !287, size: 32, offset: 576)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !227, file: !228, line: 78, baseType: !289, size: 64, offset: 640)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !290)
!290 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !227, file: !228, line: 78, baseType: !289, size: 64, offset: 704)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !227, file: !228, line: 78, baseType: !289, size: 64, offset: 768)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !227, file: !228, line: 78, baseType: !289, size: 64, offset: 832)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !227, file: !228, line: 79, baseType: !295, size: 64, offset: 896)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !298, line: 27, baseType: !299)
!298 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !300, line: 43, baseType: !301)
!300 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!301 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !227, file: !228, line: 80, baseType: !287, size: 32, offset: 960)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !227, file: !228, line: 81, baseType: !304, size: 32, offset: 992)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !227, file: !228, line: 82, baseType: !306, size: 64, offset: 1024)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !227, file: !228, line: 83, baseType: !310, size: 64, offset: 1088)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !227, file: !228, line: 84, baseType: !314, size: 64, offset: 1152)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !227, file: !228, line: 85, baseType: !314, size: 64, offset: 1216)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !227, file: !228, line: 86, baseType: !314, size: 64, offset: 1280)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !227, file: !228, line: 87, baseType: !314, size: 64, offset: 1344)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !227, file: !228, line: 88, baseType: !225, size: 64, offset: 1408)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !227, file: !228, line: 89, baseType: !295, size: 64, offset: 1472)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !227, file: !228, line: 90, baseType: !314, size: 64, offset: 1536)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !227, file: !228, line: 91, baseType: !314, size: 64, offset: 1600)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !227, file: !228, line: 92, baseType: !287, size: 32, offset: 1664)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !227, file: !228, line: 93, baseType: !324, size: 64, offset: 1728)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !227, file: !228, line: 94, baseType: !326, size: 64, offset: 1792)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !296)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !227, file: !228, line: 95, baseType: !287, size: 32, offset: 1856)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !227, file: !228, line: 95, baseType: !287, size: 32, offset: 1888)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !227, file: !228, line: 96, baseType: !330, size: 64, offset: 1920)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !227, file: !228, line: 96, baseType: !330, size: 64, offset: 1984)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !227, file: !228, line: 97, baseType: !333, size: 64, offset: 2048)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !227, file: !228, line: 97, baseType: !335, size: 64, offset: 2112)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !227, file: !228, line: 98, baseType: !287, size: 32, offset: 2176)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !227, file: !228, line: 98, baseType: !287, size: 32, offset: 2208)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !227, file: !228, line: 99, baseType: !330, size: 64, offset: 2240)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !227, file: !228, line: 99, baseType: !330, size: 64, offset: 2304)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !227, file: !228, line: 100, baseType: !341, size: 64, offset: 2368)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !290)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !227, file: !228, line: 100, baseType: !344, size: 64, offset: 2432)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !227, file: !228, line: 101, baseType: !287, size: 32, offset: 2496)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !227, file: !228, line: 101, baseType: !287, size: 32, offset: 2528)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !227, file: !228, line: 102, baseType: !330, size: 64, offset: 2560)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !227, file: !228, line: 102, baseType: !330, size: 64, offset: 2624)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !227, file: !228, line: 103, baseType: !350, size: 64, offset: 2688)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !342)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !227, file: !228, line: 103, baseType: !353, size: 64, offset: 2752)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !227, file: !228, line: 104, baseType: !282, size: 64, offset: 2816)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !227, file: !228, line: 105, baseType: !287, size: 32, offset: 2880)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !227, file: !228, line: 106, baseType: !357, size: 128, offset: 2944)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !358, size: 128, elements: !364)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !228, line: 64, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !228, line: 61, size: 128, elements: !361)
!361 = !{!362, !363}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !360, file: !228, line: 62, baseType: !275, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !360, file: !228, line: 63, baseType: !324, size: 64, offset: 64)
!364 = !{!365}
!365 = !DISubrange(count: 2)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !227, file: !228, line: 107, baseType: !367, size: 64, offset: 3072)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 64, elements: !364)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !227, file: !228, line: 108, baseType: !324, size: 64, offset: 3136)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !227, file: !228, line: 109, baseType: !370, size: 64, offset: 3200)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!241, !324}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !227, file: !228, line: 111, baseType: !287, size: 32, offset: 3264)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !227, file: !228, line: 112, baseType: !375, size: 320, offset: 3328)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 320, elements: !418)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!241, !379, !225, !324}
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !382)
!382 = !{!383, !384, !406, !407, !408, !409, !410, !411, !412, !413, !414}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !381, file: !10, line: 100, baseType: !287, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !381, file: !10, line: 101, baseType: !385, size: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !388)
!388 = !{!389, !390, !391, !392, !393, !396, !397, !398, !399, !401, !403, !404, !405}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !387, file: !10, line: 84, baseType: !314, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !387, file: !10, line: 85, baseType: !314, size: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !387, file: !10, line: 86, baseType: !324, size: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !387, file: !10, line: 87, baseType: !306, size: 64, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !387, file: !10, line: 88, baseType: !394, size: 64, offset: 256)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !387, file: !10, line: 89, baseType: !266, size: 8, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !387, file: !10, line: 90, baseType: !314, size: 64, offset: 384)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !387, file: !10, line: 91, baseType: !222, size: 64, offset: 448)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !387, file: !10, line: 92, baseType: !400, size: 32, offset: 512)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !387, file: !10, line: 93, baseType: !402, size: 32, offset: 544)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !387, file: !10, line: 94, baseType: !385, size: 64, offset: 576)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !387, file: !10, line: 95, baseType: !314, size: 64, offset: 640)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !387, file: !10, line: 96, baseType: !324, size: 64, offset: 704)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !381, file: !10, line: 102, baseType: !314, size: 64, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !381, file: !10, line: 102, baseType: !314, size: 64, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !381, file: !10, line: 103, baseType: !314, size: 64, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !381, file: !10, line: 104, baseType: !243, size: 64, offset: 320)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !381, file: !10, line: 105, baseType: !400, size: 32, offset: 384)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !381, file: !10, line: 105, baseType: !400, size: 32, offset: 416)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !381, file: !10, line: 105, baseType: !400, size: 32, offset: 448)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !381, file: !10, line: 106, baseType: !225, size: 64, offset: 512)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !381, file: !10, line: 107, baseType: !415, size: 64, offset: 576)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!418 = !{!419}
!419 = !DISubrange(count: 5)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !227, file: !228, line: 113, baseType: !421, size: 320, offset: 3648)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !422, size: 320, elements: !418)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!241, !225, !324}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !227, file: !228, line: 114, baseType: !426, size: 320, offset: 3968)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 320, elements: !418)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !227, file: !228, line: 115, baseType: !400, size: 32, offset: 4288)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !227, file: !228, line: 120, baseType: !415, size: 64, offset: 4352)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !227, file: !228, line: 121, baseType: !400, size: 32, offset: 4416)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "TAO_BQPIP", file: !432, line: 57, baseType: !433)
!432 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/tao/quadratic/impls/bqpip/bqpipimpl.h", directory: "/home/users/ndemeye/xSDK")
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !432, line: 10, size: 2176, elements: !434)
!434 = !{!435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "predcorr", scope: !433, file: !432, line: 12, baseType: !287, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !433, file: !432, line: 15, baseType: !287, size: 32, offset: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !433, file: !432, line: 16, baseType: !287, size: 32, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "dinfeas", scope: !433, file: !432, line: 19, baseType: !342, size: 64, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "pinfeas", scope: !433, file: !432, line: 20, baseType: !342, size: 64, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "pobj", scope: !433, file: !432, line: 21, baseType: !342, size: 64, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "dobj", scope: !433, file: !432, line: 22, baseType: !342, size: 64, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "gap", scope: !433, file: !432, line: 23, baseType: !342, size: 64, offset: 384)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "rgap", scope: !433, file: !432, line: 24, baseType: !342, size: 64, offset: 448)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !433, file: !432, line: 25, baseType: !342, size: 64, offset: 512)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "pathnorm", scope: !433, file: !432, line: 26, baseType: !342, size: 64, offset: 576)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "psteplength", scope: !433, file: !432, line: 27, baseType: !342, size: 64, offset: 640)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "dsteplength", scope: !433, file: !432, line: 28, baseType: !342, size: 64, offset: 704)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !433, file: !432, line: 29, baseType: !342, size: 64, offset: 768)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "G", scope: !433, file: !432, line: 32, baseType: !450, size: 64, offset: 832)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !214, line: 21, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !214, line: 21, flags: DIFlagFwdDecl)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "DG", scope: !433, file: !432, line: 33, baseType: !450, size: 64, offset: 896)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !433, file: !432, line: 34, baseType: !450, size: 64, offset: 960)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "DT", scope: !433, file: !432, line: 35, baseType: !450, size: 64, offset: 1024)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "Z", scope: !433, file: !432, line: 36, baseType: !450, size: 64, offset: 1088)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "DZ", scope: !433, file: !432, line: 37, baseType: !450, size: 64, offset: 1152)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "S", scope: !433, file: !432, line: 38, baseType: !450, size: 64, offset: 1216)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "DS", scope: !433, file: !432, line: 39, baseType: !450, size: 64, offset: 1280)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "GZwork", scope: !433, file: !432, line: 40, baseType: !450, size: 64, offset: 1344)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "TSwork", scope: !433, file: !432, line: 41, baseType: !450, size: 64, offset: 1408)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "XL", scope: !433, file: !432, line: 42, baseType: !450, size: 64, offset: 1472)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "XU", scope: !433, file: !432, line: 42, baseType: !450, size: 64, offset: 1536)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "R3", scope: !433, file: !432, line: 45, baseType: !450, size: 64, offset: 1600)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "R5", scope: !433, file: !432, line: 46, baseType: !450, size: 64, offset: 1664)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "HDiag", scope: !433, file: !432, line: 47, baseType: !450, size: 64, offset: 1728)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "Work", scope: !433, file: !432, line: 48, baseType: !450, size: 64, offset: 1792)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "DiagAxpy", scope: !433, file: !432, line: 50, baseType: !450, size: 64, offset: 1856)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "RHS", scope: !433, file: !432, line: 51, baseType: !450, size: 64, offset: 1920)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "RHS2", scope: !433, file: !432, line: 52, baseType: !450, size: 64, offset: 1984)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !433, file: !432, line: 55, baseType: !450, size: 64, offset: 2048)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !433, file: !432, line: 56, baseType: !342, size: 64, offset: 2112)
!473 = !{i32 7, !"Dwarf Version", i32 4}
!474 = !{i32 2, !"Debug Info Version", i32 3}
!475 = !{i32 1, !"wchar_size", i32 4}
!476 = !{i32 7, !"PIC Level", i32 2}
!477 = !{i32 7, !"uwtable", i32 1}
!478 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!479 = distinct !DISubprogram(name: "TaoCreate_BQPIP", scope: !480, file: !480, line: 552, type: !481, scopeLine: 553, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !709)
!480 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/tao/quadratic/impls/bqpip/bqpip.c", directory: "/home/users/ndemeye/xSDK")
!481 = !DISubroutineType(types: !482)
!482 = !{!241, !483}
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tao", file: !25, line: 118, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Tao", file: !486, line: 45, size: 14656, elements: !487)
!486 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/taoimpl.h", directory: "/home/users/ndemeye/xSDK")
!487 = !{!488, !490, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !576, !582, !584, !585, !586, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !661, !662, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !701, !702, !703, !704, !705, !706, !707, !708}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !485, file: !486, line: 46, baseType: !489, size: 4480)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !228, line: 122, baseType: !227)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !485, file: !486, line: 46, baseType: !491, size: 1536, offset: 4480)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 1536, elements: !283)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TaoOps", file: !486, line: 13, size: 1536, elements: !493)
!493 = !{!494, !498, !502, !506, !513, !514, !515, !516, !517, !518, !519, !523, !527, !528, !529, !530, !534, !538, !539, !543, !545, !546, !550, !554}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !492, file: !486, line: 15, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{!241, !483, !450, !341, !324}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgradient", scope: !492, file: !486, line: 16, baseType: !499, size: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{!241, !483, !450, !341, !450, !324}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "computegradient", scope: !492, file: !486, line: 17, baseType: !503, size: 64, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!241, !483, !450, !450, !324}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "computehessian", scope: !492, file: !486, line: 18, baseType: !507, size: 64, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{!241, !483, !450, !510, !510, !324}
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !53, line: 16, baseType: !511)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !53, line: 16, flags: DIFlagFwdDecl)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidual", scope: !492, file: !486, line: 19, baseType: !503, size: 64, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidualjacobian", scope: !492, file: !486, line: 20, baseType: !507, size: 64, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "computeconstraints", scope: !492, file: !486, line: 21, baseType: !503, size: 64, offset: 384)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "computeinequalityconstraints", scope: !492, file: !486, line: 22, baseType: !503, size: 64, offset: 448)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "computeequalityconstraints", scope: !492, file: !486, line: 23, baseType: !503, size: 64, offset: 512)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobian", scope: !492, file: !486, line: 24, baseType: !507, size: 64, offset: 576)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianstate", scope: !492, file: !486, line: 25, baseType: !520, size: 64, offset: 640)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!241, !483, !450, !510, !510, !510, !324}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobiandesign", scope: !492, file: !486, line: 26, baseType: !524, size: 64, offset: 704)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!241, !483, !450, !510, !324}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianinequality", scope: !492, file: !486, line: 27, baseType: !507, size: 64, offset: 768)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianequality", scope: !492, file: !486, line: 28, baseType: !507, size: 64, offset: 832)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "computebounds", scope: !492, file: !486, line: 29, baseType: !503, size: 64, offset: 896)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !492, file: !486, line: 30, baseType: !531, size: 64, offset: 960)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!241, !483, !287, !324}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "convergencetest", scope: !492, file: !486, line: 31, baseType: !535, size: 64, offset: 1024)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!241, !483, !324}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "convergencedestroy", scope: !492, file: !486, line: 32, baseType: !370, size: 64, offset: 1088)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "computedual", scope: !492, file: !486, line: 35, baseType: !540, size: 64, offset: 1152)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!241, !483, !450, !450}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !492, file: !486, line: 36, baseType: !544, size: 64, offset: 1216)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !492, file: !486, line: 37, baseType: !544, size: 64, offset: 1280)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !492, file: !486, line: 38, baseType: !547, size: 64, offset: 1344)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{!241, !483, !251}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !492, file: !486, line: 39, baseType: !551, size: 64, offset: 1408)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!241, !379, !483}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !492, file: !486, line: 40, baseType: !544, size: 64, offset: 1472)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !485, file: !486, line: 47, baseType: !324, size: 64, offset: 6016)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "user_objP", scope: !485, file: !486, line: 48, baseType: !324, size: 64, offset: 6080)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "user_objgradP", scope: !485, file: !486, line: 49, baseType: !324, size: 64, offset: 6144)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "user_gradP", scope: !485, file: !486, line: 50, baseType: !324, size: 64, offset: 6208)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "user_hessP", scope: !485, file: !486, line: 51, baseType: !324, size: 64, offset: 6272)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsresP", scope: !485, file: !486, line: 52, baseType: !324, size: 64, offset: 6336)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsjacP", scope: !485, file: !486, line: 53, baseType: !324, size: 64, offset: 6400)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "user_conP", scope: !485, file: !486, line: 54, baseType: !324, size: 64, offset: 6464)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_equalityP", scope: !485, file: !486, line: 55, baseType: !324, size: 64, offset: 6528)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_inequalityP", scope: !485, file: !486, line: 56, baseType: !324, size: 64, offset: 6592)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "user_jacP", scope: !485, file: !486, line: 57, baseType: !324, size: 64, offset: 6656)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_equalityP", scope: !485, file: !486, line: 58, baseType: !324, size: 64, offset: 6720)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_inequalityP", scope: !485, file: !486, line: 59, baseType: !324, size: 64, offset: 6784)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_stateP", scope: !485, file: !486, line: 60, baseType: !324, size: 64, offset: 6848)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_designP", scope: !485, file: !486, line: 61, baseType: !324, size: 64, offset: 6912)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "user_boundsP", scope: !485, file: !486, line: 62, baseType: !324, size: 64, offset: 6976)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "user_update", scope: !485, file: !486, line: 63, baseType: !324, size: 64, offset: 7040)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !485, file: !486, line: 65, baseType: !573, size: 640, offset: 7104)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !535, size: 640, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 10)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !485, file: !486, line: 66, baseType: !577, size: 640, offset: 7744)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 640, elements: !574)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!241, !581}
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !485, file: !486, line: 67, baseType: !583, size: 640, offset: 8384)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 640, elements: !574)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !485, file: !486, line: 68, baseType: !287, size: 32, offset: 9024)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !485, file: !486, line: 69, baseType: !324, size: 64, offset: 9088)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !485, file: !486, line: 70, baseType: !587, size: 32, offset: 9152)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoConvergedReason", file: !25, line: 196, baseType: !24)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !485, file: !486, line: 72, baseType: !400, size: 32, offset: 9184)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !485, file: !486, line: 73, baseType: !324, size: 64, offset: 9216)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "solution", scope: !485, file: !486, line: 75, baseType: !450, size: 64, offset: 9280)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !485, file: !486, line: 76, baseType: !450, size: 64, offset: 9344)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "stepdirection", scope: !485, file: !486, line: 77, baseType: !450, size: 64, offset: 9408)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "XL", scope: !485, file: !486, line: 78, baseType: !450, size: 64, offset: 9472)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "XU", scope: !485, file: !486, line: 79, baseType: !450, size: 64, offset: 9536)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "IL", scope: !485, file: !486, line: 80, baseType: !450, size: 64, offset: 9600)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "IU", scope: !485, file: !486, line: 81, baseType: !450, size: 64, offset: 9664)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "DI", scope: !485, file: !486, line: 82, baseType: !450, size: 64, offset: 9728)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "DE", scope: !485, file: !486, line: 83, baseType: !450, size: 64, offset: 9792)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "hessian", scope: !485, file: !486, line: 84, baseType: !510, size: 64, offset: 9856)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "hessian_pre", scope: !485, file: !486, line: 85, baseType: !510, size: 64, offset: 9920)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm", scope: !485, file: !486, line: 86, baseType: !510, size: 64, offset: 9984)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm_tmp", scope: !485, file: !486, line: 87, baseType: !450, size: 64, offset: 10048)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ls_res", scope: !485, file: !486, line: 88, baseType: !450, size: 64, offset: 10112)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac", scope: !485, file: !486, line: 89, baseType: !510, size: 64, offset: 10176)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac_pre", scope: !485, file: !486, line: 90, baseType: !510, size: 64, offset: 10240)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_v", scope: !485, file: !486, line: 91, baseType: !450, size: 64, offset: 10304)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_n", scope: !485, file: !486, line: 92, baseType: !287, size: 32, offset: 10368)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_rows", scope: !485, file: !486, line: 93, baseType: !333, size: 64, offset: 10432)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_cols", scope: !485, file: !486, line: 94, baseType: !333, size: 64, offset: 10496)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_w", scope: !485, file: !486, line: 95, baseType: !341, size: 64, offset: 10560)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !485, file: !486, line: 96, baseType: !450, size: 64, offset: 10624)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_equality", scope: !485, file: !486, line: 97, baseType: !450, size: 64, offset: 10688)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_inequality", scope: !485, file: !486, line: 98, baseType: !450, size: 64, offset: 10752)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !485, file: !486, line: 99, baseType: !510, size: 64, offset: 10816)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !485, file: !486, line: 100, baseType: !510, size: 64, offset: 10880)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality", scope: !485, file: !486, line: 101, baseType: !510, size: 64, offset: 10944)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality_pre", scope: !485, file: !486, line: 102, baseType: !510, size: 64, offset: 11008)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality", scope: !485, file: !486, line: 103, baseType: !510, size: 64, offset: 11072)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality_pre", scope: !485, file: !486, line: 104, baseType: !510, size: 64, offset: 11136)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state", scope: !485, file: !486, line: 105, baseType: !510, size: 64, offset: 11200)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_inv", scope: !485, file: !486, line: 106, baseType: !510, size: 64, offset: 11264)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design", scope: !485, file: !486, line: 107, baseType: !510, size: 64, offset: 11328)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_pre", scope: !485, file: !486, line: 108, baseType: !510, size: 64, offset: 11392)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design_pre", scope: !485, file: !486, line: 109, baseType: !510, size: 64, offset: 11456)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "state_is", scope: !485, file: !486, line: 110, baseType: !626, size: 64, offset: 11520)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !627, line: 11, baseType: !628)
!627 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !627, line: 11, flags: DIFlagFwdDecl)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "design_is", scope: !485, file: !486, line: 111, baseType: !626, size: 64, offset: 11584)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !485, file: !486, line: 112, baseType: !342, size: 64, offset: 11648)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !485, file: !486, line: 113, baseType: !342, size: 64, offset: 11712)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "gnorm0", scope: !485, file: !486, line: 114, baseType: !342, size: 64, offset: 11776)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm", scope: !485, file: !486, line: 115, baseType: !342, size: 64, offset: 11840)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm0", scope: !485, file: !486, line: 116, baseType: !342, size: 64, offset: 11904)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !485, file: !486, line: 117, baseType: !342, size: 64, offset: 11968)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !485, file: !486, line: 119, baseType: !287, size: 32, offset: 12032)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !485, file: !486, line: 120, baseType: !287, size: 32, offset: 12064)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "max_constraints", scope: !485, file: !486, line: 121, baseType: !287, size: 32, offset: 12096)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !485, file: !486, line: 122, baseType: !287, size: 32, offset: 12128)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ngrads", scope: !485, file: !486, line: 123, baseType: !287, size: 32, offset: 12160)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncgrads", scope: !485, file: !486, line: 124, baseType: !287, size: 32, offset: 12192)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "nhess", scope: !485, file: !486, line: 125, baseType: !287, size: 32, offset: 12224)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !485, file: !486, line: 126, baseType: !287, size: 32, offset: 12256)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ntotalits", scope: !485, file: !486, line: 127, baseType: !287, size: 32, offset: 12288)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "nconstraints", scope: !485, file: !486, line: 128, baseType: !287, size: 32, offset: 12320)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "niconstraints", scope: !485, file: !486, line: 129, baseType: !287, size: 32, offset: 12352)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "neconstraints", scope: !485, file: !486, line: 130, baseType: !287, size: 32, offset: 12384)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "njac", scope: !485, file: !486, line: 131, baseType: !287, size: 32, offset: 12416)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "njac_equality", scope: !485, file: !486, line: 132, baseType: !287, size: 32, offset: 12448)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "njac_inequality", scope: !485, file: !486, line: 133, baseType: !287, size: 32, offset: 12480)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "njac_state", scope: !485, file: !486, line: 134, baseType: !287, size: 32, offset: 12512)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "njac_design", scope: !485, file: !486, line: 135, baseType: !287, size: 32, offset: 12544)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_its", scope: !485, file: !486, line: 137, baseType: !287, size: 32, offset: 12576)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_tot_its", scope: !485, file: !486, line: 138, baseType: !287, size: 32, offset: 12608)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !485, file: !486, line: 140, baseType: !657, size: 64, offset: 12672)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearch", file: !658, line: 5, baseType: !659)
!658 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctaolinesearch.h", directory: "/home/users/ndemeye/xSDK")
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TaoLineSearch", file: !658, line: 5, flags: DIFlagFwdDecl)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "lsflag", scope: !485, file: !486, line: 141, baseType: !400, size: 32, offset: 12736)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !485, file: !486, line: 142, baseType: !663, size: 64, offset: 12800)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !664, line: 22, baseType: !665)
!664 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !664, line: 22, flags: DIFlagFwdDecl)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "trust0", scope: !485, file: !486, line: 143, baseType: !342, size: 64, offset: 12864)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !485, file: !486, line: 144, baseType: !342, size: 64, offset: 12928)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "gatol", scope: !485, file: !486, line: 146, baseType: !342, size: 64, offset: 12992)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "grtol", scope: !485, file: !486, line: 147, baseType: !342, size: 64, offset: 13056)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "gttol", scope: !485, file: !486, line: 148, baseType: !342, size: 64, offset: 13120)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "catol", scope: !485, file: !486, line: 149, baseType: !342, size: 64, offset: 13184)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "crtol", scope: !485, file: !486, line: 150, baseType: !342, size: 64, offset: 13248)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "steptol", scope: !485, file: !486, line: 151, baseType: !342, size: 64, offset: 13312)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "fmin", scope: !485, file: !486, line: 152, baseType: !342, size: 64, offset: 13376)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs_changed", scope: !485, file: !486, line: 153, baseType: !400, size: 32, offset: 13440)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "max_it_changed", scope: !485, file: !486, line: 154, baseType: !400, size: 32, offset: 13472)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "gatol_changed", scope: !485, file: !486, line: 155, baseType: !400, size: 32, offset: 13504)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "grtol_changed", scope: !485, file: !486, line: 156, baseType: !400, size: 32, offset: 13536)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "gttol_changed", scope: !485, file: !486, line: 157, baseType: !400, size: 32, offset: 13568)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "fmin_changed", scope: !485, file: !486, line: 158, baseType: !400, size: 32, offset: 13600)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "catol_changed", scope: !485, file: !486, line: 159, baseType: !400, size: 32, offset: 13632)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "crtol_changed", scope: !485, file: !486, line: 160, baseType: !400, size: 32, offset: 13664)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "steptol_changed", scope: !485, file: !486, line: 161, baseType: !400, size: 32, offset: 13696)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "trust0_changed", scope: !485, file: !486, line: 162, baseType: !400, size: 32, offset: 13728)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "printreason", scope: !485, file: !486, line: 163, baseType: !400, size: 32, offset: 13760)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "viewsolution", scope: !485, file: !486, line: 164, baseType: !400, size: 32, offset: 13792)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "viewgradient", scope: !485, file: !486, line: 165, baseType: !400, size: 32, offset: 13824)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "viewconstraints", scope: !485, file: !486, line: 166, baseType: !400, size: 32, offset: 13856)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "viewhessian", scope: !485, file: !486, line: 167, baseType: !400, size: 32, offset: 13888)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "viewjacobian", scope: !485, file: !486, line: 168, baseType: !400, size: 32, offset: 13920)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "bounded", scope: !485, file: !486, line: 169, baseType: !400, size: 32, offset: 13952)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "constrained", scope: !485, file: !486, line: 170, baseType: !400, size: 32, offset: 13984)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "eq_constrained", scope: !485, file: !486, line: 171, baseType: !400, size: 32, offset: 14016)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_constrained", scope: !485, file: !486, line: 172, baseType: !400, size: 32, offset: 14048)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_doublesided", scope: !485, file: !486, line: 173, baseType: !400, size: 32, offset: 14080)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "header_printed", scope: !485, file: !486, line: 174, baseType: !400, size: 32, offset: 14112)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "recycle", scope: !485, file: !486, line: 175, baseType: !400, size: 32, offset: 14144)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "subset_type", scope: !485, file: !486, line: 177, baseType: !700, size: 32, offset: 14176)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoSubsetType", file: !25, line: 26, baseType: !41)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "hist_max", scope: !485, file: !486, line: 178, baseType: !287, size: 32, offset: 14208)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "hist_obj", scope: !485, file: !486, line: 179, baseType: !341, size: 64, offset: 14272)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "hist_resid", scope: !485, file: !486, line: 180, baseType: !341, size: 64, offset: 14336)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "hist_cnorm", scope: !485, file: !486, line: 181, baseType: !341, size: 64, offset: 14400)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "hist_lits", scope: !485, file: !486, line: 182, baseType: !333, size: 64, offset: 14464)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "hist_len", scope: !485, file: !486, line: 183, baseType: !287, size: 32, offset: 14528)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "hist_reset", scope: !485, file: !486, line: 184, baseType: !400, size: 32, offset: 14560)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "hist_malloc", scope: !485, file: !486, line: 185, baseType: !400, size: 32, offset: 14592)
!709 = !{!710, !711, !712, !713, !715, !717, !719, !721, !723}
!710 = !DILocalVariable(name: "tao", arg: 1, scope: !479, file: !480, line: 552, type: !483)
!711 = !DILocalVariable(name: "qp", scope: !479, file: !480, line: 554, type: !430)
!712 = !DILocalVariable(name: "ierr", scope: !479, file: !480, line: 555, type: !241)
!713 = !DILocalVariable(name: "ierr__", scope: !714, file: !480, line: 558, type: !241)
!714 = distinct !DILexicalBlock(scope: !479, file: !480, line: 558, column: 31)
!715 = !DILocalVariable(name: "ierr__", scope: !716, file: !480, line: 583, type: !241)
!716 = distinct !DILexicalBlock(scope: !479, file: !480, line: 583, column: 56)
!717 = !DILocalVariable(name: "ierr__", scope: !718, file: !480, line: 584, type: !241)
!718 = distinct !DILexicalBlock(scope: !479, file: !480, line: 584, column: 83)
!719 = !DILocalVariable(name: "ierr__", scope: !720, file: !480, line: 585, type: !241)
!720 = distinct !DILexicalBlock(scope: !479, file: !480, line: 585, column: 56)
!721 = !DILocalVariable(name: "ierr__", scope: !722, file: !480, line: 586, type: !241)
!722 = distinct !DILexicalBlock(scope: !479, file: !480, line: 586, column: 37)
!723 = !DILocalVariable(name: "ierr__", scope: !724, file: !480, line: 587, type: !241)
!724 = distinct !DILexicalBlock(scope: !479, file: !480, line: 587, column: 73)
!725 = !DILocation(line: 0, scope: !479)
!726 = !DILocation(line: 554, column: 3, scope: !479)
!727 = !DILocation(line: 557, column: 3, scope: !728)
!728 = distinct !DILexicalBlock(scope: !729, file: !480, line: 557, column: 3)
!729 = distinct !DILexicalBlock(scope: !730, file: !480, line: 557, column: 3)
!730 = distinct !DILexicalBlock(scope: !479, file: !480, line: 557, column: 3)
!731 = !{!732, !732, i64 0}
!732 = !{!"any pointer", !733, i64 0}
!733 = !{!"omnipotent char", !734, i64 0}
!734 = !{!"Simple C/C++ TBAA"}
!735 = !DILocation(line: 557, column: 3, scope: !729)
!736 = !DILocation(line: 557, column: 3, scope: !737)
!737 = distinct !DILexicalBlock(scope: !738, file: !480, line: 557, column: 3)
!738 = distinct !DILexicalBlock(scope: !728, file: !480, line: 557, column: 3)
!739 = !{!740, !741, i64 1536}
!740 = !{!"", !733, i64 0, !733, i64 512, !733, i64 1024, !733, i64 1280, !741, i64 1536, !741, i64 1540, !733, i64 1544}
!741 = !{!"int", !733, i64 0}
!742 = !DILocation(line: 557, column: 3, scope: !738)
!743 = !DILocation(line: 557, column: 3, scope: !744)
!744 = distinct !DILexicalBlock(scope: !737, file: !480, line: 557, column: 3)
!745 = !{!741, !741, i64 0}
!746 = !{!740, !741, i64 1540}
!747 = !DILocation(line: 558, column: 10, scope: !479)
!748 = !{!"branch_weights", i32 2146410443, i32 1073205}
!749 = !DILocation(line: 0, scope: !714)
!750 = !DILocation(line: 558, column: 31, scope: !714)
!751 = !{!"branch_weights", i32 2000, i32 1}
!752 = !DILocation(line: 558, column: 31, scope: !753)
!753 = distinct !DILexicalBlock(scope: !714, file: !480, line: 558, column: 31)
!754 = !DILocation(line: 560, column: 13, scope: !479)
!755 = !DILocation(line: 560, column: 19, scope: !479)
!756 = !{!757, !732, i64 152}
!757 = !{!"_TaoOps", !732, i64 0, !732, i64 8, !732, i64 16, !732, i64 24, !732, i64 32, !732, i64 40, !732, i64 48, !732, i64 56, !732, i64 64, !732, i64 72, !732, i64 80, !732, i64 88, !732, i64 96, !732, i64 104, !732, i64 112, !732, i64 120, !732, i64 128, !732, i64 136, !732, i64 144, !732, i64 152, !732, i64 160, !732, i64 168, !732, i64 176, !732, i64 184}
!758 = !DILocation(line: 561, column: 13, scope: !479)
!759 = !DILocation(line: 561, column: 19, scope: !479)
!760 = !{!757, !732, i64 160}
!761 = !DILocation(line: 562, column: 13, scope: !479)
!762 = !DILocation(line: 562, column: 18, scope: !479)
!763 = !{!757, !732, i64 168}
!764 = !DILocation(line: 563, column: 13, scope: !479)
!765 = !DILocation(line: 563, column: 28, scope: !479)
!766 = !{!757, !732, i64 176}
