; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/linesearch/impls/basic/linesearchbasic.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/linesearch/impls/basic/linesearchbasic.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_LineSearch = type { %struct._p_PetscObject, [1 x %struct._LineSearchOps], %struct._p_SNES*, i8*, i32, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Vec*, i32, %struct._p_Vec**, double, i32, double, double, double, i32, i32, double, double, double, i32, double, double, double, i32, double, i8*, i8*, %struct._p_PetscViewer*, [5 x i32 (%struct._p_LineSearch*, i8*)*], [5 x i32 (i8**)*], [5 x i8*], i32 }

!57 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 406, baseType: !26, size: 32, elements: !60)
!60 = !{!61, !62, !63, !64, !65, !66}
!61 = !DIEnumerator(name: "SNES_NORM_DEFAULT", value: -1)
!62 = !DIEnumerator(name: "SNES_NORM_NONE", value: 0)
!63 = !DIEnumerator(name: "SNES_NORM_ALWAYS", value: 1)
!64 = !DIEnumerator(name: "SNES_NORM_INITIAL_ONLY", value: 2)
!65 = !DIEnumerator(name: "SNES_NORM_FINAL_ONLY", value: 3)
!66 = !DIEnumerator(name: "SNES_NORM_INITIAL_FINAL_ONLY", value: 4)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 493, baseType: !26, size: 32, elements: !68)
!68 = !{!69, !70, !71}
!69 = !DIEnumerator(name: "SNES_FUNCTION_DEFAULT", value: -1)
!70 = !DIEnumerator(name: "SNES_FUNCTION_UNPRECONDITIONED", value: 0)
!71 = !DIEnumerator(name: "SNES_FUNCTION_PRECONDITIONED", value: 1)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 616, baseType: !5, size: 32, elements: !73)
!73 = !{!74, !75, !76, !77, !78, !79}
!74 = !DIEnumerator(name: "SNES_LINESEARCH_SUCCEEDED", value: 0, isUnsigned: true)
!75 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_NANORINF", value: 1, isUnsigned: true)
!76 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_DOMAIN", value: 2, isUnsigned: true)
!77 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_REDUCT", value: 3, isUnsigned: true)
!78 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_USER", value: 4, isUnsigned: true)
!79 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_FUNCTION", value: 5, isUnsigned: true)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !81, line: 663, baseType: !5, size: 32, elements: !82)
!81 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!82 = !{!83, !84, !85}
!83 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !87, line: 155, baseType: !5, size: 32, elements: !88)
!87 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!88 = !{!89, !90, !91, !92, !93}
!89 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!90 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!91 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!92 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!93 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!94 = !{!95, !98, !102}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!97 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !99, line: 330, baseType: !100)
!99 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !99, line: 330, flags: DIFlagFwdDecl)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!103 = !{i32 7, !"Dwarf Version", i32 4}
!104 = !{i32 2, !"Debug Info Version", i32 3}
!105 = !{i32 1, !"wchar_size", i32 4}
!106 = !{i32 7, !"PIC Level", i32 2}
!107 = !{i32 7, !"uwtable", i32 1}
!108 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!109 = distinct !DISubprogram(name: "SNESLineSearchCreate_Basic", scope: !110, file: !110, line: 87, type: !111, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !581)
!110 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/snes/linesearch/impls/basic/linesearchbasic.c", directory: "/home/users/ndemeye/xSDK")
!111 = !DISubroutineType(types: !112)
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearch", file: !25, line: 526, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_LineSearch", file: !117, line: 29, size: 8000, elements: !118)
!117 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/linesearchimpl.h", directory: "/home/users/ndemeye/xSDK")
!118 = !{!119, !320, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !578, !579, !580}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !116, file: !117, line: 30, baseType: !120, size: 4480)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !121, line: 122, baseType: !122)
!121 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !121, line: 73, size: 4480, elements: !123)
!123 = !{!124, !126, !173, !174, !176, !179, !180, !181, !182, !190, !191, !193, !197, !201, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !214, !215, !216, !218, !219, !221, !223, !224, !225, !226, !227, !230, !232, !233, !234, !235, !236, !239, !241, !242, !243, !253, !255, !256, !260, !261, !310, !315, !317, !318, !319}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !122, file: !121, line: 74, baseType: !125, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !122, file: !121, line: 75, baseType: !127, size: 448, offset: 64)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 448, elements: !171)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !121, line: 53, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !121, line: 45, size: 448, elements: !130)
!130 = !{!131, !138, !146, !151, !155, !159, !166}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !129, file: !121, line: 46, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!113, !135, !137}
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !129, file: !121, line: 47, baseType: !139, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!113, !135, !142}
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !143, line: 16, baseType: !144)
!143 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !143, line: 16, flags: DIFlagFwdDecl)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !129, file: !121, line: 48, baseType: !147, size: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!113, !150}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !129, file: !121, line: 49, baseType: !152, size: 64, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!113, !135, !95, !135}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !129, file: !121, line: 50, baseType: !156, size: 64, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!113, !135, !95, !150}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !129, file: !121, line: 51, baseType: !160, size: 64, offset: 320)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!113, !135, !95, !163}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{null}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !129, file: !121, line: 52, baseType: !167, size: 64, offset: 384)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!113, !135, !95, !170}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!171 = !{!172}
!172 = !DISubrange(count: 1)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !122, file: !121, line: 76, baseType: !98, size: 64, offset: 512)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !122, file: !121, line: 77, baseType: !175, size: 32, offset: 576)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !122, file: !121, line: 78, baseType: !177, size: 64, offset: 640)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !178)
!178 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !122, file: !121, line: 78, baseType: !177, size: 64, offset: 704)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !122, file: !121, line: 78, baseType: !177, size: 64, offset: 768)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !122, file: !121, line: 78, baseType: !177, size: 64, offset: 832)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !122, file: !121, line: 79, baseType: !183, size: 64, offset: 896)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !186, line: 27, baseType: !187)
!186 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !188, line: 43, baseType: !189)
!188 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!189 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !122, file: !121, line: 80, baseType: !175, size: 32, offset: 960)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !122, file: !121, line: 81, baseType: !192, size: 32, offset: 992)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !122, file: !121, line: 82, baseType: !194, size: 64, offset: 1024)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !122, file: !121, line: 83, baseType: !198, size: 64, offset: 1088)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !122, file: !121, line: 84, baseType: !202, size: 64, offset: 1152)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !122, file: !121, line: 85, baseType: !202, size: 64, offset: 1216)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !122, file: !121, line: 86, baseType: !202, size: 64, offset: 1280)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !122, file: !121, line: 87, baseType: !202, size: 64, offset: 1344)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !122, file: !121, line: 88, baseType: !135, size: 64, offset: 1408)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !122, file: !121, line: 89, baseType: !183, size: 64, offset: 1472)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !122, file: !121, line: 90, baseType: !202, size: 64, offset: 1536)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !122, file: !121, line: 91, baseType: !202, size: 64, offset: 1600)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !122, file: !121, line: 92, baseType: !175, size: 32, offset: 1664)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !122, file: !121, line: 93, baseType: !102, size: 64, offset: 1728)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !122, file: !121, line: 94, baseType: !213, size: 64, offset: 1792)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !184)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !122, file: !121, line: 95, baseType: !175, size: 32, offset: 1856)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !122, file: !121, line: 95, baseType: !175, size: 32, offset: 1888)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !122, file: !121, line: 96, baseType: !217, size: 64, offset: 1920)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !122, file: !121, line: 96, baseType: !217, size: 64, offset: 1984)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !122, file: !121, line: 97, baseType: !220, size: 64, offset: 2048)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !122, file: !121, line: 97, baseType: !222, size: 64, offset: 2112)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !122, file: !121, line: 98, baseType: !175, size: 32, offset: 2176)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !122, file: !121, line: 98, baseType: !175, size: 32, offset: 2208)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !122, file: !121, line: 99, baseType: !217, size: 64, offset: 2240)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !122, file: !121, line: 99, baseType: !217, size: 64, offset: 2304)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !122, file: !121, line: 100, baseType: !228, size: 64, offset: 2368)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !178)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !122, file: !121, line: 100, baseType: !231, size: 64, offset: 2432)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !122, file: !121, line: 101, baseType: !175, size: 32, offset: 2496)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !122, file: !121, line: 101, baseType: !175, size: 32, offset: 2528)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !122, file: !121, line: 102, baseType: !217, size: 64, offset: 2560)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !122, file: !121, line: 102, baseType: !217, size: 64, offset: 2624)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !122, file: !121, line: 103, baseType: !237, size: 64, offset: 2688)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !229)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !122, file: !121, line: 103, baseType: !240, size: 64, offset: 2752)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !122, file: !121, line: 104, baseType: !170, size: 64, offset: 2816)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !122, file: !121, line: 105, baseType: !175, size: 32, offset: 2880)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !122, file: !121, line: 106, baseType: !244, size: 128, offset: 2944)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 128, elements: !251)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !121, line: 64, baseType: !247)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !121, line: 61, size: 128, elements: !248)
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !247, file: !121, line: 62, baseType: !163, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !247, file: !121, line: 63, baseType: !102, size: 64, offset: 64)
!251 = !{!252}
!252 = !DISubrange(count: 2)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !122, file: !121, line: 107, baseType: !254, size: 64, offset: 3072)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 64, elements: !251)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !122, file: !121, line: 108, baseType: !102, size: 64, offset: 3136)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !122, file: !121, line: 109, baseType: !257, size: 64, offset: 3200)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!113, !102}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !122, file: !121, line: 111, baseType: !175, size: 32, offset: 3264)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !122, file: !121, line: 112, baseType: !262, size: 320, offset: 3328)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 320, elements: !308)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!113, !266, !135, !102}
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !269)
!269 = !{!270, !271, !296, !297, !298, !299, !300, !301, !302, !303, !304}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !268, file: !10, line: 100, baseType: !175, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !268, file: !10, line: 101, baseType: !272, size: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !275)
!275 = !{!276, !277, !278, !279, !280, !283, !284, !285, !289, !291, !293, !294, !295}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !274, file: !10, line: 84, baseType: !202, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !274, file: !10, line: 85, baseType: !202, size: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !274, file: !10, line: 86, baseType: !102, size: 64, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !274, file: !10, line: 87, baseType: !194, size: 64, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !274, file: !10, line: 88, baseType: !281, size: 64, offset: 256)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !274, file: !10, line: 89, baseType: !97, size: 8, offset: 320)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !274, file: !10, line: 90, baseType: !202, size: 64, offset: 384)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !274, file: !10, line: 91, baseType: !286, size: 64, offset: 448)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !287, line: 46, baseType: !288)
!287 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!288 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !274, file: !10, line: 92, baseType: !290, size: 32, offset: 512)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !274, file: !10, line: 93, baseType: !292, size: 32, offset: 544)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !274, file: !10, line: 94, baseType: !272, size: 64, offset: 576)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !274, file: !10, line: 95, baseType: !202, size: 64, offset: 640)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !274, file: !10, line: 96, baseType: !102, size: 64, offset: 704)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !268, file: !10, line: 102, baseType: !202, size: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !268, file: !10, line: 102, baseType: !202, size: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !268, file: !10, line: 103, baseType: !202, size: 64, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !268, file: !10, line: 104, baseType: !98, size: 64, offset: 320)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !268, file: !10, line: 105, baseType: !290, size: 32, offset: 384)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !268, file: !10, line: 105, baseType: !290, size: 32, offset: 416)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !268, file: !10, line: 105, baseType: !290, size: 32, offset: 448)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !268, file: !10, line: 106, baseType: !135, size: 64, offset: 512)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !268, file: !10, line: 107, baseType: !305, size: 64, offset: 576)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!308 = !{!309}
!309 = !DISubrange(count: 5)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !122, file: !121, line: 113, baseType: !311, size: 320, offset: 3648)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 320, elements: !308)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!113, !135, !102}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !122, file: !121, line: 114, baseType: !316, size: 320, offset: 3968)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 320, elements: !308)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !122, file: !121, line: 115, baseType: !290, size: 32, offset: 4288)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !122, file: !121, line: 120, baseType: !305, size: 64, offset: 4352)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !122, file: !121, line: 121, baseType: !290, size: 32, offset: 4416)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !116, file: !117, line: 30, baseType: !321, size: 704, offset: 4480)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 704, elements: !171)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LineSearchOps", file: !117, line: 13, size: 704, elements: !323)
!323 = !{!324, !328, !331, !339, !526, !531, !535, !539, !540, !541, !542}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !322, file: !117, line: 14, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!113, !114, !142}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !322, file: !117, line: 15, baseType: !329, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchApplyFunc", file: !25, line: 554, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "precheck", scope: !322, file: !117, line: 16, baseType: !332, size: 64, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!113, !114, !335, !335, !338, !102}
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !87, line: 21, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !87, line: 21, flags: DIFlagFwdDecl)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "viproject", scope: !322, file: !117, line: 17, baseType: !340, size: 64, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchVIProjectFunc", file: !25, line: 552, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!113, !344, !335}
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !25, line: 18, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !347, line: 38, size: 11648, elements: !348)
!347 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/snesimpl.h", directory: "/home/users/ndemeye/xSDK")
!348 = !{!349, !350, !413, !418, !419, !420, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !436, !437, !438, !440, !441, !442, !443, !444, !449, !451, !452, !453, !454, !455, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !491, !493, !494, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !346, file: !347, line: 39, baseType: !120, size: 4480)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !346, file: !347, line: 39, baseType: !351, size: 1088, offset: 4480)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 1088, elements: !171)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SNESOps", file: !347, line: 12, size: 1088, elements: !353)
!353 = !{!354, !358, !362, !366, !372, !373, !377, !378, !382, !386, !387, !388, !393, !397, !401, !405, !412}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "computeinitialguess", scope: !352, file: !347, line: 13, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!113, !344, !335, !102}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "computescaling", scope: !352, file: !347, line: 14, baseType: !359, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!113, !335, !335, !102}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !352, file: !347, line: 15, baseType: !363, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!113, !344, !175}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !352, file: !347, line: 16, baseType: !367, size: 64, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{!113, !344, !175, !229, !229, !229, !370, !102}
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESConvergedReason", file: !25, line: 257, baseType: !24)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !352, file: !347, line: 17, baseType: !257, size: 64, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !352, file: !347, line: 18, baseType: !374, size: 64, offset: 320)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!113, !344}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !352, file: !347, line: 19, baseType: !374, size: 64, offset: 384)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !352, file: !347, line: 20, baseType: !379, size: 64, offset: 448)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!113, !344, !142}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !352, file: !347, line: 21, baseType: !383, size: 64, offset: 512)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!113, !266, !344}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !352, file: !347, line: 22, baseType: !374, size: 64, offset: 576)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !352, file: !347, line: 23, baseType: !374, size: 64, offset: 640)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "usercompute", scope: !352, file: !347, line: 24, baseType: !389, size: 64, offset: 704)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!113, !344, !392}
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "userdestroy", scope: !352, file: !347, line: 25, baseType: !394, size: 64, offset: 768)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!113, !392}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !352, file: !347, line: 26, baseType: !398, size: 64, offset: 832)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!113, !344, !335, !335}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "computepfunction", scope: !352, file: !347, line: 27, baseType: !402, size: 64, offset: 896)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!113, !344, !335, !335, !102}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "computepjacobian", scope: !352, file: !347, line: 28, baseType: !406, size: 64, offset: 960)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!113, !344, !335, !409, !409, !102}
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !53, line: 16, baseType: !410)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !53, line: 16, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !352, file: !347, line: 29, baseType: !379, size: 64, offset: 1024)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !346, file: !347, line: 40, baseType: !414, size: 64, offset: 5568)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !415, line: 14, baseType: !416)
!415 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !415, line: 14, flags: DIFlagFwdDecl)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !346, file: !347, line: 41, baseType: !290, size: 32, offset: 5632)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "npc", scope: !346, file: !347, line: 42, baseType: !344, size: 64, offset: 5696)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "npcside", scope: !346, file: !347, line: 43, baseType: !421, size: 32, offset: 5760)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !46, line: 85, baseType: !45)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "usesnpc", scope: !346, file: !347, line: 44, baseType: !290, size: 32, offset: 5792)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !346, file: !347, line: 47, baseType: !102, size: 64, offset: 5824)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !346, file: !347, line: 49, baseType: !335, size: 64, offset: 5888)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !346, file: !347, line: 50, baseType: !335, size: 64, offset: 5952)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !346, file: !347, line: 52, baseType: !335, size: 64, offset: 6016)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !346, file: !347, line: 54, baseType: !409, size: 64, offset: 6080)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !346, file: !347, line: 55, baseType: !409, size: 64, offset: 6144)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "picard", scope: !346, file: !347, line: 56, baseType: !409, size: 64, offset: 6208)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "initialguessP", scope: !346, file: !347, line: 57, baseType: !102, size: 64, offset: 6272)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !346, file: !347, line: 58, baseType: !432, size: 64, offset: 6336)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !433, line: 22, baseType: !434)
!433 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !433, line: 22, flags: DIFlagFwdDecl)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !346, file: !347, line: 59, baseType: !114, size: 64, offset: 6400)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "usesksp", scope: !346, file: !347, line: 60, baseType: !290, size: 32, offset: 6464)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "matstruct", scope: !346, file: !347, line: 61, baseType: !439, size: 32, offset: 6496)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !53, line: 285, baseType: !52)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_update", scope: !346, file: !347, line: 63, baseType: !335, size: 64, offset: 6528)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "scaling", scope: !346, file: !347, line: 65, baseType: !335, size: 64, offset: 6592)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "scaP", scope: !346, file: !347, line: 66, baseType: !102, size: 64, offset: 6656)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !346, file: !347, line: 68, baseType: !229, size: 64, offset: 6720)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !346, file: !347, line: 74, baseType: !445, size: 320, offset: 6784)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 320, elements: !308)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!113, !344, !175, !229, !102}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !346, file: !347, line: 75, baseType: !450, size: 320, offset: 7104)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 320, elements: !308)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !346, file: !347, line: 76, baseType: !316, size: 320, offset: 7424)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !346, file: !347, line: 77, baseType: !175, size: 32, offset: 7744)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !346, file: !347, line: 78, baseType: !102, size: 64, offset: 7808)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !346, file: !347, line: 79, baseType: !371, size: 32, offset: 7872)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !346, file: !347, line: 80, baseType: !456, size: 320, offset: 7936)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 320, elements: !308)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!113, !344, !102}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !346, file: !347, line: 81, baseType: !450, size: 320, offset: 8256)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !346, file: !347, line: 82, baseType: !316, size: 320, offset: 8576)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !346, file: !347, line: 83, baseType: !175, size: 32, offset: 8896)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !346, file: !347, line: 84, baseType: !290, size: 32, offset: 8928)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !346, file: !347, line: 88, baseType: !290, size: 32, offset: 8960)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !346, file: !347, line: 89, baseType: !102, size: 64, offset: 9024)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !346, file: !347, line: 93, baseType: !175, size: 32, offset: 9088)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !346, file: !347, line: 94, baseType: !175, size: 32, offset: 9120)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !346, file: !347, line: 95, baseType: !175, size: 32, offset: 9152)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !346, file: !347, line: 96, baseType: !175, size: 32, offset: 9184)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "linear_its", scope: !346, file: !347, line: 97, baseType: !175, size: 32, offset: 9216)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !346, file: !347, line: 98, baseType: !229, size: 64, offset: 9280)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !346, file: !347, line: 99, baseType: !229, size: 64, offset: 9344)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !346, file: !347, line: 100, baseType: !229, size: 64, offset: 9408)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !346, file: !347, line: 101, baseType: !229, size: 64, offset: 9472)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !346, file: !347, line: 102, baseType: !229, size: 64, offset: 9536)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !346, file: !347, line: 103, baseType: !229, size: 64, offset: 9600)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "stol", scope: !346, file: !347, line: 104, baseType: !229, size: 64, offset: 9664)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "deltatol", scope: !346, file: !347, line: 105, baseType: !229, size: 64, offset: 9728)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "forceiteration", scope: !346, file: !347, line: 106, baseType: !290, size: 32, offset: 9792)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "lagpreconditioner", scope: !346, file: !347, line: 107, baseType: !175, size: 32, offset: 9824)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "lagjacobian", scope: !346, file: !347, line: 108, baseType: !175, size: 32, offset: 9856)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "jac_iter", scope: !346, file: !347, line: 109, baseType: !175, size: 32, offset: 9888)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "lagjac_persist", scope: !346, file: !347, line: 110, baseType: !290, size: 32, offset: 9920)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "pre_iter", scope: !346, file: !347, line: 111, baseType: !175, size: 32, offset: 9952)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "lagpre_persist", scope: !346, file: !347, line: 112, baseType: !290, size: 32, offset: 9984)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "gridsequence", scope: !346, file: !347, line: 113, baseType: !175, size: 32, offset: 10016)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "tolerancesset", scope: !346, file: !347, line: 115, baseType: !290, size: 32, offset: 10048)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_init_set", scope: !346, file: !347, line: 117, baseType: !290, size: 32, offset: 10080)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "normschedule", scope: !346, file: !347, line: 119, baseType: !490, size: 32, offset: 10112)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESNormSchedule", file: !25, line: 411, baseType: !59)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !346, file: !347, line: 120, baseType: !492, size: 32, offset: 10144)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESFunctionType", file: !25, line: 495, baseType: !67)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !346, file: !347, line: 124, baseType: !175, size: 32, offset: 10176)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !346, file: !347, line: 125, baseType: !495, size: 64, offset: 10240)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !346, file: !347, line: 129, baseType: !175, size: 32, offset: 10304)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist", scope: !346, file: !347, line: 130, baseType: !228, size: 64, offset: 10368)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_its", scope: !346, file: !347, line: 132, baseType: !220, size: 64, offset: 10432)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_len", scope: !346, file: !347, line: 133, baseType: !175, size: 32, offset: 10496)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_max", scope: !346, file: !347, line: 134, baseType: !175, size: 32, offset: 10528)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_reset", scope: !346, file: !347, line: 135, baseType: !290, size: 32, offset: 10560)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_alloc", scope: !346, file: !347, line: 136, baseType: !290, size: 32, offset: 10592)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "counters_reset", scope: !346, file: !347, line: 137, baseType: !290, size: 32, offset: 10624)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "numFailures", scope: !346, file: !347, line: 140, baseType: !175, size: 32, offset: 10656)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "maxFailures", scope: !346, file: !347, line: 141, baseType: !175, size: 32, offset: 10688)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "numLinearSolveFailures", scope: !346, file: !347, line: 143, baseType: !175, size: 32, offset: 10720)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "maxLinearSolveFailures", scope: !346, file: !347, line: 144, baseType: !175, size: 32, offset: 10752)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "domainerror", scope: !346, file: !347, line: 146, baseType: !290, size: 32, offset: 10784)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "jacobiandomainerror", scope: !346, file: !347, line: 147, baseType: !290, size: 32, offset: 10816)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "checkjacdomainerror", scope: !346, file: !347, line: 148, baseType: !290, size: 32, offset: 10848)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_ewconv", scope: !346, file: !347, line: 150, baseType: !290, size: 32, offset: 10880)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "kspconvctx", scope: !346, file: !347, line: 151, baseType: !102, size: 64, offset: 10944)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !346, file: !347, line: 154, baseType: !229, size: 64, offset: 11008)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !346, file: !347, line: 155, baseType: !229, size: 64, offset: 11072)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "vwork", scope: !346, file: !347, line: 157, baseType: !495, size: 64, offset: 11136)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "nvwork", scope: !346, file: !347, line: 158, baseType: !175, size: 32, offset: 11200)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !346, file: !347, line: 160, baseType: !290, size: 32, offset: 11232)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "mf_operator", scope: !346, file: !347, line: 161, baseType: !290, size: 32, offset: 11264)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "mf_version", scope: !346, file: !347, line: 162, baseType: !175, size: 32, offset: 11296)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "vizerotolerance", scope: !346, file: !347, line: 164, baseType: !229, size: 64, offset: 11328)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "xl", scope: !346, file: !347, line: 165, baseType: !335, size: 64, offset: 11392)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "xu", scope: !346, file: !347, line: 165, baseType: !335, size: 64, offset: 11456)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ntruebounds", scope: !346, file: !347, line: 166, baseType: !175, size: 32, offset: 11520)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "usersetbounds", scope: !346, file: !347, line: 167, baseType: !290, size: 32, offset: 11552)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "alwayscomputesfinalresidual", scope: !346, file: !347, line: 169, baseType: !290, size: 32, offset: 11584)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "vinorm", scope: !322, file: !117, line: 18, baseType: !527, size: 64, offset: 256)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchVINormFunc", file: !25, line: 553, baseType: !528)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!113, !344, !335, !335, !228}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "postcheck", scope: !322, file: !117, line: 19, baseType: !532, size: 64, offset: 320)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!113, !114, !335, !335, !335, !338, !338, !102}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !322, file: !117, line: 20, baseType: !536, size: 64, offset: 384)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!113, !266, !114}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !322, file: !117, line: 21, baseType: !330, size: 64, offset: 448)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !322, file: !117, line: 22, baseType: !330, size: 64, offset: 512)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !322, file: !117, line: 23, baseType: !330, size: 64, offset: 576)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "snesfunc", scope: !322, file: !117, line: 24, baseType: !398, size: 64, offset: 640)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "snes", scope: !116, file: !117, line: 32, baseType: !344, size: 64, offset: 5184)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !116, file: !117, line: 34, baseType: !102, size: 64, offset: 5248)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !116, file: !117, line: 36, baseType: !290, size: 32, offset: 5312)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !116, file: !117, line: 38, baseType: !335, size: 64, offset: 5376)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_new", scope: !116, file: !117, line: 39, baseType: !335, size: 64, offset: 5440)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !116, file: !117, line: 40, baseType: !335, size: 64, offset: 5504)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_new", scope: !116, file: !117, line: 41, baseType: !335, size: 64, offset: 5568)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "vec_update", scope: !116, file: !117, line: 42, baseType: !335, size: 64, offset: 5632)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !116, file: !117, line: 44, baseType: !175, size: 32, offset: 5696)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !116, file: !117, line: 45, baseType: !495, size: 64, offset: 5760)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !116, file: !117, line: 47, baseType: !229, size: 64, offset: 5824)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "norms", scope: !116, file: !117, line: 49, baseType: !290, size: 32, offset: 5888)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "fnorm", scope: !116, file: !117, line: 50, baseType: !229, size: 64, offset: 5952)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !116, file: !117, line: 51, baseType: !229, size: 64, offset: 6016)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !116, file: !117, line: 52, baseType: !229, size: 64, offset: 6080)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !116, file: !117, line: 53, baseType: !559, size: 32, offset: 6144)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchReason", file: !25, line: 621, baseType: !72)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "keeplambda", scope: !116, file: !117, line: 54, baseType: !290, size: 32, offset: 6176)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !116, file: !117, line: 56, baseType: !229, size: 64, offset: 6208)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "maxstep", scope: !116, file: !117, line: 57, baseType: !229, size: 64, offset: 6272)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "steptol", scope: !116, file: !117, line: 58, baseType: !229, size: 64, offset: 6336)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !116, file: !117, line: 59, baseType: !175, size: 32, offset: 6400)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !116, file: !117, line: 60, baseType: !229, size: 64, offset: 6464)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "atol", scope: !116, file: !117, line: 61, baseType: !229, size: 64, offset: 6528)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "ltol", scope: !116, file: !117, line: 62, baseType: !229, size: 64, offset: 6592)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !116, file: !117, line: 63, baseType: !175, size: 32, offset: 6656)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !116, file: !117, line: 65, baseType: !229, size: 64, offset: 6720)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "precheckctx", scope: !116, file: !117, line: 67, baseType: !102, size: 64, offset: 6784)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "postcheckctx", scope: !116, file: !117, line: 68, baseType: !102, size: 64, offset: 6848)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !116, file: !117, line: 70, baseType: !142, size: 64, offset: 6912)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "monitorftns", scope: !116, file: !117, line: 71, baseType: !574, size: 320, offset: 6976)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 320, elements: !308)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{!113, !114, !102}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !116, file: !117, line: 72, baseType: !450, size: 320, offset: 7296)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !116, file: !117, line: 73, baseType: !316, size: 320, offset: 7616)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !116, file: !117, line: 74, baseType: !175, size: 32, offset: 7936)
!581 = !{!582}
!582 = !DILocalVariable(name: "linesearch", arg: 1, scope: !109, file: !110, line: 87, type: !114)
!583 = !DILocation(line: 0, scope: !109)
!584 = !DILocation(line: 89, column: 3, scope: !585)
!585 = distinct !DILexicalBlock(scope: !586, file: !110, line: 89, column: 3)
!586 = distinct !DILexicalBlock(scope: !587, file: !110, line: 89, column: 3)
!587 = distinct !DILexicalBlock(scope: !109, file: !110, line: 89, column: 3)
!588 = !{!589, !589, i64 0}
!589 = !{!"any pointer", !590, i64 0}
!590 = !{!"omnipotent char", !591, i64 0}
!591 = !{!"Simple C/C++ TBAA"}
!592 = !DILocation(line: 89, column: 3, scope: !586)
!593 = !DILocation(line: 89, column: 3, scope: !594)
!594 = distinct !DILexicalBlock(scope: !595, file: !110, line: 89, column: 3)
!595 = distinct !DILexicalBlock(scope: !585, file: !110, line: 89, column: 3)
!596 = !{!597, !598, i64 1536}
!597 = !{!"", !590, i64 0, !590, i64 512, !590, i64 1024, !590, i64 1280, !598, i64 1536, !598, i64 1540, !590, i64 1544}
!598 = !{!"int", !590, i64 0}
!599 = !DILocation(line: 89, column: 3, scope: !595)
!600 = !DILocation(line: 89, column: 3, scope: !601)
!601 = distinct !DILexicalBlock(scope: !594, file: !110, line: 89, column: 3)
!602 = !{!598, !598, i64 0}
!603 = !{!597, !598, i64 1540}
!604 = !DILocation(line: 96, column: 3, scope: !605)
!605 = distinct !DILexicalBlock(scope: !606, file: !110, line: 96, column: 3)
!606 = distinct !DILexicalBlock(scope: !607, file: !110, line: 96, column: 3)
!607 = distinct !DILexicalBlock(scope: !109, file: !110, line: 96, column: 3)
!608 = !DILocation(line: 90, column: 20, scope: !109)
!609 = !DILocation(line: 90, column: 35, scope: !109)
!610 = !{!611, !589, i64 8}
!611 = !{!"_LineSearchOps", !589, i64 0, !589, i64 8, !589, i64 16, !589, i64 24, !589, i64 32, !589, i64 40, !589, i64 48, !589, i64 56, !589, i64 64, !589, i64 72, !589, i64 80}
!612 = !DILocation(line: 92, column: 20, scope: !109)
!613 = !DILocation(line: 94, column: 20, scope: !109)
!614 = !DILocation(line: 94, column: 35, scope: !109)
!615 = !{!611, !589, i64 0}
!616 = !DILocation(line: 96, column: 3, scope: !606)
!617 = !DILocation(line: 92, column: 35, scope: !109)
!618 = !DILocation(line: 96, column: 3, scope: !619)
!619 = distinct !DILexicalBlock(scope: !620, file: !110, line: 96, column: 3)
!620 = distinct !DILexicalBlock(scope: !605, file: !110, line: 96, column: 3)
!621 = !DILocation(line: 96, column: 3, scope: !620)
!622 = !DILocation(line: 96, column: 3, scope: !623)
!623 = distinct !DILexicalBlock(scope: !624, file: !110, line: 96, column: 3)
!624 = distinct !DILexicalBlock(scope: !619, file: !110, line: 96, column: 3)
!625 = !{!597, !590, i64 1544}
!626 = !DILocation(line: 96, column: 3, scope: !624)
!627 = !DILocation(line: 96, column: 3, scope: !628)
!628 = distinct !DILexicalBlock(scope: !623, file: !110, line: 96, column: 3)
!629 = !DILocation(line: 96, column: 3, scope: !630)
!630 = distinct !DILexicalBlock(scope: !619, file: !110, line: 96, column: 3)
!631 = !DILocation(line: 96, column: 3, scope: !632)
!632 = distinct !DILexicalBlock(scope: !630, file: !110, line: 96, column: 3)
!633 = !DILocation(line: 96, column: 3, scope: !634)
!634 = distinct !DILexicalBlock(scope: !635, file: !110, line: 96, column: 3)
!635 = distinct !DILexicalBlock(scope: !632, file: !110, line: 96, column: 3)
!636 = !DILocation(line: 96, column: 3, scope: !635)
!637 = !DILocation(line: 96, column: 3, scope: !638)
!638 = distinct !DILexicalBlock(scope: !634, file: !110, line: 96, column: 3)
!639 = !DILocation(line: 96, column: 3, scope: !607)
!640 = distinct !DISubprogram(name: "SNESLineSearchApply_Basic", scope: !110, file: !110, line: 4, type: !111, scopeLine: 5, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !641)
