; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/linesearch/impls/bt/linesearchbt.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/linesearch/impls/bt/linesearchbt.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_datatype_t = type opaque
%struct._p_LineSearch = type { %struct._p_PetscObject, [1 x %struct._LineSearchOps], %struct._p_SNES*, i8*, i32, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Vec*, i32, %struct._p_Vec**, double, i32, double, double, double, i32, i32, double, double, double, i32, double, double, double, i32, double, i8*, i8*, %struct._p_PetscViewer*, [5 x i32 (%struct._p_LineSearch*, i8*)*], [5 x i32 (i8**)*], [5 x i8*], i32 }

!65 = !DIEnumerator(name: "SNES_NORM_FINAL_ONLY", value: 3)
!66 = !DIEnumerator(name: "SNES_NORM_INITIAL_FINAL_ONLY", value: 4)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 493, baseType: !26, size: 32, elements: !68)
!68 = !{!69, !70, !71}
!69 = !DIEnumerator(name: "SNES_FUNCTION_DEFAULT", value: -1)
!70 = !DIEnumerator(name: "SNES_FUNCTION_UNPRECONDITIONED", value: 0)
!71 = !DIEnumerator(name: "SNES_FUNCTION_PRECONDITIONED", value: 1)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 616, baseType: !5, size: 32, elements: !73)
!73 = !{!74, !75, !76, !77, !78, !79}
!74 = !DIEnumerator(name: "SNES_LINESEARCH_SUCCEEDED", value: 0, isUnsigned: true)
!75 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_NANORINF", value: 1, isUnsigned: true)
!76 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_DOMAIN", value: 2, isUnsigned: true)
!77 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_REDUCT", value: 3, isUnsigned: true)
!78 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_USER", value: 4, isUnsigned: true)
!79 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_FUNCTION", value: 5, isUnsigned: true)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !81, line: 663, baseType: !5, size: 32, elements: !82)
!81 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!82 = !{!83, !84, !85}
!83 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !87)
!87 = !{!88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105}
!88 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!103 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!104 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!105 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!106 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !107, line: 155, baseType: !5, size: 32, elements: !108)
!107 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!108 = !{!109, !110, !111, !112, !113}
!109 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!110 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!111 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!112 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!113 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!114 = !{!115, !123, !127, !128, !163, !122, !295, !202, !329, !332, !212, !26, !5}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearch_BT", file: !117, line: 6, baseType: !118)
!117 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/snes/linesearch/impls/bt/linesearchbt.c", directory: "/home/users/ndemeye/xSDK")
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 4, size: 64, elements: !119)
!119 = !{!120}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !118, file: !117, line: 5, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !122)
!122 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !124, line: 330, baseType: !125)
!124 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !124, line: 330, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !131, line: 73, size: 4480, elements: !132)
!131 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!132 = !{!133, !135, !184, !185, !187, !189, !190, !191, !192, !200, !201, !203, !207, !211, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !224, !225, !226, !228, !229, !231, !233, !234, !235, !236, !237, !239, !241, !242, !243, !244, !245, !248, !250, !251, !252, !262, !264, !265, !269, !270, !319, !324, !326, !327, !328}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !130, file: !131, line: 74, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !130, file: !131, line: 75, baseType: !136, size: 448, offset: 64)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 448, elements: !182)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !131, line: 53, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !131, line: 45, size: 448, elements: !139)
!139 = !{!140, !146, !154, !159, !166, !170, !177}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !138, file: !131, line: 46, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!144, !128, !145}
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !138, file: !131, line: 47, baseType: !147, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!144, !128, !150}
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !151, line: 16, baseType: !152)
!151 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !151, line: 16, flags: DIFlagFwdDecl)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !138, file: !131, line: 48, baseType: !155, size: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!144, !158}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !138, file: !131, line: 49, baseType: !160, size: 64, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!144, !128, !163, !128}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!165 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !138, file: !131, line: 50, baseType: !167, size: 64, offset: 256)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!144, !128, !163, !158}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !138, file: !131, line: 51, baseType: !171, size: 64, offset: 320)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!144, !128, !163, !174}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{null}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !138, file: !131, line: 52, baseType: !178, size: 64, offset: 384)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!144, !128, !163, !181}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!182 = !{!183}
!183 = !DISubrange(count: 1)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !130, file: !131, line: 76, baseType: !123, size: 64, offset: 512)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !130, file: !131, line: 77, baseType: !186, size: 32, offset: 576)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !130, file: !131, line: 78, baseType: !188, size: 64, offset: 640)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !122)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !130, file: !131, line: 78, baseType: !188, size: 64, offset: 704)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !130, file: !131, line: 78, baseType: !188, size: 64, offset: 768)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !130, file: !131, line: 78, baseType: !188, size: 64, offset: 832)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !130, file: !131, line: 79, baseType: !193, size: 64, offset: 896)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !196, line: 27, baseType: !197)
!196 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !198, line: 43, baseType: !199)
!198 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!199 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !130, file: !131, line: 80, baseType: !186, size: 32, offset: 960)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !130, file: !131, line: 81, baseType: !202, size: 32, offset: 992)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !130, file: !131, line: 82, baseType: !204, size: 64, offset: 1024)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !130, file: !131, line: 83, baseType: !208, size: 64, offset: 1088)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !130, file: !131, line: 84, baseType: !212, size: 64, offset: 1152)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !130, file: !131, line: 85, baseType: !212, size: 64, offset: 1216)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !130, file: !131, line: 86, baseType: !212, size: 64, offset: 1280)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !130, file: !131, line: 87, baseType: !212, size: 64, offset: 1344)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !130, file: !131, line: 88, baseType: !128, size: 64, offset: 1408)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !130, file: !131, line: 89, baseType: !193, size: 64, offset: 1472)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !130, file: !131, line: 90, baseType: !212, size: 64, offset: 1536)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !130, file: !131, line: 91, baseType: !212, size: 64, offset: 1600)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !130, file: !131, line: 92, baseType: !186, size: 32, offset: 1664)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !130, file: !131, line: 93, baseType: !127, size: 64, offset: 1728)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !130, file: !131, line: 94, baseType: !223, size: 64, offset: 1792)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !194)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !130, file: !131, line: 95, baseType: !186, size: 32, offset: 1856)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !130, file: !131, line: 95, baseType: !186, size: 32, offset: 1888)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !130, file: !131, line: 96, baseType: !227, size: 64, offset: 1920)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !130, file: !131, line: 96, baseType: !227, size: 64, offset: 1984)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !130, file: !131, line: 97, baseType: !230, size: 64, offset: 2048)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !130, file: !131, line: 97, baseType: !232, size: 64, offset: 2112)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !130, file: !131, line: 98, baseType: !186, size: 32, offset: 2176)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !130, file: !131, line: 98, baseType: !186, size: 32, offset: 2208)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !130, file: !131, line: 99, baseType: !227, size: 64, offset: 2240)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !130, file: !131, line: 99, baseType: !227, size: 64, offset: 2304)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !130, file: !131, line: 100, baseType: !238, size: 64, offset: 2368)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !130, file: !131, line: 100, baseType: !240, size: 64, offset: 2432)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !130, file: !131, line: 101, baseType: !186, size: 32, offset: 2496)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !130, file: !131, line: 101, baseType: !186, size: 32, offset: 2528)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !130, file: !131, line: 102, baseType: !227, size: 64, offset: 2560)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !130, file: !131, line: 102, baseType: !227, size: 64, offset: 2624)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !130, file: !131, line: 103, baseType: !246, size: 64, offset: 2688)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !121)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !130, file: !131, line: 103, baseType: !249, size: 64, offset: 2752)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !130, file: !131, line: 104, baseType: !181, size: 64, offset: 2816)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !130, file: !131, line: 105, baseType: !186, size: 32, offset: 2880)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !130, file: !131, line: 106, baseType: !253, size: 128, offset: 2944)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 128, elements: !260)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !131, line: 64, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !131, line: 61, size: 128, elements: !257)
!257 = !{!258, !259}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !256, file: !131, line: 62, baseType: !174, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !256, file: !131, line: 63, baseType: !127, size: 64, offset: 64)
!260 = !{!261}
!261 = !DISubrange(count: 2)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !130, file: !131, line: 107, baseType: !263, size: 64, offset: 3072)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 64, elements: !260)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !130, file: !131, line: 108, baseType: !127, size: 64, offset: 3136)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !130, file: !131, line: 109, baseType: !266, size: 64, offset: 3200)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!144, !127}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !130, file: !131, line: 111, baseType: !186, size: 32, offset: 3264)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !130, file: !131, line: 112, baseType: !271, size: 320, offset: 3328)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 320, elements: !317)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!144, !275, !128, !127}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !278)
!278 = !{!279, !280, !305, !306, !307, !308, !309, !310, !311, !312, !313}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !277, file: !10, line: 100, baseType: !186, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !277, file: !10, line: 101, baseType: !281, size: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !284)
!284 = !{!285, !286, !287, !288, !289, !292, !293, !294, !298, !300, !302, !303, !304}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !283, file: !10, line: 84, baseType: !212, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !283, file: !10, line: 85, baseType: !212, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !283, file: !10, line: 86, baseType: !127, size: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !283, file: !10, line: 87, baseType: !204, size: 64, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !283, file: !10, line: 88, baseType: !290, size: 64, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !163)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !283, file: !10, line: 89, baseType: !165, size: 8, offset: 320)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !283, file: !10, line: 90, baseType: !212, size: 64, offset: 384)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !283, file: !10, line: 91, baseType: !295, size: 64, offset: 448)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !296, line: 46, baseType: !297)
!296 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!297 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !283, file: !10, line: 92, baseType: !299, size: 32, offset: 512)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !283, file: !10, line: 93, baseType: !301, size: 32, offset: 544)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !283, file: !10, line: 94, baseType: !281, size: 64, offset: 576)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !283, file: !10, line: 95, baseType: !212, size: 64, offset: 640)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !283, file: !10, line: 96, baseType: !127, size: 64, offset: 704)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !277, file: !10, line: 102, baseType: !212, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !277, file: !10, line: 102, baseType: !212, size: 64, offset: 192)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !277, file: !10, line: 103, baseType: !212, size: 64, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !277, file: !10, line: 104, baseType: !123, size: 64, offset: 320)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !277, file: !10, line: 105, baseType: !299, size: 32, offset: 384)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !277, file: !10, line: 105, baseType: !299, size: 32, offset: 416)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !277, file: !10, line: 105, baseType: !299, size: 32, offset: 448)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !277, file: !10, line: 106, baseType: !128, size: 64, offset: 512)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !277, file: !10, line: 107, baseType: !314, size: 64, offset: 576)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !315)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!317 = !{!318}
!318 = !DISubrange(count: 5)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !130, file: !131, line: 113, baseType: !320, size: 320, offset: 3648)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 320, elements: !317)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!144, !128, !127}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !130, file: !131, line: 114, baseType: !325, size: 320, offset: 3968)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 320, elements: !317)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !130, file: !131, line: 115, baseType: !299, size: 32, offset: 4288)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !130, file: !131, line: 120, baseType: !314, size: 64, offset: 4352)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !130, file: !131, line: 121, baseType: !299, size: 32, offset: 4416)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !124, line: 331, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !124, line: 331, flags: DIFlagFwdDecl)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !124, line: 338, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !124, line: 338, flags: DIFlagFwdDecl)
!335 = !{i32 7, !"Dwarf Version", i32 4}
!336 = !{i32 2, !"Debug Info Version", i32 3}
!337 = !{i32 1, !"wchar_size", i32 4}
!338 = !{i32 7, !"PIC Level", i32 2}
!339 = !{i32 7, !"uwtable", i32 1}
!340 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!341 = distinct !DISubprogram(name: "SNESLineSearchBTSetAlpha", scope: !117, file: !117, line: 19, type: !342, scopeLine: 20, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !614)
!342 = !DISubroutineType(types: !343)
!343 = !{!144, !344, !121}
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearch", file: !25, line: 526, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_LineSearch", file: !347, line: 29, size: 8000, elements: !348)
!347 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/linesearchimpl.h", directory: "/home/users/ndemeye/xSDK")
!348 = !{!349, !351, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !611, !612, !613}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !346, file: !347, line: 30, baseType: !350, size: 4480)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !131, line: 122, baseType: !130)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !346, file: !347, line: 30, baseType: !352, size: 704, offset: 4480)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !353, size: 704, elements: !182)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LineSearchOps", file: !347, line: 13, size: 704, elements: !354)
!354 = !{!355, !359, !364, !372, !559, !564, !568, !572, !573, !574, !575}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !353, file: !347, line: 14, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{!144, !344, !150}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !353, file: !347, line: 15, baseType: !360, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchApplyFunc", file: !25, line: 554, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!144, !344}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "precheck", scope: !353, file: !347, line: 16, baseType: !365, size: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!144, !344, !368, !368, !371, !127}
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !107, line: 21, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !107, line: 21, flags: DIFlagFwdDecl)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "viproject", scope: !353, file: !347, line: 17, baseType: !373, size: 64, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchVIProjectFunc", file: !25, line: 552, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!144, !377, !368}
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !25, line: 18, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !380, line: 38, size: 11648, elements: !381)
!380 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/snesimpl.h", directory: "/home/users/ndemeye/xSDK")
!381 = !{!382, !383, !446, !451, !452, !453, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !469, !470, !471, !473, !474, !475, !476, !477, !482, !484, !485, !486, !487, !488, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !524, !526, !527, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !379, file: !380, line: 39, baseType: !350, size: 4480)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !379, file: !380, line: 39, baseType: !384, size: 1088, offset: 4480)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 1088, elements: !182)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SNESOps", file: !380, line: 12, size: 1088, elements: !386)
!386 = !{!387, !391, !395, !399, !405, !406, !410, !411, !415, !419, !420, !421, !426, !430, !434, !438, !445}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "computeinitialguess", scope: !385, file: !380, line: 13, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!144, !377, !368, !127}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "computescaling", scope: !385, file: !380, line: 14, baseType: !392, size: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!144, !368, !368, !127}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !385, file: !380, line: 15, baseType: !396, size: 64, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!144, !377, !186}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !385, file: !380, line: 16, baseType: !400, size: 64, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!144, !377, !186, !121, !121, !121, !403, !127}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESConvergedReason", file: !25, line: 257, baseType: !24)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !385, file: !380, line: 17, baseType: !266, size: 64, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !385, file: !380, line: 18, baseType: !407, size: 64, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!144, !377}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !385, file: !380, line: 19, baseType: !407, size: 64, offset: 384)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !385, file: !380, line: 20, baseType: !412, size: 64, offset: 448)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!144, !377, !150}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !385, file: !380, line: 21, baseType: !416, size: 64, offset: 512)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!144, !275, !377}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !385, file: !380, line: 22, baseType: !407, size: 64, offset: 576)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !385, file: !380, line: 23, baseType: !407, size: 64, offset: 640)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "usercompute", scope: !385, file: !380, line: 24, baseType: !422, size: 64, offset: 704)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!144, !377, !425}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "userdestroy", scope: !385, file: !380, line: 25, baseType: !427, size: 64, offset: 768)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!144, !425}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !385, file: !380, line: 26, baseType: !431, size: 64, offset: 832)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!144, !377, !368, !368}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "computepfunction", scope: !385, file: !380, line: 27, baseType: !435, size: 64, offset: 896)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!144, !377, !368, !368, !127}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "computepjacobian", scope: !385, file: !380, line: 28, baseType: !439, size: 64, offset: 960)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!144, !377, !368, !442, !442, !127}
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !53, line: 16, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !53, line: 16, flags: DIFlagFwdDecl)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !385, file: !380, line: 29, baseType: !412, size: 64, offset: 1024)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !379, file: !380, line: 40, baseType: !447, size: 64, offset: 5568)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !448, line: 14, baseType: !449)
!448 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !448, line: 14, flags: DIFlagFwdDecl)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !379, file: !380, line: 41, baseType: !299, size: 32, offset: 5632)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "npc", scope: !379, file: !380, line: 42, baseType: !377, size: 64, offset: 5696)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "npcside", scope: !379, file: !380, line: 43, baseType: !454, size: 32, offset: 5760)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !46, line: 85, baseType: !45)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "usesnpc", scope: !379, file: !380, line: 44, baseType: !299, size: 32, offset: 5792)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !379, file: !380, line: 47, baseType: !127, size: 64, offset: 5824)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !379, file: !380, line: 49, baseType: !368, size: 64, offset: 5888)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !379, file: !380, line: 50, baseType: !368, size: 64, offset: 5952)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !379, file: !380, line: 52, baseType: !368, size: 64, offset: 6016)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !379, file: !380, line: 54, baseType: !442, size: 64, offset: 6080)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !379, file: !380, line: 55, baseType: !442, size: 64, offset: 6144)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "picard", scope: !379, file: !380, line: 56, baseType: !442, size: 64, offset: 6208)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "initialguessP", scope: !379, file: !380, line: 57, baseType: !127, size: 64, offset: 6272)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !379, file: !380, line: 58, baseType: !465, size: 64, offset: 6336)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !466, line: 22, baseType: !467)
!466 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !466, line: 22, flags: DIFlagFwdDecl)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !379, file: !380, line: 59, baseType: !344, size: 64, offset: 6400)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "usesksp", scope: !379, file: !380, line: 60, baseType: !299, size: 32, offset: 6464)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "matstruct", scope: !379, file: !380, line: 61, baseType: !472, size: 32, offset: 6496)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !53, line: 285, baseType: !52)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_update", scope: !379, file: !380, line: 63, baseType: !368, size: 64, offset: 6528)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "scaling", scope: !379, file: !380, line: 65, baseType: !368, size: 64, offset: 6592)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "scaP", scope: !379, file: !380, line: 66, baseType: !127, size: 64, offset: 6656)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !379, file: !380, line: 68, baseType: !121, size: 64, offset: 6720)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !379, file: !380, line: 74, baseType: !478, size: 320, offset: 6784)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !479, size: 320, elements: !317)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!144, !377, !186, !121, !127}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !379, file: !380, line: 75, baseType: !483, size: 320, offset: 7104)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 320, elements: !317)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !379, file: !380, line: 76, baseType: !325, size: 320, offset: 7424)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !379, file: !380, line: 77, baseType: !186, size: 32, offset: 7744)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !379, file: !380, line: 78, baseType: !127, size: 64, offset: 7808)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !379, file: !380, line: 79, baseType: !404, size: 32, offset: 7872)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !379, file: !380, line: 80, baseType: !489, size: 320, offset: 7936)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 320, elements: !317)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{!144, !377, !127}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !379, file: !380, line: 81, baseType: !483, size: 320, offset: 8256)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !379, file: !380, line: 82, baseType: !325, size: 320, offset: 8576)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !379, file: !380, line: 83, baseType: !186, size: 32, offset: 8896)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !379, file: !380, line: 84, baseType: !299, size: 32, offset: 8928)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !379, file: !380, line: 88, baseType: !299, size: 32, offset: 8960)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !379, file: !380, line: 89, baseType: !127, size: 64, offset: 9024)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !379, file: !380, line: 93, baseType: !186, size: 32, offset: 9088)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !379, file: !380, line: 94, baseType: !186, size: 32, offset: 9120)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !379, file: !380, line: 95, baseType: !186, size: 32, offset: 9152)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !379, file: !380, line: 96, baseType: !186, size: 32, offset: 9184)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "linear_its", scope: !379, file: !380, line: 97, baseType: !186, size: 32, offset: 9216)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !379, file: !380, line: 98, baseType: !121, size: 64, offset: 9280)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !379, file: !380, line: 99, baseType: !121, size: 64, offset: 9344)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !379, file: !380, line: 100, baseType: !121, size: 64, offset: 9408)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !379, file: !380, line: 101, baseType: !121, size: 64, offset: 9472)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !379, file: !380, line: 102, baseType: !121, size: 64, offset: 9536)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !379, file: !380, line: 103, baseType: !121, size: 64, offset: 9600)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "stol", scope: !379, file: !380, line: 104, baseType: !121, size: 64, offset: 9664)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "deltatol", scope: !379, file: !380, line: 105, baseType: !121, size: 64, offset: 9728)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "forceiteration", scope: !379, file: !380, line: 106, baseType: !299, size: 32, offset: 9792)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "lagpreconditioner", scope: !379, file: !380, line: 107, baseType: !186, size: 32, offset: 9824)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "lagjacobian", scope: !379, file: !380, line: 108, baseType: !186, size: 32, offset: 9856)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "jac_iter", scope: !379, file: !380, line: 109, baseType: !186, size: 32, offset: 9888)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "lagjac_persist", scope: !379, file: !380, line: 110, baseType: !299, size: 32, offset: 9920)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "pre_iter", scope: !379, file: !380, line: 111, baseType: !186, size: 32, offset: 9952)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "lagpre_persist", scope: !379, file: !380, line: 112, baseType: !299, size: 32, offset: 9984)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "gridsequence", scope: !379, file: !380, line: 113, baseType: !186, size: 32, offset: 10016)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "tolerancesset", scope: !379, file: !380, line: 115, baseType: !299, size: 32, offset: 10048)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_init_set", scope: !379, file: !380, line: 117, baseType: !299, size: 32, offset: 10080)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "normschedule", scope: !379, file: !380, line: 119, baseType: !523, size: 32, offset: 10112)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESNormSchedule", file: !25, line: 411, baseType: !59)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !379, file: !380, line: 120, baseType: !525, size: 32, offset: 10144)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESFunctionType", file: !25, line: 495, baseType: !67)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !379, file: !380, line: 124, baseType: !186, size: 32, offset: 10176)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !379, file: !380, line: 125, baseType: !528, size: 64, offset: 10240)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !379, file: !380, line: 129, baseType: !186, size: 32, offset: 10304)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist", scope: !379, file: !380, line: 130, baseType: !238, size: 64, offset: 10368)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_its", scope: !379, file: !380, line: 132, baseType: !230, size: 64, offset: 10432)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_len", scope: !379, file: !380, line: 133, baseType: !186, size: 32, offset: 10496)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_max", scope: !379, file: !380, line: 134, baseType: !186, size: 32, offset: 10528)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_reset", scope: !379, file: !380, line: 135, baseType: !299, size: 32, offset: 10560)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_alloc", scope: !379, file: !380, line: 136, baseType: !299, size: 32, offset: 10592)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "counters_reset", scope: !379, file: !380, line: 137, baseType: !299, size: 32, offset: 10624)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "numFailures", scope: !379, file: !380, line: 140, baseType: !186, size: 32, offset: 10656)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "maxFailures", scope: !379, file: !380, line: 141, baseType: !186, size: 32, offset: 10688)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "numLinearSolveFailures", scope: !379, file: !380, line: 143, baseType: !186, size: 32, offset: 10720)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "maxLinearSolveFailures", scope: !379, file: !380, line: 144, baseType: !186, size: 32, offset: 10752)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "domainerror", scope: !379, file: !380, line: 146, baseType: !299, size: 32, offset: 10784)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "jacobiandomainerror", scope: !379, file: !380, line: 147, baseType: !299, size: 32, offset: 10816)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "checkjacdomainerror", scope: !379, file: !380, line: 148, baseType: !299, size: 32, offset: 10848)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_ewconv", scope: !379, file: !380, line: 150, baseType: !299, size: 32, offset: 10880)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "kspconvctx", scope: !379, file: !380, line: 151, baseType: !127, size: 64, offset: 10944)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !379, file: !380, line: 154, baseType: !121, size: 64, offset: 11008)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !379, file: !380, line: 155, baseType: !121, size: 64, offset: 11072)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "vwork", scope: !379, file: !380, line: 157, baseType: !528, size: 64, offset: 11136)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "nvwork", scope: !379, file: !380, line: 158, baseType: !186, size: 32, offset: 11200)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !379, file: !380, line: 160, baseType: !299, size: 32, offset: 11232)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "mf_operator", scope: !379, file: !380, line: 161, baseType: !299, size: 32, offset: 11264)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "mf_version", scope: !379, file: !380, line: 162, baseType: !186, size: 32, offset: 11296)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "vizerotolerance", scope: !379, file: !380, line: 164, baseType: !121, size: 64, offset: 11328)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "xl", scope: !379, file: !380, line: 165, baseType: !368, size: 64, offset: 11392)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "xu", scope: !379, file: !380, line: 165, baseType: !368, size: 64, offset: 11456)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ntruebounds", scope: !379, file: !380, line: 166, baseType: !186, size: 32, offset: 11520)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "usersetbounds", scope: !379, file: !380, line: 167, baseType: !299, size: 32, offset: 11552)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "alwayscomputesfinalresidual", scope: !379, file: !380, line: 169, baseType: !299, size: 32, offset: 11584)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "vinorm", scope: !353, file: !347, line: 18, baseType: !560, size: 64, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchVINormFunc", file: !25, line: 553, baseType: !561)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DISubroutineType(types: !563)
!563 = !{!144, !377, !368, !368, !238}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "postcheck", scope: !353, file: !347, line: 19, baseType: !565, size: 64, offset: 320)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{!144, !344, !368, !368, !368, !371, !371, !127}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !353, file: !347, line: 20, baseType: !569, size: 64, offset: 384)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{!144, !275, !344}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !353, file: !347, line: 21, baseType: !361, size: 64, offset: 448)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !353, file: !347, line: 22, baseType: !361, size: 64, offset: 512)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !353, file: !347, line: 23, baseType: !361, size: 64, offset: 576)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "snesfunc", scope: !353, file: !347, line: 24, baseType: !431, size: 64, offset: 640)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "snes", scope: !346, file: !347, line: 32, baseType: !377, size: 64, offset: 5184)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !346, file: !347, line: 34, baseType: !127, size: 64, offset: 5248)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !346, file: !347, line: 36, baseType: !299, size: 32, offset: 5312)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !346, file: !347, line: 38, baseType: !368, size: 64, offset: 5376)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_new", scope: !346, file: !347, line: 39, baseType: !368, size: 64, offset: 5440)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !346, file: !347, line: 40, baseType: !368, size: 64, offset: 5504)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_new", scope: !346, file: !347, line: 41, baseType: !368, size: 64, offset: 5568)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "vec_update", scope: !346, file: !347, line: 42, baseType: !368, size: 64, offset: 5632)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !346, file: !347, line: 44, baseType: !186, size: 32, offset: 5696)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !346, file: !347, line: 45, baseType: !528, size: 64, offset: 5760)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !346, file: !347, line: 47, baseType: !121, size: 64, offset: 5824)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "norms", scope: !346, file: !347, line: 49, baseType: !299, size: 32, offset: 5888)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "fnorm", scope: !346, file: !347, line: 50, baseType: !121, size: 64, offset: 5952)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !346, file: !347, line: 51, baseType: !121, size: 64, offset: 6016)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !346, file: !347, line: 52, baseType: !121, size: 64, offset: 6080)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !346, file: !347, line: 53, baseType: !592, size: 32, offset: 6144)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchReason", file: !25, line: 621, baseType: !72)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "keeplambda", scope: !346, file: !347, line: 54, baseType: !299, size: 32, offset: 6176)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !346, file: !347, line: 56, baseType: !121, size: 64, offset: 6208)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "maxstep", scope: !346, file: !347, line: 57, baseType: !121, size: 64, offset: 6272)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "steptol", scope: !346, file: !347, line: 58, baseType: !121, size: 64, offset: 6336)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !346, file: !347, line: 59, baseType: !186, size: 32, offset: 6400)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !346, file: !347, line: 60, baseType: !121, size: 64, offset: 6464)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "atol", scope: !346, file: !347, line: 61, baseType: !121, size: 64, offset: 6528)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ltol", scope: !346, file: !347, line: 62, baseType: !121, size: 64, offset: 6592)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !346, file: !347, line: 63, baseType: !186, size: 32, offset: 6656)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !346, file: !347, line: 65, baseType: !121, size: 64, offset: 6720)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "precheckctx", scope: !346, file: !347, line: 67, baseType: !127, size: 64, offset: 6784)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "postcheckctx", scope: !346, file: !347, line: 68, baseType: !127, size: 64, offset: 6848)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !346, file: !347, line: 70, baseType: !150, size: 64, offset: 6912)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "monitorftns", scope: !346, file: !347, line: 71, baseType: !607, size: 320, offset: 6976)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !608, size: 320, elements: !317)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!144, !344, !127}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !346, file: !347, line: 72, baseType: !483, size: 320, offset: 7296)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !346, file: !347, line: 73, baseType: !325, size: 320, offset: 7616)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !346, file: !347, line: 74, baseType: !186, size: 32, offset: 7936)
!614 = !{!615, !616, !617}
!615 = !DILocalVariable(name: "linesearch", arg: 1, scope: !341, file: !117, line: 19, type: !344)
!616 = !DILocalVariable(name: "alpha", arg: 2, scope: !341, file: !117, line: 19, type: !121)
!617 = !DILocalVariable(name: "bt", scope: !341, file: !117, line: 21, type: !115)
!618 = !DILocation(line: 0, scope: !341)
!619 = !DILocation(line: 21, column: 59, scope: !341)
!620 = !{!621, !626, i64 656}
!621 = !{!"_p_LineSearch", !622, i64 0, !624, i64 560, !626, i64 648, !626, i64 656, !624, i64 664, !626, i64 672, !626, i64 680, !626, i64 688, !626, i64 696, !626, i64 704, !623, i64 712, !626, i64 720, !627, i64 728, !624, i64 736, !627, i64 744, !627, i64 752, !627, i64 760, !624, i64 768, !624, i64 772, !627, i64 776, !627, i64 784, !627, i64 792, !623, i64 800, !627, i64 808, !627, i64 816, !627, i64 824, !623, i64 832, !627, i64 840, !626, i64 848, !626, i64 856, !626, i64 864, !624, i64 872, !624, i64 912, !624, i64 952, !623, i64 992}
!622 = !{!"_p_PetscObject", !623, i64 0, !624, i64 8, !626, i64 64, !623, i64 72, !627, i64 80, !627, i64 88, !627, i64 96, !627, i64 104, !628, i64 112, !623, i64 120, !623, i64 124, !626, i64 128, !626, i64 136, !626, i64 144, !626, i64 152, !626, i64 160, !626, i64 168, !626, i64 176, !628, i64 184, !626, i64 192, !626, i64 200, !623, i64 208, !626, i64 216, !628, i64 224, !623, i64 232, !623, i64 236, !626, i64 240, !626, i64 248, !626, i64 256, !626, i64 264, !623, i64 272, !623, i64 276, !626, i64 280, !626, i64 288, !626, i64 296, !626, i64 304, !623, i64 312, !623, i64 316, !626, i64 320, !626, i64 328, !626, i64 336, !626, i64 344, !626, i64 352, !623, i64 360, !624, i64 368, !624, i64 384, !626, i64 392, !626, i64 400, !623, i64 408, !624, i64 416, !624, i64 456, !624, i64 496, !624, i64 536, !626, i64 544, !624, i64 552}
!623 = !{!"int", !624, i64 0}
!624 = !{!"omnipotent char", !625, i64 0}
!625 = !{!"Simple C/C++ TBAA"}
!626 = !{!"any pointer", !624, i64 0}
!627 = !{!"double", !624, i64 0}
!628 = !{!"long", !624, i64 0}
!629 = !DILocation(line: 23, column: 3, scope: !630)
!630 = distinct !DILexicalBlock(scope: !631, file: !117, line: 23, column: 3)
!631 = distinct !DILexicalBlock(scope: !632, file: !117, line: 23, column: 3)
!632 = distinct !DILexicalBlock(scope: !341, file: !117, line: 23, column: 3)
!633 = !{!626, !626, i64 0}
!634 = !DILocation(line: 23, column: 3, scope: !631)
!635 = !DILocation(line: 23, column: 3, scope: !636)
!636 = distinct !DILexicalBlock(scope: !637, file: !117, line: 23, column: 3)
!637 = distinct !DILexicalBlock(scope: !630, file: !117, line: 23, column: 3)
!638 = !{!639, !623, i64 1536}
!639 = !{!"", !624, i64 0, !624, i64 512, !624, i64 1024, !624, i64 1280, !623, i64 1536, !623, i64 1540, !624, i64 1544}
!640 = !DILocation(line: 23, column: 3, scope: !637)
!641 = !DILocation(line: 23, column: 3, scope: !642)
!642 = distinct !DILexicalBlock(scope: !636, file: !117, line: 23, column: 3)
!643 = !{!623, !623, i64 0}
!644 = !{!639, !623, i64 1540}
!645 = !DILocation(line: 24, column: 3, scope: !646)
!646 = distinct !DILexicalBlock(scope: !647, file: !117, line: 24, column: 3)
!647 = distinct !DILexicalBlock(scope: !341, file: !117, line: 24, column: 3)
!648 = !DILocation(line: 24, column: 3, scope: !647)
!649 = !DILocation(line: 24, column: 3, scope: !650)
!650 = distinct !DILexicalBlock(scope: !647, file: !117, line: 24, column: 3)
!651 = !{!622, !623, i64 0}
!652 = !DILocation(line: 24, column: 3, scope: !653)
!653 = distinct !DILexicalBlock(scope: !654, file: !117, line: 24, column: 3)
!654 = distinct !DILexicalBlock(scope: !650, file: !117, line: 24, column: 3)
!655 = !DILocation(line: 24, column: 3, scope: !654)
!656 = !DILocation(line: 25, column: 7, scope: !341)
!657 = !DILocation(line: 25, column: 13, scope: !341)
!658 = !{!659, !627, i64 0}
!659 = !{!"", !627, i64 0}
