; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/bound/impls/bqnk/bqnk.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/bound/impls/bqnk/bqnk.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque

!392 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!393 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!394 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!395 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!396 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!397 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!398 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!399 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!400 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!401 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!402 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!403 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!404 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!405 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!406 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!407 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!408 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!409 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!410 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!411 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!412 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!413 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!414 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!415 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!416 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!417 = !{!418, !2045, !2054, !452, !533, !449, !2096, !473, !608}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "TAO_BNK", file: !420, line: 209, baseType: !421)
!420 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/tao/bound/impls/bnk/bnk.h", directory: "/home/users/ndemeye/xSDK")
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !420, line: 10, size: 5888, elements: !422)
!422 = !{!423, !1868, !1874, !1875, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1986, !1987, !1988, !1989, !1990, !1991, !1992, !1993, !1994, !1995, !1996, !1997, !1998, !1999, !2000, !2001, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "computehessian", scope: !421, file: !420, line: 15, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!427, !428}
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !93)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tao", file: !316, line: 118, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Tao", file: !431, line: 45, size: 14656, elements: !432)
!431 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/taoimpl.h", directory: "/home/users/ndemeye/xSDK")
!432 = !{!433, !642, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1740, !1746, !1748, !1749, !1750, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1821, !1822, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !430, file: !431, line: 46, baseType: !434, size: 4480)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !435, line: 122, baseType: !436)
!435 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !435, line: 73, size: 4480, elements: !437)
!437 = !{!438, !440, !494, !495, !497, !500, !501, !502, !503, !511, !512, !514, !518, !522, !524, !525, !526, !527, !528, !529, !530, !531, !532, !534, !536, !537, !538, !540, !541, !543, !545, !546, !547, !548, !549, !552, !554, !555, !556, !557, !558, !561, !563, !564, !565, !575, !577, !578, !582, !583, !632, !637, !639, !640, !641}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !436, file: !435, line: 74, baseType: !439, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !93)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !436, file: !435, line: 75, baseType: !441, size: 448, offset: 64)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 448, elements: !492)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !435, line: 53, baseType: !443)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !435, line: 45, size: 448, elements: !444)
!444 = !{!445, !456, !464, !469, !476, !480, !487}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !443, file: !435, line: 46, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!427, !449, !451}
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !450)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !453, line: 330, baseType: !454)
!453 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !453, line: 330, flags: DIFlagFwdDecl)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !443, file: !435, line: 47, baseType: !457, size: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!427, !449, !460}
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !461, line: 16, baseType: !462)
!461 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !461, line: 16, flags: DIFlagFwdDecl)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !443, file: !435, line: 48, baseType: !465, size: 64, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!427, !468}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !443, file: !435, line: 49, baseType: !470, size: 64, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!427, !449, !473, !449}
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !475)
!475 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !443, file: !435, line: 50, baseType: !477, size: 64, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!427, !449, !473, !468}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !443, file: !435, line: 51, baseType: !481, size: 64, offset: 320)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!427, !449, !473, !484}
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{null}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !443, file: !435, line: 52, baseType: !488, size: 64, offset: 384)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!427, !449, !473, !491}
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!492 = !{!493}
!493 = !DISubrange(count: 1)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !436, file: !435, line: 76, baseType: !452, size: 64, offset: 512)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !436, file: !435, line: 77, baseType: !496, size: 32, offset: 576)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !93)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !436, file: !435, line: 78, baseType: !498, size: 64, offset: 640)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !499)
!499 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !436, file: !435, line: 78, baseType: !498, size: 64, offset: 704)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !436, file: !435, line: 78, baseType: !498, size: 64, offset: 768)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !436, file: !435, line: 78, baseType: !498, size: 64, offset: 832)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !436, file: !435, line: 79, baseType: !504, size: 64, offset: 896)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !505)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !507, line: 27, baseType: !508)
!507 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !509, line: 43, baseType: !510)
!509 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!510 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !436, file: !435, line: 80, baseType: !496, size: 32, offset: 960)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !436, file: !435, line: 81, baseType: !513, size: 32, offset: 992)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !93)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !436, file: !435, line: 82, baseType: !515, size: 64, offset: 1024)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !436, file: !435, line: 83, baseType: !519, size: 64, offset: 1088)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !520)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !436, file: !435, line: 84, baseType: !523, size: 64, offset: 1152)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !436, file: !435, line: 85, baseType: !523, size: 64, offset: 1216)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !436, file: !435, line: 86, baseType: !523, size: 64, offset: 1280)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !436, file: !435, line: 87, baseType: !523, size: 64, offset: 1344)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !436, file: !435, line: 88, baseType: !449, size: 64, offset: 1408)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !436, file: !435, line: 89, baseType: !504, size: 64, offset: 1472)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !436, file: !435, line: 90, baseType: !523, size: 64, offset: 1536)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !436, file: !435, line: 91, baseType: !523, size: 64, offset: 1600)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !436, file: !435, line: 92, baseType: !496, size: 32, offset: 1664)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !436, file: !435, line: 93, baseType: !533, size: 64, offset: 1728)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !436, file: !435, line: 94, baseType: !535, size: 64, offset: 1792)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !505)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !436, file: !435, line: 95, baseType: !496, size: 32, offset: 1856)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !436, file: !435, line: 95, baseType: !496, size: 32, offset: 1888)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !436, file: !435, line: 96, baseType: !539, size: 64, offset: 1920)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !436, file: !435, line: 96, baseType: !539, size: 64, offset: 1984)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !436, file: !435, line: 97, baseType: !542, size: 64, offset: 2048)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !436, file: !435, line: 97, baseType: !544, size: 64, offset: 2112)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !436, file: !435, line: 98, baseType: !496, size: 32, offset: 2176)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !436, file: !435, line: 98, baseType: !496, size: 32, offset: 2208)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !436, file: !435, line: 99, baseType: !539, size: 64, offset: 2240)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !436, file: !435, line: 99, baseType: !539, size: 64, offset: 2304)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !436, file: !435, line: 100, baseType: !550, size: 64, offset: 2368)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !499)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !436, file: !435, line: 100, baseType: !553, size: 64, offset: 2432)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !436, file: !435, line: 101, baseType: !496, size: 32, offset: 2496)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !436, file: !435, line: 101, baseType: !496, size: 32, offset: 2528)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !436, file: !435, line: 102, baseType: !539, size: 64, offset: 2560)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !436, file: !435, line: 102, baseType: !539, size: 64, offset: 2624)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !436, file: !435, line: 103, baseType: !559, size: 64, offset: 2688)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !551)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !436, file: !435, line: 103, baseType: !562, size: 64, offset: 2752)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !436, file: !435, line: 104, baseType: !491, size: 64, offset: 2816)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !436, file: !435, line: 105, baseType: !496, size: 32, offset: 2880)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !436, file: !435, line: 106, baseType: !566, size: 128, offset: 2944)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 128, elements: !573)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !435, line: 64, baseType: !569)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !435, line: 61, size: 128, elements: !570)
!570 = !{!571, !572}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !569, file: !435, line: 62, baseType: !484, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !569, file: !435, line: 63, baseType: !533, size: 64, offset: 64)
!573 = !{!574}
!574 = !DISubrange(count: 2)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !436, file: !435, line: 107, baseType: !576, size: 64, offset: 3072)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !496, size: 64, elements: !573)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !436, file: !435, line: 108, baseType: !533, size: 64, offset: 3136)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !436, file: !435, line: 109, baseType: !579, size: 64, offset: 3200)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!427, !533}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !436, file: !435, line: 111, baseType: !496, size: 32, offset: 3264)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !436, file: !435, line: 112, baseType: !584, size: 320, offset: 3328)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 320, elements: !630)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{!427, !588, !449, !533}
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !591)
!591 = !{!592, !593, !618, !619, !620, !621, !622, !623, !624, !625, !626}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !590, file: !12, line: 100, baseType: !496, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !590, file: !12, line: 101, baseType: !594, size: 64, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !597)
!597 = !{!598, !599, !600, !601, !602, !605, !606, !607, !611, !613, !615, !616, !617}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !596, file: !12, line: 84, baseType: !523, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !596, file: !12, line: 85, baseType: !523, size: 64, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !596, file: !12, line: 86, baseType: !533, size: 64, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !596, file: !12, line: 87, baseType: !515, size: 64, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !596, file: !12, line: 88, baseType: !603, size: 64, offset: 256)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !596, file: !12, line: 89, baseType: !475, size: 8, offset: 320)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !596, file: !12, line: 90, baseType: !523, size: 64, offset: 384)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !596, file: !12, line: 91, baseType: !608, size: 64, offset: 448)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !609, line: 46, baseType: !610)
!609 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!610 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !596, file: !12, line: 92, baseType: !612, size: 32, offset: 512)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !596, file: !12, line: 93, baseType: !614, size: 32, offset: 544)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !596, file: !12, line: 94, baseType: !594, size: 64, offset: 576)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !596, file: !12, line: 95, baseType: !523, size: 64, offset: 640)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !596, file: !12, line: 96, baseType: !533, size: 64, offset: 704)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !590, file: !12, line: 102, baseType: !523, size: 64, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !590, file: !12, line: 102, baseType: !523, size: 64, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !590, file: !12, line: 103, baseType: !523, size: 64, offset: 256)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !590, file: !12, line: 104, baseType: !452, size: 64, offset: 320)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !590, file: !12, line: 105, baseType: !612, size: 32, offset: 384)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !590, file: !12, line: 105, baseType: !612, size: 32, offset: 416)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !590, file: !12, line: 105, baseType: !612, size: 32, offset: 448)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !590, file: !12, line: 106, baseType: !449, size: 64, offset: 512)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !590, file: !12, line: 107, baseType: !627, size: 64, offset: 576)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!630 = !{!631}
!631 = !DISubrange(count: 5)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !436, file: !435, line: 113, baseType: !633, size: 320, offset: 3648)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !634, size: 320, elements: !630)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!427, !449, !533}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !436, file: !435, line: 114, baseType: !638, size: 320, offset: 3968)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !533, size: 320, elements: !630)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !436, file: !435, line: 115, baseType: !612, size: 32, offset: 4288)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !436, file: !435, line: 120, baseType: !627, size: 64, offset: 4352)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !436, file: !435, line: 121, baseType: !612, size: 32, offset: 4416)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !430, file: !431, line: 46, baseType: !643, size: 1536, offset: 4480)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !644, size: 1536, elements: !492)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TaoOps", file: !431, line: 13, size: 1536, elements: !645)
!645 = !{!646, !950, !954, !958, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1688, !1692, !1693, !1694, !1695, !1699, !1703, !1704, !1708, !1709, !1710, !1714, !1718}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !644, file: !431, line: 15, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!427, !428, !650, !550, !533}
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !27, line: 21, baseType: !651)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !653, line: 142, size: 12800, elements: !654)
!653 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!654 = !{!655, !656, !876, !896, !897, !898, !944, !945, !946, !947, !949}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !652, file: !653, line: 143, baseType: !434, size: 4480)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !652, file: !653, line: 143, baseType: !657, size: 5248, offset: 4480)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !658, size: 5248, elements: !492)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !653, line: 23, size: 5248, elements: !659)
!659 = !{!660, !665, !670, !674, !678, !684, !689, !690, !691, !695, !699, !700, !701, !705, !709, !715, !716, !720, !724, !728, !729, !736, !740, !741, !745, !749, !750, !751, !755, !756, !763, !768, !769, !770, !774, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !795, !796, !797, !801, !805, !806, !807, !808, !812, !813, !814, !815, !816, !817, !818, !822, !823, !827, !834, !835, !840, !841, !845, !846, !847, !848, !849, !850, !851, !852, !856, !857, !858, !864, !868, !869, !870}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !658, file: !653, line: 24, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!427, !650, !664}
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !658, file: !653, line: 25, baseType: !666, size: 64, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!427, !650, !496, !669}
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !658, file: !653, line: 26, baseType: !671, size: 64, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!427, !496, !664}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !658, file: !653, line: 27, baseType: !675, size: 64, offset: 192)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!427, !650, !650, !559}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !658, file: !653, line: 28, baseType: !679, size: 64, offset: 256)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!427, !650, !496, !682, !559}
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !650)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !658, file: !653, line: 29, baseType: !685, size: 64, offset: 320)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DISubroutineType(types: !687)
!687 = !{!427, !650, !688, !550}
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !27, line: 155, baseType: !26)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !658, file: !653, line: 30, baseType: !675, size: 64, offset: 384)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !658, file: !653, line: 31, baseType: !679, size: 64, offset: 448)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !658, file: !653, line: 32, baseType: !692, size: 64, offset: 512)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!427, !650, !560}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !658, file: !653, line: 33, baseType: !696, size: 64, offset: 576)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!427, !650, !650}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !658, file: !653, line: 34, baseType: !692, size: 64, offset: 640)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !658, file: !653, line: 35, baseType: !696, size: 64, offset: 704)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !658, file: !653, line: 36, baseType: !702, size: 64, offset: 768)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!427, !650, !560, !650}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !658, file: !653, line: 37, baseType: !706, size: 64, offset: 832)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!427, !650, !560, !560, !650}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !658, file: !653, line: 38, baseType: !710, size: 64, offset: 896)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!427, !650, !496, !713, !664}
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !560)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !658, file: !653, line: 39, baseType: !702, size: 64, offset: 960)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !658, file: !653, line: 40, baseType: !717, size: 64, offset: 1024)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{!427, !650, !560, !650, !650}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !658, file: !653, line: 41, baseType: !721, size: 64, offset: 1088)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{!427, !650, !560, !560, !560, !650, !650}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !658, file: !653, line: 42, baseType: !725, size: 64, offset: 1152)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{!427, !650, !650, !650}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !658, file: !653, line: 43, baseType: !725, size: 64, offset: 1216)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !658, file: !653, line: 44, baseType: !730, size: 64, offset: 1280)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!427, !650, !496, !733, !713, !735}
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !496)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !34)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !658, file: !653, line: 45, baseType: !737, size: 64, offset: 1344)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!427, !650}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !658, file: !653, line: 46, baseType: !737, size: 64, offset: 1408)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !658, file: !653, line: 47, baseType: !742, size: 64, offset: 1472)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!427, !650, !562}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !658, file: !653, line: 48, baseType: !746, size: 64, offset: 1536)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!427, !650, !542}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !658, file: !653, line: 49, baseType: !746, size: 64, offset: 1600)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !658, file: !653, line: 50, baseType: !742, size: 64, offset: 1664)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !658, file: !653, line: 51, baseType: !752, size: 64, offset: 1728)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{!427, !650, !542, !550}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !658, file: !653, line: 52, baseType: !752, size: 64, offset: 1792)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !658, file: !653, line: 53, baseType: !757, size: 64, offset: 1856)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{!427, !650, !760}
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !761)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !658, file: !653, line: 54, baseType: !764, size: 64, offset: 1920)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{!427, !650, !767, !612}
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !27, line: 475, baseType: !45)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !658, file: !653, line: 55, baseType: !730, size: 64, offset: 1984)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !658, file: !653, line: 56, baseType: !737, size: 64, offset: 2048)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !658, file: !653, line: 57, baseType: !771, size: 64, offset: 2112)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{!427, !650, !460}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !658, file: !653, line: 58, baseType: !775, size: 64, offset: 2176)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{!427, !650, !713}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !658, file: !653, line: 59, baseType: !775, size: 64, offset: 2240)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !658, file: !653, line: 60, baseType: !675, size: 64, offset: 2304)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !658, file: !653, line: 61, baseType: !675, size: 64, offset: 2368)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !658, file: !653, line: 62, baseType: !685, size: 64, offset: 2432)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !658, file: !653, line: 63, baseType: !679, size: 64, offset: 2496)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !658, file: !653, line: 64, baseType: !679, size: 64, offset: 2560)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !658, file: !653, line: 65, baseType: !771, size: 64, offset: 2624)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !658, file: !653, line: 66, baseType: !737, size: 64, offset: 2688)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !658, file: !653, line: 67, baseType: !737, size: 64, offset: 2752)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !658, file: !653, line: 68, baseType: !788, size: 64, offset: 2816)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{!427, !650, !791}
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !792, line: 30, baseType: !793)
!792 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !792, line: 30, flags: DIFlagFwdDecl)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !658, file: !653, line: 69, baseType: !730, size: 64, offset: 2880)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !658, file: !653, line: 70, baseType: !737, size: 64, offset: 2944)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !658, file: !653, line: 71, baseType: !798, size: 64, offset: 3008)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{!427, !588, !650}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !658, file: !653, line: 72, baseType: !802, size: 64, offset: 3072)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{!427, !650, !650, !550}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !658, file: !653, line: 73, baseType: !725, size: 64, offset: 3136)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !658, file: !653, line: 74, baseType: !725, size: 64, offset: 3200)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !658, file: !653, line: 75, baseType: !725, size: 64, offset: 3264)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !658, file: !653, line: 76, baseType: !809, size: 64, offset: 3328)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!427, !650, !496, !733, !559}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !658, file: !653, line: 77, baseType: !737, size: 64, offset: 3392)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !658, file: !653, line: 78, baseType: !737, size: 64, offset: 3456)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !658, file: !653, line: 79, baseType: !737, size: 64, offset: 3520)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !658, file: !653, line: 80, baseType: !737, size: 64, offset: 3584)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !658, file: !653, line: 81, baseType: !692, size: 64, offset: 3648)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !658, file: !653, line: 82, baseType: !737, size: 64, offset: 3712)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !658, file: !653, line: 83, baseType: !819, size: 64, offset: 3776)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{!427, !650, !496, !650, !735}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !658, file: !653, line: 84, baseType: !819, size: 64, offset: 3840)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !658, file: !653, line: 85, baseType: !824, size: 64, offset: 3904)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DISubroutineType(types: !826)
!826 = !{!427, !650, !650, !559, !559}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !658, file: !653, line: 86, baseType: !828, size: 64, offset: 3968)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DISubroutineType(types: !830)
!830 = !{!427, !650, !831, !664}
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !792, line: 11, baseType: !832)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !792, line: 11, flags: DIFlagFwdDecl)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !658, file: !653, line: 87, baseType: !828, size: 64, offset: 4032)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !658, file: !653, line: 88, baseType: !836, size: 64, offset: 4096)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{!427, !650, !839}
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !658, file: !653, line: 89, baseType: !836, size: 64, offset: 4160)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !658, file: !653, line: 90, baseType: !842, size: 64, offset: 4224)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!427, !650, !496, !733, !733, !650, !735}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !658, file: !653, line: 91, baseType: !842, size: 64, offset: 4288)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !658, file: !653, line: 92, baseType: !771, size: 64, offset: 4352)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !658, file: !653, line: 93, baseType: !771, size: 64, offset: 4416)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !658, file: !653, line: 94, baseType: !696, size: 64, offset: 4480)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !658, file: !653, line: 95, baseType: !696, size: 64, offset: 4544)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !658, file: !653, line: 96, baseType: !696, size: 64, offset: 4608)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !658, file: !653, line: 97, baseType: !696, size: 64, offset: 4672)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !658, file: !653, line: 98, baseType: !853, size: 64, offset: 4736)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{!427, !650, !612}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !658, file: !653, line: 99, baseType: !742, size: 64, offset: 4800)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !658, file: !653, line: 100, baseType: !742, size: 64, offset: 4864)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !658, file: !653, line: 101, baseType: !859, size: 64, offset: 4928)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!427, !650, !562, !862}
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !6, line: 701, baseType: !50)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !658, file: !653, line: 102, baseType: !865, size: 64, offset: 4992)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!427, !650, !839, !862}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !658, file: !653, line: 103, baseType: !742, size: 64, offset: 5056)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !658, file: !653, line: 104, baseType: !836, size: 64, offset: 5120)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !658, file: !653, line: 105, baseType: !871, size: 64, offset: 5184)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!427, !496, !682, !664, !874}
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !652, file: !653, line: 144, baseType: !877, size: 64, offset: 9728)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !792, line: 60, baseType: !878)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !135, line: 240, size: 640, elements: !880)
!880 = !{!881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !879, file: !135, line: 241, baseType: !452, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !879, file: !135, line: 242, baseType: !513, size: 32, offset: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !879, file: !135, line: 243, baseType: !496, size: 32, offset: 96)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !879, file: !135, line: 243, baseType: !496, size: 32, offset: 128)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !879, file: !135, line: 244, baseType: !496, size: 32, offset: 160)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !879, file: !135, line: 244, baseType: !496, size: 32, offset: 192)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !879, file: !135, line: 245, baseType: !542, size: 64, offset: 256)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !879, file: !135, line: 246, baseType: !612, size: 32, offset: 320)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !879, file: !135, line: 247, baseType: !496, size: 32, offset: 352)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !879, file: !135, line: 251, baseType: !496, size: 32, offset: 384)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !879, file: !135, line: 252, baseType: !791, size: 64, offset: 448)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !879, file: !135, line: 253, baseType: !612, size: 32, offset: 512)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !879, file: !135, line: 254, baseType: !496, size: 32, offset: 544)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !879, file: !135, line: 254, baseType: !496, size: 32, offset: 576)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !879, file: !135, line: 255, baseType: !496, size: 32, offset: 608)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !652, file: !653, line: 145, baseType: !533, size: 64, offset: 9792)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !652, file: !653, line: 146, baseType: !612, size: 32, offset: 9856)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !652, file: !653, line: 147, baseType: !899, size: 1344, offset: 9920)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !653, line: 140, baseType: !900)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !653, line: 114, size: 1344, elements: !901)
!901 = !{!902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !920, !921, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !900, file: !653, line: 115, baseType: !496, size: 32)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !900, file: !653, line: 116, baseType: !496, size: 32, offset: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !900, file: !653, line: 117, baseType: !496, size: 32, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !900, file: !653, line: 118, baseType: !496, size: 32, offset: 96)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !900, file: !653, line: 119, baseType: !496, size: 32, offset: 128)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !900, file: !653, line: 120, baseType: !496, size: 32, offset: 160)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !900, file: !653, line: 121, baseType: !542, size: 64, offset: 192)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !900, file: !653, line: 122, baseType: !559, size: 64, offset: 256)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !900, file: !653, line: 124, baseType: !452, size: 64, offset: 320)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !900, file: !653, line: 125, baseType: !513, size: 32, offset: 384)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !900, file: !653, line: 125, baseType: !513, size: 32, offset: 416)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !900, file: !653, line: 126, baseType: !513, size: 32, offset: 448)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !900, file: !653, line: 126, baseType: !513, size: 32, offset: 480)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !900, file: !653, line: 127, baseType: !916, size: 64, offset: 512)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !453, line: 339, baseType: !918)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !453, line: 339, flags: DIFlagFwdDecl)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !900, file: !653, line: 128, baseType: !916, size: 64, offset: 576)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !900, file: !653, line: 129, baseType: !922, size: 64, offset: 640)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !453, line: 341, baseType: !924)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !453, line: 351, size: 192, elements: !925)
!925 = !{!926, !927, !928, !929, !930}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !924, file: !453, line: 354, baseType: !93, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !924, file: !453, line: 355, baseType: !93, size: 32, offset: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !924, file: !453, line: 356, baseType: !93, size: 32, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !924, file: !453, line: 361, baseType: !93, size: 32, offset: 96)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !924, file: !453, line: 362, baseType: !608, size: 64, offset: 128)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !900, file: !653, line: 130, baseType: !496, size: 32, offset: 704)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !900, file: !653, line: 130, baseType: !496, size: 32, offset: 736)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !900, file: !653, line: 131, baseType: !559, size: 64, offset: 768)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !900, file: !653, line: 131, baseType: !559, size: 64, offset: 832)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !900, file: !653, line: 132, baseType: !542, size: 64, offset: 896)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !900, file: !653, line: 132, baseType: !542, size: 64, offset: 960)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !900, file: !653, line: 133, baseType: !496, size: 32, offset: 1024)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !900, file: !653, line: 134, baseType: !542, size: 64, offset: 1088)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !900, file: !653, line: 135, baseType: !496, size: 32, offset: 1152)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !900, file: !653, line: 136, baseType: !612, size: 32, offset: 1184)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !900, file: !653, line: 137, baseType: !612, size: 32, offset: 1216)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !900, file: !653, line: 138, baseType: !735, size: 32, offset: 1248)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !900, file: !653, line: 139, baseType: !542, size: 64, offset: 1280)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !652, file: !653, line: 147, baseType: !899, size: 1344, offset: 11264)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !652, file: !653, line: 148, baseType: !612, size: 32, offset: 12608)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !652, file: !653, line: 149, baseType: !496, size: 32, offset: 12640)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !652, file: !653, line: 150, baseType: !948, size: 32, offset: 12672)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !27, line: 472, baseType: !57)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !652, file: !653, line: 157, baseType: !523, size: 64, offset: 12736)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgradient", scope: !644, file: !431, line: 16, baseType: !951, size: 64, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{!427, !428, !650, !550, !650, !533}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "computegradient", scope: !644, file: !431, line: 17, baseType: !955, size: 64, offset: 128)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!427, !428, !650, !650, !533}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "computehessian", scope: !644, file: !431, line: 18, baseType: !959, size: 64, offset: 192)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!427, !428, !650, !962, !962, !533}
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !65, line: 16, baseType: !963)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !965, line: 436, size: 23424, elements: !966)
!965 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!966 = !{!967, !968, !1453, !1454, !1455, !1456, !1458, !1459, !1460, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1574, !1575, !1591, !1592, !1593, !1594, !1595, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1630, !1650, !1651, !1653, !1654, !1655, !1656, !1657, !1658, !1676, !1677}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !964, file: !965, line: 437, baseType: !434, size: 4480)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !964, file: !965, line: 437, baseType: !969, size: 9472, offset: 4480)
!969 = !DICompositeType(tag: DW_TAG_array_type, baseType: !970, size: 9472, elements: !492)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !965, line: 32, size: 9472, elements: !971)
!971 = !{!972, !976, !980, !981, !985, !989, !990, !991, !992, !993, !994, !995, !1015, !1019, !1024, !1030, !1049, !1054, !1058, !1059, !1063, !1068, !1069, !1074, !1078, !1082, !1086, !1090, !1094, !1095, !1096, !1097, !1098, !1102, !1103, !1108, !1109, !1110, !1111, !1112, !1117, !1124, !1128, !1132, !1136, !1140, !1144, !1145, !1149, !1150, !1154, !1159, !1160, !1161, !1162, !1224, !1232, !1233, !1237, !1238, !1242, !1243, !1247, !1252, !1253, !1257, !1261, !1265, !1266, !1267, !1268, !1269, !1270, !1275, !1276, !1280, !1284, !1288, !1289, !1290, !1294, !1304, !1305, !1309, !1310, !1314, !1315, !1319, !1320, !1324, !1325, !1329, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1343, !1344, !1345, !1346, !1347, !1348, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1363, !1367, !1368, !1369, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1383, !1384, !1385, !1389, !1393, !1394, !1398, !1399, !1400, !1401, !1427, !1431, !1432, !1433, !1434, !1435, !1439, !1440, !1441, !1442, !1443, !1447, !1451, !1452}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !970, file: !965, line: 34, baseType: !973, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!427, !962, !496, !733, !496, !733, !713, !735}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !970, file: !965, line: 35, baseType: !977, size: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!427, !962, !496, !542, !544, !562}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !970, file: !965, line: 36, baseType: !977, size: 64, offset: 128)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !970, file: !965, line: 37, baseType: !982, size: 64, offset: 192)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!427, !962, !650, !650}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !970, file: !965, line: 38, baseType: !986, size: 64, offset: 256)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!427, !962, !650, !650, !650}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !970, file: !965, line: 40, baseType: !982, size: 64, offset: 320)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !970, file: !965, line: 41, baseType: !986, size: 64, offset: 384)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !970, file: !965, line: 42, baseType: !982, size: 64, offset: 448)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !970, file: !965, line: 43, baseType: !986, size: 64, offset: 512)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !970, file: !965, line: 44, baseType: !982, size: 64, offset: 576)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !970, file: !965, line: 46, baseType: !986, size: 64, offset: 640)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !970, file: !965, line: 47, baseType: !996, size: 64, offset: 704)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!427, !962, !831, !831, !999}
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1001)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !65, line: 1239, baseType: !1002)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !65, line: 1226, size: 704, elements: !1003)
!1003 = !{!1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !1002, file: !65, line: 1227, baseType: !551, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !1002, file: !65, line: 1228, baseType: !551, size: 64, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !1002, file: !65, line: 1229, baseType: !551, size: 64, offset: 128)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !1002, file: !65, line: 1230, baseType: !551, size: 64, offset: 192)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !1002, file: !65, line: 1231, baseType: !551, size: 64, offset: 256)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !1002, file: !65, line: 1232, baseType: !551, size: 64, offset: 320)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !1002, file: !65, line: 1233, baseType: !551, size: 64, offset: 384)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !1002, file: !65, line: 1234, baseType: !551, size: 64, offset: 448)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !1002, file: !65, line: 1236, baseType: !551, size: 64, offset: 512)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !1002, file: !65, line: 1237, baseType: !551, size: 64, offset: 576)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !1002, file: !65, line: 1238, baseType: !551, size: 64, offset: 640)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !970, file: !965, line: 48, baseType: !1016, size: 64, offset: 768)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!427, !962, !831, !999}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !970, file: !965, line: 49, baseType: !1020, size: 64, offset: 832)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!427, !962, !650, !551, !1023, !551, !496, !496, !650}
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !65, line: 1291, baseType: !64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !970, file: !965, line: 50, baseType: !1025, size: 64, offset: 896)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!427, !962, !1028, !1029}
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !65, line: 238, baseType: !77)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !970, file: !965, line: 52, baseType: !1031, size: 64, offset: 960)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!427, !962, !1034, !1035}
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !65, line: 612, baseType: !83)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !65, line: 600, baseType: !1037)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !65, line: 592, size: 640, elements: !1038)
!1038 = !{!1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !1037, file: !65, line: 593, baseType: !498, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !1037, file: !65, line: 594, baseType: !498, size: 64, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !1037, file: !65, line: 594, baseType: !498, size: 64, offset: 128)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !1037, file: !65, line: 594, baseType: !498, size: 64, offset: 192)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !1037, file: !65, line: 595, baseType: !498, size: 64, offset: 256)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !1037, file: !65, line: 596, baseType: !498, size: 64, offset: 320)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !1037, file: !65, line: 597, baseType: !498, size: 64, offset: 384)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !1037, file: !65, line: 598, baseType: !498, size: 64, offset: 448)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !1037, file: !65, line: 598, baseType: !498, size: 64, offset: 512)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !1037, file: !65, line: 599, baseType: !498, size: 64, offset: 576)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !970, file: !965, line: 53, baseType: !1050, size: 64, offset: 1024)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!427, !962, !962, !1053}
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !970, file: !965, line: 54, baseType: !1055, size: 64, offset: 1088)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!427, !962, !650}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !970, file: !965, line: 55, baseType: !982, size: 64, offset: 1152)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !970, file: !965, line: 56, baseType: !1060, size: 64, offset: 1216)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!427, !962, !688, !550}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !970, file: !965, line: 58, baseType: !1064, size: 64, offset: 1280)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!427, !962, !1067}
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !65, line: 424, baseType: !88)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !970, file: !965, line: 59, baseType: !1064, size: 64, offset: 1344)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !970, file: !965, line: 60, baseType: !1070, size: 64, offset: 1408)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!427, !962, !1073, !612}
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !65, line: 469, baseType: !92)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !970, file: !965, line: 61, baseType: !1075, size: 64, offset: 1472)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!427, !962}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !970, file: !965, line: 63, baseType: !1079, size: 64, offset: 1536)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DISubroutineType(types: !1081)
!1081 = !{!427, !962, !496, !733, !560, !650, !650}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !970, file: !965, line: 64, baseType: !1083, size: 64, offset: 1600)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!427, !962, !962, !831, !831, !999}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !970, file: !965, line: 65, baseType: !1087, size: 64, offset: 1664)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!427, !962, !962, !999}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !970, file: !965, line: 66, baseType: !1091, size: 64, offset: 1728)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!427, !962, !962, !831, !999}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !970, file: !965, line: 67, baseType: !1087, size: 64, offset: 1792)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !970, file: !965, line: 69, baseType: !1075, size: 64, offset: 1856)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !970, file: !965, line: 70, baseType: !1083, size: 64, offset: 1920)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !970, file: !965, line: 71, baseType: !1091, size: 64, offset: 1984)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !970, file: !965, line: 72, baseType: !1099, size: 64, offset: 2048)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!427, !962, !1029}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !970, file: !965, line: 73, baseType: !1075, size: 64, offset: 2112)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !970, file: !965, line: 75, baseType: !1104, size: 64, offset: 2176)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!427, !962, !1107, !1029}
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !65, line: 563, baseType: !123)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !970, file: !965, line: 76, baseType: !982, size: 64, offset: 2240)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !970, file: !965, line: 77, baseType: !982, size: 64, offset: 2304)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !970, file: !965, line: 78, baseType: !996, size: 64, offset: 2368)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !970, file: !965, line: 79, baseType: !1016, size: 64, offset: 2432)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !970, file: !965, line: 81, baseType: !1113, size: 64, offset: 2496)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = !DISubroutineType(types: !1115)
!1115 = !{!427, !962, !560, !962, !1116}
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !65, line: 285, baseType: !128)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !970, file: !965, line: 82, baseType: !1118, size: 64, offset: 2560)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!427, !962, !496, !1121, !1121, !1028, !1123}
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !831)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !970, file: !965, line: 83, baseType: !1125, size: 64, offset: 2624)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!427, !962, !496, !875, !496}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !970, file: !965, line: 84, baseType: !1129, size: 64, offset: 2688)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!427, !962, !496, !733, !496, !733, !559}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !970, file: !965, line: 85, baseType: !1133, size: 64, offset: 2752)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{!427, !962, !962, !1116}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !970, file: !965, line: 87, baseType: !1137, size: 64, offset: 2816)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!427, !962, !650, !542}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !970, file: !965, line: 88, baseType: !1141, size: 64, offset: 2880)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!427, !962, !560}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !970, file: !965, line: 89, baseType: !1141, size: 64, offset: 2944)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !970, file: !965, line: 90, baseType: !1146, size: 64, offset: 3008)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{!427, !962, !650, !735}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !970, file: !965, line: 91, baseType: !1079, size: 64, offset: 3072)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !970, file: !965, line: 93, baseType: !1151, size: 64, offset: 3136)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{!427, !962, !760}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !970, file: !965, line: 94, baseType: !1155, size: 64, offset: 3200)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{!427, !962, !496, !612, !612, !542, !1158, !1158, !1053}
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !970, file: !965, line: 95, baseType: !1155, size: 64, offset: 3264)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !970, file: !965, line: 96, baseType: !1155, size: 64, offset: 3328)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !970, file: !965, line: 97, baseType: !1155, size: 64, offset: 3392)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !970, file: !965, line: 99, baseType: !1163, size: 64, offset: 3456)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = !DISubroutineType(types: !1165)
!1165 = !{!427, !962, !1166, !1169}
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !792, line: 51, baseType: !1167)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !792, line: 51, flags: DIFlagFwdDecl)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !65, line: 1378, baseType: !1170)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !965, line: 609, size: 6208, elements: !1172)
!1172 = !{!1173, !1174, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1193, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1211, !1212, !1213, !1214, !1215, !1217, !1218, !1219, !1220, !1221, !1222, !1223}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1171, file: !965, line: 610, baseType: !434, size: 4480)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1171, file: !965, line: 610, baseType: !1175, size: 32, offset: 4480)
!1175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 32, elements: !492)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1171, file: !965, line: 611, baseType: !496, size: 32, offset: 4512)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1171, file: !965, line: 611, baseType: !496, size: 32, offset: 4544)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1171, file: !965, line: 611, baseType: !496, size: 32, offset: 4576)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1171, file: !965, line: 612, baseType: !496, size: 32, offset: 4608)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1171, file: !965, line: 613, baseType: !496, size: 32, offset: 4640)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1171, file: !965, line: 614, baseType: !542, size: 64, offset: 4672)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1171, file: !965, line: 615, baseType: !544, size: 64, offset: 4736)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !1171, file: !965, line: 616, baseType: !875, size: 64, offset: 4800)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1171, file: !965, line: 617, baseType: !542, size: 64, offset: 4864)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !1171, file: !965, line: 618, baseType: !1186, size: 64, offset: 4928)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !965, line: 602, baseType: !1188)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !965, line: 598, size: 128, elements: !1189)
!1189 = !{!1190, !1191, !1192}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1188, file: !965, line: 599, baseType: !496, size: 32)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1188, file: !965, line: 600, baseType: !496, size: 32, offset: 32)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1188, file: !965, line: 601, baseType: !559, size: 64, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !1171, file: !965, line: 619, baseType: !1194, size: 64, offset: 4992)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !965, line: 607, baseType: !1196)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !965, line: 604, size: 128, elements: !1197)
!1197 = !{!1198, !1199}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1196, file: !965, line: 605, baseType: !496, size: 32)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1196, file: !965, line: 606, baseType: !559, size: 64, offset: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !1171, file: !965, line: 620, baseType: !559, size: 64, offset: 5056)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !1171, file: !965, line: 621, baseType: !551, size: 64, offset: 5120)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !1171, file: !965, line: 622, baseType: !551, size: 64, offset: 5184)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !1171, file: !965, line: 623, baseType: !650, size: 64, offset: 5248)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !1171, file: !965, line: 623, baseType: !650, size: 64, offset: 5312)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !1171, file: !965, line: 623, baseType: !650, size: 64, offset: 5376)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !1171, file: !965, line: 624, baseType: !612, size: 32, offset: 5440)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1171, file: !965, line: 625, baseType: !1208, size: 64, offset: 5504)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{!427}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !1171, file: !965, line: 626, baseType: !533, size: 64, offset: 5568)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !1171, file: !965, line: 627, baseType: !650, size: 64, offset: 5632)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1171, file: !965, line: 628, baseType: !496, size: 32, offset: 5696)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !1171, file: !965, line: 629, baseType: !473, size: 64, offset: 5760)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1171, file: !965, line: 630, baseType: !1216, size: 32, offset: 5824)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !135, line: 213, baseType: !134)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1171, file: !965, line: 631, baseType: !496, size: 32, offset: 5856)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !1171, file: !965, line: 631, baseType: !496, size: 32, offset: 5888)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1171, file: !965, line: 632, baseType: !612, size: 32, offset: 5920)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !1171, file: !965, line: 633, baseType: !612, size: 32, offset: 5952)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !1171, file: !965, line: 634, baseType: !484, size: 64, offset: 6016)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !1171, file: !965, line: 634, baseType: !533, size: 64, offset: 6080)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !1171, file: !965, line: 635, baseType: !504, size: 64, offset: 6144)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !970, file: !965, line: 100, baseType: !1225, size: 64, offset: 3520)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = !DISubroutineType(types: !1227)
!1227 = !{!427, !962, !496, !496, !1228, !1231}
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !135, line: 215, baseType: !1230)
!1230 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !970, file: !965, line: 101, baseType: !1075, size: 64, offset: 3584)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !970, file: !965, line: 102, baseType: !1234, size: 64, offset: 3648)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64)
!1235 = !DISubroutineType(types: !1236)
!1236 = !{!427, !962, !831, !831, !1029}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !970, file: !965, line: 103, baseType: !973, size: 64, offset: 3712)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !970, file: !965, line: 105, baseType: !1239, size: 64, offset: 3776)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{!427, !962, !831, !831, !1028, !1029}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !970, file: !965, line: 106, baseType: !1075, size: 64, offset: 3840)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !970, file: !965, line: 107, baseType: !1244, size: 64, offset: 3904)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1245 = !DISubroutineType(types: !1246)
!1246 = !{!427, !962, !460}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !970, file: !965, line: 108, baseType: !1248, size: 64, offset: 3968)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64)
!1249 = !DISubroutineType(types: !1250)
!1250 = !{!427, !962, !1251, !1028, !1029}
!1251 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !65, line: 25, baseType: !473)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !970, file: !965, line: 109, baseType: !1208, size: 64, offset: 4032)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !970, file: !965, line: 111, baseType: !1254, size: 64, offset: 4096)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!427, !962, !962, !962, !551, !962}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !970, file: !965, line: 112, baseType: !1258, size: 64, offset: 4160)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{!427, !962, !962, !962, !962}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !970, file: !965, line: 113, baseType: !1262, size: 64, offset: 4224)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64)
!1263 = !DISubroutineType(types: !1264)
!1264 = !{!427, !962, !791, !791}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !970, file: !965, line: 114, baseType: !973, size: 64, offset: 4288)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !970, file: !965, line: 115, baseType: !1079, size: 64, offset: 4352)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !970, file: !965, line: 117, baseType: !1137, size: 64, offset: 4416)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !970, file: !965, line: 118, baseType: !1137, size: 64, offset: 4480)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !970, file: !965, line: 119, baseType: !1248, size: 64, offset: 4544)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !970, file: !965, line: 120, baseType: !1271, size: 64, offset: 4608)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{!427, !962, !1274, !1053}
!1274 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !65, line: 1675, baseType: !139)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !970, file: !965, line: 121, baseType: !1208, size: 64, offset: 4672)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !970, file: !965, line: 123, baseType: !1277, size: 64, offset: 4736)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64)
!1278 = !DISubroutineType(types: !1279)
!1279 = !{!427, !962, !496, !533}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !970, file: !965, line: 124, baseType: !1281, size: 64, offset: 4800)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64)
!1282 = !DISubroutineType(types: !1283)
!1283 = !{!427, !962, !1169, !650, !533}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !970, file: !965, line: 125, baseType: !1285, size: 64, offset: 4864)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{!427, !588, !962}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !970, file: !965, line: 126, baseType: !982, size: 64, offset: 4928)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !970, file: !965, line: 127, baseType: !982, size: 64, offset: 4992)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !970, file: !965, line: 129, baseType: !1291, size: 64, offset: 5056)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64)
!1292 = !DISubroutineType(types: !1293)
!1293 = !{!427, !962, !875}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !970, file: !965, line: 130, baseType: !1295, size: 64, offset: 5120)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64)
!1296 = !DISubroutineType(types: !1297)
!1297 = !{!427, !962, !1298, !1298}
!1298 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !27, line: 654, baseType: !1299)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64)
!1300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !27, line: 653, size: 128, elements: !1301)
!1301 = !{!1302, !1303}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1300, file: !27, line: 653, baseType: !496, size: 32)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1300, file: !27, line: 653, baseType: !650, size: 64, offset: 64)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !970, file: !965, line: 131, baseType: !1295, size: 64, offset: 5184)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !970, file: !965, line: 132, baseType: !1306, size: 64, offset: 5248)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64)
!1307 = !DISubroutineType(types: !1308)
!1308 = !{!427, !962, !542, !542, !542}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !970, file: !965, line: 133, baseType: !1244, size: 64, offset: 5312)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !970, file: !965, line: 135, baseType: !1311, size: 64, offset: 5376)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64)
!1312 = !DISubroutineType(types: !1313)
!1313 = !{!427, !962, !551, !1053}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !970, file: !965, line: 136, baseType: !1311, size: 64, offset: 5440)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !970, file: !965, line: 137, baseType: !1316, size: 64, offset: 5504)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64)
!1317 = !DISubroutineType(types: !1318)
!1318 = !{!427, !962, !1053}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !970, file: !965, line: 138, baseType: !973, size: 64, offset: 5568)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !970, file: !965, line: 139, baseType: !1321, size: 64, offset: 5632)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64)
!1322 = !DISubroutineType(types: !1323)
!1323 = !{!427, !962, !664, !664}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !970, file: !965, line: 141, baseType: !1208, size: 64, offset: 5696)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !970, file: !965, line: 142, baseType: !1326, size: 64, offset: 5760)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64)
!1327 = !DISubroutineType(types: !1328)
!1328 = !{!427, !962, !962, !551, !962}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !970, file: !965, line: 143, baseType: !1330, size: 64, offset: 5824)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64)
!1331 = !DISubroutineType(types: !1332)
!1332 = !{!427, !962, !962, !962}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !970, file: !965, line: 144, baseType: !1208, size: 64, offset: 5888)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !970, file: !965, line: 145, baseType: !1326, size: 64, offset: 5952)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !970, file: !965, line: 147, baseType: !1330, size: 64, offset: 6016)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !970, file: !965, line: 148, baseType: !1208, size: 64, offset: 6080)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !970, file: !965, line: 149, baseType: !1326, size: 64, offset: 6144)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !970, file: !965, line: 150, baseType: !1330, size: 64, offset: 6208)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !970, file: !965, line: 151, baseType: !1340, size: 64, offset: 6272)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64)
!1341 = !DISubroutineType(types: !1342)
!1342 = !{!427, !962, !612}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !970, file: !965, line: 153, baseType: !1075, size: 64, offset: 6336)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !970, file: !965, line: 154, baseType: !1075, size: 64, offset: 6400)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !970, file: !965, line: 155, baseType: !1075, size: 64, offset: 6464)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !970, file: !965, line: 156, baseType: !1075, size: 64, offset: 6528)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !970, file: !965, line: 157, baseType: !1244, size: 64, offset: 6592)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !970, file: !965, line: 159, baseType: !1349, size: 64, offset: 6656)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64)
!1350 = !DISubroutineType(types: !1351)
!1351 = !{!427, !962, !496, !713}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !970, file: !965, line: 160, baseType: !1075, size: 64, offset: 6720)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !970, file: !965, line: 161, baseType: !1075, size: 64, offset: 6784)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !970, file: !965, line: 162, baseType: !1075, size: 64, offset: 6848)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !970, file: !965, line: 163, baseType: !1075, size: 64, offset: 6912)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !970, file: !965, line: 165, baseType: !1330, size: 64, offset: 6976)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !970, file: !965, line: 166, baseType: !1330, size: 64, offset: 7040)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !970, file: !965, line: 167, baseType: !1137, size: 64, offset: 7104)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !970, file: !965, line: 168, baseType: !1360, size: 64, offset: 7168)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64)
!1361 = !DISubroutineType(types: !1362)
!1362 = !{!427, !962, !650, !496}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !970, file: !965, line: 169, baseType: !1364, size: 64, offset: 7232)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64)
!1365 = !DISubroutineType(types: !1366)
!1366 = !{!427, !962, !1053, !542}
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !970, file: !965, line: 171, baseType: !1099, size: 64, offset: 7296)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !970, file: !965, line: 172, baseType: !1075, size: 64, offset: 7360)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !970, file: !965, line: 173, baseType: !1370, size: 64, offset: 7424)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64)
!1371 = !DISubroutineType(types: !1372)
!1372 = !{!427, !962, !542, !1158}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !970, file: !965, line: 174, baseType: !1234, size: 64, offset: 7488)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !970, file: !965, line: 175, baseType: !1234, size: 64, offset: 7552)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !970, file: !965, line: 177, baseType: !982, size: 64, offset: 7616)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !970, file: !965, line: 178, baseType: !1025, size: 64, offset: 7680)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !970, file: !965, line: 179, baseType: !982, size: 64, offset: 7744)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !970, file: !965, line: 180, baseType: !986, size: 64, offset: 7808)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !970, file: !965, line: 181, baseType: !1380, size: 64, offset: 7872)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64)
!1381 = !DISubroutineType(types: !1382)
!1382 = !{!427, !962, !452, !1028, !1029}
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !970, file: !965, line: 183, baseType: !1291, size: 64, offset: 7936)
