; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/bound/impls/bnk/bnk.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/bound/impls/bnk/bnk.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque

!229 = !DIEnumerator(name: "MATOP_TRANSPOSE_COLORING_CREAT", value: 133, isUnsigned: true)
!230 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_SPT", value: 134, isUnsigned: true)
!231 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_DEN", value: 135, isUnsigned: true)
!232 = !DIEnumerator(name: "MATOP_RART", value: 136, isUnsigned: true)
!233 = !DIEnumerator(name: "MATOP_RART_SYMBOLIC", value: 137, isUnsigned: true)
!234 = !DIEnumerator(name: "MATOP_RART_NUMERIC", value: 138, isUnsigned: true)
!235 = !DIEnumerator(name: "MATOP_SET_BLOCK_SIZES", value: 139, isUnsigned: true)
!236 = !DIEnumerator(name: "MATOP_AYPX", value: 140, isUnsigned: true)
!237 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!238 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!239 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!240 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!241 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!242 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!243 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !244, line: 6, baseType: !28, size: 32, elements: !245)
!244 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctaolinesearch.h", directory: "/home/users/ndemeye/xSDK")
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257}
!246 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_INFORNAN", value: -1)
!247 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_BADPARAMETER", value: -2)
!248 = !DIEnumerator(name: "TAOLINESEARCH_FAILED_ASCENT", value: -3)
!249 = !DIEnumerator(name: "TAOLINESEARCH_CONTINUE_ITERATING", value: 0)
!250 = !DIEnumerator(name: "TAOLINESEARCH_SUCCESS", value: 1)
!251 = !DIEnumerator(name: "TAOLINESEARCH_SUCCESS_USER", value: 2)
!252 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_OTHER", value: 3)
!253 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_MAXFCN", value: 4)
!254 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_UPPERBOUND", value: 5)
!255 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_LOWERBOUND", value: 6)
!256 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_RTOL", value: 7)
!257 = !DIEnumerator(name: "TAOLINESEARCH_HALTED_USER", value: 8)
!258 = !{!259, !293, !374, !290, !314, !392, !710, !449}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "TAO_BNK", file: !261, line: 209, baseType: !262)
!261 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/tao/bound/impls/bnk/bnk.h", directory: "/home/users/ndemeye/xSDK")
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !261, line: 10, size: 5888, elements: !263)
!263 = !{!264, !702, !708, !709, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "computehessian", scope: !262, file: !261, line: 15, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!268, !269}
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tao", file: !27, line: 118, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Tao", file: !272, line: 45, size: 14656, elements: !273)
!272 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/taoimpl.h", directory: "/home/users/ndemeye/xSDK")
!273 = !{!274, !483, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !571, !577, !579, !580, !581, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !655, !656, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !694, !695, !696, !697, !698, !699, !700, !701}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !271, file: !272, line: 46, baseType: !275, size: 4480)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !276, line: 122, baseType: !277)
!276 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !276, line: 73, size: 4480, elements: !278)
!278 = !{!279, !281, !335, !336, !338, !341, !342, !343, !344, !352, !353, !355, !359, !363, !365, !366, !367, !368, !369, !370, !371, !372, !373, !375, !377, !378, !379, !381, !382, !384, !386, !387, !388, !389, !390, !393, !395, !396, !397, !398, !399, !402, !404, !405, !406, !416, !418, !419, !423, !424, !473, !478, !480, !481, !482}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !277, file: !276, line: 74, baseType: !280, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !277, file: !276, line: 75, baseType: !282, size: 448, offset: 64)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 448, elements: !333)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !276, line: 53, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !276, line: 45, size: 448, elements: !285)
!285 = !{!286, !297, !305, !310, !317, !321, !328}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !284, file: !276, line: 46, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!268, !290, !292}
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !294, line: 330, baseType: !295)
!294 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !294, line: 330, flags: DIFlagFwdDecl)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !284, file: !276, line: 47, baseType: !298, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{!268, !290, !301}
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !302, line: 16, baseType: !303)
!302 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !302, line: 16, flags: DIFlagFwdDecl)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !284, file: !276, line: 48, baseType: !306, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!268, !309}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !284, file: !276, line: 49, baseType: !311, size: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!268, !290, !314, !290}
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !316)
!316 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !284, file: !276, line: 50, baseType: !318, size: 64, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!268, !290, !314, !309}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !284, file: !276, line: 51, baseType: !322, size: 64, offset: 320)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!268, !290, !314, !325}
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{null}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !284, file: !276, line: 52, baseType: !329, size: 64, offset: 384)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!268, !290, !314, !332}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!333 = !{!334}
!334 = !DISubrange(count: 1)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !277, file: !276, line: 76, baseType: !293, size: 64, offset: 512)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !277, file: !276, line: 77, baseType: !337, size: 32, offset: 576)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !277, file: !276, line: 78, baseType: !339, size: 64, offset: 640)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !340)
!340 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !277, file: !276, line: 78, baseType: !339, size: 64, offset: 704)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !277, file: !276, line: 78, baseType: !339, size: 64, offset: 768)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !277, file: !276, line: 78, baseType: !339, size: 64, offset: 832)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !277, file: !276, line: 79, baseType: !345, size: 64, offset: 896)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !348, line: 27, baseType: !349)
!348 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !350, line: 43, baseType: !351)
!350 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!351 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !277, file: !276, line: 80, baseType: !337, size: 32, offset: 960)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !277, file: !276, line: 81, baseType: !354, size: 32, offset: 992)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !277, file: !276, line: 82, baseType: !356, size: 64, offset: 1024)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !277, file: !276, line: 83, baseType: !360, size: 64, offset: 1088)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !277, file: !276, line: 84, baseType: !364, size: 64, offset: 1152)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !277, file: !276, line: 85, baseType: !364, size: 64, offset: 1216)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !277, file: !276, line: 86, baseType: !364, size: 64, offset: 1280)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !277, file: !276, line: 87, baseType: !364, size: 64, offset: 1344)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !277, file: !276, line: 88, baseType: !290, size: 64, offset: 1408)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !277, file: !276, line: 89, baseType: !345, size: 64, offset: 1472)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !277, file: !276, line: 90, baseType: !364, size: 64, offset: 1536)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !277, file: !276, line: 91, baseType: !364, size: 64, offset: 1600)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !277, file: !276, line: 92, baseType: !337, size: 32, offset: 1664)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !277, file: !276, line: 93, baseType: !374, size: 64, offset: 1728)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !277, file: !276, line: 94, baseType: !376, size: 64, offset: 1792)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !346)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !277, file: !276, line: 95, baseType: !337, size: 32, offset: 1856)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !277, file: !276, line: 95, baseType: !337, size: 32, offset: 1888)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !277, file: !276, line: 96, baseType: !380, size: 64, offset: 1920)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !277, file: !276, line: 96, baseType: !380, size: 64, offset: 1984)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !277, file: !276, line: 97, baseType: !383, size: 64, offset: 2048)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !277, file: !276, line: 97, baseType: !385, size: 64, offset: 2112)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !277, file: !276, line: 98, baseType: !337, size: 32, offset: 2176)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !277, file: !276, line: 98, baseType: !337, size: 32, offset: 2208)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !277, file: !276, line: 99, baseType: !380, size: 64, offset: 2240)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !277, file: !276, line: 99, baseType: !380, size: 64, offset: 2304)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !277, file: !276, line: 100, baseType: !391, size: 64, offset: 2368)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !340)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !277, file: !276, line: 100, baseType: !394, size: 64, offset: 2432)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !277, file: !276, line: 101, baseType: !337, size: 32, offset: 2496)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !277, file: !276, line: 101, baseType: !337, size: 32, offset: 2528)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !277, file: !276, line: 102, baseType: !380, size: 64, offset: 2560)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !277, file: !276, line: 102, baseType: !380, size: 64, offset: 2624)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !277, file: !276, line: 103, baseType: !400, size: 64, offset: 2688)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !392)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !277, file: !276, line: 103, baseType: !403, size: 64, offset: 2752)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !277, file: !276, line: 104, baseType: !332, size: 64, offset: 2816)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !277, file: !276, line: 105, baseType: !337, size: 32, offset: 2880)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !277, file: !276, line: 106, baseType: !407, size: 128, offset: 2944)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 128, elements: !414)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !276, line: 64, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !276, line: 61, size: 128, elements: !411)
!411 = !{!412, !413}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !410, file: !276, line: 62, baseType: !325, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !410, file: !276, line: 63, baseType: !374, size: 64, offset: 64)
!414 = !{!415}
!415 = !DISubrange(count: 2)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !277, file: !276, line: 107, baseType: !417, size: 64, offset: 3072)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 64, elements: !414)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !277, file: !276, line: 108, baseType: !374, size: 64, offset: 3136)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !277, file: !276, line: 109, baseType: !420, size: 64, offset: 3200)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!268, !374}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !277, file: !276, line: 111, baseType: !337, size: 32, offset: 3264)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !277, file: !276, line: 112, baseType: !425, size: 320, offset: 3328)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 320, elements: !471)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!268, !429, !290, !374}
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !431)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !432)
!432 = !{!433, !434, !459, !460, !461, !462, !463, !464, !465, !466, !467}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !431, file: !12, line: 100, baseType: !337, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !431, file: !12, line: 101, baseType: !435, size: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !436)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !438)
!438 = !{!439, !440, !441, !442, !443, !446, !447, !448, !452, !454, !456, !457, !458}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !437, file: !12, line: 84, baseType: !364, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !437, file: !12, line: 85, baseType: !364, size: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !437, file: !12, line: 86, baseType: !374, size: 64, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !437, file: !12, line: 87, baseType: !356, size: 64, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !437, file: !12, line: 88, baseType: !444, size: 64, offset: 256)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !314)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !437, file: !12, line: 89, baseType: !316, size: 8, offset: 320)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !437, file: !12, line: 90, baseType: !364, size: 64, offset: 384)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !437, file: !12, line: 91, baseType: !449, size: 64, offset: 448)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !450, line: 46, baseType: !451)
!450 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!451 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !437, file: !12, line: 92, baseType: !453, size: 32, offset: 512)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !437, file: !12, line: 93, baseType: !455, size: 32, offset: 544)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !437, file: !12, line: 94, baseType: !435, size: 64, offset: 576)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !437, file: !12, line: 95, baseType: !364, size: 64, offset: 640)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !437, file: !12, line: 96, baseType: !374, size: 64, offset: 704)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !431, file: !12, line: 102, baseType: !364, size: 64, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !431, file: !12, line: 102, baseType: !364, size: 64, offset: 192)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !431, file: !12, line: 103, baseType: !364, size: 64, offset: 256)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !431, file: !12, line: 104, baseType: !293, size: 64, offset: 320)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !431, file: !12, line: 105, baseType: !453, size: 32, offset: 384)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !431, file: !12, line: 105, baseType: !453, size: 32, offset: 416)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !431, file: !12, line: 105, baseType: !453, size: 32, offset: 448)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !431, file: !12, line: 106, baseType: !290, size: 64, offset: 512)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !431, file: !12, line: 107, baseType: !468, size: 64, offset: 576)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!471 = !{!472}
!472 = !DISubrange(count: 5)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !277, file: !276, line: 113, baseType: !474, size: 320, offset: 3648)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !475, size: 320, elements: !471)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!268, !290, !374}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !277, file: !276, line: 114, baseType: !479, size: 320, offset: 3968)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !374, size: 320, elements: !471)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !277, file: !276, line: 115, baseType: !453, size: 32, offset: 4288)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !277, file: !276, line: 120, baseType: !468, size: 64, offset: 4352)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !277, file: !276, line: 121, baseType: !453, size: 32, offset: 4416)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !271, file: !272, line: 46, baseType: !484, size: 1536, offset: 4480)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 1536, elements: !333)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TaoOps", file: !272, line: 13, size: 1536, elements: !486)
!486 = !{!487, !494, !498, !502, !509, !510, !511, !512, !513, !514, !515, !519, !523, !524, !525, !526, !530, !534, !535, !539, !540, !541, !545, !549}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !485, file: !272, line: 15, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!268, !269, !491, !391, !374}
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !79, line: 21, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !79, line: 21, flags: DIFlagFwdDecl)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgradient", scope: !485, file: !272, line: 16, baseType: !495, size: 64, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{!268, !269, !491, !391, !491, !374}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "computegradient", scope: !485, file: !272, line: 17, baseType: !499, size: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{!268, !269, !491, !491, !374}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "computehessian", scope: !485, file: !272, line: 18, baseType: !503, size: 64, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!268, !269, !491, !506, !506, !374}
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !87, line: 16, baseType: !507)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !87, line: 16, flags: DIFlagFwdDecl)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidual", scope: !485, file: !272, line: 19, baseType: !499, size: 64, offset: 256)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidualjacobian", scope: !485, file: !272, line: 20, baseType: !503, size: 64, offset: 320)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "computeconstraints", scope: !485, file: !272, line: 21, baseType: !499, size: 64, offset: 384)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "computeinequalityconstraints", scope: !485, file: !272, line: 22, baseType: !499, size: 64, offset: 448)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "computeequalityconstraints", scope: !485, file: !272, line: 23, baseType: !499, size: 64, offset: 512)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobian", scope: !485, file: !272, line: 24, baseType: !503, size: 64, offset: 576)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianstate", scope: !485, file: !272, line: 25, baseType: !516, size: 64, offset: 640)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{!268, !269, !491, !506, !506, !506, !374}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobiandesign", scope: !485, file: !272, line: 26, baseType: !520, size: 64, offset: 704)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!268, !269, !491, !506, !374}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianinequality", scope: !485, file: !272, line: 27, baseType: !503, size: 64, offset: 768)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianequality", scope: !485, file: !272, line: 28, baseType: !503, size: 64, offset: 832)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "computebounds", scope: !485, file: !272, line: 29, baseType: !499, size: 64, offset: 896)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !485, file: !272, line: 30, baseType: !527, size: 64, offset: 960)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!268, !269, !337, !374}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "convergencetest", scope: !485, file: !272, line: 31, baseType: !531, size: 64, offset: 1024)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!268, !269, !374}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "convergencedestroy", scope: !485, file: !272, line: 32, baseType: !420, size: 64, offset: 1088)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "computedual", scope: !485, file: !272, line: 35, baseType: !536, size: 64, offset: 1152)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!268, !269, !491, !491}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !485, file: !272, line: 36, baseType: !265, size: 64, offset: 1216)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !485, file: !272, line: 37, baseType: !265, size: 64, offset: 1280)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !485, file: !272, line: 38, baseType: !542, size: 64, offset: 1344)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!268, !269, !301}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !485, file: !272, line: 39, baseType: !546, size: 64, offset: 1408)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{!268, !429, !269}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !485, file: !272, line: 40, baseType: !265, size: 64, offset: 1472)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !271, file: !272, line: 47, baseType: !374, size: 64, offset: 6016)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "user_objP", scope: !271, file: !272, line: 48, baseType: !374, size: 64, offset: 6080)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "user_objgradP", scope: !271, file: !272, line: 49, baseType: !374, size: 64, offset: 6144)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "user_gradP", scope: !271, file: !272, line: 50, baseType: !374, size: 64, offset: 6208)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "user_hessP", scope: !271, file: !272, line: 51, baseType: !374, size: 64, offset: 6272)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsresP", scope: !271, file: !272, line: 52, baseType: !374, size: 64, offset: 6336)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsjacP", scope: !271, file: !272, line: 53, baseType: !374, size: 64, offset: 6400)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "user_conP", scope: !271, file: !272, line: 54, baseType: !374, size: 64, offset: 6464)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_equalityP", scope: !271, file: !272, line: 55, baseType: !374, size: 64, offset: 6528)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_inequalityP", scope: !271, file: !272, line: 56, baseType: !374, size: 64, offset: 6592)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "user_jacP", scope: !271, file: !272, line: 57, baseType: !374, size: 64, offset: 6656)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_equalityP", scope: !271, file: !272, line: 58, baseType: !374, size: 64, offset: 6720)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_inequalityP", scope: !271, file: !272, line: 59, baseType: !374, size: 64, offset: 6784)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_stateP", scope: !271, file: !272, line: 60, baseType: !374, size: 64, offset: 6848)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_designP", scope: !271, file: !272, line: 61, baseType: !374, size: 64, offset: 6912)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "user_boundsP", scope: !271, file: !272, line: 62, baseType: !374, size: 64, offset: 6976)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "user_update", scope: !271, file: !272, line: 63, baseType: !374, size: 64, offset: 7040)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !271, file: !272, line: 65, baseType: !568, size: 640, offset: 7104)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !531, size: 640, elements: !569)
!569 = !{!570}
!570 = !DISubrange(count: 10)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !271, file: !272, line: 66, baseType: !572, size: 640, offset: 7744)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !573, size: 640, elements: !569)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{!268, !576}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !271, file: !272, line: 67, baseType: !578, size: 640, offset: 8384)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !374, size: 640, elements: !569)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !271, file: !272, line: 68, baseType: !337, size: 32, offset: 9024)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !271, file: !272, line: 69, baseType: !374, size: 64, offset: 9088)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !271, file: !272, line: 70, baseType: !582, size: 32, offset: 9152)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoConvergedReason", file: !27, line: 196, baseType: !26)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !271, file: !272, line: 72, baseType: !453, size: 32, offset: 9184)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !271, file: !272, line: 73, baseType: !374, size: 64, offset: 9216)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "solution", scope: !271, file: !272, line: 75, baseType: !491, size: 64, offset: 9280)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !271, file: !272, line: 76, baseType: !491, size: 64, offset: 9344)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "stepdirection", scope: !271, file: !272, line: 77, baseType: !491, size: 64, offset: 9408)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "XL", scope: !271, file: !272, line: 78, baseType: !491, size: 64, offset: 9472)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "XU", scope: !271, file: !272, line: 79, baseType: !491, size: 64, offset: 9536)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "IL", scope: !271, file: !272, line: 80, baseType: !491, size: 64, offset: 9600)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "IU", scope: !271, file: !272, line: 81, baseType: !491, size: 64, offset: 9664)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "DI", scope: !271, file: !272, line: 82, baseType: !491, size: 64, offset: 9728)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "DE", scope: !271, file: !272, line: 83, baseType: !491, size: 64, offset: 9792)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "hessian", scope: !271, file: !272, line: 84, baseType: !506, size: 64, offset: 9856)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "hessian_pre", scope: !271, file: !272, line: 85, baseType: !506, size: 64, offset: 9920)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm", scope: !271, file: !272, line: 86, baseType: !506, size: 64, offset: 9984)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm_tmp", scope: !271, file: !272, line: 87, baseType: !491, size: 64, offset: 10048)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "ls_res", scope: !271, file: !272, line: 88, baseType: !491, size: 64, offset: 10112)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac", scope: !271, file: !272, line: 89, baseType: !506, size: 64, offset: 10176)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac_pre", scope: !271, file: !272, line: 90, baseType: !506, size: 64, offset: 10240)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_v", scope: !271, file: !272, line: 91, baseType: !491, size: 64, offset: 10304)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_n", scope: !271, file: !272, line: 92, baseType: !337, size: 32, offset: 10368)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_rows", scope: !271, file: !272, line: 93, baseType: !383, size: 64, offset: 10432)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_cols", scope: !271, file: !272, line: 94, baseType: !383, size: 64, offset: 10496)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_w", scope: !271, file: !272, line: 95, baseType: !391, size: 64, offset: 10560)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !271, file: !272, line: 96, baseType: !491, size: 64, offset: 10624)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_equality", scope: !271, file: !272, line: 97, baseType: !491, size: 64, offset: 10688)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_inequality", scope: !271, file: !272, line: 98, baseType: !491, size: 64, offset: 10752)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !271, file: !272, line: 99, baseType: !506, size: 64, offset: 10816)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !271, file: !272, line: 100, baseType: !506, size: 64, offset: 10880)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality", scope: !271, file: !272, line: 101, baseType: !506, size: 64, offset: 10944)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality_pre", scope: !271, file: !272, line: 102, baseType: !506, size: 64, offset: 11008)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality", scope: !271, file: !272, line: 103, baseType: !506, size: 64, offset: 11072)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality_pre", scope: !271, file: !272, line: 104, baseType: !506, size: 64, offset: 11136)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state", scope: !271, file: !272, line: 105, baseType: !506, size: 64, offset: 11200)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_inv", scope: !271, file: !272, line: 106, baseType: !506, size: 64, offset: 11264)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design", scope: !271, file: !272, line: 107, baseType: !506, size: 64, offset: 11328)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_pre", scope: !271, file: !272, line: 108, baseType: !506, size: 64, offset: 11392)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design_pre", scope: !271, file: !272, line: 109, baseType: !506, size: 64, offset: 11456)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "state_is", scope: !271, file: !272, line: 110, baseType: !621, size: 64, offset: 11520)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !622, line: 11, baseType: !623)
!622 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !622, line: 11, flags: DIFlagFwdDecl)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "design_is", scope: !271, file: !272, line: 111, baseType: !621, size: 64, offset: 11584)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !271, file: !272, line: 112, baseType: !392, size: 64, offset: 11648)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !271, file: !272, line: 113, baseType: !392, size: 64, offset: 11712)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "gnorm0", scope: !271, file: !272, line: 114, baseType: !392, size: 64, offset: 11776)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm", scope: !271, file: !272, line: 115, baseType: !392, size: 64, offset: 11840)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm0", scope: !271, file: !272, line: 116, baseType: !392, size: 64, offset: 11904)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !271, file: !272, line: 117, baseType: !392, size: 64, offset: 11968)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !271, file: !272, line: 119, baseType: !337, size: 32, offset: 12032)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !271, file: !272, line: 120, baseType: !337, size: 32, offset: 12064)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "max_constraints", scope: !271, file: !272, line: 121, baseType: !337, size: 32, offset: 12096)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !271, file: !272, line: 122, baseType: !337, size: 32, offset: 12128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ngrads", scope: !271, file: !272, line: 123, baseType: !337, size: 32, offset: 12160)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncgrads", scope: !271, file: !272, line: 124, baseType: !337, size: 32, offset: 12192)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "nhess", scope: !271, file: !272, line: 125, baseType: !337, size: 32, offset: 12224)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !271, file: !272, line: 126, baseType: !337, size: 32, offset: 12256)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ntotalits", scope: !271, file: !272, line: 127, baseType: !337, size: 32, offset: 12288)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "nconstraints", scope: !271, file: !272, line: 128, baseType: !337, size: 32, offset: 12320)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "niconstraints", scope: !271, file: !272, line: 129, baseType: !337, size: 32, offset: 12352)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "neconstraints", scope: !271, file: !272, line: 130, baseType: !337, size: 32, offset: 12384)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "njac", scope: !271, file: !272, line: 131, baseType: !337, size: 32, offset: 12416)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "njac_equality", scope: !271, file: !272, line: 132, baseType: !337, size: 32, offset: 12448)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "njac_inequality", scope: !271, file: !272, line: 133, baseType: !337, size: 32, offset: 12480)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "njac_state", scope: !271, file: !272, line: 134, baseType: !337, size: 32, offset: 12512)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "njac_design", scope: !271, file: !272, line: 135, baseType: !337, size: 32, offset: 12544)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_its", scope: !271, file: !272, line: 137, baseType: !337, size: 32, offset: 12576)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_tot_its", scope: !271, file: !272, line: 138, baseType: !337, size: 32, offset: 12608)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !271, file: !272, line: 140, baseType: !652, size: 64, offset: 12672)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearch", file: !244, line: 5, baseType: !653)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TaoLineSearch", file: !244, line: 5, flags: DIFlagFwdDecl)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "lsflag", scope: !271, file: !272, line: 141, baseType: !453, size: 32, offset: 12736)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !271, file: !272, line: 142, baseType: !657, size: 64, offset: 12800)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !49, line: 22, baseType: !658)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !49, line: 22, flags: DIFlagFwdDecl)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "trust0", scope: !271, file: !272, line: 143, baseType: !392, size: 64, offset: 12864)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !271, file: !272, line: 144, baseType: !392, size: 64, offset: 12928)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "gatol", scope: !271, file: !272, line: 146, baseType: !392, size: 64, offset: 12992)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "grtol", scope: !271, file: !272, line: 147, baseType: !392, size: 64, offset: 13056)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "gttol", scope: !271, file: !272, line: 148, baseType: !392, size: 64, offset: 13120)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "catol", scope: !271, file: !272, line: 149, baseType: !392, size: 64, offset: 13184)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "crtol", scope: !271, file: !272, line: 150, baseType: !392, size: 64, offset: 13248)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "steptol", scope: !271, file: !272, line: 151, baseType: !392, size: 64, offset: 13312)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "fmin", scope: !271, file: !272, line: 152, baseType: !392, size: 64, offset: 13376)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs_changed", scope: !271, file: !272, line: 153, baseType: !453, size: 32, offset: 13440)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "max_it_changed", scope: !271, file: !272, line: 154, baseType: !453, size: 32, offset: 13472)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "gatol_changed", scope: !271, file: !272, line: 155, baseType: !453, size: 32, offset: 13504)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "grtol_changed", scope: !271, file: !272, line: 156, baseType: !453, size: 32, offset: 13536)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "gttol_changed", scope: !271, file: !272, line: 157, baseType: !453, size: 32, offset: 13568)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "fmin_changed", scope: !271, file: !272, line: 158, baseType: !453, size: 32, offset: 13600)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "catol_changed", scope: !271, file: !272, line: 159, baseType: !453, size: 32, offset: 13632)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "crtol_changed", scope: !271, file: !272, line: 160, baseType: !453, size: 32, offset: 13664)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "steptol_changed", scope: !271, file: !272, line: 161, baseType: !453, size: 32, offset: 13696)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "trust0_changed", scope: !271, file: !272, line: 162, baseType: !453, size: 32, offset: 13728)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "printreason", scope: !271, file: !272, line: 163, baseType: !453, size: 32, offset: 13760)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "viewsolution", scope: !271, file: !272, line: 164, baseType: !453, size: 32, offset: 13792)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "viewgradient", scope: !271, file: !272, line: 165, baseType: !453, size: 32, offset: 13824)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "viewconstraints", scope: !271, file: !272, line: 166, baseType: !453, size: 32, offset: 13856)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "viewhessian", scope: !271, file: !272, line: 167, baseType: !453, size: 32, offset: 13888)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "viewjacobian", scope: !271, file: !272, line: 168, baseType: !453, size: 32, offset: 13920)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "bounded", scope: !271, file: !272, line: 169, baseType: !453, size: 32, offset: 13952)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "constrained", scope: !271, file: !272, line: 170, baseType: !453, size: 32, offset: 13984)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "eq_constrained", scope: !271, file: !272, line: 171, baseType: !453, size: 32, offset: 14016)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_constrained", scope: !271, file: !272, line: 172, baseType: !453, size: 32, offset: 14048)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_doublesided", scope: !271, file: !272, line: 173, baseType: !453, size: 32, offset: 14080)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "header_printed", scope: !271, file: !272, line: 174, baseType: !453, size: 32, offset: 14112)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "recycle", scope: !271, file: !272, line: 175, baseType: !453, size: 32, offset: 14144)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "subset_type", scope: !271, file: !272, line: 177, baseType: !693, size: 32, offset: 14176)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoSubsetType", file: !27, line: 26, baseType: !43)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "hist_max", scope: !271, file: !272, line: 178, baseType: !337, size: 32, offset: 14208)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "hist_obj", scope: !271, file: !272, line: 179, baseType: !391, size: 64, offset: 14272)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "hist_resid", scope: !271, file: !272, line: 180, baseType: !391, size: 64, offset: 14336)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "hist_cnorm", scope: !271, file: !272, line: 181, baseType: !391, size: 64, offset: 14400)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "hist_lits", scope: !271, file: !272, line: 182, baseType: !383, size: 64, offset: 14464)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "hist_len", scope: !271, file: !272, line: 183, baseType: !337, size: 32, offset: 14528)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "hist_reset", scope: !271, file: !272, line: 184, baseType: !453, size: 32, offset: 14560)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "hist_malloc", scope: !271, file: !272, line: 185, baseType: !453, size: 32, offset: 14592)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "computestep", scope: !262, file: !261, line: 16, baseType: !703, size: 64, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{!268, !269, !453, !706, !383}
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !49, line: 540, baseType: !48)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "bncg", scope: !262, file: !261, line: 19, baseType: !269, size: 64, offset: 128)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "bncg_ctx", scope: !262, file: !261, line: 20, baseType: !710, size: 64, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "TAO_BNCG", file: !712, line: 50, baseType: !713)
!712 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/tao/bound/impls/bncg/bncg.h", directory: "/home/users/ndemeye/xSDK")
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !712, line: 10, size: 3456, elements: !714)
!714 = !{!715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !713, file: !712, line: 11, baseType: !506, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !713, file: !712, line: 12, baseType: !506, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "G_old", scope: !713, file: !712, line: 13, baseType: !491, size: 64, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "X_old", scope: !713, file: !712, line: 13, baseType: !491, size: 64, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "W", scope: !713, file: !712, line: 13, baseType: !491, size: 64, offset: 256)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !713, file: !712, line: 13, baseType: !491, size: 64, offset: 320)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "g_work", scope: !713, file: !712, line: 14, baseType: !491, size: 64, offset: 384)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "y_work", scope: !713, file: !712, line: 14, baseType: !491, size: 64, offset: 448)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "d_work", scope: !713, file: !712, line: 14, baseType: !491, size: 64, offset: 512)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !713, file: !712, line: 15, baseType: !491, size: 64, offset: 576)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "yk", scope: !713, file: !712, line: 15, baseType: !491, size: 64, offset: 640)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "unprojected_gradient", scope: !713, file: !712, line: 16, baseType: !491, size: 64, offset: 704)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "unprojected_gradient_old", scope: !713, file: !712, line: 16, baseType: !491, size: 64, offset: 768)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_grad", scope: !713, file: !712, line: 17, baseType: !491, size: 64, offset: 832)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_step", scope: !713, file: !712, line: 17, baseType: !491, size: 64, offset: 896)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "active_lower", scope: !713, file: !712, line: 19, baseType: !621, size: 64, offset: 960)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "active_upper", scope: !713, file: !712, line: 19, baseType: !621, size: 64, offset: 1024)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "active_fixed", scope: !713, file: !712, line: 19, baseType: !621, size: 64, offset: 1088)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "active_idx", scope: !713, file: !712, line: 19, baseType: !621, size: 64, offset: 1152)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_idx", scope: !713, file: !712, line: 19, baseType: !621, size: 64, offset: 1216)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_old", scope: !713, file: !712, line: 19, baseType: !621, size: 64, offset: 1280)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "new_inactives", scope: !713, file: !712, line: 19, baseType: !621, size: 64, offset: 1344)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !713, file: !712, line: 21, baseType: !392, size: 64, offset: 1408)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "hz_theta", scope: !713, file: !712, line: 22, baseType: !392, size: 64, offset: 1472)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "xi", scope: !713, file: !712, line: 23, baseType: !392, size: 64, offset: 1536)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "theta", scope: !713, file: !712, line: 24, baseType: !392, size: 64, offset: 1600)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "zeta", scope: !713, file: !712, line: 25, baseType: !392, size: 64, offset: 1664)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "hz_eta", scope: !713, file: !712, line: 26, baseType: !392, size: 64, offset: 1728)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "dk_eta", scope: !713, file: !712, line: 26, baseType: !392, size: 64, offset: 1792)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "bfgs_scale", scope: !713, file: !712, line: 27, baseType: !392, size: 64, offset: 1856)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "dfp_scale", scope: !713, file: !712, line: 27, baseType: !392, size: 64, offset: 1920)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "tau_bfgs", scope: !713, file: !712, line: 28, baseType: !392, size: 64, offset: 1984)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "tau_dfp", scope: !713, file: !712, line: 28, baseType: !392, size: 64, offset: 2048)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "as_step", scope: !713, file: !712, line: 29, baseType: !392, size: 64, offset: 2112)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "as_tol", scope: !713, file: !712, line: 29, baseType: !392, size: 64, offset: 2176)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "yts", scope: !713, file: !712, line: 29, baseType: !392, size: 64, offset: 2240)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "yty", scope: !713, file: !712, line: 29, baseType: !392, size: 64, offset: 2304)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "sts", scope: !713, file: !712, line: 29, baseType: !392, size: 64, offset: 2368)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !713, file: !712, line: 30, baseType: !392, size: 64, offset: 2432)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "delta_min", scope: !713, file: !712, line: 30, baseType: !392, size: 64, offset: 2496)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "delta_max", scope: !713, file: !712, line: 30, baseType: !392, size: 64, offset: 2560)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon", scope: !713, file: !712, line: 31, baseType: !392, size: 64, offset: 2624)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "eps_23", scope: !713, file: !712, line: 32, baseType: !392, size: 64, offset: 2688)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "cg_type", scope: !713, file: !712, line: 34, baseType: !337, size: 32, offset: 2752)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "min_restart_num", scope: !713, file: !712, line: 35, baseType: !337, size: 32, offset: 2784)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ls_fails", scope: !713, file: !712, line: 36, baseType: !337, size: 32, offset: 2816)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "resets", scope: !713, file: !712, line: 36, baseType: !337, size: 32, offset: 2848)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "descent_error", scope: !713, file: !712, line: 36, baseType: !337, size: 32, offset: 2880)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "skipped_updates", scope: !713, file: !712, line: 36, baseType: !337, size: 32, offset: 2912)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "pure_gd_steps", scope: !713, file: !712, line: 36, baseType: !337, size: 32, offset: 2944)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "iter_quad", scope: !713, file: !712, line: 37, baseType: !337, size: 32, offset: 2976)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "min_quad", scope: !713, file: !712, line: 37, baseType: !337, size: 32, offset: 3008)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "as_type", scope: !713, file: !712, line: 38, baseType: !337, size: 32, offset: 3040)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "inv_sig", scope: !713, file: !712, line: 40, baseType: !453, size: 32, offset: 3072)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "tol_quad", scope: !713, file: !712, line: 41, baseType: !392, size: 64, offset: 3136)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "dynamic_restart", scope: !713, file: !712, line: 42, baseType: !453, size: 32, offset: 3200)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "spaced_restart", scope: !713, file: !712, line: 43, baseType: !453, size: 32, offset: 3232)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "use_dynamic_restart", scope: !713, file: !712, line: 44, baseType: !453, size: 32, offset: 3264)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "neg_xi", scope: !713, file: !712, line: 45, baseType: !453, size: 32, offset: 3296)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "unscaled_restart", scope: !713, file: !712, line: 46, baseType: !453, size: 32, offset: 3328)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "diag_scaling", scope: !713, file: !712, line: 47, baseType: !453, size: 32, offset: 3360)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "no_scaling", scope: !713, file: !712, line: 48, baseType: !453, size: 32, offset: 3392)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "max_cg_its", scope: !262, file: !261, line: 21, baseType: !337, size: 32, offset: 256)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "tot_cg_its", scope: !262, file: !261, line: 21, baseType: !337, size: 32, offset: 288)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "bncg_sol", scope: !262, file: !261, line: 22, baseType: !491, size: 64, offset: 320)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "W", scope: !262, file: !261, line: 25, baseType: !491, size: 64, offset: 384)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "Xwork", scope: !262, file: !261, line: 25, baseType: !491, size: 64, offset: 448)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "Gwork", scope: !262, file: !261, line: 25, baseType: !491, size: 64, offset: 512)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "Xold", scope: !262, file: !261, line: 25, baseType: !491, size: 64, offset: 576)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "Gold", scope: !262, file: !261, line: 25, baseType: !491, size: 64, offset: 640)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "unprojected_gradient", scope: !262, file: !261, line: 26, baseType: !491, size: 64, offset: 704)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "unprojected_gradient_old", scope: !262, file: !261, line: 26, baseType: !491, size: 64, offset: 768)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "H_inactive", scope: !262, file: !261, line: 29, baseType: !506, size: 64, offset: 832)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "Hpre_inactive", scope: !262, file: !261, line: 29, baseType: !506, size: 64, offset: 896)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "X_inactive", scope: !262, file: !261, line: 30, baseType: !491, size: 64, offset: 960)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "G_inactive", scope: !262, file: !261, line: 30, baseType: !491, size: 64, offset: 1024)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_work", scope: !262, file: !261, line: 30, baseType: !491, size: 64, offset: 1088)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "active_work", scope: !262, file: !261, line: 30, baseType: !491, size: 64, offset: 1152)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_idx", scope: !262, file: !261, line: 31, baseType: !621, size: 64, offset: 1216)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "active_idx", scope: !262, file: !261, line: 31, baseType: !621, size: 64, offset: 1280)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "active_lower", scope: !262, file: !261, line: 31, baseType: !621, size: 64, offset: 1344)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "active_upper", scope: !262, file: !261, line: 31, baseType: !621, size: 64, offset: 1408)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "active_fixed", scope: !262, file: !261, line: 31, baseType: !621, size: 64, offset: 1472)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "fold", scope: !262, file: !261, line: 34, baseType: !392, size: 64, offset: 1536)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !262, file: !261, line: 34, baseType: !392, size: 64, offset: 1600)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "gnorm", scope: !262, file: !261, line: 34, baseType: !392, size: 64, offset: 1664)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "dnorm", scope: !262, file: !261, line: 34, baseType: !392, size: 64, offset: 1728)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "as_tol", scope: !262, file: !261, line: 37, baseType: !392, size: 64, offset: 1792)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "as_step", scope: !262, file: !261, line: 38, baseType: !392, size: 64, offset: 1856)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "bfgs_pre", scope: !262, file: !261, line: 41, baseType: !805, size: 64, offset: 1920)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !806, line: 11, baseType: !807)
!806 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpctypes.h", directory: "/home/users/ndemeye/xSDK")
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !806, line: 11, flags: DIFlagFwdDecl)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !262, file: !261, line: 42, baseType: !506, size: 64, offset: 1984)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "Diag_min", scope: !262, file: !261, line: 43, baseType: !491, size: 64, offset: 2048)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "Diag_max", scope: !262, file: !261, line: 43, baseType: !491, size: 64, offset: 2112)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "sval", scope: !262, file: !261, line: 78, baseType: !392, size: 64, offset: 2176)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "imin", scope: !262, file: !261, line: 80, baseType: !392, size: 64, offset: 2240)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "imax", scope: !262, file: !261, line: 81, baseType: !392, size: 64, offset: 2304)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "imfac", scope: !262, file: !261, line: 82, baseType: !392, size: 64, offset: 2368)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "pert", scope: !262, file: !261, line: 84, baseType: !392, size: 64, offset: 2432)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "pmin", scope: !262, file: !261, line: 85, baseType: !392, size: 64, offset: 2496)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "pmax", scope: !262, file: !261, line: 86, baseType: !392, size: 64, offset: 2560)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "pgfac", scope: !262, file: !261, line: 87, baseType: !392, size: 64, offset: 2624)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "psfac", scope: !262, file: !261, line: 88, baseType: !392, size: 64, offset: 2688)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "pmgfac", scope: !262, file: !261, line: 89, baseType: !392, size: 64, offset: 2752)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "pmsfac", scope: !262, file: !261, line: 90, baseType: !392, size: 64, offset: 2816)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "nu1", scope: !262, file: !261, line: 105, baseType: !392, size: 64, offset: 2880)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "nu2", scope: !262, file: !261, line: 106, baseType: !392, size: 64, offset: 2944)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "nu3", scope: !262, file: !261, line: 107, baseType: !392, size: 64, offset: 3008)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "nu4", scope: !262, file: !261, line: 108, baseType: !392, size: 64, offset: 3072)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "omega1", scope: !262, file: !261, line: 110, baseType: !392, size: 64, offset: 3136)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "omega2", scope: !262, file: !261, line: 111, baseType: !392, size: 64, offset: 3200)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "omega3", scope: !262, file: !261, line: 112, baseType: !392, size: 64, offset: 3264)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "omega4", scope: !262, file: !261, line: 113, baseType: !392, size: 64, offset: 3328)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "omega5", scope: !262, file: !261, line: 114, baseType: !392, size: 64, offset: 3392)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "eta1", scope: !262, file: !261, line: 131, baseType: !392, size: 64, offset: 3456)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "eta2", scope: !262, file: !261, line: 132, baseType: !392, size: 64, offset: 3520)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "eta3", scope: !262, file: !261, line: 133, baseType: !392, size: 64, offset: 3584)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "eta4", scope: !262, file: !261, line: 134, baseType: !392, size: 64, offset: 3648)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "alpha1", scope: !262, file: !261, line: 136, baseType: !392, size: 64, offset: 3712)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "alpha2", scope: !262, file: !261, line: 137, baseType: !392, size: 64, offset: 3776)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "alpha3", scope: !262, file: !261, line: 138, baseType: !392, size: 64, offset: 3840)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "alpha4", scope: !262, file: !261, line: 139, baseType: !392, size: 64, offset: 3904)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "alpha5", scope: !262, file: !261, line: 140, baseType: !392, size: 64, offset: 3968)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "mu1", scope: !262, file: !261, line: 160, baseType: !392, size: 64, offset: 4032)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "mu2", scope: !262, file: !261, line: 161, baseType: !392, size: 64, offset: 4096)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "gamma1", scope: !262, file: !261, line: 163, baseType: !392, size: 64, offset: 4160)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "gamma2", scope: !262, file: !261, line: 164, baseType: !392, size: 64, offset: 4224)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "gamma3", scope: !262, file: !261, line: 165, baseType: !392, size: 64, offset: 4288)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "gamma4", scope: !262, file: !261, line: 166, baseType: !392, size: 64, offset: 4352)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "theta", scope: !262, file: !261, line: 168, baseType: !392, size: 64, offset: 4416)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "mu1_i", scope: !262, file: !261, line: 171, baseType: !392, size: 64, offset: 4480)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "mu2_i", scope: !262, file: !261, line: 172, baseType: !392, size: 64, offset: 4544)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "gamma1_i", scope: !262, file: !261, line: 174, baseType: !392, size: 64, offset: 4608)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "gamma2_i", scope: !262, file: !261, line: 175, baseType: !392, size: 64, offset: 4672)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "gamma3_i", scope: !262, file: !261, line: 176, baseType: !392, size: 64, offset: 4736)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "gamma4_i", scope: !262, file: !261, line: 177, baseType: !392, size: 64, offset: 4800)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "theta_i", scope: !262, file: !261, line: 179, baseType: !392, size: 64, offset: 4864)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "min_radius", scope: !262, file: !261, line: 182, baseType: !392, size: 64, offset: 4928)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "max_radius", scope: !262, file: !261, line: 183, baseType: !392, size: 64, offset: 4992)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon", scope: !262, file: !261, line: 184, baseType: !392, size: 64, offset: 5056)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "dmin", scope: !262, file: !261, line: 185, baseType: !392, size: 64, offset: 5120)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "dmax", scope: !262, file: !261, line: 185, baseType: !392, size: 64, offset: 5184)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "newt", scope: !262, file: !261, line: 187, baseType: !337, size: 32, offset: 5248)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "bfgs", scope: !262, file: !261, line: 188, baseType: !337, size: 32, offset: 5280)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "sgrad", scope: !262, file: !261, line: 189, baseType: !337, size: 32, offset: 5312)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "grad", scope: !262, file: !261, line: 190, baseType: !337, size: 32, offset: 5344)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "as_type", scope: !262, file: !261, line: 192, baseType: !337, size: 32, offset: 5376)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "bfgs_scale_type", scope: !262, file: !261, line: 193, baseType: !337, size: 32, offset: 5408)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "init_type", scope: !262, file: !261, line: 194, baseType: !337, size: 32, offset: 5440)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "update_type", scope: !262, file: !261, line: 195, baseType: !337, size: 32, offset: 5472)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_atol", scope: !262, file: !261, line: 198, baseType: !337, size: 32, offset: 5504)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_rtol", scope: !262, file: !261, line: 199, baseType: !337, size: 32, offset: 5536)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_ctol", scope: !262, file: !261, line: 200, baseType: !337, size: 32, offset: 5568)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_negc", scope: !262, file: !261, line: 201, baseType: !337, size: 32, offset: 5600)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_dtol", scope: !262, file: !261, line: 202, baseType: !337, size: 32, offset: 5632)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_iter", scope: !262, file: !261, line: 203, baseType: !337, size: 32, offset: 5664)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_othr", scope: !262, file: !261, line: 204, baseType: !337, size: 32, offset: 5696)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "is_nash", scope: !262, file: !261, line: 205, baseType: !453, size: 32, offset: 5728)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "is_stcg", scope: !262, file: !261, line: 205, baseType: !453, size: 32, offset: 5760)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "is_gltr", scope: !262, file: !261, line: 205, baseType: !453, size: 32, offset: 5792)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !262, file: !261, line: 208, baseType: !374, size: 64, offset: 5824)
!879 = !{!0, !880, !886}
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(name: "BNK_UPDATE", scope: !2, file: !882, line: 6, type: !883, isLocal: true, isDefinition: true)
!882 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/tao/bound/impls/bnk/bnk.c", directory: "/home/users/ndemeye/xSDK")
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 4096, elements: !884)
!884 = !{!885}
!885 = !DISubrange(count: 64)
!886 = !DIGlobalVariableExpression(var: !887, expr: !DIExpression())
!887 = distinct !DIGlobalVariable(name: "BNK_AS", scope: !2, file: !882, line: 7, type: !883, isLocal: true, isDefinition: true)
!888 = !{i32 7, !"Dwarf Version", i32 4}
!889 = !{i32 2, !"Debug Info Version", i32 3}
!890 = !{i32 1, !"wchar_size", i32 4}
!891 = !{i32 7, !"PIC Level", i32 2}
!892 = !{i32 7, !"uwtable", i32 1}
!893 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!894 = distinct !DISubprogram(name: "TaoBNKInitialize", scope: !882, file: !882, line: 13, type: !895, scopeLine: 14, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !898)
!895 = !DISubroutineType(types: !896)
!896 = !{!268, !269, !337, !897}
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !931, !933, !937, !939, !941, !943, !945, !947, !949, !951, !953, !955, !957, !959, !961, !963, !965, !967, !971, !973, !975, !977, !979, !981, !985, !987, !989, !999, !1001, !1003, !1007, !1010, !1015, !1017, !1019, !1021, !1023, !1025, !1027, !1033, !1035, !1037, !1039, !1043, !1045, !1049, !1051, !1053, !1055, !1057, !1059, !1061, !1063, !1065, !1067, !1069, !1071, !1073, !1075, !1077}
!899 = !DILocalVariable(name: "tao", arg: 1, scope: !894, file: !882, line: 13, type: !269)
!900 = !DILocalVariable(name: "initType", arg: 2, scope: !894, file: !882, line: 13, type: !337)
!901 = !DILocalVariable(name: "needH", arg: 3, scope: !894, file: !882, line: 13, type: !897)
!902 = !DILocalVariable(name: "ierr", scope: !894, file: !882, line: 15, type: !268)
!903 = !DILocalVariable(name: "bnk", scope: !894, file: !882, line: 16, type: !259)
!904 = !DILocalVariable(name: "pc", scope: !894, file: !882, line: 17, type: !805)
!905 = !DILocalVariable(name: "f_min", scope: !894, file: !882, line: 19, type: !392)
!906 = !DILocalVariable(name: "ftrial", scope: !894, file: !882, line: 19, type: !392)
!907 = !DILocalVariable(name: "prered", scope: !894, file: !882, line: 19, type: !392)
!908 = !DILocalVariable(name: "actred", scope: !894, file: !882, line: 19, type: !392)
!909 = !DILocalVariable(name: "kappa", scope: !894, file: !882, line: 19, type: !392)
!910 = !DILocalVariable(name: "sigma", scope: !894, file: !882, line: 19, type: !392)
!911 = !DILocalVariable(name: "resnorm", scope: !894, file: !882, line: 19, type: !392)
!912 = !DILocalVariable(name: "tau", scope: !894, file: !882, line: 20, type: !392)
!913 = !DILocalVariable(name: "tau_1", scope: !894, file: !882, line: 20, type: !392)
!914 = !DILocalVariable(name: "tau_2", scope: !894, file: !882, line: 20, type: !392)
!915 = !DILocalVariable(name: "tau_max", scope: !894, file: !882, line: 20, type: !392)
!916 = !DILocalVariable(name: "tau_min", scope: !894, file: !882, line: 20, type: !392)
!917 = !DILocalVariable(name: "max_radius", scope: !894, file: !882, line: 20, type: !392)
!918 = !DILocalVariable(name: "is_bfgs", scope: !894, file: !882, line: 21, type: !453)
!919 = !DILocalVariable(name: "is_jacobi", scope: !894, file: !882, line: 21, type: !453)
