; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/sell/seq/fdsell.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/sell/seq/fdsell.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!252 = !DIEnumerator(name: "MATOP_HERMITIAN_TRANSPOSE", value: 120, isUnsigned: true)
!253 = !DIEnumerator(name: "MATOP_MULT_HERMITIAN_TRANSPOSE", value: 121, isUnsigned: true)
!254 = !DIEnumerator(name: "MATOP_MULT_HERMITIAN_TRANS_ADD", value: 122, isUnsigned: true)
!255 = !DIEnumerator(name: "MATOP_GET_MULTI_PROC_BLOCK", value: 123, isUnsigned: true)
!256 = !DIEnumerator(name: "MATOP_FIND_NONZERO_ROWS", value: 124, isUnsigned: true)
!257 = !DIEnumerator(name: "MATOP_GET_COLUMN_NORMS", value: 125, isUnsigned: true)
!258 = !DIEnumerator(name: "MATOP_INVERT_BLOCK_DIAGONAL", value: 126, isUnsigned: true)
!259 = !DIEnumerator(name: "MATOP_CREATE_SUB_MATRICES_MPI", value: 128, isUnsigned: true)
!260 = !DIEnumerator(name: "MATOP_SET_VALUES_BATCH", value: 129, isUnsigned: true)
!261 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT", value: 130, isUnsigned: true)
!262 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_SYMBO", value: 131, isUnsigned: true)
!263 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_NUMER", value: 132, isUnsigned: true)
!264 = !DIEnumerator(name: "MATOP_TRANSPOSE_COLORING_CREAT", value: 133, isUnsigned: true)
!265 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_SPT", value: 134, isUnsigned: true)
!266 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_DEN", value: 135, isUnsigned: true)
!267 = !DIEnumerator(name: "MATOP_RART", value: 136, isUnsigned: true)
!268 = !DIEnumerator(name: "MATOP_RART_SYMBOLIC", value: 137, isUnsigned: true)
!269 = !DIEnumerator(name: "MATOP_RART_NUMERIC", value: 138, isUnsigned: true)
!270 = !DIEnumerator(name: "MATOP_SET_BLOCK_SIZES", value: 139, isUnsigned: true)
!271 = !DIEnumerator(name: "MATOP_AYPX", value: 140, isUnsigned: true)
!272 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!273 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!274 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!275 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!276 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!277 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !52, line: 161, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284, !285, !286, !287}
!280 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!285 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!286 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!287 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!288 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !52, line: 1265, baseType: !5, size: 32, elements: !289)
!289 = !{!290, !291, !292}
!290 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!291 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!292 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!293 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !52, line: 1203, baseType: !5, size: 32, elements: !294)
!294 = !{!295, !296, !297, !298, !299}
!295 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!296 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!297 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!298 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!299 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !52, line: 187, baseType: !5, size: 32, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !307, !308}
!302 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!305 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!306 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!307 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!308 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!309 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !310, line: 663, baseType: !5, size: 32, elements: !311)
!310 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!311 = !{!312, !313, !314}
!312 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!313 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!314 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!315 = !{!316, !399, !528, !378, !457, !322, !447}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_SeqSELL", file: !318, line: 50, baseType: !319)
!318 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/sell/seq/sell.h", directory: "/home/users/ndemeye/xSDK")
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !318, line: 43, size: 1920, elements: !320)
!320 = !{!321, !323, !325, !326, !327, !328, !329, !330, !331, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !350, !352, !695, !696, !697, !698, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "roworiented", scope: !319, file: !318, line: 44, baseType: !322, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "nonew", scope: !319, file: !318, line: 44, baseType: !324, size: 32, offset: 32)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !88)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "nounused", scope: !319, file: !318, line: 44, baseType: !324, size: 32, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "singlemalloc", scope: !319, file: !318, line: 44, baseType: !322, size: 32, offset: 96)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "maxallocmat", scope: !319, file: !318, line: 44, baseType: !324, size: 32, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "maxallocrow", scope: !319, file: !318, line: 44, baseType: !324, size: 32, offset: 160)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "nz", scope: !319, file: !318, line: 44, baseType: !324, size: 32, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "rlenmax", scope: !319, file: !318, line: 44, baseType: !324, size: 32, offset: 224)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "rlen", scope: !319, file: !318, line: 44, baseType: !332, size: 64, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "free_rlen", scope: !319, file: !318, line: 44, baseType: !322, size: 32, offset: 320)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !319, file: !318, line: 44, baseType: !324, size: 32, offset: 352)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "keepnonzeropattern", scope: !319, file: !318, line: 44, baseType: !322, size: 32, offset: 384)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "ignorezeroentries", scope: !319, file: !318, line: 44, baseType: !322, size: 32, offset: 416)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "free_colidx", scope: !319, file: !318, line: 44, baseType: !322, size: 32, offset: 448)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "free_val", scope: !319, file: !318, line: 44, baseType: !322, size: 32, offset: 480)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "colidx", scope: !319, file: !318, line: 44, baseType: !332, size: 64, offset: 512)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "diag", scope: !319, file: !318, line: 44, baseType: !332, size: 64, offset: 576)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerorowcnt", scope: !319, file: !318, line: 44, baseType: !324, size: 32, offset: 640)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "free_diag", scope: !319, file: !318, line: 44, baseType: !322, size: 32, offset: 672)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !319, file: !318, line: 44, baseType: !344, size: 64, offset: 704)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatScalar", file: !346, line: 799, baseType: !347)
!346 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmath.h", directory: "/home/users/ndemeye/xSDK")
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !349)
!349 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "solve_work", scope: !319, file: !318, line: 44, baseType: !351, size: 64, offset: 768)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !319, file: !318, line: 44, baseType: !353, size: 64, offset: 832)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !354, line: 11, baseType: !355)
!354 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !46, line: 50, size: 7104, elements: !357)
!357 = !{!358, !561, !628, !682, !683, !684, !685, !686, !687, !688, !689, !692}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !356, file: !46, line: 51, baseType: !359, size: 4480)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !360, line: 122, baseType: !361)
!360 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !360, line: 73, size: 4480, elements: !362)
!362 = !{!363, !365, !420, !421, !422, !424, !425, !426, !427, !435, !436, !438, !442, !446, !448, !449, !450, !451, !452, !453, !454, !455, !456, !458, !460, !461, !462, !464, !465, !466, !468, !469, !470, !471, !472, !474, !476, !477, !478, !479, !480, !481, !483, !484, !485, !495, !497, !498, !502, !503, !551, !556, !558, !559, !560}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !361, file: !360, line: 74, baseType: !364, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !88)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !361, file: !360, line: 75, baseType: !366, size: 448, offset: 64)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 448, elements: !418)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !360, line: 53, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !360, line: 45, size: 448, elements: !369)
!369 = !{!370, !382, !390, !395, !402, !406, !413}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !368, file: !360, line: 46, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!374, !375, !377}
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !88)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !379, line: 330, baseType: !380)
!379 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !379, line: 330, flags: DIFlagFwdDecl)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !368, file: !360, line: 47, baseType: !383, size: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!374, !375, !386}
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !387, line: 16, baseType: !388)
!387 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !387, line: 16, flags: DIFlagFwdDecl)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !368, file: !360, line: 48, baseType: !391, size: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!374, !394}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !368, file: !360, line: 49, baseType: !396, size: 64, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!374, !375, !399, !375}
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !401)
!401 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !368, file: !360, line: 50, baseType: !403, size: 64, offset: 256)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!374, !375, !399, !394}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !368, file: !360, line: 51, baseType: !407, size: 64, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!374, !375, !399, !410}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{null}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !368, file: !360, line: 52, baseType: !414, size: 64, offset: 384)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!374, !375, !399, !417}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!418 = !{!419}
!419 = !DISubrange(count: 1)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !361, file: !360, line: 76, baseType: !378, size: 64, offset: 512)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !361, file: !360, line: 77, baseType: !324, size: 32, offset: 576)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !361, file: !360, line: 78, baseType: !423, size: 64, offset: 640)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !349)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !361, file: !360, line: 78, baseType: !423, size: 64, offset: 704)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !361, file: !360, line: 78, baseType: !423, size: 64, offset: 768)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !361, file: !360, line: 78, baseType: !423, size: 64, offset: 832)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !361, file: !360, line: 79, baseType: !428, size: 64, offset: 896)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !430)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !431, line: 27, baseType: !432)
!431 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !433, line: 43, baseType: !434)
!433 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!434 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !361, file: !360, line: 80, baseType: !324, size: 32, offset: 960)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !361, file: !360, line: 81, baseType: !437, size: 32, offset: 992)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !88)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !361, file: !360, line: 82, baseType: !439, size: 64, offset: 1024)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !361, file: !360, line: 83, baseType: !443, size: 64, offset: 1088)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !444)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !361, file: !360, line: 84, baseType: !447, size: 64, offset: 1152)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !361, file: !360, line: 85, baseType: !447, size: 64, offset: 1216)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !361, file: !360, line: 86, baseType: !447, size: 64, offset: 1280)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !361, file: !360, line: 87, baseType: !447, size: 64, offset: 1344)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !361, file: !360, line: 88, baseType: !375, size: 64, offset: 1408)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !361, file: !360, line: 89, baseType: !428, size: 64, offset: 1472)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !361, file: !360, line: 90, baseType: !447, size: 64, offset: 1536)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !361, file: !360, line: 91, baseType: !447, size: 64, offset: 1600)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !361, file: !360, line: 92, baseType: !324, size: 32, offset: 1664)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !361, file: !360, line: 93, baseType: !457, size: 64, offset: 1728)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !361, file: !360, line: 94, baseType: !459, size: 64, offset: 1792)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !429)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !361, file: !360, line: 95, baseType: !324, size: 32, offset: 1856)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !361, file: !360, line: 95, baseType: !324, size: 32, offset: 1888)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !361, file: !360, line: 96, baseType: !463, size: 64, offset: 1920)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !361, file: !360, line: 96, baseType: !463, size: 64, offset: 1984)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !361, file: !360, line: 97, baseType: !332, size: 64, offset: 2048)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !361, file: !360, line: 97, baseType: !467, size: 64, offset: 2112)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !361, file: !360, line: 98, baseType: !324, size: 32, offset: 2176)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !361, file: !360, line: 98, baseType: !324, size: 32, offset: 2208)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !361, file: !360, line: 99, baseType: !463, size: 64, offset: 2240)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !361, file: !360, line: 99, baseType: !463, size: 64, offset: 2304)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !361, file: !360, line: 100, baseType: !473, size: 64, offset: 2368)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !361, file: !360, line: 100, baseType: !475, size: 64, offset: 2432)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !361, file: !360, line: 101, baseType: !324, size: 32, offset: 2496)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !361, file: !360, line: 101, baseType: !324, size: 32, offset: 2528)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !361, file: !360, line: 102, baseType: !463, size: 64, offset: 2560)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !361, file: !360, line: 102, baseType: !463, size: 64, offset: 2624)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !361, file: !360, line: 103, baseType: !351, size: 64, offset: 2688)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !361, file: !360, line: 103, baseType: !482, size: 64, offset: 2752)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !361, file: !360, line: 104, baseType: !417, size: 64, offset: 2816)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !361, file: !360, line: 105, baseType: !324, size: 32, offset: 2880)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !361, file: !360, line: 106, baseType: !486, size: 128, offset: 2944)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !487, size: 128, elements: !493)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !360, line: 64, baseType: !489)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !360, line: 61, size: 128, elements: !490)
!490 = !{!491, !492}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !489, file: !360, line: 62, baseType: !410, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !489, file: !360, line: 63, baseType: !457, size: 64, offset: 64)
!493 = !{!494}
!494 = !DISubrange(count: 2)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !361, file: !360, line: 107, baseType: !496, size: 64, offset: 3072)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 64, elements: !493)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !361, file: !360, line: 108, baseType: !457, size: 64, offset: 3136)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !361, file: !360, line: 109, baseType: !499, size: 64, offset: 3200)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{!374, !457}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !361, file: !360, line: 111, baseType: !324, size: 32, offset: 3264)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !361, file: !360, line: 112, baseType: !504, size: 320, offset: 3328)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !505, size: 320, elements: !549)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{!374, !508, !375, !457}
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !510)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !511)
!511 = !{!512, !513, !537, !538, !539, !540, !541, !542, !543, !544, !545}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !510, file: !10, line: 100, baseType: !324, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !510, file: !10, line: 101, baseType: !514, size: 64, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !515)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !517)
!517 = !{!518, !519, !520, !521, !522, !525, !526, !527, !531, !532, !534, !535, !536}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !516, file: !10, line: 84, baseType: !447, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !516, file: !10, line: 85, baseType: !447, size: 64, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !516, file: !10, line: 86, baseType: !457, size: 64, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !516, file: !10, line: 87, baseType: !439, size: 64, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !516, file: !10, line: 88, baseType: !523, size: 64, offset: 256)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !399)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !516, file: !10, line: 89, baseType: !401, size: 8, offset: 320)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !516, file: !10, line: 90, baseType: !447, size: 64, offset: 384)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !516, file: !10, line: 91, baseType: !528, size: 64, offset: 448)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !529, line: 46, baseType: !530)
!529 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!530 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !516, file: !10, line: 92, baseType: !322, size: 32, offset: 512)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !516, file: !10, line: 93, baseType: !533, size: 32, offset: 544)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !516, file: !10, line: 94, baseType: !514, size: 64, offset: 576)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !516, file: !10, line: 95, baseType: !447, size: 64, offset: 640)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !516, file: !10, line: 96, baseType: !457, size: 64, offset: 704)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !510, file: !10, line: 102, baseType: !447, size: 64, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !510, file: !10, line: 102, baseType: !447, size: 64, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !510, file: !10, line: 103, baseType: !447, size: 64, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !510, file: !10, line: 104, baseType: !378, size: 64, offset: 320)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !510, file: !10, line: 105, baseType: !322, size: 32, offset: 384)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !510, file: !10, line: 105, baseType: !322, size: 32, offset: 416)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !510, file: !10, line: 105, baseType: !322, size: 32, offset: 448)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !510, file: !10, line: 106, baseType: !375, size: 64, offset: 512)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !510, file: !10, line: 107, baseType: !546, size: 64, offset: 576)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!549 = !{!550}
!550 = !DISubrange(count: 5)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !361, file: !360, line: 113, baseType: !552, size: 320, offset: 3648)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 320, elements: !549)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{!374, !375, !457}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !361, file: !360, line: 114, baseType: !557, size: 320, offset: 3968)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 320, elements: !549)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !361, file: !360, line: 115, baseType: !322, size: 32, offset: 4288)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !361, file: !360, line: 120, baseType: !546, size: 64, offset: 4352)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !361, file: !360, line: 121, baseType: !322, size: 32, offset: 4416)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !356, file: !46, line: 51, baseType: !562, size: 1536, offset: 4480)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 1536, elements: !418)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ISOps", file: !46, line: 21, size: 1536, elements: !564)
!564 = !{!565, !572, !573, !578, !582, !583, !588, !592, !593, !597, !598, !602, !603, !608, !612, !616, !620, !621, !622, !623, !624, !625, !626, !627}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "getindices", scope: !563, file: !46, line: 22, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!374, !353, !569}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !324)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "restoreindices", scope: !563, file: !46, line: 23, baseType: !566, size: 64, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "invertpermutation", scope: !563, file: !46, line: 24, baseType: !574, size: 64, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!374, !353, !324, !577}
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "sort", scope: !563, file: !46, line: 25, baseType: !579, size: 64, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!374, !353}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "sortremovedups", scope: !563, file: !46, line: 26, baseType: !579, size: 64, offset: 256)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "sorted", scope: !563, file: !46, line: 27, baseType: !584, size: 64, offset: 320)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!374, !353, !587}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !563, file: !46, line: 28, baseType: !589, size: 64, offset: 384)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{!374, !353, !577}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !563, file: !46, line: 29, baseType: !579, size: 64, offset: 448)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !563, file: !46, line: 30, baseType: !594, size: 64, offset: 512)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!374, !353, !386}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !563, file: !46, line: 31, baseType: !594, size: 64, offset: 576)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !563, file: !46, line: 32, baseType: !599, size: 64, offset: 640)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!374, !353, !353}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "togeneral", scope: !563, file: !46, line: 33, baseType: !579, size: 64, offset: 704)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "oncomm", scope: !563, file: !46, line: 34, baseType: !604, size: 64, offset: 768)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!374, !353, !378, !607, !577}
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscCopyMode", file: !4, line: 327, baseType: !35)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksize", scope: !563, file: !46, line: 35, baseType: !609, size: 64, offset: 832)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{!374, !353, !324}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "contiguous", scope: !563, file: !46, line: 36, baseType: !613, size: 64, offset: 896)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!374, !353, !324, !324, !332, !587}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "locate", scope: !563, file: !46, line: 37, baseType: !617, size: 64, offset: 960)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{!374, !353, !324, !332}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "sortedlocal", scope: !563, file: !46, line: 38, baseType: !584, size: 64, offset: 1024)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "sortedglobal", scope: !563, file: !46, line: 39, baseType: !584, size: 64, offset: 1088)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "uniquelocal", scope: !563, file: !46, line: 40, baseType: !584, size: 64, offset: 1152)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "uniqueglobal", scope: !563, file: !46, line: 41, baseType: !584, size: 64, offset: 1216)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "permlocal", scope: !563, file: !46, line: 42, baseType: !584, size: 64, offset: 1280)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "permglobal", scope: !563, file: !46, line: 43, baseType: !584, size: 64, offset: 1344)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "intervallocal", scope: !563, file: !46, line: 44, baseType: !584, size: 64, offset: 1408)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "intervalglobal", scope: !563, file: !46, line: 45, baseType: !584, size: 64, offset: 1472)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !356, file: !46, line: 52, baseType: !629, size: 64, offset: 6016)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !354, line: 60, baseType: !630)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !41, line: 240, size: 640, elements: !632)
!632 = !{!633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !678, !679, !680, !681}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !631, file: !41, line: 241, baseType: !378, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !631, file: !41, line: 242, baseType: !437, size: 32, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !631, file: !41, line: 243, baseType: !324, size: 32, offset: 96)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !631, file: !41, line: 243, baseType: !324, size: 32, offset: 128)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !631, file: !41, line: 244, baseType: !324, size: 32, offset: 160)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !631, file: !41, line: 244, baseType: !324, size: 32, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !631, file: !41, line: 245, baseType: !332, size: 64, offset: 256)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !631, file: !41, line: 246, baseType: !322, size: 32, offset: 320)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !631, file: !41, line: 247, baseType: !324, size: 32, offset: 352)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !631, file: !41, line: 251, baseType: !324, size: 32, offset: 384)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !631, file: !41, line: 252, baseType: !644, size: 64, offset: 448)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !354, line: 30, baseType: !645)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !46, line: 73, size: 5440, elements: !647)
!647 = !{!648, !649, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !646, file: !46, line: 74, baseType: !359, size: 4480)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !646, file: !46, line: 74, baseType: !650, size: 256, offset: 4480)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 256, elements: !418)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ISLocalToGlobalMappingOps", file: !46, line: 66, size: 256, elements: !652)
!652 = !{!653, !657, !662, !663}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingsetup", scope: !651, file: !46, line: 67, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!374, !644}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingapply", scope: !651, file: !46, line: 68, baseType: !658, size: 64, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!374, !644, !661, !324, !570, !332, !332}
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISGlobalToLocalMappingMode", file: !41, line: 149, baseType: !40)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingapplyblock", scope: !651, file: !46, line: 69, baseType: !658, size: 64, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !651, file: !46, line: 70, baseType: !654, size: 64, offset: 192)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !646, file: !46, line: 75, baseType: !324, size: 32, offset: 4736)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !646, file: !46, line: 76, baseType: !324, size: 32, offset: 4768)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "indices", scope: !646, file: !46, line: 77, baseType: !332, size: 64, offset: 4800)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "globalstart", scope: !646, file: !46, line: 78, baseType: !324, size: 32, offset: 4864)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "globalend", scope: !646, file: !46, line: 79, baseType: !324, size: 32, offset: 4896)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "info_cached", scope: !646, file: !46, line: 80, baseType: !322, size: 32, offset: 4928)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "info_free", scope: !646, file: !46, line: 81, baseType: !322, size: 32, offset: 4960)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "info_nproc", scope: !646, file: !46, line: 82, baseType: !324, size: 32, offset: 4992)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "info_procs", scope: !646, file: !46, line: 83, baseType: !332, size: 64, offset: 5056)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "info_numprocs", scope: !646, file: !46, line: 84, baseType: !332, size: 64, offset: 5120)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "info_indices", scope: !646, file: !46, line: 85, baseType: !467, size: 64, offset: 5184)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "info_nodec", scope: !646, file: !46, line: 86, baseType: !332, size: 64, offset: 5248)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "info_nodei", scope: !646, file: !46, line: 87, baseType: !467, size: 64, offset: 5312)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !646, file: !46, line: 88, baseType: !457, size: 64, offset: 5376)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !631, file: !41, line: 253, baseType: !322, size: 32, offset: 512)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !631, file: !41, line: 254, baseType: !324, size: 32, offset: 544)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !631, file: !41, line: 254, baseType: !324, size: 32, offset: 576)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !631, file: !41, line: 255, baseType: !324, size: 32, offset: 608)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !356, file: !46, line: 53, baseType: !324, size: 32, offset: 6080)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !356, file: !46, line: 53, baseType: !324, size: 32, offset: 6112)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !356, file: !46, line: 54, baseType: !457, size: 64, offset: 6144)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !356, file: !46, line: 55, baseType: !332, size: 64, offset: 6208)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !356, file: !46, line: 55, baseType: !332, size: 64, offset: 6272)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "local_offset", scope: !356, file: !46, line: 56, baseType: !324, size: 32, offset: 6336)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "complement", scope: !356, file: !46, line: 57, baseType: !353, size: 64, offset: 6400)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "info_permanent", scope: !356, file: !46, line: 58, baseType: !690, size: 320, offset: 6464)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 320, elements: !691)
!691 = !{!494, !550}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !356, file: !46, line: 59, baseType: !693, size: 320, offset: 6784)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !694, size: 320, elements: !691)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISInfoBool", file: !46, line: 48, baseType: !45)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !319, file: !318, line: 44, baseType: !353, size: 64, offset: 896)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "icol", scope: !319, file: !318, line: 44, baseType: !353, size: 64, offset: 960)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !319, file: !318, line: 44, baseType: !322, size: 32, offset: 1024)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !319, file: !318, line: 44, baseType: !699, size: 64, offset: 1088)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !52, line: 16, baseType: !700)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !702, line: 436, size: 23424, elements: !703)
!702 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!703 = !{!704, !705, !1209, !1210, !1211, !1212, !1214, !1215, !1216, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1343, !1344, !1360, !1361, !1362, !1363, !1364, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1399, !1419, !1420, !1422, !1423, !1424, !1425, !1426, !1427, !1445, !1446}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !701, file: !702, line: 437, baseType: !359, size: 4480)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !701, file: !702, line: 437, baseType: !706, size: 9472, offset: 4480)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !707, size: 9472, elements: !418)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !702, line: 32, size: 9472, elements: !708)
!708 = !{!709, !716, !720, !721, !728, !732, !733, !734, !735, !736, !737, !738, !758, !762, !767, !773, !792, !796, !800, !801, !806, !811, !812, !817, !821, !825, !829, !833, !837, !838, !839, !840, !841, !845, !846, !851, !852, !853, !854, !855, !860, !867, !871, !875, !879, !883, !887, !888, !892, !893, !900, !904, !905, !906, !907, !981, !986, !987, !991, !992, !996, !997, !1001, !1006, !1007, !1011, !1015, !1019, !1020, !1021, !1022, !1023, !1024, !1029, !1030, !1034, !1038, !1042, !1043, !1044, !1048, !1058, !1059, !1063, !1064, !1068, !1069, !1073, !1074, !1079, !1080, !1084, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1098, !1099, !1100, !1101, !1102, !1103, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1118, !1122, !1123, !1124, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1138, !1139, !1140, !1145, !1149, !1150, !1154, !1155, !1156, !1157, !1183, !1187, !1188, !1189, !1190, !1191, !1195, !1196, !1197, !1198, !1199, !1203, !1207, !1208}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !707, file: !702, line: 34, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!374, !699, !324, !570, !324, !570, !713, !715}
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !347)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !707, file: !702, line: 35, baseType: !717, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{!374, !699, !324, !332, !467, !482}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !707, file: !702, line: 36, baseType: !717, size: 64, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !707, file: !702, line: 37, baseType: !722, size: 64, offset: 192)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!374, !699, !725, !725}
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !76, line: 21, baseType: !726)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !76, line: 21, flags: DIFlagFwdDecl)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !707, file: !702, line: 38, baseType: !729, size: 64, offset: 256)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!374, !699, !725, !725, !725}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !707, file: !702, line: 40, baseType: !722, size: 64, offset: 320)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !707, file: !702, line: 41, baseType: !729, size: 64, offset: 384)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !707, file: !702, line: 42, baseType: !722, size: 64, offset: 448)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !707, file: !702, line: 43, baseType: !729, size: 64, offset: 512)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !707, file: !702, line: 44, baseType: !722, size: 64, offset: 576)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !707, file: !702, line: 46, baseType: !729, size: 64, offset: 640)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !707, file: !702, line: 47, baseType: !739, size: 64, offset: 704)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!374, !699, !353, !353, !742}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !744)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !52, line: 1239, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 1226, size: 704, elements: !746)
!746 = !{!747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !745, file: !52, line: 1227, baseType: !348, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !745, file: !52, line: 1228, baseType: !348, size: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !745, file: !52, line: 1229, baseType: !348, size: 64, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !745, file: !52, line: 1230, baseType: !348, size: 64, offset: 192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !745, file: !52, line: 1231, baseType: !348, size: 64, offset: 256)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !745, file: !52, line: 1232, baseType: !348, size: 64, offset: 320)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !745, file: !52, line: 1233, baseType: !348, size: 64, offset: 384)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !745, file: !52, line: 1234, baseType: !348, size: 64, offset: 448)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !745, file: !52, line: 1236, baseType: !348, size: 64, offset: 512)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !745, file: !52, line: 1237, baseType: !348, size: 64, offset: 576)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !745, file: !52, line: 1238, baseType: !348, size: 64, offset: 640)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !707, file: !702, line: 48, baseType: !759, size: 64, offset: 768)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{!374, !699, !353, !742}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !707, file: !702, line: 49, baseType: !763, size: 64, offset: 832)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{!374, !699, !725, !348, !766, !348, !324, !324, !725}
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !52, line: 1291, baseType: !51)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !707, file: !702, line: 50, baseType: !768, size: 64, offset: 896)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!374, !699, !771, !772}
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !52, line: 238, baseType: !64)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !707, file: !702, line: 52, baseType: !774, size: 64, offset: 960)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!374, !699, !777, !778}
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !52, line: 612, baseType: !70)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !52, line: 600, baseType: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 592, size: 640, elements: !781)
!781 = !{!782, !783, !784, !785, !786, !787, !788, !789, !790, !791}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !780, file: !52, line: 593, baseType: !423, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !780, file: !52, line: 594, baseType: !423, size: 64, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !780, file: !52, line: 594, baseType: !423, size: 64, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !780, file: !52, line: 594, baseType: !423, size: 64, offset: 192)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !780, file: !52, line: 595, baseType: !423, size: 64, offset: 256)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !780, file: !52, line: 596, baseType: !423, size: 64, offset: 320)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !780, file: !52, line: 597, baseType: !423, size: 64, offset: 384)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !780, file: !52, line: 598, baseType: !423, size: 64, offset: 448)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !780, file: !52, line: 598, baseType: !423, size: 64, offset: 512)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !780, file: !52, line: 599, baseType: !423, size: 64, offset: 576)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !707, file: !702, line: 53, baseType: !793, size: 64, offset: 1024)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DISubroutineType(types: !795)
!795 = !{!374, !699, !699, !587}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !707, file: !702, line: 54, baseType: !797, size: 64, offset: 1088)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{!374, !699, !725}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !707, file: !702, line: 55, baseType: !722, size: 64, offset: 1152)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !707, file: !702, line: 56, baseType: !802, size: 64, offset: 1216)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{!374, !699, !805, !473}
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !76, line: 155, baseType: !75)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !707, file: !702, line: 58, baseType: !807, size: 64, offset: 1280)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DISubroutineType(types: !809)
!809 = !{!374, !699, !810}
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !52, line: 424, baseType: !83)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !707, file: !702, line: 59, baseType: !807, size: 64, offset: 1344)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !707, file: !702, line: 60, baseType: !813, size: 64, offset: 1408)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{!374, !699, !816, !322}
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !52, line: 469, baseType: !87)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !707, file: !702, line: 61, baseType: !818, size: 64, offset: 1472)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!374, !699}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !707, file: !702, line: 63, baseType: !822, size: 64, offset: 1536)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!374, !699, !324, !570, !347, !725, !725}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !707, file: !702, line: 64, baseType: !826, size: 64, offset: 1600)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{!374, !699, !699, !353, !353, !742}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !707, file: !702, line: 65, baseType: !830, size: 64, offset: 1664)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{!374, !699, !699, !742}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !707, file: !702, line: 66, baseType: !834, size: 64, offset: 1728)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!374, !699, !699, !353, !742}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !707, file: !702, line: 67, baseType: !830, size: 64, offset: 1792)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !707, file: !702, line: 69, baseType: !818, size: 64, offset: 1856)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !707, file: !702, line: 70, baseType: !826, size: 64, offset: 1920)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !707, file: !702, line: 71, baseType: !834, size: 64, offset: 1984)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !707, file: !702, line: 72, baseType: !842, size: 64, offset: 2048)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!374, !699, !772}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !707, file: !702, line: 73, baseType: !818, size: 64, offset: 2112)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !707, file: !702, line: 75, baseType: !847, size: 64, offset: 2176)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{!374, !699, !850, !772}
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !52, line: 563, baseType: !118)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !707, file: !702, line: 76, baseType: !722, size: 64, offset: 2240)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !707, file: !702, line: 77, baseType: !722, size: 64, offset: 2304)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !707, file: !702, line: 78, baseType: !739, size: 64, offset: 2368)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !707, file: !702, line: 79, baseType: !759, size: 64, offset: 2432)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !707, file: !702, line: 81, baseType: !856, size: 64, offset: 2496)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{!374, !699, !347, !699, !859}
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !52, line: 285, baseType: !123)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !707, file: !702, line: 82, baseType: !861, size: 64, offset: 2560)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!374, !699, !324, !864, !864, !771, !866}
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !707, file: !702, line: 83, baseType: !868, size: 64, offset: 2624)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!374, !699, !324, !577, !324}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !707, file: !702, line: 84, baseType: !872, size: 64, offset: 2688)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!374, !699, !324, !570, !324, !570, !351}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !707, file: !702, line: 85, baseType: !876, size: 64, offset: 2752)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{!374, !699, !699, !859}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !707, file: !702, line: 87, baseType: !880, size: 64, offset: 2816)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DISubroutineType(types: !882)
!882 = !{!374, !699, !725, !332}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !707, file: !702, line: 88, baseType: !884, size: 64, offset: 2880)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{!374, !699, !347}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !707, file: !702, line: 89, baseType: !884, size: 64, offset: 2944)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !707, file: !702, line: 90, baseType: !889, size: 64, offset: 3008)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{!374, !699, !725, !715}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !707, file: !702, line: 91, baseType: !822, size: 64, offset: 3072)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !707, file: !702, line: 93, baseType: !894, size: 64, offset: 3136)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{!374, !699, !897}
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !898)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !707, file: !702, line: 94, baseType: !901, size: 64, offset: 3200)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{!374, !699, !324, !322, !322, !332, !569, !569, !587}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !707, file: !702, line: 95, baseType: !901, size: 64, offset: 3264)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !707, file: !702, line: 96, baseType: !901, size: 64, offset: 3328)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !707, file: !702, line: 97, baseType: !901, size: 64, offset: 3392)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !707, file: !702, line: 99, baseType: !908, size: 64, offset: 3456)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!374, !699, !911, !927}
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !354, line: 51, baseType: !912)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !46, line: 91, size: 384, elements: !914)
!914 = !{!915, !916, !917, !918, !919, !923, !924, !926}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !913, file: !46, line: 92, baseType: !324, size: 32)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !913, file: !46, line: 93, baseType: !324, size: 32, offset: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "is", scope: !913, file: !46, line: 94, baseType: !577, size: 64, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !913, file: !46, line: 95, baseType: !378, size: 64, offset: 128)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !913, file: !46, line: 96, baseType: !920, size: 64, offset: 192)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !41, line: 215, baseType: !922)
!922 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !913, file: !46, line: 97, baseType: !324, size: 32, offset: 256)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !913, file: !46, line: 98, baseType: !925, size: 32, offset: 288)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !41, line: 213, baseType: !129)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !913, file: !46, line: 99, baseType: !322, size: 32, offset: 320)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !52, line: 1378, baseType: !928)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !702, line: 609, size: 6208, elements: !930)
!930 = !{!931, !932, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !951, !958, !959, !960, !961, !962, !963, !964, !965, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !929, file: !702, line: 610, baseType: !359, size: 4480)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !929, file: !702, line: 610, baseType: !933, size: 32, offset: 4480)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 32, elements: !418)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !929, file: !702, line: 611, baseType: !324, size: 32, offset: 4512)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !929, file: !702, line: 611, baseType: !324, size: 32, offset: 4544)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !929, file: !702, line: 611, baseType: !324, size: 32, offset: 4576)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !929, file: !702, line: 612, baseType: !324, size: 32, offset: 4608)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !929, file: !702, line: 613, baseType: !324, size: 32, offset: 4640)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !929, file: !702, line: 614, baseType: !332, size: 64, offset: 4672)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !929, file: !702, line: 615, baseType: !467, size: 64, offset: 4736)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !929, file: !702, line: 616, baseType: !577, size: 64, offset: 4800)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !929, file: !702, line: 617, baseType: !332, size: 64, offset: 4864)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !929, file: !702, line: 618, baseType: !944, size: 64, offset: 4928)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !702, line: 602, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !702, line: 598, size: 128, elements: !947)
!947 = !{!948, !949, !950}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !946, file: !702, line: 599, baseType: !324, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !946, file: !702, line: 600, baseType: !324, size: 32, offset: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !946, file: !702, line: 601, baseType: !351, size: 64, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !929, file: !702, line: 619, baseType: !952, size: 64, offset: 4992)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !702, line: 607, baseType: !954)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !702, line: 604, size: 128, elements: !955)
!955 = !{!956, !957}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !954, file: !702, line: 605, baseType: !324, size: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !954, file: !702, line: 606, baseType: !351, size: 64, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !929, file: !702, line: 620, baseType: !351, size: 64, offset: 5056)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !929, file: !702, line: 621, baseType: !348, size: 64, offset: 5120)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !929, file: !702, line: 622, baseType: !348, size: 64, offset: 5184)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !929, file: !702, line: 623, baseType: !725, size: 64, offset: 5248)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !929, file: !702, line: 623, baseType: !725, size: 64, offset: 5312)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !929, file: !702, line: 623, baseType: !725, size: 64, offset: 5376)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !929, file: !702, line: 624, baseType: !322, size: 32, offset: 5440)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !929, file: !702, line: 625, baseType: !966, size: 64, offset: 5504)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!374}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !929, file: !702, line: 626, baseType: !457, size: 64, offset: 5568)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !929, file: !702, line: 627, baseType: !725, size: 64, offset: 5632)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !929, file: !702, line: 628, baseType: !324, size: 32, offset: 5696)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !929, file: !702, line: 629, baseType: !399, size: 64, offset: 5760)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !929, file: !702, line: 630, baseType: !925, size: 32, offset: 5824)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !929, file: !702, line: 631, baseType: !324, size: 32, offset: 5856)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !929, file: !702, line: 631, baseType: !324, size: 32, offset: 5888)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !929, file: !702, line: 632, baseType: !322, size: 32, offset: 5920)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !929, file: !702, line: 633, baseType: !322, size: 32, offset: 5952)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !929, file: !702, line: 634, baseType: !410, size: 64, offset: 6016)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !929, file: !702, line: 634, baseType: !457, size: 64, offset: 6080)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !929, file: !702, line: 635, baseType: !428, size: 64, offset: 6144)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !707, file: !702, line: 100, baseType: !982, size: 64, offset: 3520)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!374, !699, !324, !324, !920, !985}
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !707, file: !702, line: 101, baseType: !818, size: 64, offset: 3584)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !707, file: !702, line: 102, baseType: !988, size: 64, offset: 3648)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!374, !699, !353, !353, !772}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !707, file: !702, line: 103, baseType: !710, size: 64, offset: 3712)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !707, file: !702, line: 105, baseType: !993, size: 64, offset: 3776)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!374, !699, !353, !353, !771, !772}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !707, file: !702, line: 106, baseType: !818, size: 64, offset: 3840)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !707, file: !702, line: 107, baseType: !998, size: 64, offset: 3904)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!374, !699, !386}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !707, file: !702, line: 108, baseType: !1002, size: 64, offset: 3968)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!374, !699, !1005, !771, !772}
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !52, line: 25, baseType: !399)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !707, file: !702, line: 109, baseType: !966, size: 64, offset: 4032)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !707, file: !702, line: 111, baseType: !1008, size: 64, offset: 4096)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!374, !699, !699, !699, !348, !699}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !707, file: !702, line: 112, baseType: !1012, size: 64, offset: 4160)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!374, !699, !699, !699, !699}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !707, file: !702, line: 113, baseType: !1016, size: 64, offset: 4224)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!374, !699, !644, !644}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !707, file: !702, line: 114, baseType: !710, size: 64, offset: 4288)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !707, file: !702, line: 115, baseType: !822, size: 64, offset: 4352)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !707, file: !702, line: 117, baseType: !880, size: 64, offset: 4416)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !707, file: !702, line: 118, baseType: !880, size: 64, offset: 4480)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !707, file: !702, line: 119, baseType: !1002, size: 64, offset: 4544)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !707, file: !702, line: 120, baseType: !1025, size: 64, offset: 4608)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!374, !699, !1028, !587}
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !52, line: 1675, baseType: !133)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !707, file: !702, line: 121, baseType: !966, size: 64, offset: 4672)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !707, file: !702, line: 123, baseType: !1031, size: 64, offset: 4736)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!374, !699, !324, !457}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !707, file: !702, line: 124, baseType: !1035, size: 64, offset: 4800)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!374, !699, !927, !725, !457}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !707, file: !702, line: 125, baseType: !1039, size: 64, offset: 4864)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!374, !508, !699}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !707, file: !702, line: 126, baseType: !722, size: 64, offset: 4928)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !707, file: !702, line: 127, baseType: !722, size: 64, offset: 4992)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !707, file: !702, line: 129, baseType: !1045, size: 64, offset: 5056)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!374, !699, !577}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !707, file: !702, line: 130, baseType: !1049, size: 64, offset: 5120)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!374, !699, !1052, !1052}
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !76, line: 654, baseType: !1053)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !76, line: 653, size: 128, elements: !1055)
!1055 = !{!1056, !1057}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1054, file: !76, line: 653, baseType: !324, size: 32)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1054, file: !76, line: 653, baseType: !725, size: 64, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !707, file: !702, line: 131, baseType: !1049, size: 64, offset: 5184)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !707, file: !702, line: 132, baseType: !1060, size: 64, offset: 5248)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!374, !699, !332, !332, !332}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !707, file: !702, line: 133, baseType: !998, size: 64, offset: 5312)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !707, file: !702, line: 135, baseType: !1065, size: 64, offset: 5376)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!374, !699, !348, !587}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !707, file: !702, line: 136, baseType: !1065, size: 64, offset: 5440)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !707, file: !702, line: 137, baseType: !1070, size: 64, offset: 5504)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!374, !699, !587}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !707, file: !702, line: 138, baseType: !710, size: 64, offset: 5568)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !707, file: !702, line: 139, baseType: !1075, size: 64, offset: 5632)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!374, !699, !1078, !1078}
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !707, file: !702, line: 141, baseType: !966, size: 64, offset: 5696)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !707, file: !702, line: 142, baseType: !1081, size: 64, offset: 5760)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!374, !699, !699, !348, !699}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !707, file: !702, line: 143, baseType: !1085, size: 64, offset: 5824)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!374, !699, !699, !699}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !707, file: !702, line: 144, baseType: !966, size: 64, offset: 5888)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !707, file: !702, line: 145, baseType: !1081, size: 64, offset: 5952)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !707, file: !702, line: 147, baseType: !1085, size: 64, offset: 6016)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !707, file: !702, line: 148, baseType: !966, size: 64, offset: 6080)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !707, file: !702, line: 149, baseType: !1081, size: 64, offset: 6144)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !707, file: !702, line: 150, baseType: !1085, size: 64, offset: 6208)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !707, file: !702, line: 151, baseType: !1095, size: 64, offset: 6272)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!374, !699, !322}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !707, file: !702, line: 153, baseType: !818, size: 64, offset: 6336)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !707, file: !702, line: 154, baseType: !818, size: 64, offset: 6400)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !707, file: !702, line: 155, baseType: !818, size: 64, offset: 6464)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !707, file: !702, line: 156, baseType: !818, size: 64, offset: 6528)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !707, file: !702, line: 157, baseType: !998, size: 64, offset: 6592)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !707, file: !702, line: 159, baseType: !1104, size: 64, offset: 6656)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!374, !699, !324, !713}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !707, file: !702, line: 160, baseType: !818, size: 64, offset: 6720)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !707, file: !702, line: 161, baseType: !818, size: 64, offset: 6784)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !707, file: !702, line: 162, baseType: !818, size: 64, offset: 6848)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !707, file: !702, line: 163, baseType: !818, size: 64, offset: 6912)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !707, file: !702, line: 165, baseType: !1085, size: 64, offset: 6976)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !707, file: !702, line: 166, baseType: !1085, size: 64, offset: 7040)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !707, file: !702, line: 167, baseType: !880, size: 64, offset: 7104)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !707, file: !702, line: 168, baseType: !1115, size: 64, offset: 7168)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!374, !699, !725, !324}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !707, file: !702, line: 169, baseType: !1119, size: 64, offset: 7232)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = !DISubroutineType(types: !1121)
!1121 = !{!374, !699, !587, !332}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !707, file: !702, line: 171, baseType: !842, size: 64, offset: 7296)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !707, file: !702, line: 172, baseType: !818, size: 64, offset: 7360)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !707, file: !702, line: 173, baseType: !1125, size: 64, offset: 7424)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!374, !699, !332, !569}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !707, file: !702, line: 174, baseType: !988, size: 64, offset: 7488)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !707, file: !702, line: 175, baseType: !988, size: 64, offset: 7552)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !707, file: !702, line: 177, baseType: !722, size: 64, offset: 7616)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !707, file: !702, line: 178, baseType: !768, size: 64, offset: 7680)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !707, file: !702, line: 179, baseType: !722, size: 64, offset: 7744)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !707, file: !702, line: 180, baseType: !729, size: 64, offset: 7808)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !707, file: !702, line: 181, baseType: !1135, size: 64, offset: 7872)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{!374, !699, !378, !771, !772}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !707, file: !702, line: 183, baseType: !1045, size: 64, offset: 7936)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !707, file: !702, line: 184, baseType: !802, size: 64, offset: 8000)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !707, file: !702, line: 185, baseType: !1141, size: 64, offset: 8064)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!374, !699, !1144}
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !707, file: !702, line: 186, baseType: !1146, size: 64, offset: 8128)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{!374, !699, !324, !570, !351}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !707, file: !702, line: 187, baseType: !861, size: 64, offset: 8192)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !707, file: !702, line: 189, baseType: !1151, size: 64, offset: 8256)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{!374, !699, !324, !324, !332, !713}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !707, file: !702, line: 190, baseType: !966, size: 64, offset: 8320)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !707, file: !702, line: 191, baseType: !1081, size: 64, offset: 8384)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !707, file: !702, line: 192, baseType: !1085, size: 64, offset: 8448)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !707, file: !702, line: 193, baseType: !1158, size: 64, offset: 8512)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{!374, !699, !911, !1161}
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !52, line: 1401, baseType: !1162)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !702, line: 660, size: 5312, elements: !1164)
!1164 = !{!1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1163, file: !702, line: 661, baseType: !359, size: 4480)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1163, file: !702, line: 661, baseType: !933, size: 32, offset: 4480)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1163, file: !702, line: 662, baseType: !324, size: 32, offset: 4512)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1163, file: !702, line: 662, baseType: !324, size: 32, offset: 4544)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1163, file: !702, line: 662, baseType: !324, size: 32, offset: 4576)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1163, file: !702, line: 663, baseType: !324, size: 32, offset: 4608)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1163, file: !702, line: 664, baseType: !324, size: 32, offset: 4640)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1163, file: !702, line: 665, baseType: !332, size: 64, offset: 4672)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1163, file: !702, line: 666, baseType: !332, size: 64, offset: 4736)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1163, file: !702, line: 667, baseType: !324, size: 32, offset: 4800)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1163, file: !702, line: 668, baseType: !925, size: 32, offset: 4832)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1163, file: !702, line: 670, baseType: !332, size: 64, offset: 4864)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1163, file: !702, line: 670, baseType: !332, size: 64, offset: 4928)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1163, file: !702, line: 671, baseType: !332, size: 64, offset: 4992)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1163, file: !702, line: 672, baseType: !332, size: 64, offset: 5056)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1163, file: !702, line: 673, baseType: !332, size: 64, offset: 5120)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1163, file: !702, line: 674, baseType: !324, size: 32, offset: 5184)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1163, file: !702, line: 675, baseType: !332, size: 64, offset: 5248)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !707, file: !702, line: 195, baseType: !1184, size: 64, offset: 8576)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{!374, !1161, !699, !699}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !707, file: !702, line: 196, baseType: !1184, size: 64, offset: 8640)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !707, file: !702, line: 197, baseType: !966, size: 64, offset: 8704)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !707, file: !702, line: 198, baseType: !1081, size: 64, offset: 8768)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !707, file: !702, line: 199, baseType: !1085, size: 64, offset: 8832)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !707, file: !702, line: 201, baseType: !1192, size: 64, offset: 8896)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1193 = !DISubroutineType(types: !1194)
!1194 = !{!374, !699, !324, !324}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !707, file: !702, line: 202, baseType: !856, size: 64, offset: 8960)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !707, file: !702, line: 203, baseType: !729, size: 64, offset: 9024)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !707, file: !702, line: 204, baseType: !908, size: 64, offset: 9088)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !707, file: !702, line: 205, baseType: !1045, size: 64, offset: 9152)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !707, file: !702, line: 206, baseType: !1200, size: 64, offset: 9216)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DISubroutineType(types: !1202)
!1202 = !{!374, !378, !699, !324, !771, !772}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !707, file: !702, line: 208, baseType: !1204, size: 64, offset: 9280)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{!374, !324, !866}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !707, file: !702, line: 209, baseType: !1085, size: 64, offset: 9344)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !707, file: !702, line: 210, baseType: !872, size: 64, offset: 9408)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !701, file: !702, line: 438, baseType: !629, size: 64, offset: 13952)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !701, file: !702, line: 438, baseType: !629, size: 64, offset: 14016)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !701, file: !702, line: 439, baseType: !457, size: 64, offset: 14080)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !701, file: !702, line: 440, baseType: !1213, size: 32, offset: 14144)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !52, line: 161, baseType: !278)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !701, file: !702, line: 441, baseType: !322, size: 32, offset: 14176)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !701, file: !702, line: 442, baseType: !322, size: 32, offset: 14208)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !701, file: !702, line: 443, baseType: !1217, size: 448, offset: 14272)
!1217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1218, size: 448, elements: !1219)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !52, line: 1159, baseType: !399)
!1219 = !{!1220}
!1220 = !DISubrange(count: 7)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !701, file: !702, line: 444, baseType: !322, size: 32, offset: 14720)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !701, file: !702, line: 445, baseType: !322, size: 32, offset: 14752)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !701, file: !702, line: 446, baseType: !324, size: 32, offset: 14784)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !701, file: !702, line: 447, baseType: !459, size: 64, offset: 14848)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !701, file: !702, line: 448, baseType: !459, size: 64, offset: 14912)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !701, file: !702, line: 449, baseType: !779, size: 640, offset: 14976)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !701, file: !702, line: 450, baseType: !715, size: 32, offset: 15616)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !701, file: !702, line: 451, baseType: !1229, size: 2880, offset: 15680)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !702, line: 318, baseType: !1230)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !702, line: 319, size: 2880, elements: !1231)
