; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/eisens/eisen.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/eisens/eisen.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_PC = type { %struct._p_PetscObject, [1 x %struct._PCOps], %struct._p_DM*, i32, i64, i64, i32, i32, i32, i32, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 (%struct._p_PC*, i32, %struct._p_IS**, %struct._p_IS**, %struct._p_Mat**, i8*)*, i8*, i8*, i32, i8*, i32, i32 }

!184 = !DIEnumerator(name: "MATOP_REAL_PART", value: 105, isUnsigned: true)
!185 = !DIEnumerator(name: "MATOP_IMAGINARY_PART", value: 106, isUnsigned: true)
!186 = !DIEnumerator(name: "MATOP_GET_ROW_UPPER_TRIANGULAR", value: 107, isUnsigned: true)
!187 = !DIEnumerator(name: "MATOP_RESTORE_ROW_UPPER_TRIANG", value: 108, isUnsigned: true)
!188 = !DIEnumerator(name: "MATOP_MAT_SOLVE", value: 109, isUnsigned: true)
!189 = !DIEnumerator(name: "MATOP_MAT_SOLVE_TRANSPOSE", value: 110, isUnsigned: true)
!190 = !DIEnumerator(name: "MATOP_GET_ROW_MIN", value: 111, isUnsigned: true)
!191 = !DIEnumerator(name: "MATOP_GET_COLUMN_VECTOR", value: 112, isUnsigned: true)
!192 = !DIEnumerator(name: "MATOP_MISSING_DIAGONAL", value: 113, isUnsigned: true)
!193 = !DIEnumerator(name: "MATOP_GET_SEQ_NONZERO_STRUCTUR", value: 114, isUnsigned: true)
!194 = !DIEnumerator(name: "MATOP_CREATE", value: 115, isUnsigned: true)
!195 = !DIEnumerator(name: "MATOP_GET_GHOSTS", value: 116, isUnsigned: true)
!196 = !DIEnumerator(name: "MATOP_GET_LOCAL_SUB_MATRIX", value: 117, isUnsigned: true)
!197 = !DIEnumerator(name: "MATOP_RESTORE_LOCALSUB_MATRIX", value: 118, isUnsigned: true)
!198 = !DIEnumerator(name: "MATOP_MULT_DIAGONAL_BLOCK", value: 119, isUnsigned: true)
!199 = !DIEnumerator(name: "MATOP_HERMITIAN_TRANSPOSE", value: 120, isUnsigned: true)
!200 = !DIEnumerator(name: "MATOP_MULT_HERMITIAN_TRANSPOSE", value: 121, isUnsigned: true)
!201 = !DIEnumerator(name: "MATOP_MULT_HERMITIAN_TRANS_ADD", value: 122, isUnsigned: true)
!202 = !DIEnumerator(name: "MATOP_GET_MULTI_PROC_BLOCK", value: 123, isUnsigned: true)
!203 = !DIEnumerator(name: "MATOP_FIND_NONZERO_ROWS", value: 124, isUnsigned: true)
!204 = !DIEnumerator(name: "MATOP_GET_COLUMN_NORMS", value: 125, isUnsigned: true)
!205 = !DIEnumerator(name: "MATOP_INVERT_BLOCK_DIAGONAL", value: 126, isUnsigned: true)
!206 = !DIEnumerator(name: "MATOP_CREATE_SUB_MATRICES_MPI", value: 128, isUnsigned: true)
!207 = !DIEnumerator(name: "MATOP_SET_VALUES_BATCH", value: 129, isUnsigned: true)
!208 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT", value: 130, isUnsigned: true)
!209 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_SYMBO", value: 131, isUnsigned: true)
!210 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_NUMER", value: 132, isUnsigned: true)
!211 = !DIEnumerator(name: "MATOP_TRANSPOSE_COLORING_CREAT", value: 133, isUnsigned: true)
!212 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_SPT", value: 134, isUnsigned: true)
!213 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_DEN", value: 135, isUnsigned: true)
!214 = !DIEnumerator(name: "MATOP_RART", value: 136, isUnsigned: true)
!215 = !DIEnumerator(name: "MATOP_RART_SYMBOLIC", value: 137, isUnsigned: true)
!216 = !DIEnumerator(name: "MATOP_RART_NUMERIC", value: 138, isUnsigned: true)
!217 = !DIEnumerator(name: "MATOP_SET_BLOCK_SIZES", value: 139, isUnsigned: true)
!218 = !DIEnumerator(name: "MATOP_AYPX", value: 140, isUnsigned: true)
!219 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!220 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!221 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!222 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!223 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!224 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!225 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 1288, baseType: !5, size: 32, elements: !226)
!226 = !{!227, !228, !229, !230, !231, !232, !233, !234, !235, !236}
!227 = !DIEnumerator(name: "SOR_FORWARD_SWEEP", value: 1, isUnsigned: true)
!228 = !DIEnumerator(name: "SOR_BACKWARD_SWEEP", value: 2, isUnsigned: true)
!229 = !DIEnumerator(name: "SOR_SYMMETRIC_SWEEP", value: 3, isUnsigned: true)
!230 = !DIEnumerator(name: "SOR_LOCAL_FORWARD_SWEEP", value: 4, isUnsigned: true)
!231 = !DIEnumerator(name: "SOR_LOCAL_BACKWARD_SWEEP", value: 8, isUnsigned: true)
!232 = !DIEnumerator(name: "SOR_LOCAL_SYMMETRIC_SWEEP", value: 12, isUnsigned: true)
!233 = !DIEnumerator(name: "SOR_ZERO_INITIAL_GUESS", value: 16, isUnsigned: true)
!234 = !DIEnumerator(name: "SOR_EISENSTAT", value: 32, isUnsigned: true)
!235 = !DIEnumerator(name: "SOR_APPLY_UPPER", value: 64, isUnsigned: true)
!236 = !DIEnumerator(name: "SOR_APPLY_LOWER", value: 128, isUnsigned: true)
!237 = !{!238, !242, !243, !318, !446, !449, !328, !26, !452, !278, !412, !453, !5, !455, !474, !304, !289, !475}
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !239, line: 330, baseType: !240)
!239 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !239, line: 330, flags: DIFlagFwdDecl)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !246, line: 73, size: 4480, elements: !247)
!246 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!247 = !{!248, !250, !299, !300, !302, !305, !306, !307, !308, !316, !317, !319, !323, !327, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !340, !341, !342, !344, !345, !347, !349, !350, !351, !352, !353, !356, !358, !359, !360, !361, !362, !365, !367, !368, !369, !379, !381, !382, !386, !387, !436, !441, !443, !444, !445}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !245, file: !246, line: 74, baseType: !249, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !245, file: !246, line: 75, baseType: !251, size: 448, offset: 64)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 448, elements: !297)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !246, line: 53, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !246, line: 45, size: 448, elements: !254)
!254 = !{!255, !261, !269, !274, !281, !285, !292}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !253, file: !246, line: 46, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!259, !243, !260}
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !253, file: !246, line: 47, baseType: !262, size: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!259, !243, !265}
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !266, line: 16, baseType: !267)
!266 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !266, line: 16, flags: DIFlagFwdDecl)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !253, file: !246, line: 48, baseType: !270, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!259, !273}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !253, file: !246, line: 49, baseType: !275, size: 64, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!259, !243, !278, !243}
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !280)
!280 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !253, file: !246, line: 50, baseType: !282, size: 64, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!259, !243, !278, !273}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !253, file: !246, line: 51, baseType: !286, size: 64, offset: 320)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!259, !243, !278, !289}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{null}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !253, file: !246, line: 52, baseType: !293, size: 64, offset: 384)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!259, !243, !278, !296}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!297 = !{!298}
!298 = !DISubrange(count: 1)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !245, file: !246, line: 76, baseType: !238, size: 64, offset: 512)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !245, file: !246, line: 77, baseType: !301, size: 32, offset: 576)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !245, file: !246, line: 78, baseType: !303, size: 64, offset: 640)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !304)
!304 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !245, file: !246, line: 78, baseType: !303, size: 64, offset: 704)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !245, file: !246, line: 78, baseType: !303, size: 64, offset: 768)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !245, file: !246, line: 78, baseType: !303, size: 64, offset: 832)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !245, file: !246, line: 79, baseType: !309, size: 64, offset: 896)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !312, line: 27, baseType: !313)
!312 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !314, line: 43, baseType: !315)
!314 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!315 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !245, file: !246, line: 80, baseType: !301, size: 32, offset: 960)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !245, file: !246, line: 81, baseType: !318, size: 32, offset: 992)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !245, file: !246, line: 82, baseType: !320, size: 64, offset: 1024)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !245, file: !246, line: 83, baseType: !324, size: 64, offset: 1088)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !245, file: !246, line: 84, baseType: !328, size: 64, offset: 1152)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !245, file: !246, line: 85, baseType: !328, size: 64, offset: 1216)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !245, file: !246, line: 86, baseType: !328, size: 64, offset: 1280)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !245, file: !246, line: 87, baseType: !328, size: 64, offset: 1344)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !245, file: !246, line: 88, baseType: !243, size: 64, offset: 1408)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !245, file: !246, line: 89, baseType: !309, size: 64, offset: 1472)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !245, file: !246, line: 90, baseType: !328, size: 64, offset: 1536)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !245, file: !246, line: 91, baseType: !328, size: 64, offset: 1600)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !245, file: !246, line: 92, baseType: !301, size: 32, offset: 1664)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !245, file: !246, line: 93, baseType: !242, size: 64, offset: 1728)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !245, file: !246, line: 94, baseType: !339, size: 64, offset: 1792)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !310)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !245, file: !246, line: 95, baseType: !301, size: 32, offset: 1856)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !245, file: !246, line: 95, baseType: !301, size: 32, offset: 1888)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !245, file: !246, line: 96, baseType: !343, size: 64, offset: 1920)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !245, file: !246, line: 96, baseType: !343, size: 64, offset: 1984)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !245, file: !246, line: 97, baseType: !346, size: 64, offset: 2048)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !245, file: !246, line: 97, baseType: !348, size: 64, offset: 2112)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !245, file: !246, line: 98, baseType: !301, size: 32, offset: 2176)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !245, file: !246, line: 98, baseType: !301, size: 32, offset: 2208)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !245, file: !246, line: 99, baseType: !343, size: 64, offset: 2240)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !245, file: !246, line: 99, baseType: !343, size: 64, offset: 2304)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !245, file: !246, line: 100, baseType: !354, size: 64, offset: 2368)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !304)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !245, file: !246, line: 100, baseType: !357, size: 64, offset: 2432)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !245, file: !246, line: 101, baseType: !301, size: 32, offset: 2496)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !245, file: !246, line: 101, baseType: !301, size: 32, offset: 2528)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !245, file: !246, line: 102, baseType: !343, size: 64, offset: 2560)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !245, file: !246, line: 102, baseType: !343, size: 64, offset: 2624)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !245, file: !246, line: 103, baseType: !363, size: 64, offset: 2688)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !355)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !245, file: !246, line: 103, baseType: !366, size: 64, offset: 2752)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !245, file: !246, line: 104, baseType: !296, size: 64, offset: 2816)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !245, file: !246, line: 105, baseType: !301, size: 32, offset: 2880)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !245, file: !246, line: 106, baseType: !370, size: 128, offset: 2944)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !371, size: 128, elements: !377)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !246, line: 64, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !246, line: 61, size: 128, elements: !374)
!374 = !{!375, !376}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !373, file: !246, line: 62, baseType: !289, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !373, file: !246, line: 63, baseType: !242, size: 64, offset: 64)
!377 = !{!378}
!378 = !DISubrange(count: 2)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !245, file: !246, line: 107, baseType: !380, size: 64, offset: 3072)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 64, elements: !377)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !245, file: !246, line: 108, baseType: !242, size: 64, offset: 3136)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !245, file: !246, line: 109, baseType: !383, size: 64, offset: 3200)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!259, !242}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !245, file: !246, line: 111, baseType: !301, size: 32, offset: 3264)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !245, file: !246, line: 112, baseType: !388, size: 320, offset: 3328)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 320, elements: !434)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!259, !392, !243, !242}
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !394)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !395)
!395 = !{!396, !397, !422, !423, !424, !425, !426, !427, !428, !429, !430}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !394, file: !10, line: 100, baseType: !301, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !394, file: !10, line: 101, baseType: !398, size: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !401)
!401 = !{!402, !403, !404, !405, !406, !409, !410, !411, !415, !417, !419, !420, !421}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !400, file: !10, line: 84, baseType: !328, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !400, file: !10, line: 85, baseType: !328, size: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !400, file: !10, line: 86, baseType: !242, size: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !400, file: !10, line: 87, baseType: !320, size: 64, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !400, file: !10, line: 88, baseType: !407, size: 64, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !278)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !400, file: !10, line: 89, baseType: !280, size: 8, offset: 320)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !400, file: !10, line: 90, baseType: !328, size: 64, offset: 384)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !400, file: !10, line: 91, baseType: !412, size: 64, offset: 448)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !413, line: 46, baseType: !414)
!413 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!414 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !400, file: !10, line: 92, baseType: !416, size: 32, offset: 512)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !400, file: !10, line: 93, baseType: !418, size: 32, offset: 544)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !400, file: !10, line: 94, baseType: !398, size: 64, offset: 576)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !400, file: !10, line: 95, baseType: !328, size: 64, offset: 640)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !400, file: !10, line: 96, baseType: !242, size: 64, offset: 704)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !394, file: !10, line: 102, baseType: !328, size: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !394, file: !10, line: 102, baseType: !328, size: 64, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !394, file: !10, line: 103, baseType: !328, size: 64, offset: 256)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !394, file: !10, line: 104, baseType: !238, size: 64, offset: 320)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !394, file: !10, line: 105, baseType: !416, size: 32, offset: 384)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !394, file: !10, line: 105, baseType: !416, size: 32, offset: 416)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !394, file: !10, line: 105, baseType: !416, size: 32, offset: 448)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !394, file: !10, line: 106, baseType: !243, size: 64, offset: 512)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !394, file: !10, line: 107, baseType: !431, size: 64, offset: 576)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!434 = !{!435}
!435 = !DISubrange(count: 5)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !245, file: !246, line: 113, baseType: !437, size: 320, offset: 3648)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !438, size: 320, elements: !434)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!259, !243, !242}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !245, file: !246, line: 114, baseType: !442, size: 320, offset: 3968)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 320, elements: !434)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !245, file: !246, line: 115, baseType: !416, size: 32, offset: 4288)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !245, file: !246, line: 120, baseType: !431, size: 64, offset: 4352)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !245, file: !246, line: 121, baseType: !416, size: 32, offset: 4416)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !239, line: 331, baseType: !447)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !239, line: 331, flags: DIFlagFwdDecl)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !239, line: 338, baseType: !450)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !239, line: 338, flags: DIFlagFwdDecl)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !454, line: 1451, baseType: !289)
!454 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_Eisenstat", file: !457, line: 15, baseType: !458)
!457 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/eisens/eisen.c", directory: "/home/users/ndemeye/xSDK")
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !457, line: 10, size: 448, elements: !459)
!459 = !{!460, !464, !465, !471, !472, !473}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "shell", scope: !458, file: !457, line: 11, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !39, line: 16, baseType: !462)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !39, line: 16, flags: DIFlagFwdDecl)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !458, file: !457, line: 11, baseType: !461, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !458, file: !457, line: 12, baseType: !466, size: 128, offset: 128)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 128, elements: !377)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !468, line: 21, baseType: !469)
!468 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !468, line: 21, flags: DIFlagFwdDecl)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "diag", scope: !458, file: !457, line: 12, baseType: !467, size: 64, offset: 256)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "omega", scope: !458, file: !457, line: 13, baseType: !355, size: 64, offset: 320)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "usediag", scope: !458, file: !457, line: 14, baseType: !416, size: 32, offset: 384)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !39, line: 1291, baseType: !225)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!476 = !{i32 7, !"Dwarf Version", i32 4}
!477 = !{i32 2, !"Debug Info Version", i32 3}
!478 = !{i32 1, !"wchar_size", i32 4}
!479 = !{i32 7, !"PIC Level", i32 2}
!480 = !{i32 7, !"uwtable", i32 1}
!481 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!482 = distinct !DISubprogram(name: "PCEisenstatSetOmega", scope: !457, file: !457, line: 250, type: !483, scopeLine: 251, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !588)
!483 = !DISubroutineType(types: !484)
!484 = !{!259, !485, !355}
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !486)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !488, line: 37, size: 6720, elements: !489)
!488 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcimpl.h", directory: "/home/users/ndemeye/xSDK")
!489 = !{!490, !492, !552, !557, !558, !559, !560, !561, !563, !564, !565, !566, !567, !568, !569, !570, !571, !581, !582, !583, !584, !585, !587}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !487, file: !488, line: 38, baseType: !491, size: 4480)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !246, line: 122, baseType: !245)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !487, file: !488, line: 38, baseType: !493, size: 1152, offset: 4480)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 1152, elements: !297)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PCOps", file: !488, line: 13, size: 1152, elements: !495)
!495 = !{!496, !500, !504, !508, !514, !519, !520, !524, !528, !536, !537, !542, !543, !544, !545, !546, !550, !551}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !494, file: !488, line: 14, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{!259, !485}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !494, file: !488, line: 15, baseType: !501, size: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!259, !485, !467, !467}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "matapply", scope: !494, file: !488, line: 16, baseType: !505, size: 64, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{!259, !485, !461, !461}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "applyrichardson", scope: !494, file: !488, line: 17, baseType: !509, size: 64, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{!259, !485, !467, !467, !467, !355, !355, !355, !301, !416, !346, !512}
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCRichardsonConvergedReason", file: !25, line: 102, baseType: !24)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "applyBA", scope: !494, file: !488, line: 18, baseType: !515, size: 64, offset: 256)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{!259, !485, !518, !467, !467, !467}
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "applytranspose", scope: !494, file: !488, line: 19, baseType: !501, size: 64, offset: 320)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "applyBAtranspose", scope: !494, file: !488, line: 20, baseType: !521, size: 64, offset: 384)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{!259, !485, !301, !467, !467, !467}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !494, file: !488, line: 21, baseType: !525, size: 64, offset: 448)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!259, !392, !485}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !494, file: !488, line: 22, baseType: !529, size: 64, offset: 512)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!259, !485, !532, !467, !467}
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !533, line: 22, baseType: !534)
!533 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !533, line: 22, flags: DIFlagFwdDecl)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !494, file: !488, line: 23, baseType: !529, size: 64, offset: 576)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "getfactoredmatrix", scope: !494, file: !488, line: 24, baseType: !538, size: 64, offset: 640)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!259, !485, !541}
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricleft", scope: !494, file: !488, line: 25, baseType: !501, size: 64, offset: 704)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricright", scope: !494, file: !488, line: 26, baseType: !501, size: 64, offset: 768)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "setuponblocks", scope: !494, file: !488, line: 27, baseType: !497, size: 64, offset: 832)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !494, file: !488, line: 28, baseType: !497, size: 64, offset: 896)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !494, file: !488, line: 29, baseType: !547, size: 64, offset: 960)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{!259, !485, !265}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !494, file: !488, line: 30, baseType: !497, size: 64, offset: 1024)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !494, file: !488, line: 31, baseType: !547, size: 64, offset: 1088)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !487, file: !488, line: 39, baseType: !553, size: 64, offset: 5632)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !554, line: 14, baseType: !555)
!554 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !554, line: 14, flags: DIFlagFwdDecl)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !487, file: !488, line: 40, baseType: !301, size: 32, offset: 5696)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "matstate", scope: !487, file: !488, line: 41, baseType: !339, size: 64, offset: 5760)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "matnonzerostate", scope: !487, file: !488, line: 41, baseType: !339, size: 64, offset: 5824)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "reusepreconditioner", scope: !487, file: !488, line: 42, baseType: !416, size: 32, offset: 5888)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !487, file: !488, line: 43, baseType: !562, size: 32, offset: 5920)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !39, line: 285, baseType: !38)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !487, file: !488, line: 45, baseType: !301, size: 32, offset: 5952)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "erroriffailure", scope: !487, file: !488, line: 46, baseType: !416, size: 32, offset: 5984)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !487, file: !488, line: 47, baseType: !461, size: 64, offset: 6016)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "pmat", scope: !487, file: !488, line: 47, baseType: !461, size: 64, offset: 6080)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleright", scope: !487, file: !488, line: 48, baseType: !467, size: 64, offset: 6144)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleleft", scope: !487, file: !488, line: 48, baseType: !467, size: 64, offset: 6208)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !487, file: !488, line: 49, baseType: !416, size: 32, offset: 6272)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "useAmat", scope: !487, file: !488, line: 50, baseType: !416, size: 32, offset: 6304)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatrices", scope: !487, file: !488, line: 51, baseType: !572, size: 64, offset: 6336)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!259, !485, !301, !575, !575, !541, !242}
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !577)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !578, line: 11, baseType: !579)
!578 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !578, line: 11, flags: DIFlagFwdDecl)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatricesP", scope: !487, file: !488, line: 52, baseType: !242, size: 64, offset: 6400)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !487, file: !488, line: 53, baseType: !242, size: 64, offset: 6464)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "presolvedone", scope: !487, file: !488, line: 54, baseType: !301, size: 32, offset: 6528)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !487, file: !488, line: 55, baseType: !242, size: 64, offset: 6592)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "failedreason", scope: !487, file: !488, line: 56, baseType: !586, size: 32, offset: 6656)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !25, line: 395, baseType: !45)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "failedreasonrank", scope: !487, file: !488, line: 57, baseType: !586, size: 32, offset: 6688)
!588 = !{!589, !590, !591, !592, !594, !595, !599, !600, !602, !606, !607, !609, !615, !616, !618, !621, !622, !624, !627, !628, !631, !632, !634, !638}
!589 = !DILocalVariable(name: "pc", arg: 1, scope: !482, file: !457, line: 250, type: !485)
!590 = !DILocalVariable(name: "omega", arg: 2, scope: !482, file: !457, line: 250, type: !355)
!591 = !DILocalVariable(name: "ierr", scope: !482, file: !457, line: 252, type: !259)
!592 = !DILocalVariable(name: "_7_ierr", scope: !593, file: !457, line: 256, type: !259)
!593 = distinct !DILexicalBlock(scope: !482, file: !457, line: 256, column: 3)
!594 = !DILocalVariable(name: "b0", scope: !593, file: !457, line: 256, type: !355)
!595 = !DILocalVariable(name: "b1", scope: !593, file: !457, line: 256, type: !596)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, size: 192, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 3)
!599 = !DILocalVariable(name: "b2", scope: !593, file: !457, line: 256, type: !596)
!600 = !DILocalVariable(name: "_4_ierr", scope: !601, file: !457, line: 256, type: !259)
!601 = distinct !DILexicalBlock(scope: !593, file: !457, line: 256, column: 3)
!602 = !DILocalVariable(name: "a_b1", scope: !601, file: !457, line: 256, type: !603)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !318, size: 192, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 6)
!606 = !DILocalVariable(name: "a_b2", scope: !601, file: !457, line: 256, type: !603)
!607 = !DILocalVariable(name: "_7_errorcode", scope: !608, file: !457, line: 256, type: !259)
!608 = distinct !DILexicalBlock(scope: !601, file: !457, line: 256, column: 3)
!609 = !DILocalVariable(name: "_7_errorstring", scope: !610, file: !457, line: 256, type: !612)
!610 = distinct !DILexicalBlock(scope: !611, file: !457, line: 256, column: 3)
!611 = distinct !DILexicalBlock(scope: !608, file: !457, line: 256, column: 3)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 2048, elements: !613)
!613 = !{!614}
!614 = !DISubrange(count: 256)
!615 = !DILocalVariable(name: "_7_resultlen", scope: !610, file: !457, line: 256, type: !318)
!616 = !DILocalVariable(name: "_7_errorcode", scope: !617, file: !457, line: 256, type: !259)
!617 = distinct !DILexicalBlock(scope: !601, file: !457, line: 256, column: 3)
!618 = !DILocalVariable(name: "_7_errorstring", scope: !619, file: !457, line: 256, type: !612)
!619 = distinct !DILexicalBlock(scope: !620, file: !457, line: 256, column: 3)
!620 = distinct !DILexicalBlock(scope: !617, file: !457, line: 256, column: 3)
!621 = !DILocalVariable(name: "_7_resultlen", scope: !619, file: !457, line: 256, type: !318)
!622 = !DILocalVariable(name: "_7_errorcode", scope: !623, file: !457, line: 256, type: !259)
!623 = distinct !DILexicalBlock(scope: !593, file: !457, line: 256, column: 3)
!624 = !DILocalVariable(name: "_7_errorstring", scope: !625, file: !457, line: 256, type: !612)
!625 = distinct !DILexicalBlock(scope: !626, file: !457, line: 256, column: 3)
!626 = distinct !DILexicalBlock(scope: !623, file: !457, line: 256, column: 3)
!627 = !DILocalVariable(name: "_7_resultlen", scope: !625, file: !457, line: 256, type: !318)
!628 = !DILocalVariable(name: "_7_f", scope: !629, file: !457, line: 257, type: !630)
!629 = distinct !DILexicalBlock(scope: !482, file: !457, line: 257, column: 10)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!631 = !DILocalVariable(name: "_7_ierr", scope: !629, file: !457, line: 257, type: !259)
!632 = !DILocalVariable(name: "ierr__", scope: !633, file: !457, line: 257, type: !259)
!633 = distinct !DILexicalBlock(scope: !629, file: !457, line: 257, column: 10)
!634 = !DILocalVariable(name: "ierr__", scope: !635, file: !457, line: 257, type: !259)
!635 = distinct !DILexicalBlock(scope: !636, file: !457, line: 257, column: 10)
