; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/sell/mpi/mmsell.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/sell/mpi/mmsell.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Vec = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!275 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!276 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!277 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!278 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!279 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!280 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !54, line: 161, baseType: !7, size: 32, elements: !281)
!281 = !{!282, !283, !284, !285, !286, !287, !288, !289}
!282 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!285 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!286 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!287 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!288 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!289 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!290 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !54, line: 1265, baseType: !7, size: 32, elements: !291)
!291 = !{!292, !293, !294}
!292 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!293 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!294 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!295 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !54, line: 1203, baseType: !7, size: 32, elements: !296)
!296 = !{!297, !298, !299, !300, !301}
!297 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!300 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!301 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!302 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !54, line: 187, baseType: !7, size: 32, elements: !303)
!303 = !{!304, !305, !306, !307, !308, !309, !310}
!304 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!305 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!306 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!307 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!308 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!309 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!310 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!311 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !312, line: 663, baseType: !7, size: 32, elements: !313)
!312 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!313 = !{!314, !315, !316}
!314 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!315 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!316 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!317 = !{!318, !1458, !349, !430, !346, !509, !370, !505, !393, !507}
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_MPISELL", file: !320, line: 39, baseType: !321)
!320 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/sell/mpi/mpisell.h", directory: "/home/users/ndemeye/xSDK")
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !320, line: 7, size: 1280, elements: !322)
!322 = !{!323, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1444, !1445, !1446, !1447, !1453, !1454, !1455, !1456, !1457}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !321, file: !320, line: 8, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !54, line: 16, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !327, line: 436, size: 23424, elements: !328)
!327 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!328 = !{!329, !539, !1183, !1184, !1185, !1186, !1188, !1189, !1190, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1317, !1318, !1334, !1335, !1336, !1337, !1338, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1373, !1393, !1394, !1396, !1397, !1398, !1399, !1400, !1401, !1419, !1420}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !326, file: !327, line: 437, baseType: !330, size: 4480)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !331, line: 122, baseType: !332)
!331 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !331, line: 73, size: 4480, elements: !333)
!333 = !{!334, !336, !391, !392, !394, !397, !398, !399, !400, !408, !409, !411, !415, !419, !421, !422, !423, !424, !425, !426, !427, !428, !429, !431, !433, !434, !435, !437, !438, !440, !442, !443, !444, !445, !446, !449, !451, !452, !453, !454, !455, !458, !460, !461, !462, !472, !474, !475, !479, !480, !529, !534, !536, !537, !538}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !332, file: !331, line: 74, baseType: !335, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !90)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !332, file: !331, line: 75, baseType: !337, size: 448, offset: 64)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 448, elements: !389)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !331, line: 53, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !331, line: 45, size: 448, elements: !340)
!340 = !{!341, !353, !361, !366, !373, !377, !384}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !339, file: !331, line: 46, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!345, !346, !348}
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !90)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !350, line: 330, baseType: !351)
!350 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !350, line: 330, flags: DIFlagFwdDecl)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !339, file: !331, line: 47, baseType: !354, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!345, !346, !357}
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !358, line: 16, baseType: !359)
!358 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !358, line: 16, flags: DIFlagFwdDecl)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !339, file: !331, line: 48, baseType: !362, size: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!345, !365}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !339, file: !331, line: 49, baseType: !367, size: 64, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{!345, !346, !370, !346}
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !372)
!372 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !339, file: !331, line: 50, baseType: !374, size: 64, offset: 256)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!345, !346, !370, !365}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !339, file: !331, line: 51, baseType: !378, size: 64, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!345, !346, !370, !381}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{null}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !339, file: !331, line: 52, baseType: !385, size: 64, offset: 384)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!345, !346, !370, !388}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!389 = !{!390}
!390 = !DISubrange(count: 1)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !332, file: !331, line: 76, baseType: !349, size: 64, offset: 512)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !332, file: !331, line: 77, baseType: !393, size: 32, offset: 576)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !90)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !332, file: !331, line: 78, baseType: !395, size: 64, offset: 640)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !396)
!396 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !332, file: !331, line: 78, baseType: !395, size: 64, offset: 704)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !332, file: !331, line: 78, baseType: !395, size: 64, offset: 768)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !332, file: !331, line: 78, baseType: !395, size: 64, offset: 832)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !332, file: !331, line: 79, baseType: !401, size: 64, offset: 896)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !404, line: 27, baseType: !405)
!404 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !406, line: 43, baseType: !407)
!406 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!407 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !332, file: !331, line: 80, baseType: !393, size: 32, offset: 960)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !332, file: !331, line: 81, baseType: !410, size: 32, offset: 992)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !90)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !332, file: !331, line: 82, baseType: !412, size: 64, offset: 1024)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !332, file: !331, line: 83, baseType: !416, size: 64, offset: 1088)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !417)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !332, file: !331, line: 84, baseType: !420, size: 64, offset: 1152)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !332, file: !331, line: 85, baseType: !420, size: 64, offset: 1216)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !332, file: !331, line: 86, baseType: !420, size: 64, offset: 1280)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !332, file: !331, line: 87, baseType: !420, size: 64, offset: 1344)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !332, file: !331, line: 88, baseType: !346, size: 64, offset: 1408)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !332, file: !331, line: 89, baseType: !401, size: 64, offset: 1472)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !332, file: !331, line: 90, baseType: !420, size: 64, offset: 1536)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !332, file: !331, line: 91, baseType: !420, size: 64, offset: 1600)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !332, file: !331, line: 92, baseType: !393, size: 32, offset: 1664)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !332, file: !331, line: 93, baseType: !430, size: 64, offset: 1728)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !332, file: !331, line: 94, baseType: !432, size: 64, offset: 1792)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !402)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !332, file: !331, line: 95, baseType: !393, size: 32, offset: 1856)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !332, file: !331, line: 95, baseType: !393, size: 32, offset: 1888)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !332, file: !331, line: 96, baseType: !436, size: 64, offset: 1920)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !332, file: !331, line: 96, baseType: !436, size: 64, offset: 1984)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !332, file: !331, line: 97, baseType: !439, size: 64, offset: 2048)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !332, file: !331, line: 97, baseType: !441, size: 64, offset: 2112)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !332, file: !331, line: 98, baseType: !393, size: 32, offset: 2176)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !332, file: !331, line: 98, baseType: !393, size: 32, offset: 2208)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !332, file: !331, line: 99, baseType: !436, size: 64, offset: 2240)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !332, file: !331, line: 99, baseType: !436, size: 64, offset: 2304)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !332, file: !331, line: 100, baseType: !447, size: 64, offset: 2368)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !396)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !332, file: !331, line: 100, baseType: !450, size: 64, offset: 2432)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !332, file: !331, line: 101, baseType: !393, size: 32, offset: 2496)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !332, file: !331, line: 101, baseType: !393, size: 32, offset: 2528)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !332, file: !331, line: 102, baseType: !436, size: 64, offset: 2560)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !332, file: !331, line: 102, baseType: !436, size: 64, offset: 2624)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !332, file: !331, line: 103, baseType: !456, size: 64, offset: 2688)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !448)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !332, file: !331, line: 103, baseType: !459, size: 64, offset: 2752)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !332, file: !331, line: 104, baseType: !388, size: 64, offset: 2816)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !332, file: !331, line: 105, baseType: !393, size: 32, offset: 2880)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !332, file: !331, line: 106, baseType: !463, size: 128, offset: 2944)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 128, elements: !470)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !331, line: 64, baseType: !466)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !331, line: 61, size: 128, elements: !467)
!467 = !{!468, !469}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !466, file: !331, line: 62, baseType: !381, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !466, file: !331, line: 63, baseType: !430, size: 64, offset: 64)
!470 = !{!471}
!471 = !DISubrange(count: 2)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !332, file: !331, line: 107, baseType: !473, size: 64, offset: 3072)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, size: 64, elements: !470)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !332, file: !331, line: 108, baseType: !430, size: 64, offset: 3136)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !332, file: !331, line: 109, baseType: !476, size: 64, offset: 3200)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!345, !430}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !332, file: !331, line: 111, baseType: !393, size: 32, offset: 3264)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !332, file: !331, line: 112, baseType: !481, size: 320, offset: 3328)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !482, size: 320, elements: !527)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!345, !485, !346, !430}
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !487)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !488)
!488 = !{!489, !490, !515, !516, !517, !518, !519, !520, !521, !522, !523}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !487, file: !12, line: 100, baseType: !393, size: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !487, file: !12, line: 101, baseType: !491, size: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !494)
!494 = !{!495, !496, !497, !498, !499, !502, !503, !504, !508, !510, !512, !513, !514}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !493, file: !12, line: 84, baseType: !420, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !493, file: !12, line: 85, baseType: !420, size: 64, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !493, file: !12, line: 86, baseType: !430, size: 64, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !493, file: !12, line: 87, baseType: !412, size: 64, offset: 192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !493, file: !12, line: 88, baseType: !500, size: 64, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !370)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !493, file: !12, line: 89, baseType: !372, size: 8, offset: 320)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !493, file: !12, line: 90, baseType: !420, size: 64, offset: 384)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !493, file: !12, line: 91, baseType: !505, size: 64, offset: 448)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !506, line: 46, baseType: !507)
!506 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!507 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !493, file: !12, line: 92, baseType: !509, size: 32, offset: 512)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !493, file: !12, line: 93, baseType: !511, size: 32, offset: 544)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !493, file: !12, line: 94, baseType: !491, size: 64, offset: 576)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !493, file: !12, line: 95, baseType: !420, size: 64, offset: 640)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !493, file: !12, line: 96, baseType: !430, size: 64, offset: 704)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !487, file: !12, line: 102, baseType: !420, size: 64, offset: 128)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !487, file: !12, line: 102, baseType: !420, size: 64, offset: 192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !487, file: !12, line: 103, baseType: !420, size: 64, offset: 256)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !487, file: !12, line: 104, baseType: !349, size: 64, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !487, file: !12, line: 105, baseType: !509, size: 32, offset: 384)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !487, file: !12, line: 105, baseType: !509, size: 32, offset: 416)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !487, file: !12, line: 105, baseType: !509, size: 32, offset: 448)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !487, file: !12, line: 106, baseType: !346, size: 64, offset: 512)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !487, file: !12, line: 107, baseType: !524, size: 64, offset: 576)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!527 = !{!528}
!528 = !DISubrange(count: 5)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !332, file: !331, line: 113, baseType: !530, size: 320, offset: 3648)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !531, size: 320, elements: !527)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!345, !346, !430}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !332, file: !331, line: 114, baseType: !535, size: 320, offset: 3968)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 320, elements: !527)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !332, file: !331, line: 115, baseType: !509, size: 32, offset: 4288)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !332, file: !331, line: 120, baseType: !524, size: 64, offset: 4352)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !332, file: !331, line: 121, baseType: !509, size: 32, offset: 4416)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !326, file: !327, line: 437, baseType: !540, size: 9472, offset: 4480)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !541, size: 9472, elements: !389)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !327, line: 32, size: 9472, elements: !542)
!542 = !{!543, !552, !556, !557, !564, !568, !569, !570, !571, !572, !573, !574, !732, !736, !741, !747, !766, !770, !774, !775, !780, !785, !786, !791, !795, !799, !803, !807, !811, !812, !813, !814, !815, !819, !820, !825, !826, !827, !828, !829, !834, !841, !845, !849, !853, !857, !861, !862, !866, !867, !874, !878, !879, !880, !881, !955, !960, !961, !965, !966, !970, !971, !975, !980, !981, !985, !989, !993, !994, !995, !996, !997, !998, !1003, !1004, !1008, !1012, !1016, !1017, !1018, !1022, !1032, !1033, !1037, !1038, !1042, !1043, !1047, !1048, !1053, !1054, !1058, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1072, !1073, !1074, !1075, !1076, !1077, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1092, !1096, !1097, !1098, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1112, !1113, !1114, !1119, !1123, !1124, !1128, !1129, !1130, !1131, !1157, !1161, !1162, !1163, !1164, !1165, !1169, !1170, !1171, !1172, !1173, !1177, !1181, !1182}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !541, file: !327, line: 34, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{!345, !324, !393, !547, !393, !547, !549, !551}
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !393)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !457)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !26)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !541, file: !327, line: 35, baseType: !553, size: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{!345, !324, !393, !439, !441, !459}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !541, file: !327, line: 36, baseType: !553, size: 64, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !541, file: !327, line: 37, baseType: !558, size: 64, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{!345, !324, !561, !561}
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !78, line: 21, baseType: !562)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !78, line: 21, flags: DIFlagFwdDecl)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !541, file: !327, line: 38, baseType: !565, size: 64, offset: 256)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{!345, !324, !561, !561, !561}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !541, file: !327, line: 40, baseType: !558, size: 64, offset: 320)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !541, file: !327, line: 41, baseType: !565, size: 64, offset: 384)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !541, file: !327, line: 42, baseType: !558, size: 64, offset: 448)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !541, file: !327, line: 43, baseType: !565, size: 64, offset: 512)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !541, file: !327, line: 44, baseType: !558, size: 64, offset: 576)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !541, file: !327, line: 46, baseType: !565, size: 64, offset: 640)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !541, file: !327, line: 47, baseType: !575, size: 64, offset: 704)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{!345, !324, !578, !578, !716}
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !579, line: 11, baseType: !580)
!579 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !48, line: 50, size: 7104, elements: !582)
!582 = !{!583, !584, !649, !703, !704, !705, !706, !707, !708, !709, !710, !713}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !581, file: !48, line: 51, baseType: !330, size: 4480)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !581, file: !48, line: 51, baseType: !585, size: 1536, offset: 4480)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 1536, elements: !389)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ISOps", file: !48, line: 21, size: 1536, elements: !587)
!587 = !{!588, !593, !594, !599, !603, !604, !609, !613, !614, !618, !619, !623, !624, !629, !633, !637, !641, !642, !643, !644, !645, !646, !647, !648}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "getindices", scope: !586, file: !48, line: 22, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{!345, !578, !592}
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "restoreindices", scope: !586, file: !48, line: 23, baseType: !589, size: 64, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "invertpermutation", scope: !586, file: !48, line: 24, baseType: !595, size: 64, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!345, !578, !393, !598}
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "sort", scope: !586, file: !48, line: 25, baseType: !600, size: 64, offset: 192)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{!345, !578}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "sortremovedups", scope: !586, file: !48, line: 26, baseType: !600, size: 64, offset: 256)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "sorted", scope: !586, file: !48, line: 27, baseType: !605, size: 64, offset: 320)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!345, !578, !608}
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !586, file: !48, line: 28, baseType: !610, size: 64, offset: 384)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!345, !578, !598}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !586, file: !48, line: 29, baseType: !600, size: 64, offset: 448)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !586, file: !48, line: 30, baseType: !615, size: 64, offset: 512)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!345, !578, !357}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !586, file: !48, line: 31, baseType: !615, size: 64, offset: 576)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !586, file: !48, line: 32, baseType: !620, size: 64, offset: 640)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!345, !578, !578}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "togeneral", scope: !586, file: !48, line: 33, baseType: !600, size: 64, offset: 704)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "oncomm", scope: !586, file: !48, line: 34, baseType: !625, size: 64, offset: 768)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!345, !578, !349, !628, !598}
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscCopyMode", file: !6, line: 327, baseType: !37)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksize", scope: !586, file: !48, line: 35, baseType: !630, size: 64, offset: 832)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!345, !578, !393}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "contiguous", scope: !586, file: !48, line: 36, baseType: !634, size: 64, offset: 896)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!345, !578, !393, !393, !439, !608}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "locate", scope: !586, file: !48, line: 37, baseType: !638, size: 64, offset: 960)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!345, !578, !393, !439}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "sortedlocal", scope: !586, file: !48, line: 38, baseType: !605, size: 64, offset: 1024)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "sortedglobal", scope: !586, file: !48, line: 39, baseType: !605, size: 64, offset: 1088)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "uniquelocal", scope: !586, file: !48, line: 40, baseType: !605, size: 64, offset: 1152)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "uniqueglobal", scope: !586, file: !48, line: 41, baseType: !605, size: 64, offset: 1216)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "permlocal", scope: !586, file: !48, line: 42, baseType: !605, size: 64, offset: 1280)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "permglobal", scope: !586, file: !48, line: 43, baseType: !605, size: 64, offset: 1344)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "intervallocal", scope: !586, file: !48, line: 44, baseType: !605, size: 64, offset: 1408)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "intervalglobal", scope: !586, file: !48, line: 45, baseType: !605, size: 64, offset: 1472)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !581, file: !48, line: 52, baseType: !650, size: 64, offset: 6016)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !579, line: 60, baseType: !651)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !43, line: 240, size: 640, elements: !653)
!653 = !{!654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !699, !700, !701, !702}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !652, file: !43, line: 241, baseType: !349, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !652, file: !43, line: 242, baseType: !410, size: 32, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !652, file: !43, line: 243, baseType: !393, size: 32, offset: 96)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !652, file: !43, line: 243, baseType: !393, size: 32, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !652, file: !43, line: 244, baseType: !393, size: 32, offset: 160)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !652, file: !43, line: 244, baseType: !393, size: 32, offset: 192)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !652, file: !43, line: 245, baseType: !439, size: 64, offset: 256)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !652, file: !43, line: 246, baseType: !509, size: 32, offset: 320)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !652, file: !43, line: 247, baseType: !393, size: 32, offset: 352)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !652, file: !43, line: 251, baseType: !393, size: 32, offset: 384)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !652, file: !43, line: 252, baseType: !665, size: 64, offset: 448)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !579, line: 30, baseType: !666)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !48, line: 73, size: 5440, elements: !668)
!668 = !{!669, !670, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !667, file: !48, line: 74, baseType: !330, size: 4480)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !667, file: !48, line: 74, baseType: !671, size: 256, offset: 4480)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 256, elements: !389)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ISLocalToGlobalMappingOps", file: !48, line: 66, size: 256, elements: !673)
!673 = !{!674, !678, !683, !684}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingsetup", scope: !672, file: !48, line: 67, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!345, !665}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingapply", scope: !672, file: !48, line: 68, baseType: !679, size: 64, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!345, !665, !682, !393, !547, !439, !439}
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISGlobalToLocalMappingMode", file: !43, line: 149, baseType: !42)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingapplyblock", scope: !672, file: !48, line: 69, baseType: !679, size: 64, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !672, file: !48, line: 70, baseType: !675, size: 64, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !667, file: !48, line: 75, baseType: !393, size: 32, offset: 4736)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !667, file: !48, line: 76, baseType: !393, size: 32, offset: 4768)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "indices", scope: !667, file: !48, line: 77, baseType: !439, size: 64, offset: 4800)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "globalstart", scope: !667, file: !48, line: 78, baseType: !393, size: 32, offset: 4864)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "globalend", scope: !667, file: !48, line: 79, baseType: !393, size: 32, offset: 4896)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "info_cached", scope: !667, file: !48, line: 80, baseType: !509, size: 32, offset: 4928)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "info_free", scope: !667, file: !48, line: 81, baseType: !509, size: 32, offset: 4960)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "info_nproc", scope: !667, file: !48, line: 82, baseType: !393, size: 32, offset: 4992)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "info_procs", scope: !667, file: !48, line: 83, baseType: !439, size: 64, offset: 5056)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "info_numprocs", scope: !667, file: !48, line: 84, baseType: !439, size: 64, offset: 5120)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "info_indices", scope: !667, file: !48, line: 85, baseType: !441, size: 64, offset: 5184)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "info_nodec", scope: !667, file: !48, line: 86, baseType: !439, size: 64, offset: 5248)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "info_nodei", scope: !667, file: !48, line: 87, baseType: !441, size: 64, offset: 5312)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !667, file: !48, line: 88, baseType: !430, size: 64, offset: 5376)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !652, file: !43, line: 253, baseType: !509, size: 32, offset: 512)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !652, file: !43, line: 254, baseType: !393, size: 32, offset: 544)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !652, file: !43, line: 254, baseType: !393, size: 32, offset: 576)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !652, file: !43, line: 255, baseType: !393, size: 32, offset: 608)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !581, file: !48, line: 53, baseType: !393, size: 32, offset: 6080)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !581, file: !48, line: 53, baseType: !393, size: 32, offset: 6112)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !581, file: !48, line: 54, baseType: !430, size: 64, offset: 6144)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !581, file: !48, line: 55, baseType: !439, size: 64, offset: 6208)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !581, file: !48, line: 55, baseType: !439, size: 64, offset: 6272)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "local_offset", scope: !581, file: !48, line: 56, baseType: !393, size: 32, offset: 6336)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "complement", scope: !581, file: !48, line: 57, baseType: !578, size: 64, offset: 6400)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "info_permanent", scope: !581, file: !48, line: 58, baseType: !711, size: 320, offset: 6464)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !509, size: 320, elements: !712)
!712 = !{!471, !528}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !581, file: !48, line: 59, baseType: !714, size: 320, offset: 6784)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !715, size: 320, elements: !712)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISInfoBool", file: !48, line: 48, baseType: !47)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !718)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !54, line: 1239, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !54, line: 1226, size: 704, elements: !720)
!720 = !{!721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !719, file: !54, line: 1227, baseType: !448, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !719, file: !54, line: 1228, baseType: !448, size: 64, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !719, file: !54, line: 1229, baseType: !448, size: 64, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !719, file: !54, line: 1230, baseType: !448, size: 64, offset: 192)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !719, file: !54, line: 1231, baseType: !448, size: 64, offset: 256)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !719, file: !54, line: 1232, baseType: !448, size: 64, offset: 320)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !719, file: !54, line: 1233, baseType: !448, size: 64, offset: 384)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !719, file: !54, line: 1234, baseType: !448, size: 64, offset: 448)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !719, file: !54, line: 1236, baseType: !448, size: 64, offset: 512)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !719, file: !54, line: 1237, baseType: !448, size: 64, offset: 576)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !719, file: !54, line: 1238, baseType: !448, size: 64, offset: 640)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !541, file: !327, line: 48, baseType: !733, size: 64, offset: 768)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!345, !324, !578, !716}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !541, file: !327, line: 49, baseType: !737, size: 64, offset: 832)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!345, !324, !561, !448, !740, !448, !393, !393, !561}
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !54, line: 1291, baseType: !53)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !541, file: !327, line: 50, baseType: !742, size: 64, offset: 896)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!345, !324, !745, !746}
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !54, line: 238, baseType: !66)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !541, file: !327, line: 52, baseType: !748, size: 64, offset: 960)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{!345, !324, !751, !752}
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !54, line: 612, baseType: !72)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !54, line: 600, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !54, line: 592, size: 640, elements: !755)
!755 = !{!756, !757, !758, !759, !760, !761, !762, !763, !764, !765}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !754, file: !54, line: 593, baseType: !395, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !754, file: !54, line: 594, baseType: !395, size: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !754, file: !54, line: 594, baseType: !395, size: 64, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !754, file: !54, line: 594, baseType: !395, size: 64, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !754, file: !54, line: 595, baseType: !395, size: 64, offset: 256)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !754, file: !54, line: 596, baseType: !395, size: 64, offset: 320)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !754, file: !54, line: 597, baseType: !395, size: 64, offset: 384)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !754, file: !54, line: 598, baseType: !395, size: 64, offset: 448)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !754, file: !54, line: 598, baseType: !395, size: 64, offset: 512)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !754, file: !54, line: 599, baseType: !395, size: 64, offset: 576)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !541, file: !327, line: 53, baseType: !767, size: 64, offset: 1024)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{!345, !324, !324, !608}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !541, file: !327, line: 54, baseType: !771, size: 64, offset: 1088)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{!345, !324, !561}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !541, file: !327, line: 55, baseType: !558, size: 64, offset: 1152)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !541, file: !327, line: 56, baseType: !776, size: 64, offset: 1216)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{!345, !324, !779, !447}
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !78, line: 155, baseType: !77)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !541, file: !327, line: 58, baseType: !781, size: 64, offset: 1280)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DISubroutineType(types: !783)
!783 = !{!345, !324, !784}
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !54, line: 424, baseType: !85)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !541, file: !327, line: 59, baseType: !781, size: 64, offset: 1344)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !541, file: !327, line: 60, baseType: !787, size: 64, offset: 1408)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{!345, !324, !790, !509}
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !54, line: 469, baseType: !89)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !541, file: !327, line: 61, baseType: !792, size: 64, offset: 1472)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{!345, !324}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !541, file: !327, line: 63, baseType: !796, size: 64, offset: 1536)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{!345, !324, !393, !547, !457, !561, !561}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !541, file: !327, line: 64, baseType: !800, size: 64, offset: 1600)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DISubroutineType(types: !802)
!802 = !{!345, !324, !324, !578, !578, !716}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !541, file: !327, line: 65, baseType: !804, size: 64, offset: 1664)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!345, !324, !324, !716}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !541, file: !327, line: 66, baseType: !808, size: 64, offset: 1728)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DISubroutineType(types: !810)
!810 = !{!345, !324, !324, !578, !716}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !541, file: !327, line: 67, baseType: !804, size: 64, offset: 1792)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !541, file: !327, line: 69, baseType: !792, size: 64, offset: 1856)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !541, file: !327, line: 70, baseType: !800, size: 64, offset: 1920)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !541, file: !327, line: 71, baseType: !808, size: 64, offset: 1984)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !541, file: !327, line: 72, baseType: !816, size: 64, offset: 2048)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{!345, !324, !746}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !541, file: !327, line: 73, baseType: !792, size: 64, offset: 2112)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !541, file: !327, line: 75, baseType: !821, size: 64, offset: 2176)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{!345, !324, !824, !746}
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !54, line: 563, baseType: !120)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !541, file: !327, line: 76, baseType: !558, size: 64, offset: 2240)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !541, file: !327, line: 77, baseType: !558, size: 64, offset: 2304)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !541, file: !327, line: 78, baseType: !575, size: 64, offset: 2368)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !541, file: !327, line: 79, baseType: !733, size: 64, offset: 2432)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !541, file: !327, line: 81, baseType: !830, size: 64, offset: 2496)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{!345, !324, !457, !324, !833}
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !54, line: 285, baseType: !125)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !541, file: !327, line: 82, baseType: !835, size: 64, offset: 2560)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!345, !324, !393, !838, !838, !745, !840}
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !578)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !541, file: !327, line: 83, baseType: !842, size: 64, offset: 2624)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!345, !324, !393, !598, !393}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !541, file: !327, line: 84, baseType: !846, size: 64, offset: 2688)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!345, !324, !393, !547, !393, !547, !456}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !541, file: !327, line: 85, baseType: !850, size: 64, offset: 2752)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!345, !324, !324, !833}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !541, file: !327, line: 87, baseType: !854, size: 64, offset: 2816)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{!345, !324, !561, !439}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !541, file: !327, line: 88, baseType: !858, size: 64, offset: 2880)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{!345, !324, !457}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !541, file: !327, line: 89, baseType: !858, size: 64, offset: 2944)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !541, file: !327, line: 90, baseType: !863, size: 64, offset: 3008)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{!345, !324, !561, !551}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !541, file: !327, line: 91, baseType: !796, size: 64, offset: 3072)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !541, file: !327, line: 93, baseType: !868, size: 64, offset: 3136)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!345, !324, !871}
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !872)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !541, file: !327, line: 94, baseType: !875, size: 64, offset: 3200)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!345, !324, !393, !509, !509, !439, !592, !592, !608}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !541, file: !327, line: 95, baseType: !875, size: 64, offset: 3264)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !541, file: !327, line: 96, baseType: !875, size: 64, offset: 3328)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !541, file: !327, line: 97, baseType: !875, size: 64, offset: 3392)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !541, file: !327, line: 99, baseType: !882, size: 64, offset: 3456)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DISubroutineType(types: !884)
!884 = !{!345, !324, !885, !901}
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !579, line: 51, baseType: !886)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !48, line: 91, size: 384, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !897, !898, !900}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !887, file: !48, line: 92, baseType: !393, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !887, file: !48, line: 93, baseType: !393, size: 32, offset: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "is", scope: !887, file: !48, line: 94, baseType: !598, size: 64, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !887, file: !48, line: 95, baseType: !349, size: 64, offset: 128)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !887, file: !48, line: 96, baseType: !894, size: 64, offset: 192)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !43, line: 215, baseType: !896)
!896 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !887, file: !48, line: 97, baseType: !393, size: 32, offset: 256)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !887, file: !48, line: 98, baseType: !899, size: 32, offset: 288)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !43, line: 213, baseType: !131)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !887, file: !48, line: 99, baseType: !509, size: 32, offset: 320)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !54, line: 1378, baseType: !902)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !327, line: 609, size: 6208, elements: !904)
!904 = !{!905, !906, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !925, !932, !933, !934, !935, !936, !937, !938, !939, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !903, file: !327, line: 610, baseType: !330, size: 4480)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !903, file: !327, line: 610, baseType: !907, size: 32, offset: 4480)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 32, elements: !389)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !903, file: !327, line: 611, baseType: !393, size: 32, offset: 4512)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !903, file: !327, line: 611, baseType: !393, size: 32, offset: 4544)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !903, file: !327, line: 611, baseType: !393, size: 32, offset: 4576)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !903, file: !327, line: 612, baseType: !393, size: 32, offset: 4608)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !903, file: !327, line: 613, baseType: !393, size: 32, offset: 4640)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !903, file: !327, line: 614, baseType: !439, size: 64, offset: 4672)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !903, file: !327, line: 615, baseType: !441, size: 64, offset: 4736)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !903, file: !327, line: 616, baseType: !598, size: 64, offset: 4800)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !903, file: !327, line: 617, baseType: !439, size: 64, offset: 4864)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !903, file: !327, line: 618, baseType: !918, size: 64, offset: 4928)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !327, line: 602, baseType: !920)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !327, line: 598, size: 128, elements: !921)
!921 = !{!922, !923, !924}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !920, file: !327, line: 599, baseType: !393, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !920, file: !327, line: 600, baseType: !393, size: 32, offset: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !920, file: !327, line: 601, baseType: !456, size: 64, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !903, file: !327, line: 619, baseType: !926, size: 64, offset: 4992)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !327, line: 607, baseType: !928)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !327, line: 604, size: 128, elements: !929)
!929 = !{!930, !931}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !928, file: !327, line: 605, baseType: !393, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !928, file: !327, line: 606, baseType: !456, size: 64, offset: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !903, file: !327, line: 620, baseType: !456, size: 64, offset: 5056)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !903, file: !327, line: 621, baseType: !448, size: 64, offset: 5120)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !903, file: !327, line: 622, baseType: !448, size: 64, offset: 5184)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !903, file: !327, line: 623, baseType: !561, size: 64, offset: 5248)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !903, file: !327, line: 623, baseType: !561, size: 64, offset: 5312)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !903, file: !327, line: 623, baseType: !561, size: 64, offset: 5376)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !903, file: !327, line: 624, baseType: !509, size: 32, offset: 5440)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !903, file: !327, line: 625, baseType: !940, size: 64, offset: 5504)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{!345}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !903, file: !327, line: 626, baseType: !430, size: 64, offset: 5568)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !903, file: !327, line: 627, baseType: !561, size: 64, offset: 5632)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !903, file: !327, line: 628, baseType: !393, size: 32, offset: 5696)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !903, file: !327, line: 629, baseType: !370, size: 64, offset: 5760)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !903, file: !327, line: 630, baseType: !899, size: 32, offset: 5824)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !903, file: !327, line: 631, baseType: !393, size: 32, offset: 5856)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !903, file: !327, line: 631, baseType: !393, size: 32, offset: 5888)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !903, file: !327, line: 632, baseType: !509, size: 32, offset: 5920)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !903, file: !327, line: 633, baseType: !509, size: 32, offset: 5952)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !903, file: !327, line: 634, baseType: !381, size: 64, offset: 6016)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !903, file: !327, line: 634, baseType: !430, size: 64, offset: 6080)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !903, file: !327, line: 635, baseType: !401, size: 64, offset: 6144)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !541, file: !327, line: 100, baseType: !956, size: 64, offset: 3520)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DISubroutineType(types: !958)
!958 = !{!345, !324, !393, !393, !894, !959}
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !541, file: !327, line: 101, baseType: !792, size: 64, offset: 3584)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !541, file: !327, line: 102, baseType: !962, size: 64, offset: 3648)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!345, !324, !578, !578, !746}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !541, file: !327, line: 103, baseType: !544, size: 64, offset: 3712)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !541, file: !327, line: 105, baseType: !967, size: 64, offset: 3776)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!345, !324, !578, !578, !745, !746}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !541, file: !327, line: 106, baseType: !792, size: 64, offset: 3840)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !541, file: !327, line: 107, baseType: !972, size: 64, offset: 3904)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!345, !324, !357}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !541, file: !327, line: 108, baseType: !976, size: 64, offset: 3968)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!345, !324, !979, !745, !746}
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !54, line: 25, baseType: !370)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !541, file: !327, line: 109, baseType: !940, size: 64, offset: 4032)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !541, file: !327, line: 111, baseType: !982, size: 64, offset: 4096)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!345, !324, !324, !324, !448, !324}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !541, file: !327, line: 112, baseType: !986, size: 64, offset: 4160)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!345, !324, !324, !324, !324}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !541, file: !327, line: 113, baseType: !990, size: 64, offset: 4224)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!345, !324, !665, !665}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !541, file: !327, line: 114, baseType: !544, size: 64, offset: 4288)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !541, file: !327, line: 115, baseType: !796, size: 64, offset: 4352)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !541, file: !327, line: 117, baseType: !854, size: 64, offset: 4416)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !541, file: !327, line: 118, baseType: !854, size: 64, offset: 4480)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !541, file: !327, line: 119, baseType: !976, size: 64, offset: 4544)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !541, file: !327, line: 120, baseType: !999, size: 64, offset: 4608)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!345, !324, !1002, !608}
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !54, line: 1675, baseType: !135)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !541, file: !327, line: 121, baseType: !940, size: 64, offset: 4672)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !541, file: !327, line: 123, baseType: !1005, size: 64, offset: 4736)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!345, !324, !393, !430}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !541, file: !327, line: 124, baseType: !1009, size: 64, offset: 4800)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!345, !324, !901, !561, !430}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !541, file: !327, line: 125, baseType: !1013, size: 64, offset: 4864)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!345, !485, !324}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !541, file: !327, line: 126, baseType: !558, size: 64, offset: 4928)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !541, file: !327, line: 127, baseType: !558, size: 64, offset: 4992)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !541, file: !327, line: 129, baseType: !1019, size: 64, offset: 5056)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!345, !324, !598}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !541, file: !327, line: 130, baseType: !1023, size: 64, offset: 5120)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!345, !324, !1026, !1026}
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !78, line: 654, baseType: !1027)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !78, line: 653, size: 128, elements: !1029)
!1029 = !{!1030, !1031}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1028, file: !78, line: 653, baseType: !393, size: 32)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1028, file: !78, line: 653, baseType: !561, size: 64, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !541, file: !327, line: 131, baseType: !1023, size: 64, offset: 5184)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !541, file: !327, line: 132, baseType: !1034, size: 64, offset: 5248)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!345, !324, !439, !439, !439}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !541, file: !327, line: 133, baseType: !972, size: 64, offset: 5312)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !541, file: !327, line: 135, baseType: !1039, size: 64, offset: 5376)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!345, !324, !448, !608}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !541, file: !327, line: 136, baseType: !1039, size: 64, offset: 5440)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !541, file: !327, line: 137, baseType: !1044, size: 64, offset: 5504)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!345, !324, !608}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !541, file: !327, line: 138, baseType: !544, size: 64, offset: 5568)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !541, file: !327, line: 139, baseType: !1049, size: 64, offset: 5632)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!345, !324, !1052, !1052}
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !541, file: !327, line: 141, baseType: !940, size: 64, offset: 5696)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !541, file: !327, line: 142, baseType: !1055, size: 64, offset: 5760)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!345, !324, !324, !448, !324}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !541, file: !327, line: 143, baseType: !1059, size: 64, offset: 5824)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!345, !324, !324, !324}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !541, file: !327, line: 144, baseType: !940, size: 64, offset: 5888)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !541, file: !327, line: 145, baseType: !1055, size: 64, offset: 5952)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !541, file: !327, line: 147, baseType: !1059, size: 64, offset: 6016)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !541, file: !327, line: 148, baseType: !940, size: 64, offset: 6080)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !541, file: !327, line: 149, baseType: !1055, size: 64, offset: 6144)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !541, file: !327, line: 150, baseType: !1059, size: 64, offset: 6208)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !541, file: !327, line: 151, baseType: !1069, size: 64, offset: 6272)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!345, !324, !509}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !541, file: !327, line: 153, baseType: !792, size: 64, offset: 6336)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !541, file: !327, line: 154, baseType: !792, size: 64, offset: 6400)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !541, file: !327, line: 155, baseType: !792, size: 64, offset: 6464)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !541, file: !327, line: 156, baseType: !792, size: 64, offset: 6528)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !541, file: !327, line: 157, baseType: !972, size: 64, offset: 6592)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !541, file: !327, line: 159, baseType: !1078, size: 64, offset: 6656)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!345, !324, !393, !549}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !541, file: !327, line: 160, baseType: !792, size: 64, offset: 6720)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !541, file: !327, line: 161, baseType: !792, size: 64, offset: 6784)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !541, file: !327, line: 162, baseType: !792, size: 64, offset: 6848)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !541, file: !327, line: 163, baseType: !792, size: 64, offset: 6912)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !541, file: !327, line: 165, baseType: !1059, size: 64, offset: 6976)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !541, file: !327, line: 166, baseType: !1059, size: 64, offset: 7040)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !541, file: !327, line: 167, baseType: !854, size: 64, offset: 7104)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !541, file: !327, line: 168, baseType: !1089, size: 64, offset: 7168)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!345, !324, !561, !393}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !541, file: !327, line: 169, baseType: !1093, size: 64, offset: 7232)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!345, !324, !608, !439}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !541, file: !327, line: 171, baseType: !816, size: 64, offset: 7296)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !541, file: !327, line: 172, baseType: !792, size: 64, offset: 7360)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !541, file: !327, line: 173, baseType: !1099, size: 64, offset: 7424)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!345, !324, !439, !592}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !541, file: !327, line: 174, baseType: !962, size: 64, offset: 7488)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !541, file: !327, line: 175, baseType: !962, size: 64, offset: 7552)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !541, file: !327, line: 177, baseType: !558, size: 64, offset: 7616)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !541, file: !327, line: 178, baseType: !742, size: 64, offset: 7680)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !541, file: !327, line: 179, baseType: !558, size: 64, offset: 7744)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !541, file: !327, line: 180, baseType: !565, size: 64, offset: 7808)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !541, file: !327, line: 181, baseType: !1109, size: 64, offset: 7872)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{!345, !324, !349, !745, !746}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !541, file: !327, line: 183, baseType: !1019, size: 64, offset: 7936)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !541, file: !327, line: 184, baseType: !776, size: 64, offset: 8000)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !541, file: !327, line: 185, baseType: !1115, size: 64, offset: 8064)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!345, !324, !1118}
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !541, file: !327, line: 186, baseType: !1120, size: 64, offset: 8128)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{!345, !324, !393, !547, !456}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !541, file: !327, line: 187, baseType: !835, size: 64, offset: 8192)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !541, file: !327, line: 189, baseType: !1125, size: 64, offset: 8256)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!345, !324, !393, !393, !439, !549}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !541, file: !327, line: 190, baseType: !940, size: 64, offset: 8320)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !541, file: !327, line: 191, baseType: !1055, size: 64, offset: 8384)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !541, file: !327, line: 192, baseType: !1059, size: 64, offset: 8448)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !541, file: !327, line: 193, baseType: !1132, size: 64, offset: 8512)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!345, !324, !885, !1135}
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !54, line: 1401, baseType: !1136)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !327, line: 660, size: 5312, elements: !1138)
!1138 = !{!1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1137, file: !327, line: 661, baseType: !330, size: 4480)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1137, file: !327, line: 661, baseType: !907, size: 32, offset: 4480)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1137, file: !327, line: 662, baseType: !393, size: 32, offset: 4512)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1137, file: !327, line: 662, baseType: !393, size: 32, offset: 4544)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1137, file: !327, line: 662, baseType: !393, size: 32, offset: 4576)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1137, file: !327, line: 663, baseType: !393, size: 32, offset: 4608)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1137, file: !327, line: 664, baseType: !393, size: 32, offset: 4640)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1137, file: !327, line: 665, baseType: !439, size: 64, offset: 4672)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1137, file: !327, line: 666, baseType: !439, size: 64, offset: 4736)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1137, file: !327, line: 667, baseType: !393, size: 32, offset: 4800)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1137, file: !327, line: 668, baseType: !899, size: 32, offset: 4832)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1137, file: !327, line: 670, baseType: !439, size: 64, offset: 4864)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1137, file: !327, line: 670, baseType: !439, size: 64, offset: 4928)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1137, file: !327, line: 671, baseType: !439, size: 64, offset: 4992)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1137, file: !327, line: 672, baseType: !439, size: 64, offset: 5056)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1137, file: !327, line: 673, baseType: !439, size: 64, offset: 5120)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1137, file: !327, line: 674, baseType: !393, size: 32, offset: 5184)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1137, file: !327, line: 675, baseType: !439, size: 64, offset: 5248)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !541, file: !327, line: 195, baseType: !1158, size: 64, offset: 8576)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{!345, !1135, !324, !324}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !541, file: !327, line: 196, baseType: !1158, size: 64, offset: 8640)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !541, file: !327, line: 197, baseType: !940, size: 64, offset: 8704)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !541, file: !327, line: 198, baseType: !1055, size: 64, offset: 8768)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !541, file: !327, line: 199, baseType: !1059, size: 64, offset: 8832)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !541, file: !327, line: 201, baseType: !1166, size: 64, offset: 8896)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{!345, !324, !393, !393}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !541, file: !327, line: 202, baseType: !830, size: 64, offset: 8960)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !541, file: !327, line: 203, baseType: !565, size: 64, offset: 9024)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !541, file: !327, line: 204, baseType: !882, size: 64, offset: 9088)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !541, file: !327, line: 205, baseType: !1019, size: 64, offset: 9152)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !541, file: !327, line: 206, baseType: !1174, size: 64, offset: 9216)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64)
!1175 = !DISubroutineType(types: !1176)
!1176 = !{!345, !349, !324, !393, !745, !746}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !541, file: !327, line: 208, baseType: !1178, size: 64, offset: 9280)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{!345, !393, !840}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !541, file: !327, line: 209, baseType: !1059, size: 64, offset: 9344)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !541, file: !327, line: 210, baseType: !846, size: 64, offset: 9408)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !326, file: !327, line: 438, baseType: !650, size: 64, offset: 13952)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !326, file: !327, line: 438, baseType: !650, size: 64, offset: 14016)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !326, file: !327, line: 439, baseType: !430, size: 64, offset: 14080)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !326, file: !327, line: 440, baseType: !1187, size: 32, offset: 14144)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !54, line: 161, baseType: !280)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !326, file: !327, line: 441, baseType: !509, size: 32, offset: 14176)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !326, file: !327, line: 442, baseType: !509, size: 32, offset: 14208)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !326, file: !327, line: 443, baseType: !1191, size: 448, offset: 14272)
!1191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1192, size: 448, elements: !1193)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !54, line: 1159, baseType: !370)
!1193 = !{!1194}
!1194 = !DISubrange(count: 7)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !326, file: !327, line: 444, baseType: !509, size: 32, offset: 14720)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !326, file: !327, line: 445, baseType: !509, size: 32, offset: 14752)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !326, file: !327, line: 446, baseType: !393, size: 32, offset: 14784)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !326, file: !327, line: 447, baseType: !432, size: 64, offset: 14848)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !326, file: !327, line: 448, baseType: !432, size: 64, offset: 14912)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !326, file: !327, line: 449, baseType: !753, size: 640, offset: 14976)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !326, file: !327, line: 450, baseType: !551, size: 32, offset: 15616)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !326, file: !327, line: 451, baseType: !1203, size: 2880, offset: 15680)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !327, line: 318, baseType: !1204)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !327, line: 319, size: 2880, elements: !1205)
!1205 = !{!1206, !1207, !1208, !1209, !1210, !1211, !1212, !1225, !1226, !1231, !1236, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1251, !1252, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1284, !1285, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1308, !1309, !1310, !1314, !1315}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1204, file: !327, line: 320, baseType: !393, size: 32)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1204, file: !327, line: 321, baseType: !393, size: 32, offset: 32)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1204, file: !327, line: 322, baseType: !393, size: 32, offset: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1204, file: !327, line: 323, baseType: !393, size: 32, offset: 96)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1204, file: !327, line: 324, baseType: !393, size: 32, offset: 128)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1204, file: !327, line: 325, baseType: !393, size: 32, offset: 160)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1204, file: !327, line: 326, baseType: !1213, size: 64, offset: 192)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !327, line: 293, baseType: !1214)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !327, line: 295, size: 448, elements: !1216)
!1216 = !{!1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1215, file: !327, line: 296, baseType: !1213, size: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1215, file: !327, line: 297, baseType: !456, size: 64, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1215, file: !327, line: 297, baseType: !456, size: 64, offset: 128)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1215, file: !327, line: 298, baseType: !439, size: 64, offset: 192)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1215, file: !327, line: 298, baseType: !439, size: 64, offset: 256)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1215, file: !327, line: 299, baseType: !393, size: 32, offset: 320)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1215, file: !327, line: 300, baseType: !393, size: 32, offset: 352)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1215, file: !327, line: 301, baseType: !393, size: 32, offset: 384)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1204, file: !327, line: 326, baseType: !1213, size: 64, offset: 256)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1204, file: !327, line: 328, baseType: !1227, size: 64, offset: 320)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{!345, !324, !1230, !439}
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1204, file: !327, line: 329, baseType: !1232, size: 64, offset: 384)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = !DISubroutineType(types: !1234)
!1234 = !{!345, !1230, !1235, !441, !441, !459, !439}
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1204, file: !327, line: 330, baseType: !1237, size: 64, offset: 448)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64)
!1238 = !DISubroutineType(types: !1239)
!1239 = !{!345, !1230}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1204, file: !327, line: 331, baseType: !1237, size: 64, offset: 512)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1204, file: !327, line: 334, baseType: !349, size: 64, offset: 576)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1204, file: !327, line: 335, baseType: !410, size: 32, offset: 640)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1204, file: !327, line: 335, baseType: !410, size: 32, offset: 672)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1204, file: !327, line: 336, baseType: !410, size: 32, offset: 704)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1204, file: !327, line: 336, baseType: !410, size: 32, offset: 736)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1204, file: !327, line: 337, baseType: !1247, size: 64, offset: 768)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64)
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !350, line: 339, baseType: !1249)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64)
!1250 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !350, line: 339, flags: DIFlagFwdDecl)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1204, file: !327, line: 338, baseType: !1247, size: 64, offset: 832)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1204, file: !327, line: 339, baseType: !1253, size: 64, offset: 896)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64)
!1254 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !350, line: 341, baseType: !1255)
