; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/mffd/mffddef.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/mffd/mffddef.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319}
!302 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!305 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!306 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!307 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!308 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!309 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!310 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!311 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!312 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!313 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!314 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!315 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!316 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!317 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!318 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!319 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!320 = !{!321, !325, !326, !334, !337, !535, !501, !536, !333}
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !322, line: 330, baseType: !323)
!322 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !322, line: 330, flags: DIFlagFwdDecl)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatMFFD_DS", file: !328, line: 46, baseType: !329)
!328 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/impls/mffd/mffddef.c", directory: "/home/users/ndemeye/xSDK")
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !328, line: 44, size: 64, elements: !330)
!330 = !{!331}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !329, file: !328, line: 45, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !333)
!333 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !336)
!336 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !340, line: 73, size: 4480, elements: !341)
!340 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!341 = !{!342, !344, !390, !391, !393, !395, !396, !397, !398, !406, !407, !409, !413, !417, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !430, !431, !432, !434, !435, !437, !439, !440, !441, !442, !443, !445, !447, !448, !449, !450, !451, !454, !456, !457, !458, !468, !470, !471, !475, !476, !525, !530, !532, !533, !534}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !339, file: !340, line: 74, baseType: !343, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !339, file: !340, line: 75, baseType: !345, size: 448, offset: 64)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !346, size: 448, elements: !388)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !340, line: 53, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !340, line: 45, size: 448, elements: !348)
!348 = !{!349, !355, !363, !368, !372, !376, !383}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !347, file: !340, line: 46, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!353, !337, !354}
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !347, file: !340, line: 47, baseType: !356, size: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{!353, !337, !359}
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !360, line: 16, baseType: !361)
!360 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !360, line: 16, flags: DIFlagFwdDecl)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !347, file: !340, line: 48, baseType: !364, size: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!353, !367}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !347, file: !340, line: 49, baseType: !369, size: 64, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!353, !337, !334, !337}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !347, file: !340, line: 50, baseType: !373, size: 64, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!353, !337, !334, !367}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !347, file: !340, line: 51, baseType: !377, size: 64, offset: 320)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!353, !337, !334, !380}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{null}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !347, file: !340, line: 52, baseType: !384, size: 64, offset: 384)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{!353, !337, !334, !387}
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!388 = !{!389}
!389 = !DISubrange(count: 1)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !339, file: !340, line: 76, baseType: !321, size: 64, offset: 512)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !339, file: !340, line: 77, baseType: !392, size: 32, offset: 576)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !339, file: !340, line: 78, baseType: !394, size: 64, offset: 640)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !333)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !339, file: !340, line: 78, baseType: !394, size: 64, offset: 704)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !339, file: !340, line: 78, baseType: !394, size: 64, offset: 768)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !339, file: !340, line: 78, baseType: !394, size: 64, offset: 832)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !339, file: !340, line: 79, baseType: !399, size: 64, offset: 896)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !401)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !402, line: 27, baseType: !403)
!402 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !404, line: 43, baseType: !405)
!404 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!405 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !339, file: !340, line: 80, baseType: !392, size: 32, offset: 960)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !339, file: !340, line: 81, baseType: !408, size: 32, offset: 992)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !339, file: !340, line: 82, baseType: !410, size: 64, offset: 1024)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !411)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !339, file: !340, line: 83, baseType: !414, size: 64, offset: 1088)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !339, file: !340, line: 84, baseType: !418, size: 64, offset: 1152)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !339, file: !340, line: 85, baseType: !418, size: 64, offset: 1216)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !339, file: !340, line: 86, baseType: !418, size: 64, offset: 1280)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !339, file: !340, line: 87, baseType: !418, size: 64, offset: 1344)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !339, file: !340, line: 88, baseType: !337, size: 64, offset: 1408)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !339, file: !340, line: 89, baseType: !399, size: 64, offset: 1472)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !339, file: !340, line: 90, baseType: !418, size: 64, offset: 1536)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !339, file: !340, line: 91, baseType: !418, size: 64, offset: 1600)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !339, file: !340, line: 92, baseType: !392, size: 32, offset: 1664)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !339, file: !340, line: 93, baseType: !325, size: 64, offset: 1728)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !339, file: !340, line: 94, baseType: !429, size: 64, offset: 1792)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !400)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !339, file: !340, line: 95, baseType: !392, size: 32, offset: 1856)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !339, file: !340, line: 95, baseType: !392, size: 32, offset: 1888)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !339, file: !340, line: 96, baseType: !433, size: 64, offset: 1920)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !339, file: !340, line: 96, baseType: !433, size: 64, offset: 1984)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !339, file: !340, line: 97, baseType: !436, size: 64, offset: 2048)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !339, file: !340, line: 97, baseType: !438, size: 64, offset: 2112)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !339, file: !340, line: 98, baseType: !392, size: 32, offset: 2176)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !339, file: !340, line: 98, baseType: !392, size: 32, offset: 2208)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !339, file: !340, line: 99, baseType: !433, size: 64, offset: 2240)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !339, file: !340, line: 99, baseType: !433, size: 64, offset: 2304)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !339, file: !340, line: 100, baseType: !444, size: 64, offset: 2368)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !339, file: !340, line: 100, baseType: !446, size: 64, offset: 2432)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !339, file: !340, line: 101, baseType: !392, size: 32, offset: 2496)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !339, file: !340, line: 101, baseType: !392, size: 32, offset: 2528)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !339, file: !340, line: 102, baseType: !433, size: 64, offset: 2560)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !339, file: !340, line: 102, baseType: !433, size: 64, offset: 2624)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !339, file: !340, line: 103, baseType: !452, size: 64, offset: 2688)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !332)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !339, file: !340, line: 103, baseType: !455, size: 64, offset: 2752)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !339, file: !340, line: 104, baseType: !387, size: 64, offset: 2816)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !339, file: !340, line: 105, baseType: !392, size: 32, offset: 2880)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !339, file: !340, line: 106, baseType: !459, size: 128, offset: 2944)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 128, elements: !466)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !340, line: 64, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !340, line: 61, size: 128, elements: !463)
!463 = !{!464, !465}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !462, file: !340, line: 62, baseType: !380, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !462, file: !340, line: 63, baseType: !325, size: 64, offset: 64)
!466 = !{!467}
!467 = !DISubrange(count: 2)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !339, file: !340, line: 107, baseType: !469, size: 64, offset: 3072)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 64, elements: !466)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !339, file: !340, line: 108, baseType: !325, size: 64, offset: 3136)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !339, file: !340, line: 109, baseType: !472, size: 64, offset: 3200)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!353, !325}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !339, file: !340, line: 111, baseType: !392, size: 32, offset: 3264)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !339, file: !340, line: 112, baseType: !477, size: 320, offset: 3328)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 320, elements: !523)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!353, !481, !337, !325}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !484)
!484 = !{!485, !486, !511, !512, !513, !514, !515, !516, !517, !518, !519}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !483, file: !10, line: 100, baseType: !392, size: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !483, file: !10, line: 101, baseType: !487, size: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !490)
!490 = !{!491, !492, !493, !494, !495, !498, !499, !500, !504, !506, !508, !509, !510}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !489, file: !10, line: 84, baseType: !418, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !489, file: !10, line: 85, baseType: !418, size: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !489, file: !10, line: 86, baseType: !325, size: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !489, file: !10, line: 87, baseType: !410, size: 64, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !489, file: !10, line: 88, baseType: !496, size: 64, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !334)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !489, file: !10, line: 89, baseType: !336, size: 8, offset: 320)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !489, file: !10, line: 90, baseType: !418, size: 64, offset: 384)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !489, file: !10, line: 91, baseType: !501, size: 64, offset: 448)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !502, line: 46, baseType: !503)
!502 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!503 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !489, file: !10, line: 92, baseType: !505, size: 32, offset: 512)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !489, file: !10, line: 93, baseType: !507, size: 32, offset: 544)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !489, file: !10, line: 94, baseType: !487, size: 64, offset: 576)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !489, file: !10, line: 95, baseType: !418, size: 64, offset: 640)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !489, file: !10, line: 96, baseType: !325, size: 64, offset: 704)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !483, file: !10, line: 102, baseType: !418, size: 64, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !483, file: !10, line: 102, baseType: !418, size: 64, offset: 192)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !483, file: !10, line: 103, baseType: !418, size: 64, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !483, file: !10, line: 104, baseType: !321, size: 64, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !483, file: !10, line: 105, baseType: !505, size: 32, offset: 384)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !483, file: !10, line: 105, baseType: !505, size: 32, offset: 416)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !483, file: !10, line: 105, baseType: !505, size: 32, offset: 448)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !483, file: !10, line: 106, baseType: !337, size: 64, offset: 512)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !483, file: !10, line: 107, baseType: !520, size: 64, offset: 576)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!523 = !{!524}
!524 = !DISubrange(count: 5)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !339, file: !340, line: 113, baseType: !526, size: 320, offset: 3648)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !527, size: 320, elements: !523)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!353, !337, !325}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !339, file: !340, line: 114, baseType: !531, size: 320, offset: 3968)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !325, size: 320, elements: !523)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !339, file: !340, line: 115, baseType: !505, size: 32, offset: 4288)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !339, file: !340, line: 120, baseType: !520, size: 64, offset: 4352)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !339, file: !340, line: 121, baseType: !505, size: 32, offset: 4416)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !537, line: 1451, baseType: !380)
!537 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!538 = !{i32 7, !"Dwarf Version", i32 4}
!539 = !{i32 2, !"Debug Info Version", i32 3}
!540 = !{i32 1, !"wchar_size", i32 4}
!541 = !{i32 7, !"PIC Level", i32 2}
!542 = !{i32 7, !"uwtable", i32 1}
!543 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!544 = distinct !DISubprogram(name: "MatMFFDDSSetUmin_DS", scope: !328, file: !328, line: 174, type: !545, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1318)
!545 = !DISubroutineType(types: !546)
!546 = !{!353, !547, !332}
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !548)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !550, line: 436, size: 23424, elements: !551)
!550 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!551 = !{!552, !554, !1061, !1081, !1082, !1083, !1085, !1086, !1087, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1214, !1215, !1231, !1232, !1233, !1234, !1235, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1270, !1290, !1291, !1293, !1294, !1295, !1296, !1297, !1298, !1316, !1317}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !549, file: !550, line: 437, baseType: !553, size: 4480)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !340, line: 122, baseType: !339)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !549, file: !550, line: 437, baseType: !555, size: 9472, offset: 4480)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 9472, elements: !388)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !550, line: 32, size: 9472, elements: !557)
!557 = !{!558, !567, !571, !572, !579, !583, !584, !585, !586, !587, !588, !589, !613, !617, !622, !628, !647, !652, !656, !657, !662, !667, !668, !673, !677, !681, !685, !689, !693, !694, !695, !696, !697, !701, !702, !707, !708, !709, !710, !711, !716, !723, !728, !732, !736, !740, !744, !745, !749, !750, !757, !762, !763, !764, !765, !827, !835, !836, !840, !841, !845, !846, !850, !855, !856, !860, !864, !871, !872, !873, !874, !875, !876, !881, !882, !886, !890, !894, !895, !896, !900, !910, !911, !915, !916, !920, !921, !925, !926, !931, !932, !936, !940, !941, !942, !943, !944, !945, !946, !950, !951, !952, !953, !954, !955, !959, !960, !961, !962, !963, !964, !965, !966, !970, !974, !975, !976, !980, !981, !982, !983, !984, !985, !986, !990, !991, !992, !997, !1001, !1002, !1006, !1007, !1008, !1009, !1035, !1039, !1040, !1041, !1042, !1043, !1047, !1048, !1049, !1050, !1051, !1055, !1059, !1060}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !556, file: !550, line: 34, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{!353, !547, !392, !562, !392, !562, !564, !566}
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !392)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !453)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !556, file: !550, line: 35, baseType: !568, size: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!353, !547, !392, !436, !438, !455}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !556, file: !550, line: 36, baseType: !568, size: 64, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !556, file: !550, line: 37, baseType: !573, size: 64, offset: 192)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{!353, !547, !576, !576}
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !577)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !556, file: !550, line: 38, baseType: !580, size: 64, offset: 256)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{!353, !547, !576, !576, !576}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !556, file: !550, line: 40, baseType: !573, size: 64, offset: 320)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !556, file: !550, line: 41, baseType: !580, size: 64, offset: 384)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !556, file: !550, line: 42, baseType: !573, size: 64, offset: 448)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !556, file: !550, line: 43, baseType: !580, size: 64, offset: 512)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !556, file: !550, line: 44, baseType: !573, size: 64, offset: 576)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !556, file: !550, line: 46, baseType: !580, size: 64, offset: 640)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !556, file: !550, line: 47, baseType: !590, size: 64, offset: 704)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!353, !547, !593, !593, !597}
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !594, line: 11, baseType: !595)
!594 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !594, line: 11, flags: DIFlagFwdDecl)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !599)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !600)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !601)
!601 = !{!602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !600, file: !36, line: 1227, baseType: !332, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !600, file: !36, line: 1228, baseType: !332, size: 64, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !600, file: !36, line: 1229, baseType: !332, size: 64, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !600, file: !36, line: 1230, baseType: !332, size: 64, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !600, file: !36, line: 1231, baseType: !332, size: 64, offset: 256)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !600, file: !36, line: 1232, baseType: !332, size: 64, offset: 320)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !600, file: !36, line: 1233, baseType: !332, size: 64, offset: 384)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !600, file: !36, line: 1234, baseType: !332, size: 64, offset: 448)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !600, file: !36, line: 1236, baseType: !332, size: 64, offset: 512)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !600, file: !36, line: 1237, baseType: !332, size: 64, offset: 576)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !600, file: !36, line: 1238, baseType: !332, size: 64, offset: 640)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !556, file: !550, line: 48, baseType: !614, size: 64, offset: 768)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!353, !547, !593, !597}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !556, file: !550, line: 49, baseType: !618, size: 64, offset: 832)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{!353, !547, !576, !332, !621, !332, !392, !392, !576}
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !556, file: !550, line: 50, baseType: !623, size: 64, offset: 896)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{!353, !547, !626, !627}
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !556, file: !550, line: 52, baseType: !629, size: 64, offset: 960)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{!353, !547, !632, !633}
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !635)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !636)
!636 = !{!637, !638, !639, !640, !641, !642, !643, !644, !645, !646}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !635, file: !36, line: 593, baseType: !394, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !635, file: !36, line: 594, baseType: !394, size: 64, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !635, file: !36, line: 594, baseType: !394, size: 64, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !635, file: !36, line: 594, baseType: !394, size: 64, offset: 192)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !635, file: !36, line: 595, baseType: !394, size: 64, offset: 256)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !635, file: !36, line: 596, baseType: !394, size: 64, offset: 320)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !635, file: !36, line: 597, baseType: !394, size: 64, offset: 384)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !635, file: !36, line: 598, baseType: !394, size: 64, offset: 448)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !635, file: !36, line: 598, baseType: !394, size: 64, offset: 512)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !635, file: !36, line: 599, baseType: !394, size: 64, offset: 576)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !556, file: !550, line: 53, baseType: !648, size: 64, offset: 1024)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!353, !547, !547, !651}
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !556, file: !550, line: 54, baseType: !653, size: 64, offset: 1088)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{!353, !547, !576}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !556, file: !550, line: 55, baseType: !573, size: 64, offset: 1152)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !556, file: !550, line: 56, baseType: !658, size: 64, offset: 1216)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!353, !547, !661, !444}
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !556, file: !550, line: 58, baseType: !663, size: 64, offset: 1280)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!353, !547, !666}
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !556, file: !550, line: 59, baseType: !663, size: 64, offset: 1344)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !556, file: !550, line: 60, baseType: !669, size: 64, offset: 1408)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{!353, !547, !672, !505}
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !556, file: !550, line: 61, baseType: !674, size: 64, offset: 1472)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!353, !547}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !556, file: !550, line: 63, baseType: !678, size: 64, offset: 1536)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{!353, !547, !392, !562, !453, !576, !576}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !556, file: !550, line: 64, baseType: !682, size: 64, offset: 1600)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!353, !547, !547, !593, !593, !597}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !556, file: !550, line: 65, baseType: !686, size: 64, offset: 1664)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!353, !547, !547, !597}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !556, file: !550, line: 66, baseType: !690, size: 64, offset: 1728)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!353, !547, !547, !593, !597}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !556, file: !550, line: 67, baseType: !686, size: 64, offset: 1792)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !556, file: !550, line: 69, baseType: !674, size: 64, offset: 1856)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !556, file: !550, line: 70, baseType: !682, size: 64, offset: 1920)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !556, file: !550, line: 71, baseType: !690, size: 64, offset: 1984)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !556, file: !550, line: 72, baseType: !698, size: 64, offset: 2048)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!353, !547, !627}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !556, file: !550, line: 73, baseType: !674, size: 64, offset: 2112)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !556, file: !550, line: 75, baseType: !703, size: 64, offset: 2176)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{!353, !547, !706, !627}
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !556, file: !550, line: 76, baseType: !573, size: 64, offset: 2240)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !556, file: !550, line: 77, baseType: !573, size: 64, offset: 2304)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !556, file: !550, line: 78, baseType: !590, size: 64, offset: 2368)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !556, file: !550, line: 79, baseType: !614, size: 64, offset: 2432)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !556, file: !550, line: 81, baseType: !712, size: 64, offset: 2496)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!353, !547, !453, !547, !715}
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !556, file: !550, line: 82, baseType: !717, size: 64, offset: 2560)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{!353, !547, !392, !720, !720, !626, !722}
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !593)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !556, file: !550, line: 83, baseType: !724, size: 64, offset: 2624)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!353, !547, !392, !727, !392}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !556, file: !550, line: 84, baseType: !729, size: 64, offset: 2688)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!353, !547, !392, !562, !392, !562, !452}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !556, file: !550, line: 85, baseType: !733, size: 64, offset: 2752)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!353, !547, !547, !715}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !556, file: !550, line: 87, baseType: !737, size: 64, offset: 2816)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!353, !547, !576, !436}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !556, file: !550, line: 88, baseType: !741, size: 64, offset: 2880)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{!353, !547, !453}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !556, file: !550, line: 89, baseType: !741, size: 64, offset: 2944)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !556, file: !550, line: 90, baseType: !746, size: 64, offset: 3008)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!353, !547, !576, !566}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !556, file: !550, line: 91, baseType: !678, size: 64, offset: 3072)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !556, file: !550, line: 93, baseType: !751, size: 64, offset: 3136)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!353, !547, !754}
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !755)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !556, file: !550, line: 94, baseType: !758, size: 64, offset: 3200)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!353, !547, !392, !505, !505, !436, !761, !761, !651}
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !556, file: !550, line: 95, baseType: !758, size: 64, offset: 3264)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !556, file: !550, line: 96, baseType: !758, size: 64, offset: 3328)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !556, file: !550, line: 97, baseType: !758, size: 64, offset: 3392)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !556, file: !550, line: 99, baseType: !766, size: 64, offset: 3456)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{!353, !547, !769, !772}
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !594, line: 51, baseType: !770)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !594, line: 51, flags: DIFlagFwdDecl)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !773)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !550, line: 609, size: 6208, elements: !775)
!775 = !{!776, !777, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !796, !803, !804, !805, !806, !807, !808, !809, !810, !814, !815, !816, !817, !818, !820, !821, !822, !823, !824, !825, !826}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !774, file: !550, line: 610, baseType: !553, size: 4480)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !774, file: !550, line: 610, baseType: !778, size: 32, offset: 4480)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !388)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !774, file: !550, line: 611, baseType: !392, size: 32, offset: 4512)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !774, file: !550, line: 611, baseType: !392, size: 32, offset: 4544)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !774, file: !550, line: 611, baseType: !392, size: 32, offset: 4576)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !774, file: !550, line: 612, baseType: !392, size: 32, offset: 4608)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !774, file: !550, line: 613, baseType: !392, size: 32, offset: 4640)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !774, file: !550, line: 614, baseType: !436, size: 64, offset: 4672)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !774, file: !550, line: 615, baseType: !438, size: 64, offset: 4736)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !774, file: !550, line: 616, baseType: !727, size: 64, offset: 4800)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !774, file: !550, line: 617, baseType: !436, size: 64, offset: 4864)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !774, file: !550, line: 618, baseType: !789, size: 64, offset: 4928)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !550, line: 602, baseType: !791)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !550, line: 598, size: 128, elements: !792)
!792 = !{!793, !794, !795}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !791, file: !550, line: 599, baseType: !392, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !791, file: !550, line: 600, baseType: !392, size: 32, offset: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !791, file: !550, line: 601, baseType: !452, size: 64, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !774, file: !550, line: 619, baseType: !797, size: 64, offset: 4992)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !550, line: 607, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !550, line: 604, size: 128, elements: !800)
!800 = !{!801, !802}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !799, file: !550, line: 605, baseType: !392, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !799, file: !550, line: 606, baseType: !452, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !774, file: !550, line: 620, baseType: !452, size: 64, offset: 5056)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !774, file: !550, line: 621, baseType: !332, size: 64, offset: 5120)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !774, file: !550, line: 622, baseType: !332, size: 64, offset: 5184)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !774, file: !550, line: 623, baseType: !576, size: 64, offset: 5248)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !774, file: !550, line: 623, baseType: !576, size: 64, offset: 5312)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !774, file: !550, line: 623, baseType: !576, size: 64, offset: 5376)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !774, file: !550, line: 624, baseType: !505, size: 32, offset: 5440)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !774, file: !550, line: 625, baseType: !811, size: 64, offset: 5504)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DISubroutineType(types: !813)
!813 = !{!353}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !774, file: !550, line: 626, baseType: !325, size: 64, offset: 5568)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !774, file: !550, line: 627, baseType: !576, size: 64, offset: 5632)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !774, file: !550, line: 628, baseType: !392, size: 32, offset: 5696)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !774, file: !550, line: 629, baseType: !334, size: 64, offset: 5760)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !774, file: !550, line: 630, baseType: !819, size: 32, offset: 5824)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !774, file: !550, line: 631, baseType: !392, size: 32, offset: 5856)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !774, file: !550, line: 631, baseType: !392, size: 32, offset: 5888)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !774, file: !550, line: 632, baseType: !505, size: 32, offset: 5920)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !774, file: !550, line: 633, baseType: !505, size: 32, offset: 5952)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !774, file: !550, line: 634, baseType: !380, size: 64, offset: 6016)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !774, file: !550, line: 634, baseType: !325, size: 64, offset: 6080)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !774, file: !550, line: 635, baseType: !399, size: 64, offset: 6144)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !556, file: !550, line: 100, baseType: !828, size: 64, offset: 3520)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DISubroutineType(types: !830)
!830 = !{!353, !547, !392, !392, !831, !834}
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !833)
!833 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !556, file: !550, line: 101, baseType: !674, size: 64, offset: 3584)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !556, file: !550, line: 102, baseType: !837, size: 64, offset: 3648)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{!353, !547, !593, !593, !627}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !556, file: !550, line: 103, baseType: !559, size: 64, offset: 3712)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !556, file: !550, line: 105, baseType: !842, size: 64, offset: 3776)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!353, !547, !593, !593, !626, !627}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !556, file: !550, line: 106, baseType: !674, size: 64, offset: 3840)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !556, file: !550, line: 107, baseType: !847, size: 64, offset: 3904)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{!353, !547, !359}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !556, file: !550, line: 108, baseType: !851, size: 64, offset: 3968)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{!353, !547, !854, !626, !627}
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !334)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !556, file: !550, line: 109, baseType: !811, size: 64, offset: 4032)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !556, file: !550, line: 111, baseType: !857, size: 64, offset: 4096)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DISubroutineType(types: !859)
!859 = !{!353, !547, !547, !547, !332, !547}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !556, file: !550, line: 112, baseType: !861, size: 64, offset: 4160)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!353, !547, !547, !547, !547}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !556, file: !550, line: 113, baseType: !865, size: 64, offset: 4224)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!353, !547, !868, !868}
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !594, line: 30, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !594, line: 30, flags: DIFlagFwdDecl)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !556, file: !550, line: 114, baseType: !559, size: 64, offset: 4288)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !556, file: !550, line: 115, baseType: !678, size: 64, offset: 4352)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !556, file: !550, line: 117, baseType: !737, size: 64, offset: 4416)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !556, file: !550, line: 118, baseType: !737, size: 64, offset: 4480)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !556, file: !550, line: 119, baseType: !851, size: 64, offset: 4544)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !556, file: !550, line: 120, baseType: !877, size: 64, offset: 4608)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DISubroutineType(types: !879)
!879 = !{!353, !547, !880, !651}
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !556, file: !550, line: 121, baseType: !811, size: 64, offset: 4672)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !556, file: !550, line: 123, baseType: !883, size: 64, offset: 4736)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DISubroutineType(types: !885)
!885 = !{!353, !547, !392, !325}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !556, file: !550, line: 124, baseType: !887, size: 64, offset: 4800)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{!353, !547, !772, !576, !325}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !556, file: !550, line: 125, baseType: !891, size: 64, offset: 4864)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!353, !481, !547}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !556, file: !550, line: 126, baseType: !573, size: 64, offset: 4928)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !556, file: !550, line: 127, baseType: !573, size: 64, offset: 4992)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !556, file: !550, line: 129, baseType: !897, size: 64, offset: 5056)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DISubroutineType(types: !899)
!899 = !{!353, !547, !727}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !556, file: !550, line: 130, baseType: !901, size: 64, offset: 5120)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{!353, !547, !904, !904}
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !905)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !907)
!907 = !{!908, !909}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !906, file: !60, line: 653, baseType: !392, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !906, file: !60, line: 653, baseType: !576, size: 64, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !556, file: !550, line: 131, baseType: !901, size: 64, offset: 5184)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !556, file: !550, line: 132, baseType: !912, size: 64, offset: 5248)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{!353, !547, !436, !436, !436}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !556, file: !550, line: 133, baseType: !847, size: 64, offset: 5312)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !556, file: !550, line: 135, baseType: !917, size: 64, offset: 5376)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{!353, !547, !332, !651}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !556, file: !550, line: 136, baseType: !917, size: 64, offset: 5440)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !556, file: !550, line: 137, baseType: !922, size: 64, offset: 5504)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!353, !547, !651}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !556, file: !550, line: 138, baseType: !559, size: 64, offset: 5568)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !556, file: !550, line: 139, baseType: !927, size: 64, offset: 5632)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{!353, !547, !930, !930}
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !556, file: !550, line: 141, baseType: !811, size: 64, offset: 5696)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !556, file: !550, line: 142, baseType: !933, size: 64, offset: 5760)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{!353, !547, !547, !332, !547}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !556, file: !550, line: 143, baseType: !937, size: 64, offset: 5824)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DISubroutineType(types: !939)
!939 = !{!353, !547, !547, !547}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !556, file: !550, line: 144, baseType: !811, size: 64, offset: 5888)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !556, file: !550, line: 145, baseType: !933, size: 64, offset: 5952)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !556, file: !550, line: 147, baseType: !937, size: 64, offset: 6016)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !556, file: !550, line: 148, baseType: !811, size: 64, offset: 6080)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !556, file: !550, line: 149, baseType: !933, size: 64, offset: 6144)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !556, file: !550, line: 150, baseType: !937, size: 64, offset: 6208)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !556, file: !550, line: 151, baseType: !947, size: 64, offset: 6272)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{!353, !547, !505}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !556, file: !550, line: 153, baseType: !674, size: 64, offset: 6336)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !556, file: !550, line: 154, baseType: !674, size: 64, offset: 6400)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !556, file: !550, line: 155, baseType: !674, size: 64, offset: 6464)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !556, file: !550, line: 156, baseType: !674, size: 64, offset: 6528)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !556, file: !550, line: 157, baseType: !847, size: 64, offset: 6592)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !556, file: !550, line: 159, baseType: !956, size: 64, offset: 6656)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DISubroutineType(types: !958)
!958 = !{!353, !547, !392, !564}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !556, file: !550, line: 160, baseType: !674, size: 64, offset: 6720)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !556, file: !550, line: 161, baseType: !674, size: 64, offset: 6784)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !556, file: !550, line: 162, baseType: !674, size: 64, offset: 6848)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !556, file: !550, line: 163, baseType: !674, size: 64, offset: 6912)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !556, file: !550, line: 165, baseType: !937, size: 64, offset: 6976)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !556, file: !550, line: 166, baseType: !937, size: 64, offset: 7040)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !556, file: !550, line: 167, baseType: !737, size: 64, offset: 7104)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !556, file: !550, line: 168, baseType: !967, size: 64, offset: 7168)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!353, !547, !576, !392}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !556, file: !550, line: 169, baseType: !971, size: 64, offset: 7232)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!353, !547, !651, !436}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !556, file: !550, line: 171, baseType: !698, size: 64, offset: 7296)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !556, file: !550, line: 172, baseType: !674, size: 64, offset: 7360)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !556, file: !550, line: 173, baseType: !977, size: 64, offset: 7424)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!353, !547, !436, !761}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !556, file: !550, line: 174, baseType: !837, size: 64, offset: 7488)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !556, file: !550, line: 175, baseType: !837, size: 64, offset: 7552)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !556, file: !550, line: 177, baseType: !573, size: 64, offset: 7616)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !556, file: !550, line: 178, baseType: !623, size: 64, offset: 7680)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !556, file: !550, line: 179, baseType: !573, size: 64, offset: 7744)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !556, file: !550, line: 180, baseType: !580, size: 64, offset: 7808)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !556, file: !550, line: 181, baseType: !987, size: 64, offset: 7872)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!353, !547, !321, !626, !627}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !556, file: !550, line: 183, baseType: !897, size: 64, offset: 7936)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !556, file: !550, line: 184, baseType: !658, size: 64, offset: 8000)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !556, file: !550, line: 185, baseType: !993, size: 64, offset: 8064)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!353, !547, !996}
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !556, file: !550, line: 186, baseType: !998, size: 64, offset: 8128)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!353, !547, !392, !562, !452}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !556, file: !550, line: 187, baseType: !717, size: 64, offset: 8192)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !556, file: !550, line: 189, baseType: !1003, size: 64, offset: 8256)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!353, !547, !392, !392, !436, !564}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !556, file: !550, line: 190, baseType: !811, size: 64, offset: 8320)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !556, file: !550, line: 191, baseType: !933, size: 64, offset: 8384)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !556, file: !550, line: 192, baseType: !937, size: 64, offset: 8448)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !556, file: !550, line: 193, baseType: !1010, size: 64, offset: 8512)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!353, !547, !769, !1013}
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1014)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !550, line: 660, size: 5312, elements: !1016)
!1016 = !{!1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1015, file: !550, line: 661, baseType: !553, size: 4480)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1015, file: !550, line: 661, baseType: !778, size: 32, offset: 4480)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1015, file: !550, line: 662, baseType: !392, size: 32, offset: 4512)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1015, file: !550, line: 662, baseType: !392, size: 32, offset: 4544)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1015, file: !550, line: 662, baseType: !392, size: 32, offset: 4576)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1015, file: !550, line: 663, baseType: !392, size: 32, offset: 4608)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1015, file: !550, line: 664, baseType: !392, size: 32, offset: 4640)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1015, file: !550, line: 665, baseType: !436, size: 64, offset: 4672)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1015, file: !550, line: 666, baseType: !436, size: 64, offset: 4736)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1015, file: !550, line: 667, baseType: !392, size: 32, offset: 4800)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1015, file: !550, line: 668, baseType: !819, size: 32, offset: 4832)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1015, file: !550, line: 670, baseType: !436, size: 64, offset: 4864)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1015, file: !550, line: 670, baseType: !436, size: 64, offset: 4928)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1015, file: !550, line: 671, baseType: !436, size: 64, offset: 4992)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1015, file: !550, line: 672, baseType: !436, size: 64, offset: 5056)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1015, file: !550, line: 673, baseType: !436, size: 64, offset: 5120)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1015, file: !550, line: 674, baseType: !392, size: 32, offset: 5184)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1015, file: !550, line: 675, baseType: !436, size: 64, offset: 5248)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !556, file: !550, line: 195, baseType: !1036, size: 64, offset: 8576)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!353, !1013, !547, !547}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !556, file: !550, line: 196, baseType: !1036, size: 64, offset: 8640)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !556, file: !550, line: 197, baseType: !811, size: 64, offset: 8704)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !556, file: !550, line: 198, baseType: !933, size: 64, offset: 8768)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !556, file: !550, line: 199, baseType: !937, size: 64, offset: 8832)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !556, file: !550, line: 201, baseType: !1044, size: 64, offset: 8896)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!353, !547, !392, !392}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !556, file: !550, line: 202, baseType: !712, size: 64, offset: 8960)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !556, file: !550, line: 203, baseType: !580, size: 64, offset: 9024)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !556, file: !550, line: 204, baseType: !766, size: 64, offset: 9088)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !556, file: !550, line: 205, baseType: !897, size: 64, offset: 9152)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !556, file: !550, line: 206, baseType: !1052, size: 64, offset: 9216)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!353, !321, !547, !392, !626, !627}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !556, file: !550, line: 208, baseType: !1056, size: 64, offset: 9280)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!353, !392, !722}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !556, file: !550, line: 209, baseType: !937, size: 64, offset: 9344)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !556, file: !550, line: 210, baseType: !729, size: 64, offset: 9408)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !549, file: !550, line: 438, baseType: !1062, size: 64, offset: 13952)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !594, line: 60, baseType: !1063)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1065)
!1065 = !{!1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1064, file: !114, line: 241, baseType: !321, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1064, file: !114, line: 242, baseType: !408, size: 32, offset: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1064, file: !114, line: 243, baseType: !392, size: 32, offset: 96)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1064, file: !114, line: 243, baseType: !392, size: 32, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1064, file: !114, line: 244, baseType: !392, size: 32, offset: 160)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1064, file: !114, line: 244, baseType: !392, size: 32, offset: 192)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1064, file: !114, line: 245, baseType: !436, size: 64, offset: 256)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1064, file: !114, line: 246, baseType: !505, size: 32, offset: 320)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1064, file: !114, line: 247, baseType: !392, size: 32, offset: 352)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1064, file: !114, line: 251, baseType: !392, size: 32, offset: 384)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1064, file: !114, line: 252, baseType: !868, size: 64, offset: 448)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1064, file: !114, line: 253, baseType: !505, size: 32, offset: 512)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1064, file: !114, line: 254, baseType: !392, size: 32, offset: 544)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1064, file: !114, line: 254, baseType: !392, size: 32, offset: 576)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1064, file: !114, line: 255, baseType: !392, size: 32, offset: 608)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !549, file: !550, line: 438, baseType: !1062, size: 64, offset: 14016)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !549, file: !550, line: 439, baseType: !325, size: 64, offset: 14080)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !549, file: !550, line: 440, baseType: !1084, size: 32, offset: 14144)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !549, file: !550, line: 441, baseType: !505, size: 32, offset: 14176)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !549, file: !550, line: 442, baseType: !505, size: 32, offset: 14208)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !549, file: !550, line: 443, baseType: !1088, size: 448, offset: 14272)
!1088 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1089, size: 448, elements: !1090)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !334)
!1090 = !{!1091}
!1091 = !DISubrange(count: 7)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !549, file: !550, line: 444, baseType: !505, size: 32, offset: 14720)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !549, file: !550, line: 445, baseType: !505, size: 32, offset: 14752)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !549, file: !550, line: 446, baseType: !392, size: 32, offset: 14784)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !549, file: !550, line: 447, baseType: !429, size: 64, offset: 14848)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !549, file: !550, line: 448, baseType: !429, size: 64, offset: 14912)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !549, file: !550, line: 449, baseType: !634, size: 640, offset: 14976)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !549, file: !550, line: 450, baseType: !566, size: 32, offset: 15616)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !549, file: !550, line: 451, baseType: !1100, size: 2880, offset: 15680)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !550, line: 318, baseType: !1101)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !550, line: 319, size: 2880, elements: !1102)
!1102 = !{!1103, !1104, !1105, !1106, !1107, !1108, !1109, !1122, !1123, !1128, !1133, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1148, !1149, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1181, !1182, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1205, !1206, !1207, !1211, !1212}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1101, file: !550, line: 320, baseType: !392, size: 32)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1101, file: !550, line: 321, baseType: !392, size: 32, offset: 32)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1101, file: !550, line: 322, baseType: !392, size: 32, offset: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1101, file: !550, line: 323, baseType: !392, size: 32, offset: 96)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1101, file: !550, line: 324, baseType: !392, size: 32, offset: 128)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1101, file: !550, line: 325, baseType: !392, size: 32, offset: 160)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1101, file: !550, line: 326, baseType: !1110, size: 64, offset: 192)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !550, line: 293, baseType: !1111)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !550, line: 295, size: 448, elements: !1113)
!1113 = !{!1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1112, file: !550, line: 296, baseType: !1110, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1112, file: !550, line: 297, baseType: !452, size: 64, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1112, file: !550, line: 297, baseType: !452, size: 64, offset: 128)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1112, file: !550, line: 298, baseType: !436, size: 64, offset: 192)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1112, file: !550, line: 298, baseType: !436, size: 64, offset: 256)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1112, file: !550, line: 299, baseType: !392, size: 32, offset: 320)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1112, file: !550, line: 300, baseType: !392, size: 32, offset: 352)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1112, file: !550, line: 301, baseType: !392, size: 32, offset: 384)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1101, file: !550, line: 326, baseType: !1110, size: 64, offset: 256)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1101, file: !550, line: 328, baseType: !1124, size: 64, offset: 320)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1125 = !DISubroutineType(types: !1126)
!1126 = !{!353, !547, !1127, !436}
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1101, file: !550, line: 329, baseType: !1129, size: 64, offset: 384)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!353, !1127, !1132, !438, !438, !455, !436}
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1101, file: !550, line: 330, baseType: !1134, size: 64, offset: 448)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!353, !1127}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1101, file: !550, line: 331, baseType: !1134, size: 64, offset: 512)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1101, file: !550, line: 334, baseType: !321, size: 64, offset: 576)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1101, file: !550, line: 335, baseType: !408, size: 32, offset: 640)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1101, file: !550, line: 335, baseType: !408, size: 32, offset: 672)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1101, file: !550, line: 336, baseType: !408, size: 32, offset: 704)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1101, file: !550, line: 336, baseType: !408, size: 32, offset: 736)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1101, file: !550, line: 337, baseType: !1144, size: 64, offset: 768)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !322, line: 339, baseType: !1146)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !322, line: 339, flags: DIFlagFwdDecl)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1101, file: !550, line: 338, baseType: !1144, size: 64, offset: 832)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1101, file: !550, line: 339, baseType: !1150, size: 64, offset: 896)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !322, line: 341, baseType: !1152)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !322, line: 351, size: 192, elements: !1153)
!1153 = !{!1154, !1155, !1156, !1157, !1158}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1152, file: !322, line: 354, baseType: !72, size: 32)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1152, file: !322, line: 355, baseType: !72, size: 32, offset: 32)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1152, file: !322, line: 356, baseType: !72, size: 32, offset: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1152, file: !322, line: 361, baseType: !72, size: 32, offset: 96)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1152, file: !322, line: 362, baseType: !501, size: 64, offset: 128)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1101, file: !550, line: 340, baseType: !392, size: 32, offset: 960)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1101, file: !550, line: 340, baseType: !392, size: 32, offset: 992)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1101, file: !550, line: 341, baseType: !452, size: 64, offset: 1024)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1101, file: !550, line: 342, baseType: !436, size: 64, offset: 1088)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1101, file: !550, line: 343, baseType: !455, size: 64, offset: 1152)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1101, file: !550, line: 344, baseType: !438, size: 64, offset: 1216)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1101, file: !550, line: 345, baseType: !392, size: 32, offset: 1280)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1101, file: !550, line: 346, baseType: !1132, size: 64, offset: 1344)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1101, file: !550, line: 347, baseType: !505, size: 32, offset: 1408)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1101, file: !550, line: 348, baseType: !392, size: 32, offset: 1440)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1101, file: !550, line: 351, baseType: !505, size: 32, offset: 1472)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1101, file: !550, line: 352, baseType: !505, size: 32, offset: 1504)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1101, file: !550, line: 353, baseType: !408, size: 32, offset: 1536)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1101, file: !550, line: 354, baseType: !408, size: 32, offset: 1568)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1101, file: !550, line: 355, baseType: !1132, size: 64, offset: 1600)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1101, file: !550, line: 356, baseType: !1132, size: 64, offset: 1664)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1101, file: !550, line: 357, baseType: !1176, size: 64, offset: 1728)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !550, line: 310, baseType: !1178)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !550, line: 308, size: 32, elements: !1179)
!1179 = !{!1180}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1178, file: !550, line: 309, baseType: !392, size: 32)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1101, file: !550, line: 357, baseType: !1176, size: 64, offset: 1792)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1101, file: !550, line: 358, baseType: !1183, size: 64, offset: 1856)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !550, line: 316, baseType: !1185)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !550, line: 312, size: 128, elements: !1186)
!1186 = !{!1187, !1188, !1189}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1185, file: !550, line: 313, baseType: !325, size: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1185, file: !550, line: 314, baseType: !392, size: 32, offset: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1185, file: !550, line: 315, baseType: !336, size: 8, offset: 96)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1101, file: !550, line: 359, baseType: !1183, size: 64, offset: 1920)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1101, file: !550, line: 360, baseType: !1183, size: 64, offset: 1984)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1101, file: !550, line: 361, baseType: !392, size: 32, offset: 2048)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1101, file: !550, line: 362, baseType: !408, size: 32, offset: 2080)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1101, file: !550, line: 363, baseType: !392, size: 32, offset: 2112)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1101, file: !550, line: 364, baseType: !1132, size: 64, offset: 2176)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1101, file: !550, line: 365, baseType: !1150, size: 64, offset: 2240)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1101, file: !550, line: 366, baseType: !408, size: 32, offset: 2304)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1101, file: !550, line: 367, baseType: !408, size: 32, offset: 2336)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1101, file: !550, line: 368, baseType: !1144, size: 64, offset: 2368)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1101, file: !550, line: 369, baseType: !1144, size: 64, offset: 2432)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1101, file: !550, line: 370, baseType: !1202, size: 64, offset: 2496)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1203)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1204 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1101, file: !550, line: 371, baseType: !1202, size: 64, offset: 2560)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1101, file: !550, line: 372, baseType: !1202, size: 64, offset: 2624)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1101, file: !550, line: 373, baseType: !1208, size: 64, offset: 2688)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !322, line: 331, baseType: !1209)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64)
!1210 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !322, line: 331, flags: DIFlagFwdDecl)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1101, file: !550, line: 374, baseType: !501, size: 64, offset: 2752)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1101, file: !550, line: 375, baseType: !1213, size: 64, offset: 2816)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !549, file: !550, line: 451, baseType: !1100, size: 2880, offset: 18560)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !549, file: !550, line: 452, baseType: !1216, size: 64, offset: 21440)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1217)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !550, line: 681, size: 4864, elements: !1219)
!1219 = !{!1220, !1221, !1222, !1223, !1224, !1225, !1226, !1230}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1218, file: !550, line: 682, baseType: !553, size: 4480)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1218, file: !550, line: 682, baseType: !778, size: 32, offset: 4480)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1218, file: !550, line: 683, baseType: !505, size: 32, offset: 4512)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1218, file: !550, line: 684, baseType: !392, size: 32, offset: 4544)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1218, file: !550, line: 685, baseType: !930, size: 64, offset: 4608)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1218, file: !550, line: 686, baseType: !452, size: 64, offset: 4672)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1218, file: !550, line: 687, baseType: !1227, size: 64, offset: 4736)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{!353, !1216, !576, !325}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1218, file: !550, line: 688, baseType: !325, size: 64, offset: 4800)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !549, file: !550, line: 453, baseType: !1216, size: 64, offset: 21504)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !549, file: !550, line: 454, baseType: !1216, size: 64, offset: 21568)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !549, file: !550, line: 455, baseType: !392, size: 32, offset: 21632)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "preallocated", scope: !549, file: !550, line: 456, baseType: !505, size: 32, offset: 21664)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !549, file: !550, line: 457, baseType: !1236, size: 320, offset: 21696)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStencilInfo", file: !550, line: 399, baseType: !1237)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !550, line: 394, size: 320, elements: !1238)
!1238 = !{!1239, !1240, !1244, !1245}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !1237, file: !550, line: 395, baseType: !392, size: 32)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "dims", scope: !1237, file: !550, line: 396, baseType: !1241, size: 128, offset: 32)
!1241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 128, elements: !1242)
!1242 = !{!1243}
!1243 = !DISubrange(count: 4)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "starts", scope: !1237, file: !550, line: 397, baseType: !1241, size: 128, offset: 160)
