; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/aij/mpi/mpimatmatmult.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/aij/mpi/mpimatmatmult.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_datatype_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!286 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!287 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!288 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!289 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!290 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!291 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!292 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 1265, baseType: !5, size: 32, elements: !293)
!293 = !{!294, !295, !296}
!294 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!295 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!296 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!297 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 1203, baseType: !5, size: 32, elements: !298)
!298 = !{!299, !300, !301, !302, !303}
!299 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!300 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!301 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!302 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!303 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!304 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 187, baseType: !5, size: 32, elements: !305)
!305 = !{!306, !307, !308, !309, !310, !311, !312}
!306 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!307 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!308 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!309 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!310 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!311 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!312 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!313 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !314, line: 663, baseType: !5, size: 32, elements: !315)
!314 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!315 = !{!316, !317, !318}
!316 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!317 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!318 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!319 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !320, line: 77, baseType: !5, size: 32, elements: !321)
!320 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsf.h", directory: "/home/users/ndemeye/xSDK")
!321 = !{!322, !323, !324}
!322 = !DIEnumerator(name: "PETSCSF_DUPLICATE_CONFONLY", value: 0, isUnsigned: true)
!323 = !DIEnumerator(name: "PETSCSF_DUPLICATE_RANKS", value: 1, isUnsigned: true)
!324 = !DIEnumerator(name: "PETSCSF_DUPLICATE_GRAPH", value: 2, isUnsigned: true)
!325 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !320, line: 35, baseType: !5, size: 32, elements: !326)
!326 = !{!327, !328, !329, !330}
!327 = !DIEnumerator(name: "PETSCSF_PATTERN_GENERAL", value: 0, isUnsigned: true)
!328 = !DIEnumerator(name: "PETSCSF_PATTERN_ALLGATHER", value: 1, isUnsigned: true)
!329 = !DIEnumerator(name: "PETSCSF_PATTERN_GATHER", value: 2, isUnsigned: true)
!330 = !DIEnumerator(name: "PETSCSF_PATTERN_ALLTOALL", value: 3, isUnsigned: true)
!331 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !332, line: 37, baseType: !5, size: 32, elements: !333)
!332 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sfimpl.h", directory: "/home/users/ndemeye/xSDK")
!333 = !{!334, !335, !336, !337}
!334 = !DIEnumerator(name: "PETSCSF_BACKEND_INVALID", value: 0, isUnsigned: true)
!335 = !DIEnumerator(name: "PETSCSF_BACKEND_CUDA", value: 1, isUnsigned: true)
!336 = !DIEnumerator(name: "PETSCSF_BACKEND_HIP", value: 2, isUnsigned: true)
!337 = !DIEnumerator(name: "PETSCSF_BACKEND_KOKKOS", value: 3, isUnsigned: true)
!338 = !{!339, !343, !344, !347, !547, !1772, !1811, !429, !91, !513, !1463, !1624, !456, !405, !1911, !404, !852, !571, !411, !402, !346, !1650, !1926, !419, !1682, !515, !1948, !5}
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !340, line: 330, baseType: !341)
!340 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !340, line: 330, flags: DIFlagFwdDecl)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !346)
!346 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !350, line: 73, size: 4480, elements: !351)
!350 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!351 = !{!352, !354, !400, !401, !403, !406, !407, !408, !409, !417, !418, !420, !424, !428, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !441, !442, !443, !445, !446, !448, !450, !451, !452, !453, !454, !457, !459, !460, !461, !462, !463, !466, !468, !469, !470, !480, !482, !483, !487, !488, !537, !542, !544, !545, !546}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !349, file: !350, line: 74, baseType: !353, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !91)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !349, file: !350, line: 75, baseType: !355, size: 448, offset: 64)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 448, elements: !398)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !350, line: 53, baseType: !357)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !350, line: 45, size: 448, elements: !358)
!358 = !{!359, !365, !373, !378, !382, !386, !393}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !357, file: !350, line: 46, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!363, !347, !364}
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !91)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !357, file: !350, line: 47, baseType: !366, size: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!363, !347, !369}
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !370, line: 16, baseType: !371)
!370 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !370, line: 16, flags: DIFlagFwdDecl)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !357, file: !350, line: 48, baseType: !374, size: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!363, !377}
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !357, file: !350, line: 49, baseType: !379, size: 64, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!363, !347, !344, !347}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !357, file: !350, line: 50, baseType: !383, size: 64, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!363, !347, !344, !377}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !357, file: !350, line: 51, baseType: !387, size: 64, offset: 320)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!363, !347, !344, !390}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{null}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !357, file: !350, line: 52, baseType: !394, size: 64, offset: 384)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!363, !347, !344, !397}
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!398 = !{!399}
!399 = !DISubrange(count: 1)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !349, file: !350, line: 76, baseType: !339, size: 64, offset: 512)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !349, file: !350, line: 77, baseType: !402, size: 32, offset: 576)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !91)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !349, file: !350, line: 78, baseType: !404, size: 64, offset: 640)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !405)
!405 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !349, file: !350, line: 78, baseType: !404, size: 64, offset: 704)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !349, file: !350, line: 78, baseType: !404, size: 64, offset: 768)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !349, file: !350, line: 78, baseType: !404, size: 64, offset: 832)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !349, file: !350, line: 79, baseType: !410, size: 64, offset: 896)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !411)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !413, line: 27, baseType: !414)
!413 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !415, line: 43, baseType: !416)
!415 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!416 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !349, file: !350, line: 80, baseType: !402, size: 32, offset: 960)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !349, file: !350, line: 81, baseType: !419, size: 32, offset: 992)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !91)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !349, file: !350, line: 82, baseType: !421, size: 64, offset: 1024)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !422)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !349, file: !350, line: 83, baseType: !425, size: 64, offset: 1088)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !349, file: !350, line: 84, baseType: !429, size: 64, offset: 1152)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !349, file: !350, line: 85, baseType: !429, size: 64, offset: 1216)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !349, file: !350, line: 86, baseType: !429, size: 64, offset: 1280)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !349, file: !350, line: 87, baseType: !429, size: 64, offset: 1344)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !349, file: !350, line: 88, baseType: !347, size: 64, offset: 1408)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !349, file: !350, line: 89, baseType: !410, size: 64, offset: 1472)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !349, file: !350, line: 90, baseType: !429, size: 64, offset: 1536)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !349, file: !350, line: 91, baseType: !429, size: 64, offset: 1600)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !349, file: !350, line: 92, baseType: !402, size: 32, offset: 1664)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !349, file: !350, line: 93, baseType: !343, size: 64, offset: 1728)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !349, file: !350, line: 94, baseType: !440, size: 64, offset: 1792)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !411)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !349, file: !350, line: 95, baseType: !402, size: 32, offset: 1856)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !349, file: !350, line: 95, baseType: !402, size: 32, offset: 1888)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !349, file: !350, line: 96, baseType: !444, size: 64, offset: 1920)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !349, file: !350, line: 96, baseType: !444, size: 64, offset: 1984)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !349, file: !350, line: 97, baseType: !447, size: 64, offset: 2048)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !349, file: !350, line: 97, baseType: !449, size: 64, offset: 2112)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !349, file: !350, line: 98, baseType: !402, size: 32, offset: 2176)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !349, file: !350, line: 98, baseType: !402, size: 32, offset: 2208)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !349, file: !350, line: 99, baseType: !444, size: 64, offset: 2240)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !349, file: !350, line: 99, baseType: !444, size: 64, offset: 2304)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !349, file: !350, line: 100, baseType: !455, size: 64, offset: 2368)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !405)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !349, file: !350, line: 100, baseType: !458, size: 64, offset: 2432)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !349, file: !350, line: 101, baseType: !402, size: 32, offset: 2496)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !349, file: !350, line: 101, baseType: !402, size: 32, offset: 2528)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !349, file: !350, line: 102, baseType: !444, size: 64, offset: 2560)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !349, file: !350, line: 102, baseType: !444, size: 64, offset: 2624)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !349, file: !350, line: 103, baseType: !464, size: 64, offset: 2688)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !456)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !349, file: !350, line: 103, baseType: !467, size: 64, offset: 2752)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !349, file: !350, line: 104, baseType: !397, size: 64, offset: 2816)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !349, file: !350, line: 105, baseType: !402, size: 32, offset: 2880)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !349, file: !350, line: 106, baseType: !471, size: 128, offset: 2944)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !472, size: 128, elements: !478)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !350, line: 64, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !350, line: 61, size: 128, elements: !475)
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !474, file: !350, line: 62, baseType: !390, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !474, file: !350, line: 63, baseType: !343, size: 64, offset: 64)
!478 = !{!479}
!479 = !DISubrange(count: 2)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !349, file: !350, line: 107, baseType: !481, size: 64, offset: 3072)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !402, size: 64, elements: !478)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !349, file: !350, line: 108, baseType: !343, size: 64, offset: 3136)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !349, file: !350, line: 109, baseType: !484, size: 64, offset: 3200)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!363, !343}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !349, file: !350, line: 111, baseType: !402, size: 32, offset: 3264)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !349, file: !350, line: 112, baseType: !489, size: 320, offset: 3328)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 320, elements: !535)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{!363, !493, !347, !343}
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !496)
!496 = !{!497, !498, !523, !524, !525, !526, !527, !528, !529, !530, !531}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !495, file: !10, line: 100, baseType: !402, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !495, file: !10, line: 101, baseType: !499, size: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !500)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !502)
!502 = !{!503, !504, !505, !506, !507, !510, !511, !512, !516, !518, !520, !521, !522}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !501, file: !10, line: 84, baseType: !429, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !501, file: !10, line: 85, baseType: !429, size: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !501, file: !10, line: 86, baseType: !343, size: 64, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !501, file: !10, line: 87, baseType: !421, size: 64, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !501, file: !10, line: 88, baseType: !508, size: 64, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !344)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !501, file: !10, line: 89, baseType: !346, size: 8, offset: 320)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !501, file: !10, line: 90, baseType: !429, size: 64, offset: 384)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !501, file: !10, line: 91, baseType: !513, size: 64, offset: 448)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !514, line: 46, baseType: !515)
!514 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!515 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !501, file: !10, line: 92, baseType: !517, size: 32, offset: 512)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !501, file: !10, line: 93, baseType: !519, size: 32, offset: 544)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !501, file: !10, line: 94, baseType: !499, size: 64, offset: 576)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !501, file: !10, line: 95, baseType: !429, size: 64, offset: 640)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !501, file: !10, line: 96, baseType: !343, size: 64, offset: 704)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !495, file: !10, line: 102, baseType: !429, size: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !495, file: !10, line: 102, baseType: !429, size: 64, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !495, file: !10, line: 103, baseType: !429, size: 64, offset: 256)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !495, file: !10, line: 104, baseType: !339, size: 64, offset: 320)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !495, file: !10, line: 105, baseType: !517, size: 32, offset: 384)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !495, file: !10, line: 105, baseType: !517, size: 32, offset: 416)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !495, file: !10, line: 105, baseType: !517, size: 32, offset: 448)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !495, file: !10, line: 106, baseType: !347, size: 64, offset: 512)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !495, file: !10, line: 107, baseType: !532, size: 64, offset: 576)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !533)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!535 = !{!536}
!536 = !DISubrange(count: 5)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !349, file: !350, line: 113, baseType: !538, size: 320, offset: 3648)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, size: 320, elements: !535)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!363, !347, !343}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !349, file: !350, line: 114, baseType: !543, size: 320, offset: 3968)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 320, elements: !535)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !349, file: !350, line: 115, baseType: !517, size: 32, offset: 4288)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !349, file: !350, line: 120, baseType: !532, size: 64, offset: 4352)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !349, file: !350, line: 121, baseType: !517, size: 32, offset: 4416)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_APMPI", file: !549, line: 32, baseType: !550)
!549 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/aij/mpi/mpiaij.h", directory: "/home/users/ndemeye/xSDK")
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !549, line: 15, size: 1472, elements: !551)
!551 = !{!552, !553, !554, !555, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1752, !1753, !1754}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "startsj_s", scope: !550, file: !549, line: 16, baseType: !447, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "startsj_r", scope: !550, file: !549, line: 16, baseType: !447, size: 64, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "bufa", scope: !550, file: !549, line: 17, baseType: !464, size: 64, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "P_loc", scope: !550, file: !549, line: 18, baseType: !556, size: 64, offset: 192)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !63, line: 16, baseType: !557)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !559, line: 436, size: 23424, elements: !560)
!559 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!560 = !{!561, !563, !1348, !1349, !1350, !1351, !1353, !1354, !1355, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1469, !1470, !1486, !1487, !1488, !1489, !1490, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1525, !1545, !1546, !1548, !1549, !1550, !1551, !1552, !1553, !1571, !1572}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !558, file: !559, line: 437, baseType: !562, size: 4480)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !350, line: 122, baseType: !349)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !558, file: !559, line: 437, baseType: !564, size: 9472, offset: 4480)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 9472, elements: !398)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !559, line: 32, size: 9472, elements: !566)
!566 = !{!567, !576, !580, !581, !880, !884, !885, !886, !887, !888, !889, !890, !910, !914, !919, !925, !944, !949, !953, !954, !958, !963, !964, !969, !973, !977, !981, !985, !989, !990, !991, !992, !993, !997, !998, !1003, !1004, !1005, !1006, !1007, !1012, !1019, !1023, !1027, !1031, !1035, !1039, !1040, !1044, !1045, !1049, !1054, !1055, !1056, !1057, !1119, !1127, !1128, !1132, !1133, !1137, !1138, !1142, !1147, !1148, !1152, !1156, !1160, !1161, !1162, !1163, !1164, !1165, !1170, !1171, !1175, !1179, !1183, !1184, !1185, !1189, !1199, !1200, !1204, !1205, !1209, !1210, !1214, !1215, !1219, !1220, !1224, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1238, !1239, !1240, !1241, !1242, !1243, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1258, !1262, !1263, !1264, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1278, !1279, !1280, !1284, !1288, !1289, !1293, !1294, !1295, !1296, !1322, !1326, !1327, !1328, !1329, !1330, !1334, !1335, !1336, !1337, !1338, !1342, !1346, !1347}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !565, file: !559, line: 34, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!363, !556, !402, !571, !402, !571, !573, !575}
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !402)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !465)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !565, file: !559, line: 35, baseType: !577, size: 64, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!363, !556, !402, !447, !449, !467}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !565, file: !559, line: 36, baseType: !577, size: 64, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !565, file: !559, line: 37, baseType: !582, size: 64, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!363, !556, !585, !585}
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !36, line: 21, baseType: !586)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !588, line: 142, size: 12800, elements: !589)
!588 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!589 = !{!590, !591, !806, !826, !827, !828, !874, !875, !876, !877, !879}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !587, file: !588, line: 143, baseType: !562, size: 4480)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !587, file: !588, line: 143, baseType: !592, size: 5248, offset: 4480)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !593, size: 5248, elements: !398)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !588, line: 23, size: 5248, elements: !594)
!594 = !{!595, !600, !605, !609, !613, !619, !624, !625, !626, !630, !634, !635, !636, !640, !644, !648, !649, !653, !657, !661, !662, !666, !670, !671, !675, !679, !680, !681, !685, !686, !693, !698, !699, !700, !704, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !725, !726, !727, !731, !735, !736, !737, !738, !742, !743, !744, !745, !746, !747, !748, !752, !753, !757, !764, !765, !770, !771, !775, !776, !777, !778, !779, !780, !781, !782, !786, !787, !788, !794, !798, !799, !800}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !593, file: !588, line: 24, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{!363, !585, !599}
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !593, file: !588, line: 25, baseType: !601, size: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!363, !585, !402, !604}
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !593, file: !588, line: 26, baseType: !606, size: 64, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{!363, !402, !599}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !593, file: !588, line: 27, baseType: !610, size: 64, offset: 192)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!363, !585, !585, !464}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !593, file: !588, line: 28, baseType: !614, size: 64, offset: 256)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!363, !585, !402, !617, !464}
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !585)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !593, file: !588, line: 29, baseType: !620, size: 64, offset: 320)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!363, !585, !623, !455}
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !36, line: 155, baseType: !35)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !593, file: !588, line: 30, baseType: !610, size: 64, offset: 384)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !593, file: !588, line: 31, baseType: !614, size: 64, offset: 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !593, file: !588, line: 32, baseType: !627, size: 64, offset: 512)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!363, !585, !465}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !593, file: !588, line: 33, baseType: !631, size: 64, offset: 576)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!363, !585, !585}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !593, file: !588, line: 34, baseType: !627, size: 64, offset: 640)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !593, file: !588, line: 35, baseType: !631, size: 64, offset: 704)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !593, file: !588, line: 36, baseType: !637, size: 64, offset: 768)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{!363, !585, !465, !585}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !593, file: !588, line: 37, baseType: !641, size: 64, offset: 832)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!363, !585, !465, !465, !585}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !593, file: !588, line: 38, baseType: !645, size: 64, offset: 896)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{!363, !585, !402, !573, !599}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !593, file: !588, line: 39, baseType: !637, size: 64, offset: 960)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !593, file: !588, line: 40, baseType: !650, size: 64, offset: 1024)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{!363, !585, !465, !585, !585}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !593, file: !588, line: 41, baseType: !654, size: 64, offset: 1088)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!363, !585, !465, !465, !465, !585, !585}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !593, file: !588, line: 42, baseType: !658, size: 64, offset: 1152)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!363, !585, !585, !585}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !593, file: !588, line: 43, baseType: !658, size: 64, offset: 1216)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !593, file: !588, line: 44, baseType: !663, size: 64, offset: 1280)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!363, !585, !402, !571, !573, !575}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !593, file: !588, line: 45, baseType: !667, size: 64, offset: 1344)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!363, !585}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !593, file: !588, line: 46, baseType: !667, size: 64, offset: 1408)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !593, file: !588, line: 47, baseType: !672, size: 64, offset: 1472)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!363, !585, !467}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !593, file: !588, line: 48, baseType: !676, size: 64, offset: 1536)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DISubroutineType(types: !678)
!678 = !{!363, !585, !447}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !593, file: !588, line: 49, baseType: !676, size: 64, offset: 1600)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !593, file: !588, line: 50, baseType: !672, size: 64, offset: 1664)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !593, file: !588, line: 51, baseType: !682, size: 64, offset: 1728)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!363, !585, !447, !455}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !593, file: !588, line: 52, baseType: !682, size: 64, offset: 1792)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !593, file: !588, line: 53, baseType: !687, size: 64, offset: 1856)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{!363, !585, !690}
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !691)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !593, file: !588, line: 54, baseType: !694, size: 64, offset: 1920)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!363, !585, !697, !517}
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !36, line: 475, baseType: !43)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !593, file: !588, line: 55, baseType: !663, size: 64, offset: 1984)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !593, file: !588, line: 56, baseType: !667, size: 64, offset: 2048)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !593, file: !588, line: 57, baseType: !701, size: 64, offset: 2112)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!363, !585, !369}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !593, file: !588, line: 58, baseType: !705, size: 64, offset: 2176)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!363, !585, !573}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !593, file: !588, line: 59, baseType: !705, size: 64, offset: 2240)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !593, file: !588, line: 60, baseType: !610, size: 64, offset: 2304)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !593, file: !588, line: 61, baseType: !610, size: 64, offset: 2368)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !593, file: !588, line: 62, baseType: !620, size: 64, offset: 2432)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !593, file: !588, line: 63, baseType: !614, size: 64, offset: 2496)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !593, file: !588, line: 64, baseType: !614, size: 64, offset: 2560)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !593, file: !588, line: 65, baseType: !701, size: 64, offset: 2624)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !593, file: !588, line: 66, baseType: !667, size: 64, offset: 2688)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !593, file: !588, line: 67, baseType: !667, size: 64, offset: 2752)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !593, file: !588, line: 68, baseType: !718, size: 64, offset: 2816)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!363, !585, !721}
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !722, line: 30, baseType: !723)
!722 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !722, line: 30, flags: DIFlagFwdDecl)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !593, file: !588, line: 69, baseType: !663, size: 64, offset: 2880)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !593, file: !588, line: 70, baseType: !667, size: 64, offset: 2944)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !593, file: !588, line: 71, baseType: !728, size: 64, offset: 3008)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!363, !493, !585}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !593, file: !588, line: 72, baseType: !732, size: 64, offset: 3072)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!363, !585, !585, !455}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !593, file: !588, line: 73, baseType: !658, size: 64, offset: 3136)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !593, file: !588, line: 74, baseType: !658, size: 64, offset: 3200)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !593, file: !588, line: 75, baseType: !658, size: 64, offset: 3264)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !593, file: !588, line: 76, baseType: !739, size: 64, offset: 3328)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!363, !585, !402, !571, !464}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !593, file: !588, line: 77, baseType: !667, size: 64, offset: 3392)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !593, file: !588, line: 78, baseType: !667, size: 64, offset: 3456)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !593, file: !588, line: 79, baseType: !667, size: 64, offset: 3520)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !593, file: !588, line: 80, baseType: !667, size: 64, offset: 3584)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !593, file: !588, line: 81, baseType: !627, size: 64, offset: 3648)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !593, file: !588, line: 82, baseType: !667, size: 64, offset: 3712)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !593, file: !588, line: 83, baseType: !749, size: 64, offset: 3776)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!363, !585, !402, !585, !575}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !593, file: !588, line: 84, baseType: !749, size: 64, offset: 3840)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !593, file: !588, line: 85, baseType: !754, size: 64, offset: 3904)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{!363, !585, !585, !464, !464}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !593, file: !588, line: 86, baseType: !758, size: 64, offset: 3968)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!363, !585, !761, !599}
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !722, line: 11, baseType: !762)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !722, line: 11, flags: DIFlagFwdDecl)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !593, file: !588, line: 87, baseType: !758, size: 64, offset: 4032)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !593, file: !588, line: 88, baseType: !766, size: 64, offset: 4096)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{!363, !585, !769}
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !593, file: !588, line: 89, baseType: !766, size: 64, offset: 4160)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !593, file: !588, line: 90, baseType: !772, size: 64, offset: 4224)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!363, !585, !402, !571, !571, !585, !575}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !593, file: !588, line: 91, baseType: !772, size: 64, offset: 4288)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !593, file: !588, line: 92, baseType: !701, size: 64, offset: 4352)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !593, file: !588, line: 93, baseType: !701, size: 64, offset: 4416)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !593, file: !588, line: 94, baseType: !631, size: 64, offset: 4480)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !593, file: !588, line: 95, baseType: !631, size: 64, offset: 4544)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !593, file: !588, line: 96, baseType: !631, size: 64, offset: 4608)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !593, file: !588, line: 97, baseType: !631, size: 64, offset: 4672)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !593, file: !588, line: 98, baseType: !783, size: 64, offset: 4736)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{!363, !585, !517}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !593, file: !588, line: 99, baseType: !672, size: 64, offset: 4800)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !593, file: !588, line: 100, baseType: !672, size: 64, offset: 4864)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !593, file: !588, line: 101, baseType: !789, size: 64, offset: 4928)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{!363, !585, !467, !792}
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !48)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !593, file: !588, line: 102, baseType: !795, size: 64, offset: 4992)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{!363, !585, !769, !792}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !593, file: !588, line: 103, baseType: !672, size: 64, offset: 5056)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !593, file: !588, line: 104, baseType: !766, size: 64, offset: 5120)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !593, file: !588, line: 105, baseType: !801, size: 64, offset: 5184)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{!363, !402, !617, !599, !804}
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !587, file: !588, line: 144, baseType: !807, size: 64, offset: 9728)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !722, line: 60, baseType: !808)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !133, line: 240, size: 640, elements: !810)
!810 = !{!811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !809, file: !133, line: 241, baseType: !339, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !809, file: !133, line: 242, baseType: !419, size: 32, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !809, file: !133, line: 243, baseType: !402, size: 32, offset: 96)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !809, file: !133, line: 243, baseType: !402, size: 32, offset: 128)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !809, file: !133, line: 244, baseType: !402, size: 32, offset: 160)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !809, file: !133, line: 244, baseType: !402, size: 32, offset: 192)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !809, file: !133, line: 245, baseType: !447, size: 64, offset: 256)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !809, file: !133, line: 246, baseType: !517, size: 32, offset: 320)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !809, file: !133, line: 247, baseType: !402, size: 32, offset: 352)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !809, file: !133, line: 251, baseType: !402, size: 32, offset: 384)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !809, file: !133, line: 252, baseType: !721, size: 64, offset: 448)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !809, file: !133, line: 253, baseType: !517, size: 32, offset: 512)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !809, file: !133, line: 254, baseType: !402, size: 32, offset: 544)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !809, file: !133, line: 254, baseType: !402, size: 32, offset: 576)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !809, file: !133, line: 255, baseType: !402, size: 32, offset: 608)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !587, file: !588, line: 145, baseType: !343, size: 64, offset: 9792)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !587, file: !588, line: 146, baseType: !517, size: 32, offset: 9856)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !587, file: !588, line: 147, baseType: !829, size: 1344, offset: 9920)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !588, line: 140, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !588, line: 114, size: 1344, elements: !831)
!831 = !{!832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !850, !851, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !830, file: !588, line: 115, baseType: !402, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !830, file: !588, line: 116, baseType: !402, size: 32, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !830, file: !588, line: 117, baseType: !402, size: 32, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !830, file: !588, line: 118, baseType: !402, size: 32, offset: 96)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !830, file: !588, line: 119, baseType: !402, size: 32, offset: 128)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !830, file: !588, line: 120, baseType: !402, size: 32, offset: 160)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !830, file: !588, line: 121, baseType: !447, size: 64, offset: 192)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !830, file: !588, line: 122, baseType: !464, size: 64, offset: 256)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !830, file: !588, line: 124, baseType: !339, size: 64, offset: 320)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !830, file: !588, line: 125, baseType: !419, size: 32, offset: 384)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !830, file: !588, line: 125, baseType: !419, size: 32, offset: 416)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !830, file: !588, line: 126, baseType: !419, size: 32, offset: 448)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !830, file: !588, line: 126, baseType: !419, size: 32, offset: 480)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !830, file: !588, line: 127, baseType: !846, size: 64, offset: 512)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !340, line: 339, baseType: !848)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !340, line: 339, flags: DIFlagFwdDecl)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !830, file: !588, line: 128, baseType: !846, size: 64, offset: 576)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !830, file: !588, line: 129, baseType: !852, size: 64, offset: 640)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !340, line: 341, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !340, line: 351, size: 192, elements: !855)
!855 = !{!856, !857, !858, !859, !860}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !854, file: !340, line: 354, baseType: !91, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !854, file: !340, line: 355, baseType: !91, size: 32, offset: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !854, file: !340, line: 356, baseType: !91, size: 32, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !854, file: !340, line: 361, baseType: !91, size: 32, offset: 96)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !854, file: !340, line: 362, baseType: !513, size: 64, offset: 128)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !830, file: !588, line: 130, baseType: !402, size: 32, offset: 704)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !830, file: !588, line: 130, baseType: !402, size: 32, offset: 736)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !830, file: !588, line: 131, baseType: !464, size: 64, offset: 768)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !830, file: !588, line: 131, baseType: !464, size: 64, offset: 832)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !830, file: !588, line: 132, baseType: !447, size: 64, offset: 896)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !830, file: !588, line: 132, baseType: !447, size: 64, offset: 960)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !830, file: !588, line: 133, baseType: !402, size: 32, offset: 1024)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !830, file: !588, line: 134, baseType: !447, size: 64, offset: 1088)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !830, file: !588, line: 135, baseType: !402, size: 32, offset: 1152)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !830, file: !588, line: 136, baseType: !517, size: 32, offset: 1184)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !830, file: !588, line: 137, baseType: !517, size: 32, offset: 1216)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !830, file: !588, line: 138, baseType: !575, size: 32, offset: 1248)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !830, file: !588, line: 139, baseType: !447, size: 64, offset: 1280)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !587, file: !588, line: 147, baseType: !829, size: 1344, offset: 11264)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !587, file: !588, line: 148, baseType: !517, size: 32, offset: 12608)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !587, file: !588, line: 149, baseType: !402, size: 32, offset: 12640)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !587, file: !588, line: 150, baseType: !878, size: 32, offset: 12672)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !36, line: 472, baseType: !55)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !587, file: !588, line: 157, baseType: !429, size: 64, offset: 12736)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !565, file: !559, line: 38, baseType: !881, size: 64, offset: 256)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!363, !556, !585, !585, !585}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !565, file: !559, line: 40, baseType: !582, size: 64, offset: 320)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !565, file: !559, line: 41, baseType: !881, size: 64, offset: 384)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !565, file: !559, line: 42, baseType: !582, size: 64, offset: 448)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !565, file: !559, line: 43, baseType: !881, size: 64, offset: 512)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !565, file: !559, line: 44, baseType: !582, size: 64, offset: 576)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !565, file: !559, line: 46, baseType: !881, size: 64, offset: 640)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !565, file: !559, line: 47, baseType: !891, size: 64, offset: 704)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!363, !556, !761, !761, !894}
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !896)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !63, line: 1239, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 1226, size: 704, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !897, file: !63, line: 1227, baseType: !456, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !897, file: !63, line: 1228, baseType: !456, size: 64, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !897, file: !63, line: 1229, baseType: !456, size: 64, offset: 128)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !897, file: !63, line: 1230, baseType: !456, size: 64, offset: 192)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !897, file: !63, line: 1231, baseType: !456, size: 64, offset: 256)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !897, file: !63, line: 1232, baseType: !456, size: 64, offset: 320)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !897, file: !63, line: 1233, baseType: !456, size: 64, offset: 384)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !897, file: !63, line: 1234, baseType: !456, size: 64, offset: 448)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !897, file: !63, line: 1236, baseType: !456, size: 64, offset: 512)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !897, file: !63, line: 1237, baseType: !456, size: 64, offset: 576)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !897, file: !63, line: 1238, baseType: !456, size: 64, offset: 640)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !565, file: !559, line: 48, baseType: !911, size: 64, offset: 768)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!363, !556, !761, !894}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !565, file: !559, line: 49, baseType: !915, size: 64, offset: 832)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!363, !556, !585, !456, !918, !456, !402, !402, !585}
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !63, line: 1291, baseType: !62)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !565, file: !559, line: 50, baseType: !920, size: 64, offset: 896)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{!363, !556, !923, !924}
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !63, line: 238, baseType: !75)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !565, file: !559, line: 52, baseType: !926, size: 64, offset: 960)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{!363, !556, !929, !930}
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !63, line: 612, baseType: !81)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !63, line: 600, baseType: !932)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 592, size: 640, elements: !933)
!933 = !{!934, !935, !936, !937, !938, !939, !940, !941, !942, !943}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !932, file: !63, line: 593, baseType: !404, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !932, file: !63, line: 594, baseType: !404, size: 64, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !932, file: !63, line: 594, baseType: !404, size: 64, offset: 128)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !932, file: !63, line: 594, baseType: !404, size: 64, offset: 192)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !932, file: !63, line: 595, baseType: !404, size: 64, offset: 256)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !932, file: !63, line: 596, baseType: !404, size: 64, offset: 320)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !932, file: !63, line: 597, baseType: !404, size: 64, offset: 384)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !932, file: !63, line: 598, baseType: !404, size: 64, offset: 448)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !932, file: !63, line: 598, baseType: !404, size: 64, offset: 512)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !932, file: !63, line: 599, baseType: !404, size: 64, offset: 576)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !565, file: !559, line: 53, baseType: !945, size: 64, offset: 1024)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!363, !556, !556, !948}
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !565, file: !559, line: 54, baseType: !950, size: 64, offset: 1088)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{!363, !556, !585}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !565, file: !559, line: 55, baseType: !582, size: 64, offset: 1152)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !565, file: !559, line: 56, baseType: !955, size: 64, offset: 1216)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!363, !556, !623, !455}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !565, file: !559, line: 58, baseType: !959, size: 64, offset: 1280)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!363, !556, !962}
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !63, line: 424, baseType: !86)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !565, file: !559, line: 59, baseType: !959, size: 64, offset: 1344)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !565, file: !559, line: 60, baseType: !965, size: 64, offset: 1408)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!363, !556, !968, !517}
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !63, line: 469, baseType: !90)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !565, file: !559, line: 61, baseType: !970, size: 64, offset: 1472)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!363, !556}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !565, file: !559, line: 63, baseType: !974, size: 64, offset: 1536)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!363, !556, !402, !571, !465, !585, !585}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !565, file: !559, line: 64, baseType: !978, size: 64, offset: 1600)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!363, !556, !556, !761, !761, !894}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !565, file: !559, line: 65, baseType: !982, size: 64, offset: 1664)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!363, !556, !556, !894}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !565, file: !559, line: 66, baseType: !986, size: 64, offset: 1728)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!363, !556, !556, !761, !894}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !565, file: !559, line: 67, baseType: !982, size: 64, offset: 1792)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !565, file: !559, line: 69, baseType: !970, size: 64, offset: 1856)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !565, file: !559, line: 70, baseType: !978, size: 64, offset: 1920)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !565, file: !559, line: 71, baseType: !986, size: 64, offset: 1984)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !565, file: !559, line: 72, baseType: !994, size: 64, offset: 2048)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!363, !556, !924}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !565, file: !559, line: 73, baseType: !970, size: 64, offset: 2112)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !565, file: !559, line: 75, baseType: !999, size: 64, offset: 2176)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!363, !556, !1002, !924}
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !63, line: 563, baseType: !121)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !565, file: !559, line: 76, baseType: !582, size: 64, offset: 2240)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !565, file: !559, line: 77, baseType: !582, size: 64, offset: 2304)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !565, file: !559, line: 78, baseType: !891, size: 64, offset: 2368)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !565, file: !559, line: 79, baseType: !911, size: 64, offset: 2432)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !565, file: !559, line: 81, baseType: !1008, size: 64, offset: 2496)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!363, !556, !465, !556, !1011}
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !63, line: 285, baseType: !126)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !565, file: !559, line: 82, baseType: !1013, size: 64, offset: 2560)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!363, !556, !402, !1016, !1016, !923, !1018}
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !761)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !565, file: !559, line: 83, baseType: !1020, size: 64, offset: 2624)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!363, !556, !402, !805, !402}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !565, file: !559, line: 84, baseType: !1024, size: 64, offset: 2688)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!363, !556, !402, !571, !402, !571, !464}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !565, file: !559, line: 85, baseType: !1028, size: 64, offset: 2752)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!363, !556, !556, !1011}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !565, file: !559, line: 87, baseType: !1032, size: 64, offset: 2816)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!363, !556, !585, !447}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !565, file: !559, line: 88, baseType: !1036, size: 64, offset: 2880)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!363, !556, !465}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !565, file: !559, line: 89, baseType: !1036, size: 64, offset: 2944)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !565, file: !559, line: 90, baseType: !1041, size: 64, offset: 3008)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!363, !556, !585, !575}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !565, file: !559, line: 91, baseType: !974, size: 64, offset: 3072)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !565, file: !559, line: 93, baseType: !1046, size: 64, offset: 3136)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!363, !556, !690}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !565, file: !559, line: 94, baseType: !1050, size: 64, offset: 3200)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!363, !556, !402, !517, !517, !447, !1053, !1053, !948}
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !565, file: !559, line: 95, baseType: !1050, size: 64, offset: 3264)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !565, file: !559, line: 96, baseType: !1050, size: 64, offset: 3328)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !565, file: !559, line: 97, baseType: !1050, size: 64, offset: 3392)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !565, file: !559, line: 99, baseType: !1058, size: 64, offset: 3456)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!363, !556, !1061, !1064}
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !722, line: 51, baseType: !1062)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !722, line: 51, flags: DIFlagFwdDecl)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !63, line: 1378, baseType: !1065)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !559, line: 609, size: 6208, elements: !1067)
!1067 = !{!1068, !1069, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1088, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1106, !1107, !1108, !1109, !1110, !1112, !1113, !1114, !1115, !1116, !1117, !1118}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1066, file: !559, line: 610, baseType: !562, size: 4480)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1066, file: !559, line: 610, baseType: !1070, size: 32, offset: 4480)
!1070 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 32, elements: !398)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1066, file: !559, line: 611, baseType: !402, size: 32, offset: 4512)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1066, file: !559, line: 611, baseType: !402, size: 32, offset: 4544)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1066, file: !559, line: 611, baseType: !402, size: 32, offset: 4576)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1066, file: !559, line: 612, baseType: !402, size: 32, offset: 4608)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1066, file: !559, line: 613, baseType: !402, size: 32, offset: 4640)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1066, file: !559, line: 614, baseType: !447, size: 64, offset: 4672)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1066, file: !559, line: 615, baseType: !449, size: 64, offset: 4736)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !1066, file: !559, line: 616, baseType: !805, size: 64, offset: 4800)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1066, file: !559, line: 617, baseType: !447, size: 64, offset: 4864)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !1066, file: !559, line: 618, baseType: !1081, size: 64, offset: 4928)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !559, line: 602, baseType: !1083)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !559, line: 598, size: 128, elements: !1084)
!1084 = !{!1085, !1086, !1087}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1083, file: !559, line: 599, baseType: !402, size: 32)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1083, file: !559, line: 600, baseType: !402, size: 32, offset: 32)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1083, file: !559, line: 601, baseType: !464, size: 64, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !1066, file: !559, line: 619, baseType: !1089, size: 64, offset: 4992)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !559, line: 607, baseType: !1091)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !559, line: 604, size: 128, elements: !1092)
!1092 = !{!1093, !1094}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1091, file: !559, line: 605, baseType: !402, size: 32)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1091, file: !559, line: 606, baseType: !464, size: 64, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !1066, file: !559, line: 620, baseType: !464, size: 64, offset: 5056)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !1066, file: !559, line: 621, baseType: !456, size: 64, offset: 5120)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !1066, file: !559, line: 622, baseType: !456, size: 64, offset: 5184)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !1066, file: !559, line: 623, baseType: !585, size: 64, offset: 5248)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !1066, file: !559, line: 623, baseType: !585, size: 64, offset: 5312)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !1066, file: !559, line: 623, baseType: !585, size: 64, offset: 5376)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !1066, file: !559, line: 624, baseType: !517, size: 32, offset: 5440)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1066, file: !559, line: 625, baseType: !1103, size: 64, offset: 5504)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!363}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !1066, file: !559, line: 626, baseType: !343, size: 64, offset: 5568)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !1066, file: !559, line: 627, baseType: !585, size: 64, offset: 5632)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1066, file: !559, line: 628, baseType: !402, size: 32, offset: 5696)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !1066, file: !559, line: 629, baseType: !344, size: 64, offset: 5760)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1066, file: !559, line: 630, baseType: !1111, size: 32, offset: 5824)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !133, line: 213, baseType: !132)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1066, file: !559, line: 631, baseType: !402, size: 32, offset: 5856)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !1066, file: !559, line: 631, baseType: !402, size: 32, offset: 5888)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1066, file: !559, line: 632, baseType: !517, size: 32, offset: 5920)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !1066, file: !559, line: 633, baseType: !517, size: 32, offset: 5952)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !1066, file: !559, line: 634, baseType: !390, size: 64, offset: 6016)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !1066, file: !559, line: 634, baseType: !343, size: 64, offset: 6080)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !1066, file: !559, line: 635, baseType: !410, size: 64, offset: 6144)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !565, file: !559, line: 100, baseType: !1120, size: 64, offset: 3520)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{!363, !556, !402, !402, !1123, !1126}
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !133, line: 215, baseType: !1125)
!1125 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !565, file: !559, line: 101, baseType: !970, size: 64, offset: 3584)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !565, file: !559, line: 102, baseType: !1129, size: 64, offset: 3648)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!363, !556, !761, !761, !924}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !565, file: !559, line: 103, baseType: !568, size: 64, offset: 3712)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !565, file: !559, line: 105, baseType: !1134, size: 64, offset: 3776)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!363, !556, !761, !761, !923, !924}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !565, file: !559, line: 106, baseType: !970, size: 64, offset: 3840)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !565, file: !559, line: 107, baseType: !1139, size: 64, offset: 3904)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = !DISubroutineType(types: !1141)
!1141 = !{!363, !556, !369}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !565, file: !559, line: 108, baseType: !1143, size: 64, offset: 3968)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!363, !556, !1146, !923, !924}
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !63, line: 25, baseType: !344)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !565, file: !559, line: 109, baseType: !1103, size: 64, offset: 4032)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !565, file: !559, line: 111, baseType: !1149, size: 64, offset: 4096)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!363, !556, !556, !556, !456, !556}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !565, file: !559, line: 112, baseType: !1153, size: 64, offset: 4160)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!363, !556, !556, !556, !556}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !565, file: !559, line: 113, baseType: !1157, size: 64, offset: 4224)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!363, !556, !721, !721}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !565, file: !559, line: 114, baseType: !568, size: 64, offset: 4288)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !565, file: !559, line: 115, baseType: !974, size: 64, offset: 4352)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !565, file: !559, line: 117, baseType: !1032, size: 64, offset: 4416)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !565, file: !559, line: 118, baseType: !1032, size: 64, offset: 4480)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !565, file: !559, line: 119, baseType: !1143, size: 64, offset: 4544)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !565, file: !559, line: 120, baseType: !1166, size: 64, offset: 4608)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{!363, !556, !1169, !948}
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !63, line: 1675, baseType: !137)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !565, file: !559, line: 121, baseType: !1103, size: 64, offset: 4672)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !565, file: !559, line: 123, baseType: !1172, size: 64, offset: 4736)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = !DISubroutineType(types: !1174)
!1174 = !{!363, !556, !402, !343}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !565, file: !559, line: 124, baseType: !1176, size: 64, offset: 4800)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = !DISubroutineType(types: !1178)
!1178 = !{!363, !556, !1064, !585, !343}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !565, file: !559, line: 125, baseType: !1180, size: 64, offset: 4864)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = !DISubroutineType(types: !1182)
!1182 = !{!363, !493, !556}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !565, file: !559, line: 126, baseType: !582, size: 64, offset: 4928)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !565, file: !559, line: 127, baseType: !582, size: 64, offset: 4992)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !565, file: !559, line: 129, baseType: !1186, size: 64, offset: 5056)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = !DISubroutineType(types: !1188)
!1188 = !{!363, !556, !805}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !565, file: !559, line: 130, baseType: !1190, size: 64, offset: 5120)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1191 = !DISubroutineType(types: !1192)
!1192 = !{!363, !556, !1193, !1193}
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !36, line: 654, baseType: !1194)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !36, line: 653, size: 128, elements: !1196)
!1196 = !{!1197, !1198}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1195, file: !36, line: 653, baseType: !402, size: 32)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1195, file: !36, line: 653, baseType: !585, size: 64, offset: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !565, file: !559, line: 131, baseType: !1190, size: 64, offset: 5184)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !565, file: !559, line: 132, baseType: !1201, size: 64, offset: 5248)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = !DISubroutineType(types: !1203)
!1203 = !{!363, !556, !447, !447, !447}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !565, file: !559, line: 133, baseType: !1139, size: 64, offset: 5312)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !565, file: !559, line: 135, baseType: !1206, size: 64, offset: 5376)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{!363, !556, !456, !948}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !565, file: !559, line: 136, baseType: !1206, size: 64, offset: 5440)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !565, file: !559, line: 137, baseType: !1211, size: 64, offset: 5504)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = !DISubroutineType(types: !1213)
!1213 = !{!363, !556, !948}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !565, file: !559, line: 138, baseType: !568, size: 64, offset: 5568)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !565, file: !559, line: 139, baseType: !1216, size: 64, offset: 5632)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DISubroutineType(types: !1218)
!1218 = !{!363, !556, !599, !599}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !565, file: !559, line: 141, baseType: !1103, size: 64, offset: 5696)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !565, file: !559, line: 142, baseType: !1221, size: 64, offset: 5760)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{!363, !556, !556, !456, !556}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !565, file: !559, line: 143, baseType: !1225, size: 64, offset: 5824)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = !DISubroutineType(types: !1227)
!1227 = !{!363, !556, !556, !556}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !565, file: !559, line: 144, baseType: !1103, size: 64, offset: 5888)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !565, file: !559, line: 145, baseType: !1221, size: 64, offset: 5952)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !565, file: !559, line: 147, baseType: !1225, size: 64, offset: 6016)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !565, file: !559, line: 148, baseType: !1103, size: 64, offset: 6080)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !565, file: !559, line: 149, baseType: !1221, size: 64, offset: 6144)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !565, file: !559, line: 150, baseType: !1225, size: 64, offset: 6208)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !565, file: !559, line: 151, baseType: !1235, size: 64, offset: 6272)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!363, !556, !517}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !565, file: !559, line: 153, baseType: !970, size: 64, offset: 6336)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !565, file: !559, line: 154, baseType: !970, size: 64, offset: 6400)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !565, file: !559, line: 155, baseType: !970, size: 64, offset: 6464)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !565, file: !559, line: 156, baseType: !970, size: 64, offset: 6528)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !565, file: !559, line: 157, baseType: !1139, size: 64, offset: 6592)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !565, file: !559, line: 159, baseType: !1244, size: 64, offset: 6656)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1245 = !DISubroutineType(types: !1246)
!1246 = !{!363, !556, !402, !573}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !565, file: !559, line: 160, baseType: !970, size: 64, offset: 6720)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !565, file: !559, line: 161, baseType: !970, size: 64, offset: 6784)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !565, file: !559, line: 162, baseType: !970, size: 64, offset: 6848)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !565, file: !559, line: 163, baseType: !970, size: 64, offset: 6912)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !565, file: !559, line: 165, baseType: !1225, size: 64, offset: 6976)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !565, file: !559, line: 166, baseType: !1225, size: 64, offset: 7040)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !565, file: !559, line: 167, baseType: !1032, size: 64, offset: 7104)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !565, file: !559, line: 168, baseType: !1255, size: 64, offset: 7168)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64)
!1256 = !DISubroutineType(types: !1257)
!1257 = !{!363, !556, !585, !402}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !565, file: !559, line: 169, baseType: !1259, size: 64, offset: 7232)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{!363, !556, !948, !447}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !565, file: !559, line: 171, baseType: !994, size: 64, offset: 7296)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !565, file: !559, line: 172, baseType: !970, size: 64, offset: 7360)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !565, file: !559, line: 173, baseType: !1265, size: 64, offset: 7424)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64)
!1266 = !DISubroutineType(types: !1267)
!1267 = !{!363, !556, !447, !1053}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !565, file: !559, line: 174, baseType: !1129, size: 64, offset: 7488)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !565, file: !559, line: 175, baseType: !1129, size: 64, offset: 7552)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !565, file: !559, line: 177, baseType: !582, size: 64, offset: 7616)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !565, file: !559, line: 178, baseType: !920, size: 64, offset: 7680)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !565, file: !559, line: 179, baseType: !582, size: 64, offset: 7744)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !565, file: !559, line: 180, baseType: !881, size: 64, offset: 7808)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !565, file: !559, line: 181, baseType: !1275, size: 64, offset: 7872)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!363, !556, !339, !923, !924}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !565, file: !559, line: 183, baseType: !1186, size: 64, offset: 7936)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !565, file: !559, line: 184, baseType: !955, size: 64, offset: 8000)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !565, file: !559, line: 185, baseType: !1281, size: 64, offset: 8064)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64)
!1282 = !DISubroutineType(types: !1283)
!1283 = !{!363, !556, !769}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !565, file: !559, line: 186, baseType: !1285, size: 64, offset: 8128)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{!363, !556, !402, !571, !464}
