; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/cg/stcg/stcg.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/cg/stcg/stcg.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque

!79 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !104, line: 70, baseType: !7, size: 32, elements: !105)
!104 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!105 = !{!106, !107, !108}
!106 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!107 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!108 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 451, baseType: !28, size: 32, elements: !110)
!110 = !{!111, !112, !113, !114, !115}
!111 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!112 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!113 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!114 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!115 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!116 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !117, line: 663, baseType: !7, size: 32, elements: !118)
!117 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!118 = !{!119, !120, !121}
!119 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!120 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!121 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!122 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 395, baseType: !28, size: 32, elements: !123)
!123 = !{!124, !125, !126, !127, !128, !129, !130}
!124 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!125 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!126 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!127 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!128 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!129 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!130 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!131 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !132, line: 155, baseType: !7, size: 32, elements: !133)
!132 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!133 = !{!134, !135, !136, !137, !138}
!134 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!135 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!136 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!137 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!138 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!139 = !{!140, !143, !161, !242, !348, !182, !350, !205, !359, !362, !232, !28, !365, !208}
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !141, line: 46, baseType: !142)
!141 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!142 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !146, line: 73, size: 4480, elements: !147)
!146 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!147 = !{!148, !150, !203, !204, !206, !209, !210, !211, !212, !220, !221, !223, !227, !231, !233, !234, !235, !236, !237, !238, !239, !240, !241, !243, !245, !246, !247, !249, !250, !252, !254, !255, !256, !257, !258, !261, !263, !264, !265, !266, !267, !270, !272, !273, !274, !284, !286, !287, !291, !292, !338, !343, !345, !346, !347}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !145, file: !146, line: 74, baseType: !149, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !145, file: !146, line: 75, baseType: !151, size: 448, offset: 64)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 448, elements: !201)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !146, line: 53, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !146, line: 45, size: 448, elements: !154)
!154 = !{!155, !165, !173, !178, !185, !189, !196}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !153, file: !146, line: 46, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!159, !143, !160}
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !162, line: 330, baseType: !163)
!162 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !162, line: 330, flags: DIFlagFwdDecl)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !153, file: !146, line: 47, baseType: !166, size: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!159, !143, !169}
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !170, line: 16, baseType: !171)
!170 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !170, line: 16, flags: DIFlagFwdDecl)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !153, file: !146, line: 48, baseType: !174, size: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!159, !177}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !153, file: !146, line: 49, baseType: !179, size: 64, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!159, !143, !182, !143}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!184 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !153, file: !146, line: 50, baseType: !186, size: 64, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!159, !143, !182, !177}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !153, file: !146, line: 51, baseType: !190, size: 64, offset: 320)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!159, !143, !182, !193}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{null}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !153, file: !146, line: 52, baseType: !197, size: 64, offset: 384)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!159, !143, !182, !200}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!201 = !{!202}
!202 = !DISubrange(count: 1)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !145, file: !146, line: 76, baseType: !161, size: 64, offset: 512)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !145, file: !146, line: 77, baseType: !205, size: 32, offset: 576)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !145, file: !146, line: 78, baseType: !207, size: 64, offset: 640)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !208)
!208 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !145, file: !146, line: 78, baseType: !207, size: 64, offset: 704)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !145, file: !146, line: 78, baseType: !207, size: 64, offset: 768)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !145, file: !146, line: 78, baseType: !207, size: 64, offset: 832)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !145, file: !146, line: 79, baseType: !213, size: 64, offset: 896)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !216, line: 27, baseType: !217)
!216 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !218, line: 43, baseType: !219)
!218 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!219 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !145, file: !146, line: 80, baseType: !205, size: 32, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !145, file: !146, line: 81, baseType: !222, size: 32, offset: 992)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !145, file: !146, line: 82, baseType: !224, size: 64, offset: 1024)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !145, file: !146, line: 83, baseType: !228, size: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !145, file: !146, line: 84, baseType: !232, size: 64, offset: 1152)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !145, file: !146, line: 85, baseType: !232, size: 64, offset: 1216)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !145, file: !146, line: 86, baseType: !232, size: 64, offset: 1280)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !145, file: !146, line: 87, baseType: !232, size: 64, offset: 1344)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !145, file: !146, line: 88, baseType: !143, size: 64, offset: 1408)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !145, file: !146, line: 89, baseType: !213, size: 64, offset: 1472)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !145, file: !146, line: 90, baseType: !232, size: 64, offset: 1536)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !145, file: !146, line: 91, baseType: !232, size: 64, offset: 1600)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !145, file: !146, line: 92, baseType: !205, size: 32, offset: 1664)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !145, file: !146, line: 93, baseType: !242, size: 64, offset: 1728)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !145, file: !146, line: 94, baseType: !244, size: 64, offset: 1792)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !214)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !145, file: !146, line: 95, baseType: !205, size: 32, offset: 1856)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !145, file: !146, line: 95, baseType: !205, size: 32, offset: 1888)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !145, file: !146, line: 96, baseType: !248, size: 64, offset: 1920)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !145, file: !146, line: 96, baseType: !248, size: 64, offset: 1984)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !145, file: !146, line: 97, baseType: !251, size: 64, offset: 2048)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !145, file: !146, line: 97, baseType: !253, size: 64, offset: 2112)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !145, file: !146, line: 98, baseType: !205, size: 32, offset: 2176)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !145, file: !146, line: 98, baseType: !205, size: 32, offset: 2208)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !145, file: !146, line: 99, baseType: !248, size: 64, offset: 2240)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !145, file: !146, line: 99, baseType: !248, size: 64, offset: 2304)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !145, file: !146, line: 100, baseType: !259, size: 64, offset: 2368)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !208)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !145, file: !146, line: 100, baseType: !262, size: 64, offset: 2432)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !145, file: !146, line: 101, baseType: !205, size: 32, offset: 2496)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !145, file: !146, line: 101, baseType: !205, size: 32, offset: 2528)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !145, file: !146, line: 102, baseType: !248, size: 64, offset: 2560)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !145, file: !146, line: 102, baseType: !248, size: 64, offset: 2624)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !145, file: !146, line: 103, baseType: !268, size: 64, offset: 2688)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !260)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !145, file: !146, line: 103, baseType: !271, size: 64, offset: 2752)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !145, file: !146, line: 104, baseType: !200, size: 64, offset: 2816)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !145, file: !146, line: 105, baseType: !205, size: 32, offset: 2880)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !145, file: !146, line: 106, baseType: !275, size: 128, offset: 2944)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 128, elements: !282)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !146, line: 64, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !146, line: 61, size: 128, elements: !279)
!279 = !{!280, !281}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !278, file: !146, line: 62, baseType: !193, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !278, file: !146, line: 63, baseType: !242, size: 64, offset: 64)
!282 = !{!283}
!283 = !DISubrange(count: 2)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !145, file: !146, line: 107, baseType: !285, size: 64, offset: 3072)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 64, elements: !282)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !145, file: !146, line: 108, baseType: !242, size: 64, offset: 3136)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !145, file: !146, line: 109, baseType: !288, size: 64, offset: 3200)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!159, !242}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !145, file: !146, line: 111, baseType: !205, size: 32, offset: 3264)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !145, file: !146, line: 112, baseType: !293, size: 320, offset: 3328)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 320, elements: !336)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!159, !297, !143, !242}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !300)
!300 = !{!301, !302, !324, !325, !326, !327, !328, !329, !330, !331, !332}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !299, file: !12, line: 100, baseType: !205, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !299, file: !12, line: 101, baseType: !303, size: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !306)
!306 = !{!307, !308, !309, !310, !311, !314, !315, !316, !317, !319, !321, !322, !323}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !305, file: !12, line: 84, baseType: !232, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !305, file: !12, line: 85, baseType: !232, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !305, file: !12, line: 86, baseType: !242, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !305, file: !12, line: 87, baseType: !224, size: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !305, file: !12, line: 88, baseType: !312, size: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !305, file: !12, line: 89, baseType: !184, size: 8, offset: 320)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !305, file: !12, line: 90, baseType: !232, size: 64, offset: 384)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !305, file: !12, line: 91, baseType: !140, size: 64, offset: 448)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !305, file: !12, line: 92, baseType: !318, size: 32, offset: 512)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !305, file: !12, line: 93, baseType: !320, size: 32, offset: 544)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !305, file: !12, line: 94, baseType: !303, size: 64, offset: 576)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !305, file: !12, line: 95, baseType: !232, size: 64, offset: 640)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !305, file: !12, line: 96, baseType: !242, size: 64, offset: 704)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !299, file: !12, line: 102, baseType: !232, size: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !299, file: !12, line: 102, baseType: !232, size: 64, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !299, file: !12, line: 103, baseType: !232, size: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !299, file: !12, line: 104, baseType: !161, size: 64, offset: 320)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !299, file: !12, line: 105, baseType: !318, size: 32, offset: 384)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !299, file: !12, line: 105, baseType: !318, size: 32, offset: 416)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !299, file: !12, line: 105, baseType: !318, size: 32, offset: 448)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !299, file: !12, line: 106, baseType: !143, size: 64, offset: 512)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !299, file: !12, line: 107, baseType: !333, size: 64, offset: 576)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!336 = !{!337}
!337 = !DISubrange(count: 5)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !145, file: !146, line: 113, baseType: !339, size: 320, offset: 3648)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 320, elements: !336)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!159, !143, !242}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !145, file: !146, line: 114, baseType: !344, size: 320, offset: 3968)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 320, elements: !336)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !145, file: !146, line: 115, baseType: !318, size: 32, offset: 4288)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !145, file: !146, line: 120, baseType: !333, size: 64, offset: 4352)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !145, file: !146, line: 121, baseType: !318, size: 32, offset: 4416)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !349, line: 1451, baseType: !193)
!349 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPCG_STCG", file: !352, line: 24, baseType: !353)
!352 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/ksp/impls/cg/stcg/stcgimpl.h", directory: "/home/users/ndemeye/xSDK")
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 19, size: 256, elements: !354)
!354 = !{!355, !356, !357, !358}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !353, file: !352, line: 20, baseType: !260, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "norm_d", scope: !353, file: !352, line: 21, baseType: !260, size: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "o_fcn", scope: !353, file: !352, line: 22, baseType: !260, size: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "dtype", scope: !353, file: !352, line: 23, baseType: !205, size: 32, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !162, line: 331, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !162, line: 331, flags: DIFlagFwdDecl)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !162, line: 338, baseType: !363)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !162, line: 338, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !27, line: 395, baseType: !122)
!366 = !{!0}
!367 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/cg/stcg/stcg.c", directory: "/home/users/ndemeye/xSDK")
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 4096, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 64)
!371 = !{i32 7, !"Dwarf Version", i32 4}
!372 = !{i32 2, !"Debug Info Version", i32 3}
!373 = !{i32 1, !"wchar_size", i32 4}
!374 = !{i32 7, !"PIC Level", i32 2}
!375 = !{i32 7, !"uwtable", i32 1}
!376 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!377 = distinct !DISubprogram(name: "KSPCreate_STCG", scope: !367, file: !367, line: 641, type: !378, scopeLine: 642, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !622)
!378 = !DISubroutineType(types: !379)
!379 = !{!159, !380}
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !35, line: 22, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !104, line: 75, size: 12800, elements: !383)
!383 = !{!384, !386, !437, !442, !443, !444, !445, !475, !476, !477, !478, !479, !481, !486, !487, !488, !489, !490, !491, !492, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !515, !521, !522, !523, !524, !529, !530, !531, !532, !537, !538, !539, !540, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !592, !593, !594, !595, !596, !603, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !619, !620, !621}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !382, file: !104, line: 76, baseType: !385, size: 4480)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !146, line: 122, baseType: !145)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !382, file: !104, line: 76, baseType: !387, size: 896, offset: 4480)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 896, elements: !201)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !104, line: 18, size: 896, elements: !389)
!389 = !{!390, !398, !402, !404, !412, !413, !417, !418, !422, !426, !430, !431, !435, !436}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !388, file: !104, line: 19, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!159, !380, !394, !397}
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !132, line: 21, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !132, line: 21, flags: DIFlagFwdDecl)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !388, file: !104, line: 22, baseType: !399, size: 64, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!159, !380, !394, !394, !397}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !388, file: !104, line: 25, baseType: !403, size: 64, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !388, file: !104, line: 26, baseType: !405, size: 64, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!159, !380, !408, !408}
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !409, line: 16, baseType: !410)
!409 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !409, line: 16, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !388, file: !104, line: 27, baseType: !403, size: 64, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !388, file: !104, line: 28, baseType: !414, size: 64, offset: 320)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!159, !297, !380}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !388, file: !104, line: 29, baseType: !403, size: 64, offset: 384)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !388, file: !104, line: 30, baseType: !419, size: 64, offset: 448)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!159, !380, !259, !259}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !388, file: !104, line: 31, baseType: !423, size: 64, offset: 512)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!159, !380, !205, !259, !259, !251}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !388, file: !104, line: 32, baseType: !427, size: 64, offset: 576)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!159, !380, !318, !318, !251, !397, !259, !259}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !388, file: !104, line: 33, baseType: !403, size: 64, offset: 640)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !388, file: !104, line: 34, baseType: !432, size: 64, offset: 704)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!159, !380, !169}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !388, file: !104, line: 35, baseType: !403, size: 64, offset: 768)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !388, file: !104, line: 36, baseType: !432, size: 64, offset: 832)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !382, file: !104, line: 77, baseType: !438, size: 64, offset: 5376)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !439, line: 14, baseType: !440)
!439 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !439, line: 14, flags: DIFlagFwdDecl)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !382, file: !104, line: 78, baseType: !318, size: 32, offset: 5440)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !382, file: !104, line: 79, baseType: !318, size: 32, offset: 5472)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !382, file: !104, line: 81, baseType: !205, size: 32, offset: 5504)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !382, file: !104, line: 82, baseType: !446, size: 64, offset: 5568)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !35, line: 752, baseType: !447)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !104, line: 54, size: 5184, elements: !449)
!449 = !{!450, !451, !471, !472, !473, !474}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !448, file: !104, line: 55, baseType: !385, size: 4480)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !448, file: !104, line: 55, baseType: !452, size: 448, offset: 4480)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !453, size: 448, elements: !201)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !104, line: 41, size: 448, elements: !454)
!454 = !{!455, !459, !460, !464, !465, !466, !470}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !453, file: !104, line: 42, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{!159, !446, !394, !394}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !453, file: !104, line: 43, baseType: !456, size: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !453, file: !104, line: 44, baseType: !461, size: 64, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!159, !446}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !453, file: !104, line: 45, baseType: !461, size: 64, offset: 192)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !453, file: !104, line: 46, baseType: !461, size: 64, offset: 256)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !453, file: !104, line: 47, baseType: !467, size: 64, offset: 320)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!159, !446, !169}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !453, file: !104, line: 48, baseType: !461, size: 64, offset: 384)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !448, file: !104, line: 56, baseType: !380, size: 64, offset: 4928)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !448, file: !104, line: 57, baseType: !408, size: 64, offset: 4992)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !448, file: !104, line: 58, baseType: !244, size: 64, offset: 5056)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !448, file: !104, line: 59, baseType: !242, size: 64, offset: 5120)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !382, file: !104, line: 83, baseType: !318, size: 32, offset: 5632)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !382, file: !104, line: 84, baseType: !318, size: 32, offset: 5664)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !382, file: !104, line: 85, baseType: !318, size: 32, offset: 5696)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !382, file: !104, line: 86, baseType: !318, size: 32, offset: 5728)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !382, file: !104, line: 87, baseType: !480, size: 32, offset: 5760)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !27, line: 85, baseType: !26)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !382, file: !104, line: 88, baseType: !482, size: 384, offset: 5792)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 384, elements: !483)
!483 = !{!484, !485}
!484 = !DISubrange(count: 4)
!485 = !DISubrange(count: 3)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !382, file: !104, line: 89, baseType: !260, size: 64, offset: 6208)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !382, file: !104, line: 90, baseType: !260, size: 64, offset: 6272)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !382, file: !104, line: 91, baseType: !260, size: 64, offset: 6336)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !382, file: !104, line: 92, baseType: !260, size: 64, offset: 6400)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !382, file: !104, line: 93, baseType: !260, size: 64, offset: 6464)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !382, file: !104, line: 94, baseType: !260, size: 64, offset: 6528)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !382, file: !104, line: 95, baseType: !493, size: 32, offset: 6592)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !35, line: 540, baseType: !34)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !382, file: !104, line: 96, baseType: !318, size: 32, offset: 6624)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !382, file: !104, line: 98, baseType: !394, size: 64, offset: 6656)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !382, file: !104, line: 98, baseType: !394, size: 64, offset: 6720)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !382, file: !104, line: 102, baseType: !259, size: 64, offset: 6784)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !382, file: !104, line: 103, baseType: !259, size: 64, offset: 6848)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !382, file: !104, line: 104, baseType: !205, size: 32, offset: 6912)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !382, file: !104, line: 105, baseType: !205, size: 32, offset: 6944)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !382, file: !104, line: 106, baseType: !318, size: 32, offset: 6976)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !382, file: !104, line: 107, baseType: !259, size: 64, offset: 7040)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !382, file: !104, line: 108, baseType: !259, size: 64, offset: 7104)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !382, file: !104, line: 109, baseType: !205, size: 32, offset: 7168)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !382, file: !104, line: 110, baseType: !205, size: 32, offset: 7200)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !382, file: !104, line: 111, baseType: !318, size: 32, offset: 7232)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !382, file: !104, line: 113, baseType: !205, size: 32, offset: 7264)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !382, file: !104, line: 114, baseType: !318, size: 32, offset: 7296)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !382, file: !104, line: 117, baseType: !205, size: 32, offset: 7328)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !382, file: !104, line: 120, baseType: !511, size: 320, offset: 7360)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 320, elements: !336)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!159, !380, !205, !260, !242}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !382, file: !104, line: 121, baseType: !516, size: 320, offset: 7680)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 320, elements: !336)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DISubroutineType(types: !519)
!519 = !{!159, !520}
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !382, file: !104, line: 122, baseType: !344, size: 320, offset: 8000)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !382, file: !104, line: 123, baseType: !205, size: 32, offset: 8320)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !382, file: !104, line: 124, baseType: !318, size: 32, offset: 8352)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !382, file: !104, line: 126, baseType: !525, size: 320, offset: 8384)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !526, size: 320, elements: !336)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!159, !380, !242}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !382, file: !104, line: 127, baseType: !516, size: 320, offset: 8704)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !382, file: !104, line: 128, baseType: !344, size: 320, offset: 9024)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !382, file: !104, line: 129, baseType: !205, size: 32, offset: 9344)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !382, file: !104, line: 131, baseType: !533, size: 64, offset: 9408)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!159, !380, !205, !260, !536, !242}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !382, file: !104, line: 132, baseType: !288, size: 64, offset: 9472)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !382, file: !104, line: 133, baseType: !242, size: 64, offset: 9536)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !382, file: !104, line: 135, baseType: !242, size: 64, offset: 9600)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !382, file: !104, line: 137, baseType: !541, size: 64, offset: 9664)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !27, line: 11, baseType: !542)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !27, line: 11, flags: DIFlagFwdDecl)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !382, file: !104, line: 139, baseType: !242, size: 64, offset: 9728)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !382, file: !104, line: 142, baseType: !318, size: 32, offset: 9792)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !382, file: !104, line: 142, baseType: !318, size: 32, offset: 9824)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !382, file: !104, line: 142, baseType: !318, size: 32, offset: 9856)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !382, file: !104, line: 142, baseType: !318, size: 32, offset: 9888)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !382, file: !104, line: 142, baseType: !318, size: 32, offset: 9920)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !382, file: !104, line: 142, baseType: !318, size: 32, offset: 9952)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !382, file: !104, line: 142, baseType: !318, size: 32, offset: 9984)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !382, file: !104, line: 142, baseType: !318, size: 32, offset: 10016)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !382, file: !104, line: 142, baseType: !318, size: 32, offset: 10048)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !382, file: !104, line: 142, baseType: !318, size: 32, offset: 10080)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !382, file: !104, line: 142, baseType: !318, size: 32, offset: 10112)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !382, file: !104, line: 142, baseType: !318, size: 32, offset: 10144)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !382, file: !104, line: 142, baseType: !318, size: 32, offset: 10176)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !382, file: !104, line: 142, baseType: !318, size: 32, offset: 10208)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !382, file: !104, line: 143, baseType: !169, size: 64, offset: 10240)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !382, file: !104, line: 143, baseType: !169, size: 64, offset: 10304)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !382, file: !104, line: 143, baseType: !169, size: 64, offset: 10368)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !382, file: !104, line: 143, baseType: !169, size: 64, offset: 10432)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !382, file: !104, line: 143, baseType: !169, size: 64, offset: 10496)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !382, file: !104, line: 143, baseType: !169, size: 64, offset: 10560)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !382, file: !104, line: 143, baseType: !169, size: 64, offset: 10624)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !382, file: !104, line: 143, baseType: !169, size: 64, offset: 10688)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !382, file: !104, line: 143, baseType: !169, size: 64, offset: 10752)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !382, file: !104, line: 143, baseType: !169, size: 64, offset: 10816)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !382, file: !104, line: 143, baseType: !169, size: 64, offset: 10880)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !382, file: !104, line: 143, baseType: !169, size: 64, offset: 10944)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !382, file: !104, line: 143, baseType: !169, size: 64, offset: 11008)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !382, file: !104, line: 143, baseType: !169, size: 64, offset: 11072)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !382, file: !104, line: 144, baseType: !574, size: 32, offset: 11136)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !59, line: 162, baseType: !58)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !382, file: !104, line: 144, baseType: !574, size: 32, offset: 11168)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !382, file: !104, line: 144, baseType: !574, size: 32, offset: 11200)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !382, file: !104, line: 144, baseType: !574, size: 32, offset: 11232)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !382, file: !104, line: 144, baseType: !574, size: 32, offset: 11264)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !382, file: !104, line: 144, baseType: !574, size: 32, offset: 11296)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !382, file: !104, line: 144, baseType: !574, size: 32, offset: 11328)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !382, file: !104, line: 144, baseType: !574, size: 32, offset: 11360)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !382, file: !104, line: 144, baseType: !574, size: 32, offset: 11392)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !382, file: !104, line: 144, baseType: !574, size: 32, offset: 11424)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !382, file: !104, line: 144, baseType: !574, size: 32, offset: 11456)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !382, file: !104, line: 144, baseType: !574, size: 32, offset: 11488)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !382, file: !104, line: 144, baseType: !574, size: 32, offset: 11520)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !382, file: !104, line: 144, baseType: !574, size: 32, offset: 11552)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !382, file: !104, line: 147, baseType: !205, size: 32, offset: 11584)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !382, file: !104, line: 148, baseType: !397, size: 64, offset: 11648)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !382, file: !104, line: 150, baseType: !591, size: 32, offset: 11712)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !104, line: 70, baseType: !103)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !382, file: !104, line: 151, baseType: !318, size: 32, offset: 11744)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !382, file: !104, line: 153, baseType: !205, size: 32, offset: 11776)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !382, file: !104, line: 154, baseType: !205, size: 32, offset: 11808)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !382, file: !104, line: 156, baseType: !318, size: 32, offset: 11840)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !382, file: !104, line: 161, baseType: !597, size: 192, offset: 11904)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !382, file: !104, line: 157, size: 192, elements: !598)
!598 = !{!599, !600, !601, !602}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !597, file: !104, line: 158, baseType: !408, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !597, file: !104, line: 158, baseType: !408, size: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !597, file: !104, line: 159, baseType: !318, size: 32, offset: 128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !597, file: !104, line: 160, baseType: !318, size: 32, offset: 160)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !382, file: !104, line: 163, baseType: !604, size: 32, offset: 12096)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !35, line: 451, baseType: !109)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !382, file: !104, line: 165, baseType: !480, size: 32, offset: 12128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !382, file: !104, line: 166, baseType: !604, size: 32, offset: 12160)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !382, file: !104, line: 171, baseType: !318, size: 32, offset: 12192)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !382, file: !104, line: 172, baseType: !318, size: 32, offset: 12224)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !382, file: !104, line: 173, baseType: !318, size: 32, offset: 12256)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !382, file: !104, line: 174, baseType: !394, size: 64, offset: 12288)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !382, file: !104, line: 175, baseType: !394, size: 64, offset: 12352)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !382, file: !104, line: 177, baseType: !205, size: 32, offset: 12416)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !382, file: !104, line: 178, baseType: !318, size: 32, offset: 12448)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !382, file: !104, line: 180, baseType: !169, size: 64, offset: 12480)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !382, file: !104, line: 182, baseType: !616, size: 64, offset: 12544)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{!159, !380, !394, !394, !242}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !382, file: !104, line: 183, baseType: !616, size: 64, offset: 12608)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !382, file: !104, line: 184, baseType: !242, size: 64, offset: 12672)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !382, file: !104, line: 184, baseType: !242, size: 64, offset: 12736)
!622 = !{!623, !624, !625, !626, !628, !630, !632, !634, !636, !638, !640}
!623 = !DILocalVariable(name: "ksp", arg: 1, scope: !377, file: !367, line: 641, type: !380)
!624 = !DILocalVariable(name: "ierr", scope: !377, file: !367, line: 643, type: !159)
!625 = !DILocalVariable(name: "cg", scope: !377, file: !367, line: 644, type: !350)
!626 = !DILocalVariable(name: "ierr__", scope: !627, file: !367, line: 647, type: !159)
!627 = distinct !DILexicalBlock(scope: !377, file: !367, line: 647, column: 31)
!628 = !DILocalVariable(name: "ierr__", scope: !629, file: !367, line: 653, type: !159)
!629 = distinct !DILexicalBlock(scope: !377, file: !367, line: 653, column: 77)
!630 = !DILocalVariable(name: "ierr__", scope: !631, file: !367, line: 654, type: !159)
!631 = distinct !DILexicalBlock(scope: !377, file: !367, line: 654, column: 75)
!632 = !DILocalVariable(name: "ierr__", scope: !633, file: !367, line: 655, type: !159)
!633 = distinct !DILexicalBlock(scope: !377, file: !367, line: 655, column: 68)
!634 = !DILocalVariable(name: "ierr__", scope: !635, file: !367, line: 656, type: !159)
!635 = distinct !DILexicalBlock(scope: !377, file: !367, line: 656, column: 65)
!636 = !DILocalVariable(name: "ierr__", scope: !637, file: !367, line: 671, type: !159)
!637 = distinct !DILexicalBlock(scope: !377, file: !367, line: 671, column: 94)
!638 = !DILocalVariable(name: "ierr__", scope: !639, file: !367, line: 672, type: !159)
!639 = distinct !DILexicalBlock(scope: !377, file: !367, line: 672, column: 92)
!640 = !DILocalVariable(name: "ierr__", scope: !641, file: !367, line: 673, type: !159)
!641 = distinct !DILexicalBlock(scope: !377, file: !367, line: 673, column: 94)
!642 = !DILocation(line: 0, scope: !377)
!643 = !DILocation(line: 644, column: 3, scope: !377)
!644 = !DILocation(line: 646, column: 3, scope: !645)
!645 = distinct !DILexicalBlock(scope: !646, file: !367, line: 646, column: 3)
!646 = distinct !DILexicalBlock(scope: !647, file: !367, line: 646, column: 3)
!647 = distinct !DILexicalBlock(scope: !377, file: !367, line: 646, column: 3)
!648 = !{!649, !649, i64 0}
!649 = !{!"any pointer", !650, i64 0}
!650 = !{!"omnipotent char", !651, i64 0}
!651 = !{!"Simple C/C++ TBAA"}
!652 = !DILocation(line: 646, column: 3, scope: !646)
!653 = !DILocation(line: 646, column: 3, scope: !654)
!654 = distinct !DILexicalBlock(scope: !655, file: !367, line: 646, column: 3)
!655 = distinct !DILexicalBlock(scope: !645, file: !367, line: 646, column: 3)
!656 = !{!657, !658, i64 1536}
!657 = !{!"", !650, i64 0, !650, i64 512, !650, i64 1024, !650, i64 1280, !658, i64 1536, !658, i64 1540, !650, i64 1544}
!658 = !{!"int", !650, i64 0}
!659 = !DILocation(line: 646, column: 3, scope: !655)
!660 = !DILocation(line: 646, column: 3, scope: !661)
!661 = distinct !DILexicalBlock(scope: !654, file: !367, line: 646, column: 3)
!662 = !{!658, !658, i64 0}
!663 = !{!657, !658, i64 1540}
!664 = !DILocation(line: 647, column: 10, scope: !377)
!665 = !{!"branch_weights", i32 2146410443, i32 1073205}
!666 = !DILocation(line: 0, scope: !627)
!667 = !DILocation(line: 647, column: 31, scope: !627)
!668 = !{!"branch_weights", i32 2000, i32 1}
!669 = !DILocation(line: 647, column: 31, scope: !670)
!670 = distinct !DILexicalBlock(scope: !627, file: !367, line: 647, column: 31)
!671 = !DILocation(line: 649, column: 3, scope: !377)
!672 = !DILocation(line: 649, column: 7, scope: !377)
!673 = !DILocation(line: 649, column: 14, scope: !377)
!674 = !{!675, !676, i64 0}
!675 = !{!"", !676, i64 0, !676, i64 8, !676, i64 16, !658, i64 24}
!676 = !{!"double", !650, i64 0}
!677 = !DILocation(line: 650, column: 7, scope: !377)
!678 = !DILocation(line: 650, column: 14, scope: !377)
!679 = !{!675, !658, i64 24}
!680 = !DILocation(line: 652, column: 8, scope: !377)
!681 = !DILocation(line: 652, column: 14, scope: !377)
!682 = !{!683, !649, i64 1216}
