; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/mg/mgadapt.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/mg/mgadapt.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct._p_PC = type { %struct._p_PetscObject, [1 x %struct._PCOps], %struct._p_DM*, i32, i64, i64, i32, i32, i32, i32, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 (%struct._p_PC*, i32, %struct._p_IS**, %struct._p_IS**, %struct._p_Mat**, i8*)*, i8*, i8*, i32, i8*, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!36 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_ITS", value: 4)
!37 = !DIEnumerator(name: "PCRICHARDSON_DIVERGED_DTOL", value: -4)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 85, baseType: !32, size: 32, elements: !39)
!39 = !{!40, !41, !42, !43}
!40 = !DIEnumerator(name: "PC_SIDE_DEFAULT", value: -1)
!41 = !DIEnumerator(name: "PC_LEFT", value: 0)
!42 = !DIEnumerator(name: "PC_RIGHT", value: 1)
!43 = !DIEnumerator(name: "PC_SYMMETRIC", value: 2)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 285, baseType: !5, size: 32, elements: !46)
!45 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!46 = !{!47, !48, !49, !50}
!47 = !DIEnumerator(name: "DIFFERENT_NONZERO_PATTERN", value: 0, isUnsigned: true)
!48 = !DIEnumerator(name: "SUBSET_NONZERO_PATTERN", value: 1, isUnsigned: true)
!49 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!50 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 395, baseType: !32, size: 32, elements: !52)
!52 = !{!53, !54, !55, !56, !57, !58, !59}
!53 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!54 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!55 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!56 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!57 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!58 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!59 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 330, baseType: !5, size: 32, elements: !61)
!61 = !{!62, !63, !64, !65}
!62 = !DIEnumerator(name: "PCMG_POLYNOMIAL", value: 0, isUnsigned: true)
!63 = !DIEnumerator(name: "PCMG_HARMONIC", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "PCMG_EIGENVECTOR", value: 2, isUnsigned: true)
!65 = !DIEnumerator(name: "PCMG_GENERALIZED_EIGENVECTOR", value: 3, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 264, baseType: !5, size: 32, elements: !67)
!67 = !{!68, !69, !70, !71}
!68 = !DIEnumerator(name: "PC_MG_MULTIPLICATIVE", value: 0, isUnsigned: true)
!69 = !DIEnumerator(name: "PC_MG_ADDITIVE", value: 1, isUnsigned: true)
!70 = !DIEnumerator(name: "PC_MG_FULL", value: 2, isUnsigned: true)
!71 = !DIEnumerator(name: "PC_MG_KASKADE", value: 3, isUnsigned: true)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 297, baseType: !5, size: 32, elements: !73)
!73 = !{!74, !75, !76, !77, !78}
!74 = !DIEnumerator(name: "PC_MG_GALERKIN_BOTH", value: 0, isUnsigned: true)
!75 = !DIEnumerator(name: "PC_MG_GALERKIN_PMAT", value: 1, isUnsigned: true)
!76 = !DIEnumerator(name: "PC_MG_GALERKIN_MAT", value: 2, isUnsigned: true)
!77 = !DIEnumerator(name: "PC_MG_GALERKIN_NONE", value: 3, isUnsigned: true)
!78 = !DIEnumerator(name: "PC_MG_GALERKIN_EXTERNAL", value: 4, isUnsigned: true)
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 238, baseType: !5, size: 32, elements: !80)
!80 = !{!81, !82, !83, !84}
!81 = !DIEnumerator(name: "MAT_INITIAL_MATRIX", value: 0, isUnsigned: true)
!82 = !DIEnumerator(name: "MAT_REUSE_MATRIX", value: 1, isUnsigned: true)
!83 = !DIEnumerator(name: "MAT_IGNORE_MATRIX", value: 2, isUnsigned: true)
!84 = !DIEnumerator(name: "MAT_INPLACE_MATRIX", value: 3, isUnsigned: true)
!85 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 580, baseType: !5, size: 32, elements: !86)
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95}
!87 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!88 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!89 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!90 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!91 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!92 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!93 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!94 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!95 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!96 = !{!97, !101, !102, !105, !305, !205, !214, !271}
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !98, line: 330, baseType: !99)
!98 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !98, line: 330, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!104 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !108, line: 73, size: 4480, elements: !109)
!108 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!109 = !{!110, !112, !158, !159, !161, !164, !165, !166, !167, !175, !176, !178, !182, !186, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !199, !200, !201, !203, !204, !206, !208, !209, !210, !211, !212, !215, !217, !218, !219, !220, !221, !224, !226, !227, !228, !238, !240, !241, !245, !246, !295, !300, !302, !303, !304}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !107, file: !108, line: 74, baseType: !111, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !107, file: !108, line: 75, baseType: !113, size: 448, offset: 64)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 448, elements: !156)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !108, line: 53, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !108, line: 45, size: 448, elements: !116)
!116 = !{!117, !123, !131, !136, !140, !144, !151}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !115, file: !108, line: 46, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!121, !105, !122}
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !32)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !115, file: !108, line: 47, baseType: !124, size: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!121, !105, !127}
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !128, line: 16, baseType: !129)
!128 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !128, line: 16, flags: DIFlagFwdDecl)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !115, file: !108, line: 48, baseType: !132, size: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!121, !135}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !115, file: !108, line: 49, baseType: !137, size: 64, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!121, !105, !102, !105}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !115, file: !108, line: 50, baseType: !141, size: 64, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!121, !105, !102, !135}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !115, file: !108, line: 51, baseType: !145, size: 64, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!121, !105, !102, !148}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{null}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !115, file: !108, line: 52, baseType: !152, size: 64, offset: 384)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!121, !105, !102, !155}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!156 = !{!157}
!157 = !DISubrange(count: 1)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !107, file: !108, line: 76, baseType: !97, size: 64, offset: 512)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !107, file: !108, line: 77, baseType: !160, size: 32, offset: 576)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !107, file: !108, line: 78, baseType: !162, size: 64, offset: 640)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !163)
!163 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !107, file: !108, line: 78, baseType: !162, size: 64, offset: 704)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !107, file: !108, line: 78, baseType: !162, size: 64, offset: 768)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !107, file: !108, line: 78, baseType: !162, size: 64, offset: 832)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !107, file: !108, line: 79, baseType: !168, size: 64, offset: 896)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !169)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !171, line: 27, baseType: !172)
!171 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !173, line: 43, baseType: !174)
!173 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!174 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !107, file: !108, line: 80, baseType: !160, size: 32, offset: 960)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !107, file: !108, line: 81, baseType: !177, size: 32, offset: 992)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !107, file: !108, line: 82, baseType: !179, size: 64, offset: 1024)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !107, file: !108, line: 83, baseType: !183, size: 64, offset: 1088)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !107, file: !108, line: 84, baseType: !187, size: 64, offset: 1152)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !107, file: !108, line: 85, baseType: !187, size: 64, offset: 1216)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !107, file: !108, line: 86, baseType: !187, size: 64, offset: 1280)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !107, file: !108, line: 87, baseType: !187, size: 64, offset: 1344)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !107, file: !108, line: 88, baseType: !105, size: 64, offset: 1408)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !107, file: !108, line: 89, baseType: !168, size: 64, offset: 1472)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !107, file: !108, line: 90, baseType: !187, size: 64, offset: 1536)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !107, file: !108, line: 91, baseType: !187, size: 64, offset: 1600)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !107, file: !108, line: 92, baseType: !160, size: 32, offset: 1664)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !107, file: !108, line: 93, baseType: !101, size: 64, offset: 1728)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !107, file: !108, line: 94, baseType: !198, size: 64, offset: 1792)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !169)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !107, file: !108, line: 95, baseType: !160, size: 32, offset: 1856)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !107, file: !108, line: 95, baseType: !160, size: 32, offset: 1888)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !107, file: !108, line: 96, baseType: !202, size: 64, offset: 1920)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !107, file: !108, line: 96, baseType: !202, size: 64, offset: 1984)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !107, file: !108, line: 97, baseType: !205, size: 64, offset: 2048)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !107, file: !108, line: 97, baseType: !207, size: 64, offset: 2112)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !107, file: !108, line: 98, baseType: !160, size: 32, offset: 2176)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !107, file: !108, line: 98, baseType: !160, size: 32, offset: 2208)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !107, file: !108, line: 99, baseType: !202, size: 64, offset: 2240)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !107, file: !108, line: 99, baseType: !202, size: 64, offset: 2304)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !107, file: !108, line: 100, baseType: !213, size: 64, offset: 2368)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !163)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !107, file: !108, line: 100, baseType: !216, size: 64, offset: 2432)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !107, file: !108, line: 101, baseType: !160, size: 32, offset: 2496)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !107, file: !108, line: 101, baseType: !160, size: 32, offset: 2528)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !107, file: !108, line: 102, baseType: !202, size: 64, offset: 2560)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !107, file: !108, line: 102, baseType: !202, size: 64, offset: 2624)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !107, file: !108, line: 103, baseType: !222, size: 64, offset: 2688)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !214)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !107, file: !108, line: 103, baseType: !225, size: 64, offset: 2752)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !107, file: !108, line: 104, baseType: !155, size: 64, offset: 2816)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !107, file: !108, line: 105, baseType: !160, size: 32, offset: 2880)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !107, file: !108, line: 106, baseType: !229, size: 128, offset: 2944)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 128, elements: !236)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !108, line: 64, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !108, line: 61, size: 128, elements: !233)
!233 = !{!234, !235}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !232, file: !108, line: 62, baseType: !148, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !232, file: !108, line: 63, baseType: !101, size: 64, offset: 64)
!236 = !{!237}
!237 = !DISubrange(count: 2)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !107, file: !108, line: 107, baseType: !239, size: 64, offset: 3072)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 64, elements: !236)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !107, file: !108, line: 108, baseType: !101, size: 64, offset: 3136)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !107, file: !108, line: 109, baseType: !242, size: 64, offset: 3200)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!121, !101}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !107, file: !108, line: 111, baseType: !160, size: 32, offset: 3264)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !107, file: !108, line: 112, baseType: !247, size: 320, offset: 3328)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 320, elements: !293)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{!121, !251, !105, !101}
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !16, line: 108, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !16, line: 99, size: 640, elements: !254)
!254 = !{!255, !256, !281, !282, !283, !284, !285, !286, !287, !288, !289}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !253, file: !16, line: 100, baseType: !160, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !253, file: !16, line: 101, baseType: !257, size: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !16, line: 82, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !16, line: 83, size: 768, elements: !260)
!260 = !{!261, !262, !263, !264, !265, !268, !269, !270, !274, !276, !278, !279, !280}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !259, file: !16, line: 84, baseType: !187, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !259, file: !16, line: 85, baseType: !187, size: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !259, file: !16, line: 86, baseType: !101, size: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !259, file: !16, line: 87, baseType: !179, size: 64, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !259, file: !16, line: 88, baseType: !266, size: 64, offset: 256)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !259, file: !16, line: 89, baseType: !104, size: 8, offset: 320)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !259, file: !16, line: 90, baseType: !187, size: 64, offset: 384)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !259, file: !16, line: 91, baseType: !271, size: 64, offset: 448)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !272, line: 46, baseType: !273)
!272 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!273 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !259, file: !16, line: 92, baseType: !275, size: 32, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !259, file: !16, line: 93, baseType: !277, size: 32, offset: 544)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !16, line: 81, baseType: !15)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !259, file: !16, line: 94, baseType: !257, size: 64, offset: 576)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !259, file: !16, line: 95, baseType: !187, size: 64, offset: 640)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !259, file: !16, line: 96, baseType: !101, size: 64, offset: 704)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !253, file: !16, line: 102, baseType: !187, size: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !253, file: !16, line: 102, baseType: !187, size: 64, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !253, file: !16, line: 103, baseType: !187, size: 64, offset: 256)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !253, file: !16, line: 104, baseType: !97, size: 64, offset: 320)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !253, file: !16, line: 105, baseType: !275, size: 32, offset: 384)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !253, file: !16, line: 105, baseType: !275, size: 32, offset: 416)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !253, file: !16, line: 105, baseType: !275, size: 32, offset: 448)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !253, file: !16, line: 106, baseType: !105, size: 64, offset: 512)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !253, file: !16, line: 107, baseType: !290, size: 64, offset: 576)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !16, line: 10, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !16, line: 10, flags: DIFlagFwdDecl)
!293 = !{!294}
!294 = !DISubrange(count: 5)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !107, file: !108, line: 113, baseType: !296, size: 320, offset: 3648)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 320, elements: !293)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!121, !105, !101}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !107, file: !108, line: 114, baseType: !301, size: 320, offset: 3968)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 320, elements: !293)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !107, file: !108, line: 115, baseType: !275, size: 32, offset: 4288)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !107, file: !108, line: 120, baseType: !290, size: 64, offset: 4352)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !107, file: !108, line: 121, baseType: !275, size: 32, offset: 4416)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_MG", file: !307, line: 79, baseType: !308)
!307 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcmgimpl.h", directory: "/home/users/ndemeye/xSDK")
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !307, line: 53, size: 2240, elements: !309)
!309 = !{!310, !312, !313, !314, !316, !317, !318, !320, !321, !322, !323, !324, !325, !379, !380, !381, !382, !383, !384, !385, !386, !388, !488, !492}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "am", scope: !308, file: !307, line: 54, baseType: !311, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCMGType", file: !31, line: 264, baseType: !66)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "cyclesperpcapply", scope: !308, file: !307, line: 55, baseType: !160, size: 32, offset: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "maxlevels", scope: !308, file: !307, line: 56, baseType: !160, size: 32, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "galerkin", scope: !308, file: !307, line: 57, baseType: !315, size: 32, offset: 96)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCMGGalerkinType", file: !31, line: 297, baseType: !72)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "usedmfornumberoflevels", scope: !308, file: !307, line: 58, baseType: !275, size: 32, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "adaptInterpolation", scope: !308, file: !307, line: 60, baseType: !275, size: 32, offset: 160)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "coarseSpaceType", scope: !308, file: !307, line: 61, baseType: !319, size: 32, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCMGCoarseSpaceType", file: !31, line: 330, baseType: !60)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !308, file: !307, line: 62, baseType: !160, size: 32, offset: 224)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "eigenvalue", scope: !308, file: !307, line: 63, baseType: !160, size: 32, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "mespMonitor", scope: !308, file: !307, line: 64, baseType: !275, size: 32, offset: 288)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "compatibleRelaxation", scope: !308, file: !307, line: 66, baseType: !275, size: 32, offset: 320)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "nlevels", scope: !308, file: !307, line: 68, baseType: !160, size: 32, offset: 352)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !308, file: !307, line: 69, baseType: !326, size: 64, offset: 384)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_MG_Levels", file: !307, line: 48, baseType: !329)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !307, line: 14, size: 1600, elements: !330)
!330 = !{!331, !332, !333, !334, !339, !340, !341, !345, !346, !347, !349, !353, !354, !358, !359, !360, !365, !366, !367, !368, !369, !370, !371, !372, !373, !376, !377, !378}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "cycles", scope: !329, file: !307, line: 15, baseType: !160, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !329, file: !307, line: 16, baseType: !160, size: 32, offset: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !329, file: !307, line: 17, baseType: !160, size: 32, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !329, file: !307, line: 18, baseType: !335, size: 64, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !336, line: 21, baseType: !337)
!336 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !336, line: 21, flags: DIFlagFwdDecl)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !329, file: !307, line: 19, baseType: !335, size: 64, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !329, file: !307, line: 20, baseType: !335, size: 64, offset: 256)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !329, file: !307, line: 21, baseType: !342, size: 64, offset: 320)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !45, line: 16, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !45, line: 16, flags: DIFlagFwdDecl)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !329, file: !307, line: 22, baseType: !342, size: 64, offset: 384)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "R", scope: !329, file: !307, line: 23, baseType: !342, size: 64, offset: 448)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "coarseSpace", scope: !329, file: !307, line: 24, baseType: !348, size: 64, offset: 512)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !329, file: !307, line: 29, baseType: !350, size: 64, offset: 576)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!121, !342, !335, !335, !335}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "residualtranspose", scope: !329, file: !307, line: 30, baseType: !350, size: 64, offset: 640)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "matresidual", scope: !329, file: !307, line: 31, baseType: !355, size: 64, offset: 704)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!121, !342, !342, !342, !342}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "matresidualtranspose", scope: !329, file: !307, line: 32, baseType: !355, size: 64, offset: 768)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !329, file: !307, line: 34, baseType: !342, size: 64, offset: 832)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "smoothd", scope: !329, file: !307, line: 35, baseType: !361, size: 64, offset: 896)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !362, line: 22, baseType: !363)
!362 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !362, line: 22, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "smoothu", scope: !329, file: !307, line: 36, baseType: !361, size: 64, offset: 960)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "cr", scope: !329, file: !307, line: 37, baseType: !361, size: 64, offset: 1024)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "crx", scope: !329, file: !307, line: 38, baseType: !335, size: 64, offset: 1088)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "crb", scope: !329, file: !307, line: 39, baseType: !335, size: 64, offset: 1152)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !329, file: !307, line: 40, baseType: !342, size: 64, offset: 1216)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "restrct", scope: !329, file: !307, line: 41, baseType: !342, size: 64, offset: 1280)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "inject", scope: !329, file: !307, line: 42, baseType: !342, size: 64, offset: 1344)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "rscale", scope: !329, file: !307, line: 43, baseType: !335, size: 64, offset: 1408)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "eventsmoothsetup", scope: !329, file: !307, line: 44, baseType: !374, size: 32, offset: 1472)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogEvent", file: !375, line: 80, baseType: !32)
!375 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!376 = !DIDerivedType(tag: DW_TAG_member, name: "eventsmoothsolve", scope: !329, file: !307, line: 45, baseType: !374, size: 32, offset: 1504)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "eventresidual", scope: !329, file: !307, line: 46, baseType: !374, size: 32, offset: 1536)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "eventinterprestrict", scope: !329, file: !307, line: 47, baseType: !374, size: 32, offset: 1568)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "default_smoothu", scope: !308, file: !307, line: 70, baseType: !160, size: 32, offset: 448)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "default_smoothd", scope: !308, file: !307, line: 71, baseType: !160, size: 32, offset: 480)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !308, file: !307, line: 72, baseType: !214, size: 64, offset: 512)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !308, file: !307, line: 72, baseType: !214, size: 64, offset: 576)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "dtol", scope: !308, file: !307, line: 72, baseType: !214, size: 64, offset: 640)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !308, file: !307, line: 72, baseType: !214, size: 64, offset: 704)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "innerctx", scope: !308, file: !307, line: 74, baseType: !101, size: 64, offset: 768)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "stageApply", scope: !308, file: !307, line: 75, baseType: !387, size: 32, offset: 832)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogStage", file: !375, line: 89, baseType: !32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !308, file: !307, line: 76, baseType: !389, size: 64, offset: 896)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!121, !392, !127}
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !31, line: 11, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !395, line: 37, size: 6720, elements: !396)
!395 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcimpl.h", directory: "/home/users/ndemeye/xSDK")
!396 = !{!397, !399, !452, !457, !458, !459, !460, !461, !463, !464, !465, !466, !467, !468, !469, !470, !471, !481, !482, !483, !484, !485, !487}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !394, file: !395, line: 38, baseType: !398, size: 4480)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !108, line: 122, baseType: !107)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !394, file: !395, line: 38, baseType: !400, size: 1152, offset: 4480)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 1152, elements: !156)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PCOps", file: !395, line: 13, size: 1152, elements: !402)
!402 = !{!403, !407, !411, !415, !421, !426, !427, !431, !435, !439, !440, !445, !446, !447, !448, !449, !450, !451}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !401, file: !395, line: 14, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!121, !392}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !401, file: !395, line: 15, baseType: !408, size: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!121, !392, !335, !335}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "matapply", scope: !401, file: !395, line: 16, baseType: !412, size: 64, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!121, !392, !342, !342}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "applyrichardson", scope: !401, file: !395, line: 17, baseType: !416, size: 64, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!121, !392, !335, !335, !335, !214, !214, !214, !160, !275, !205, !419}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCRichardsonConvergedReason", file: !31, line: 102, baseType: !30)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "applyBA", scope: !401, file: !395, line: 18, baseType: !422, size: 64, offset: 256)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!121, !392, !425, !335, !335, !335}
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !31, line: 85, baseType: !38)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "applytranspose", scope: !401, file: !395, line: 19, baseType: !408, size: 64, offset: 320)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "applyBAtranspose", scope: !401, file: !395, line: 20, baseType: !428, size: 64, offset: 384)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!121, !392, !160, !335, !335, !335}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !401, file: !395, line: 21, baseType: !432, size: 64, offset: 448)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!121, !251, !392}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !401, file: !395, line: 22, baseType: !436, size: 64, offset: 512)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!121, !392, !361, !335, !335}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !401, file: !395, line: 23, baseType: !436, size: 64, offset: 576)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "getfactoredmatrix", scope: !401, file: !395, line: 24, baseType: !441, size: 64, offset: 640)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!121, !392, !444}
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricleft", scope: !401, file: !395, line: 25, baseType: !408, size: 64, offset: 704)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricright", scope: !401, file: !395, line: 26, baseType: !408, size: 64, offset: 768)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "setuponblocks", scope: !401, file: !395, line: 27, baseType: !404, size: 64, offset: 832)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !401, file: !395, line: 28, baseType: !404, size: 64, offset: 896)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !401, file: !395, line: 29, baseType: !389, size: 64, offset: 960)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !401, file: !395, line: 30, baseType: !404, size: 64, offset: 1024)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !401, file: !395, line: 31, baseType: !389, size: 64, offset: 1088)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !394, file: !395, line: 39, baseType: !453, size: 64, offset: 5632)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !454, line: 14, baseType: !455)
!454 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !454, line: 14, flags: DIFlagFwdDecl)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !394, file: !395, line: 40, baseType: !160, size: 32, offset: 5696)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "matstate", scope: !394, file: !395, line: 41, baseType: !198, size: 64, offset: 5760)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "matnonzerostate", scope: !394, file: !395, line: 41, baseType: !198, size: 64, offset: 5824)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "reusepreconditioner", scope: !394, file: !395, line: 42, baseType: !275, size: 32, offset: 5888)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !394, file: !395, line: 43, baseType: !462, size: 32, offset: 5920)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !45, line: 285, baseType: !44)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !394, file: !395, line: 45, baseType: !160, size: 32, offset: 5952)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "erroriffailure", scope: !394, file: !395, line: 46, baseType: !275, size: 32, offset: 5984)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !394, file: !395, line: 47, baseType: !342, size: 64, offset: 6016)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "pmat", scope: !394, file: !395, line: 47, baseType: !342, size: 64, offset: 6080)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleright", scope: !394, file: !395, line: 48, baseType: !335, size: 64, offset: 6144)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleleft", scope: !394, file: !395, line: 48, baseType: !335, size: 64, offset: 6208)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !394, file: !395, line: 49, baseType: !275, size: 32, offset: 6272)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "useAmat", scope: !394, file: !395, line: 50, baseType: !275, size: 32, offset: 6304)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatrices", scope: !394, file: !395, line: 51, baseType: !472, size: 64, offset: 6336)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!121, !392, !160, !475, !475, !444, !101}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !477)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !478, line: 11, baseType: !479)
!478 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !478, line: 11, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatricesP", scope: !394, file: !395, line: 52, baseType: !101, size: 64, offset: 6400)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !394, file: !395, line: 53, baseType: !101, size: 64, offset: 6464)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "presolvedone", scope: !394, file: !395, line: 54, baseType: !160, size: 32, offset: 6528)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !394, file: !395, line: 55, baseType: !101, size: 64, offset: 6592)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "failedreason", scope: !394, file: !395, line: 56, baseType: !486, size: 32, offset: 6656)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !31, line: 395, baseType: !51)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "failedreasonrank", scope: !394, file: !395, line: 57, baseType: !486, size: 32, offset: 6688)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "min_eigen_DinvA", scope: !308, file: !307, line: 77, baseType: !489, size: 640, offset: 960)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 640, elements: !490)
!490 = !{!491}
!491 = !DISubrange(count: 10)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "max_eigen_DinvA", scope: !308, file: !307, line: 78, baseType: !489, size: 640, offset: 1600)
!493 = !{i32 7, !"Dwarf Version", i32 4}
!494 = !{i32 2, !"Debug Info Version", i32 3}
!495 = !{i32 1, !"wchar_size", i32 4}
!496 = !{i32 7, !"PIC Level", i32 2}
!497 = !{i32 7, !"uwtable", i32 1}
!498 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!499 = distinct !DISubprogram(name: "DMSetBasisFunction_Internal", scope: !500, file: !500, line: 47, type: !501, scopeLine: 48, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !509)
!500 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/mg/mgadapt.c", directory: "/home/users/ndemeye/xSDK")
!501 = !DISubroutineType(types: !502)
!502 = !{!121, !160, !275, !160, !503}
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!121, !160, !214, !507, !160, !222, !101}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !214)
!509 = !{!510, !511, !512, !513, !514}
!510 = !DILocalVariable(name: "Nf", arg: 1, scope: !499, file: !500, line: 47, type: !160)
!511 = !DILocalVariable(name: "usePoly", arg: 2, scope: !499, file: !500, line: 47, type: !275)
!512 = !DILocalVariable(name: "dir", arg: 3, scope: !499, file: !500, line: 47, type: !160)
!513 = !DILocalVariable(name: "funcs", arg: 4, scope: !499, file: !500, line: 47, type: !503)
!514 = !DILocalVariable(name: "f", scope: !499, file: !500, line: 49, type: !160)
!515 = !DILocation(line: 0, scope: !499)
!516 = !DILocation(line: 51, column: 3, scope: !517)
!517 = distinct !DILexicalBlock(scope: !518, file: !500, line: 51, column: 3)
!518 = distinct !DILexicalBlock(scope: !519, file: !500, line: 51, column: 3)
!519 = distinct !DILexicalBlock(scope: !499, file: !500, line: 51, column: 3)
!520 = !{!521, !521, i64 0}
!521 = !{!"any pointer", !522, i64 0}
!522 = !{!"omnipotent char", !523, i64 0}
!523 = !{!"Simple C/C++ TBAA"}
!524 = !DILocation(line: 51, column: 3, scope: !518)
!525 = !DILocation(line: 51, column: 3, scope: !526)
!526 = distinct !DILexicalBlock(scope: !527, file: !500, line: 51, column: 3)
!527 = distinct !DILexicalBlock(scope: !517, file: !500, line: 51, column: 3)
!528 = !{!529, !530, i64 1536}
!529 = !{!"", !522, i64 0, !522, i64 512, !522, i64 1024, !522, i64 1280, !530, i64 1536, !530, i64 1540, !522, i64 1544}
!530 = !{!"int", !522, i64 0}
!531 = !DILocation(line: 51, column: 3, scope: !527)
!532 = !DILocation(line: 51, column: 3, scope: !533)
!533 = distinct !DILexicalBlock(scope: !526, file: !500, line: 51, column: 3)
!534 = !{!530, !530, i64 0}
!535 = !{!529, !530, i64 1540}
!536 = !DILocation(line: 52, column: 17, scope: !537)
!537 = distinct !DILexicalBlock(scope: !538, file: !500, line: 52, column: 3)
!538 = distinct !DILexicalBlock(scope: !499, file: !500, line: 52, column: 3)
!539 = !DILocation(line: 52, column: 3, scope: !538)
!540 = !DILocation(line: 53, column: 9, scope: !541)
!541 = distinct !DILexicalBlock(scope: !537, file: !500, line: 52, column: 28)
!542 = !DILocation(line: 61, column: 7, scope: !543)
!543 = distinct !DILexicalBlock(scope: !544, file: !500, line: 60, column: 12)
!544 = distinct !DILexicalBlock(scope: !541, file: !500, line: 53, column: 9)
!545 = !DILocation(line: 52, column: 23, scope: !537)
!546 = !DILocation(line: 63, column: 24, scope: !547)
!547 = distinct !DILexicalBlock(scope: !543, file: !500, line: 61, column: 20)
!548 = distinct !{!548, !539, !549, !550, !551}
!549 = !DILocation(line: 68, column: 3, scope: !538)
!550 = !{!"llvm.loop.mustprogress"}
!551 = !{!"llvm.loop.isvectorized", i32 1}
!552 = distinct !{!552, !553}
!553 = !{!"llvm.loop.unroll.disable"}
