; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/multiblock/multiblock.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/multiblock/multiblock.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_datatype_t = type opaque

!71 = !DIEnumerator(name: "SNES_FUNCTION_PRECONDITIONED", value: 1)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !46, line: 180, baseType: !5, size: 32, elements: !73)
!73 = !{!74, !75, !76, !77, !78, !79}
!74 = !DIEnumerator(name: "PC_COMPOSITE_ADDITIVE", value: 0, isUnsigned: true)
!75 = !DIEnumerator(name: "PC_COMPOSITE_MULTIPLICATIVE", value: 1, isUnsigned: true)
!76 = !DIEnumerator(name: "PC_COMPOSITE_SYMMETRIC_MULTIPLICATIVE", value: 2, isUnsigned: true)
!77 = !DIEnumerator(name: "PC_COMPOSITE_SPECIAL", value: 3, isUnsigned: true)
!78 = !DIEnumerator(name: "PC_COMPOSITE_SCHUR", value: 4, isUnsigned: true)
!79 = !DIEnumerator(name: "PC_COMPOSITE_GKB", value: 5, isUnsigned: true)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !81, line: 663, baseType: !5, size: 32, elements: !82)
!81 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!82 = !{!83, !84, !85}
!83 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !87)
!87 = !{!88, !89, !90}
!88 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !92, line: 155, baseType: !5, size: 32, elements: !93)
!92 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!93 = !{!94, !95, !96, !97, !98}
!94 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!95 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!96 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!97 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!98 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!99 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 580, baseType: !5, size: 32, elements: !100)
!100 = !{!101, !102, !103, !104, !105, !106, !107, !108, !109}
!101 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!102 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!103 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!104 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!105 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!106 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!107 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!108 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!109 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!110 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !92, line: 30, baseType: !5, size: 32, elements: !111)
!111 = !{!112, !113, !114, !115, !116}
!112 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!113 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!114 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!115 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!116 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!117 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !118)
!118 = !{!119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136}
!119 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!120 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!121 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!122 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!123 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!124 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!125 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!126 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!127 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!128 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!129 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!130 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!131 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!132 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!133 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!134 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!135 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!136 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!137 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 58, baseType: !5, size: 32, elements: !138)
!138 = !{!139}
!139 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!140 = !{!141, !203, !281, !224, !200, !355, !262, !573, !576, !161, !26, !579, !581, !5, !582, !583}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES_Multiblock", file: !143, line: 24, baseType: !144)
!143 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/snes/impls/multiblock/multiblock.c", directory: "/home/users/ndemeye/xSDK")
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !143, line: 16, size: 256, elements: !145)
!145 = !{!146, !148, !149, !150, !152, !153, !155}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "issetup", scope: !144, file: !143, line: 17, baseType: !147, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "defined", scope: !144, file: !143, line: 18, baseType: !147, size: 32, offset: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "defaultblocks", scope: !144, file: !143, line: 19, baseType: !147, size: 32, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "numBlocks", scope: !144, file: !143, line: 20, baseType: !151, size: 32, offset: 96)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !144, file: !143, line: 21, baseType: !151, size: 32, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !144, file: !143, line: 22, baseType: !154, size: 32, offset: 160)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCCompositeType", file: !46, line: 180, baseType: !72)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !144, file: !143, line: 23, baseType: !156, size: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlockDesc", file: !143, line: 4, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_BlockDesc", file: !143, line: 5, size: 576, elements: !159)
!159 = !{!160, !163, !164, !166, !171, !177, !570, !571, !572}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !158, file: !143, line: 6, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nfields", scope: !158, file: !143, line: 7, baseType: !151, size: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !158, file: !143, line: 8, baseType: !165, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "is", scope: !158, file: !143, line: 9, baseType: !167, size: 64, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !168, line: 11, baseType: !169)
!168 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !168, line: 11, flags: DIFlagFwdDecl)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "sctx", scope: !158, file: !143, line: 10, baseType: !172, size: 64, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !173, line: 59, baseType: !174)
!173 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !173, line: 15, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !173, line: 15, flags: DIFlagFwdDecl)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "snes", scope: !158, file: !143, line: 11, baseType: !178, size: 64, offset: 320)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !25, line: 18, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !181, line: 38, size: 11648, elements: !182)
!181 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/snesimpl.h", directory: "/home/users/ndemeye/xSDK")
!182 = !{!183, !388, !454, !459, !460, !461, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !477, !481, !482, !484, !485, !486, !487, !488, !493, !495, !496, !497, !498, !499, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !535, !537, !538, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !180, file: !181, line: 39, baseType: !184, size: 4480)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !185, line: 122, baseType: !186)
!185 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !185, line: 73, size: 4480, elements: !187)
!187 = !{!188, !190, !244, !245, !246, !249, !250, !251, !252, !260, !261, !263, !267, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !282, !284, !285, !286, !288, !289, !290, !292, !293, !294, !295, !296, !299, !301, !302, !303, !304, !305, !308, !310, !311, !312, !322, !324, !325, !329, !330, !378, !383, !385, !386, !387}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !186, file: !185, line: 74, baseType: !189, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !186, file: !185, line: 75, baseType: !191, size: 448, offset: 64)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 448, elements: !242)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !185, line: 53, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !185, line: 45, size: 448, elements: !194)
!194 = !{!195, !207, !215, !220, !226, !230, !237}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !193, file: !185, line: 46, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!199, !200, !202}
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !204, line: 330, baseType: !205)
!204 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !204, line: 330, flags: DIFlagFwdDecl)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !193, file: !185, line: 47, baseType: !208, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!199, !200, !211}
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !212, line: 16, baseType: !213)
!212 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !212, line: 16, flags: DIFlagFwdDecl)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !193, file: !185, line: 48, baseType: !216, size: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!199, !219}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !193, file: !185, line: 49, baseType: !221, size: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!199, !200, !224, !200}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !193, file: !185, line: 50, baseType: !227, size: 64, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!199, !200, !224, !219}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !193, file: !185, line: 51, baseType: !231, size: 64, offset: 320)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!199, !200, !224, !234}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{null}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !193, file: !185, line: 52, baseType: !238, size: 64, offset: 384)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!199, !200, !224, !241}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!242 = !{!243}
!243 = !DISubrange(count: 1)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !186, file: !185, line: 76, baseType: !203, size: 64, offset: 512)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !186, file: !185, line: 77, baseType: !151, size: 32, offset: 576)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !186, file: !185, line: 78, baseType: !247, size: 64, offset: 640)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !248)
!248 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !186, file: !185, line: 78, baseType: !247, size: 64, offset: 704)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !186, file: !185, line: 78, baseType: !247, size: 64, offset: 768)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !186, file: !185, line: 78, baseType: !247, size: 64, offset: 832)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !186, file: !185, line: 79, baseType: !253, size: 64, offset: 896)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !256, line: 27, baseType: !257)
!256 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !258, line: 43, baseType: !259)
!258 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!259 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !186, file: !185, line: 80, baseType: !151, size: 32, offset: 960)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !186, file: !185, line: 81, baseType: !262, size: 32, offset: 992)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !186, file: !185, line: 82, baseType: !264, size: 64, offset: 1024)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !186, file: !185, line: 83, baseType: !268, size: 64, offset: 1088)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !186, file: !185, line: 84, baseType: !161, size: 64, offset: 1152)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !186, file: !185, line: 85, baseType: !161, size: 64, offset: 1216)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !186, file: !185, line: 86, baseType: !161, size: 64, offset: 1280)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !186, file: !185, line: 87, baseType: !161, size: 64, offset: 1344)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !186, file: !185, line: 88, baseType: !200, size: 64, offset: 1408)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !186, file: !185, line: 89, baseType: !253, size: 64, offset: 1472)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !186, file: !185, line: 90, baseType: !161, size: 64, offset: 1536)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !186, file: !185, line: 91, baseType: !161, size: 64, offset: 1600)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !186, file: !185, line: 92, baseType: !151, size: 32, offset: 1664)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !186, file: !185, line: 93, baseType: !281, size: 64, offset: 1728)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !186, file: !185, line: 94, baseType: !283, size: 64, offset: 1792)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !254)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !186, file: !185, line: 95, baseType: !151, size: 32, offset: 1856)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !186, file: !185, line: 95, baseType: !151, size: 32, offset: 1888)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !186, file: !185, line: 96, baseType: !287, size: 64, offset: 1920)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !186, file: !185, line: 96, baseType: !287, size: 64, offset: 1984)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !186, file: !185, line: 97, baseType: !165, size: 64, offset: 2048)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !186, file: !185, line: 97, baseType: !291, size: 64, offset: 2112)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !186, file: !185, line: 98, baseType: !151, size: 32, offset: 2176)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !186, file: !185, line: 98, baseType: !151, size: 32, offset: 2208)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !186, file: !185, line: 99, baseType: !287, size: 64, offset: 2240)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !186, file: !185, line: 99, baseType: !287, size: 64, offset: 2304)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !186, file: !185, line: 100, baseType: !297, size: 64, offset: 2368)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !248)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !186, file: !185, line: 100, baseType: !300, size: 64, offset: 2432)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !186, file: !185, line: 101, baseType: !151, size: 32, offset: 2496)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !186, file: !185, line: 101, baseType: !151, size: 32, offset: 2528)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !186, file: !185, line: 102, baseType: !287, size: 64, offset: 2560)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !186, file: !185, line: 102, baseType: !287, size: 64, offset: 2624)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !186, file: !185, line: 103, baseType: !306, size: 64, offset: 2688)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !298)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !186, file: !185, line: 103, baseType: !309, size: 64, offset: 2752)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !186, file: !185, line: 104, baseType: !241, size: 64, offset: 2816)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !186, file: !185, line: 105, baseType: !151, size: 32, offset: 2880)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !186, file: !185, line: 106, baseType: !313, size: 128, offset: 2944)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 128, elements: !320)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !185, line: 64, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !185, line: 61, size: 128, elements: !317)
!317 = !{!318, !319}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !316, file: !185, line: 62, baseType: !234, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !316, file: !185, line: 63, baseType: !281, size: 64, offset: 64)
!320 = !{!321}
!321 = !DISubrange(count: 2)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !186, file: !185, line: 107, baseType: !323, size: 64, offset: 3072)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 64, elements: !320)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !186, file: !185, line: 108, baseType: !281, size: 64, offset: 3136)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !186, file: !185, line: 109, baseType: !326, size: 64, offset: 3200)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!199, !281}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !186, file: !185, line: 111, baseType: !151, size: 32, offset: 3264)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !186, file: !185, line: 112, baseType: !331, size: 320, offset: 3328)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 320, elements: !376)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!199, !335, !200, !281}
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !338)
!338 = !{!339, !340, !364, !365, !366, !367, !368, !369, !370, !371, !372}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !337, file: !10, line: 100, baseType: !151, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !337, file: !10, line: 101, baseType: !341, size: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !344)
!344 = !{!345, !346, !347, !348, !349, !352, !353, !354, !358, !359, !361, !362, !363}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !343, file: !10, line: 84, baseType: !161, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !343, file: !10, line: 85, baseType: !161, size: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !343, file: !10, line: 86, baseType: !281, size: 64, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !343, file: !10, line: 87, baseType: !264, size: 64, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !343, file: !10, line: 88, baseType: !350, size: 64, offset: 256)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !224)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !343, file: !10, line: 89, baseType: !162, size: 8, offset: 320)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !343, file: !10, line: 90, baseType: !161, size: 64, offset: 384)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !343, file: !10, line: 91, baseType: !355, size: 64, offset: 448)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !356, line: 46, baseType: !357)
!356 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!357 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !343, file: !10, line: 92, baseType: !147, size: 32, offset: 512)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !343, file: !10, line: 93, baseType: !360, size: 32, offset: 544)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !343, file: !10, line: 94, baseType: !341, size: 64, offset: 576)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !343, file: !10, line: 95, baseType: !161, size: 64, offset: 640)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !343, file: !10, line: 96, baseType: !281, size: 64, offset: 704)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !337, file: !10, line: 102, baseType: !161, size: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !337, file: !10, line: 102, baseType: !161, size: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !337, file: !10, line: 103, baseType: !161, size: 64, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !337, file: !10, line: 104, baseType: !203, size: 64, offset: 320)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !337, file: !10, line: 105, baseType: !147, size: 32, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !337, file: !10, line: 105, baseType: !147, size: 32, offset: 416)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !337, file: !10, line: 105, baseType: !147, size: 32, offset: 448)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !337, file: !10, line: 106, baseType: !200, size: 64, offset: 512)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !337, file: !10, line: 107, baseType: !373, size: 64, offset: 576)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!376 = !{!377}
!377 = !DISubrange(count: 5)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !186, file: !185, line: 113, baseType: !379, size: 320, offset: 3648)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 320, elements: !376)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!199, !200, !281}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !186, file: !185, line: 114, baseType: !384, size: 320, offset: 3968)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 320, elements: !376)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !186, file: !185, line: 115, baseType: !147, size: 32, offset: 4288)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !186, file: !185, line: 120, baseType: !373, size: 64, offset: 4352)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !186, file: !185, line: 121, baseType: !147, size: 32, offset: 4416)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !180, file: !181, line: 39, baseType: !389, size: 1088, offset: 4480)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 1088, elements: !242)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SNESOps", file: !181, line: 12, size: 1088, elements: !391)
!391 = !{!392, !399, !403, !407, !413, !414, !418, !419, !423, !427, !428, !429, !434, !438, !442, !446, !453}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "computeinitialguess", scope: !390, file: !181, line: 13, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!199, !178, !396, !281}
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !92, line: 21, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !92, line: 21, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "computescaling", scope: !390, file: !181, line: 14, baseType: !400, size: 64, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!199, !396, !396, !281}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !390, file: !181, line: 15, baseType: !404, size: 64, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!199, !178, !151}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !390, file: !181, line: 16, baseType: !408, size: 64, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!199, !178, !151, !298, !298, !298, !411, !281}
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESConvergedReason", file: !25, line: 257, baseType: !24)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !390, file: !181, line: 17, baseType: !326, size: 64, offset: 256)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !390, file: !181, line: 18, baseType: !415, size: 64, offset: 320)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!199, !178}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !390, file: !181, line: 19, baseType: !415, size: 64, offset: 384)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !390, file: !181, line: 20, baseType: !420, size: 64, offset: 448)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!199, !178, !211}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !390, file: !181, line: 21, baseType: !424, size: 64, offset: 512)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!199, !335, !178}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !390, file: !181, line: 22, baseType: !415, size: 64, offset: 576)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !390, file: !181, line: 23, baseType: !415, size: 64, offset: 640)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "usercompute", scope: !390, file: !181, line: 24, baseType: !430, size: 64, offset: 704)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!199, !178, !433}
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "userdestroy", scope: !390, file: !181, line: 25, baseType: !435, size: 64, offset: 768)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!199, !433}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !390, file: !181, line: 26, baseType: !439, size: 64, offset: 832)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!199, !178, !396, !396}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "computepfunction", scope: !390, file: !181, line: 27, baseType: !443, size: 64, offset: 896)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!199, !178, !396, !396, !281}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "computepjacobian", scope: !390, file: !181, line: 28, baseType: !447, size: 64, offset: 960)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!199, !178, !396, !450, !450, !281}
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !53, line: 16, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !53, line: 16, flags: DIFlagFwdDecl)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !390, file: !181, line: 29, baseType: !420, size: 64, offset: 1024)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !180, file: !181, line: 40, baseType: !455, size: 64, offset: 5568)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !456, line: 14, baseType: !457)
!456 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !456, line: 14, flags: DIFlagFwdDecl)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !180, file: !181, line: 41, baseType: !147, size: 32, offset: 5632)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "npc", scope: !180, file: !181, line: 42, baseType: !178, size: 64, offset: 5696)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "npcside", scope: !180, file: !181, line: 43, baseType: !462, size: 32, offset: 5760)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !46, line: 85, baseType: !45)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "usesnpc", scope: !180, file: !181, line: 44, baseType: !147, size: 32, offset: 5792)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !180, file: !181, line: 47, baseType: !281, size: 64, offset: 5824)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !180, file: !181, line: 49, baseType: !396, size: 64, offset: 5888)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !180, file: !181, line: 50, baseType: !396, size: 64, offset: 5952)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !180, file: !181, line: 52, baseType: !396, size: 64, offset: 6016)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !180, file: !181, line: 54, baseType: !450, size: 64, offset: 6080)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !180, file: !181, line: 55, baseType: !450, size: 64, offset: 6144)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "picard", scope: !180, file: !181, line: 56, baseType: !450, size: 64, offset: 6208)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "initialguessP", scope: !180, file: !181, line: 57, baseType: !281, size: 64, offset: 6272)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !180, file: !181, line: 58, baseType: !473, size: 64, offset: 6336)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !474, line: 22, baseType: !475)
!474 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !474, line: 22, flags: DIFlagFwdDecl)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !180, file: !181, line: 59, baseType: !478, size: 64, offset: 6400)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearch", file: !25, line: 526, baseType: !479)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_LineSearch", file: !25, line: 526, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "usesksp", scope: !180, file: !181, line: 60, baseType: !147, size: 32, offset: 6464)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "matstruct", scope: !180, file: !181, line: 61, baseType: !483, size: 32, offset: 6496)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !53, line: 285, baseType: !52)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_update", scope: !180, file: !181, line: 63, baseType: !396, size: 64, offset: 6528)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "scaling", scope: !180, file: !181, line: 65, baseType: !396, size: 64, offset: 6592)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "scaP", scope: !180, file: !181, line: 66, baseType: !281, size: 64, offset: 6656)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !180, file: !181, line: 68, baseType: !298, size: 64, offset: 6720)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !180, file: !181, line: 74, baseType: !489, size: 320, offset: 6784)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 320, elements: !376)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{!199, !178, !151, !298, !281}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !180, file: !181, line: 75, baseType: !494, size: 320, offset: 7104)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 320, elements: !376)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !180, file: !181, line: 76, baseType: !384, size: 320, offset: 7424)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !180, file: !181, line: 77, baseType: !151, size: 32, offset: 7744)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !180, file: !181, line: 78, baseType: !281, size: 64, offset: 7808)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !180, file: !181, line: 79, baseType: !412, size: 32, offset: 7872)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !180, file: !181, line: 80, baseType: !500, size: 320, offset: 7936)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 320, elements: !376)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!199, !178, !281}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !180, file: !181, line: 81, baseType: !494, size: 320, offset: 8256)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !180, file: !181, line: 82, baseType: !384, size: 320, offset: 8576)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !180, file: !181, line: 83, baseType: !151, size: 32, offset: 8896)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !180, file: !181, line: 84, baseType: !147, size: 32, offset: 8928)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !180, file: !181, line: 88, baseType: !147, size: 32, offset: 8960)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !180, file: !181, line: 89, baseType: !281, size: 64, offset: 9024)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !180, file: !181, line: 93, baseType: !151, size: 32, offset: 9088)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !180, file: !181, line: 94, baseType: !151, size: 32, offset: 9120)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !180, file: !181, line: 95, baseType: !151, size: 32, offset: 9152)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !180, file: !181, line: 96, baseType: !151, size: 32, offset: 9184)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "linear_its", scope: !180, file: !181, line: 97, baseType: !151, size: 32, offset: 9216)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !180, file: !181, line: 98, baseType: !298, size: 64, offset: 9280)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !180, file: !181, line: 99, baseType: !298, size: 64, offset: 9344)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !180, file: !181, line: 100, baseType: !298, size: 64, offset: 9408)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !180, file: !181, line: 101, baseType: !298, size: 64, offset: 9472)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !180, file: !181, line: 102, baseType: !298, size: 64, offset: 9536)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !180, file: !181, line: 103, baseType: !298, size: 64, offset: 9600)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "stol", scope: !180, file: !181, line: 104, baseType: !298, size: 64, offset: 9664)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "deltatol", scope: !180, file: !181, line: 105, baseType: !298, size: 64, offset: 9728)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "forceiteration", scope: !180, file: !181, line: 106, baseType: !147, size: 32, offset: 9792)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "lagpreconditioner", scope: !180, file: !181, line: 107, baseType: !151, size: 32, offset: 9824)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "lagjacobian", scope: !180, file: !181, line: 108, baseType: !151, size: 32, offset: 9856)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "jac_iter", scope: !180, file: !181, line: 109, baseType: !151, size: 32, offset: 9888)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "lagjac_persist", scope: !180, file: !181, line: 110, baseType: !147, size: 32, offset: 9920)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "pre_iter", scope: !180, file: !181, line: 111, baseType: !151, size: 32, offset: 9952)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "lagpre_persist", scope: !180, file: !181, line: 112, baseType: !147, size: 32, offset: 9984)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "gridsequence", scope: !180, file: !181, line: 113, baseType: !151, size: 32, offset: 10016)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "tolerancesset", scope: !180, file: !181, line: 115, baseType: !147, size: 32, offset: 10048)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_init_set", scope: !180, file: !181, line: 117, baseType: !147, size: 32, offset: 10080)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "normschedule", scope: !180, file: !181, line: 119, baseType: !534, size: 32, offset: 10112)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESNormSchedule", file: !25, line: 411, baseType: !59)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !180, file: !181, line: 120, baseType: !536, size: 32, offset: 10144)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESFunctionType", file: !25, line: 495, baseType: !67)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !180, file: !181, line: 124, baseType: !151, size: 32, offset: 10176)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !180, file: !181, line: 125, baseType: !539, size: 64, offset: 10240)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !180, file: !181, line: 129, baseType: !151, size: 32, offset: 10304)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist", scope: !180, file: !181, line: 130, baseType: !297, size: 64, offset: 10368)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_its", scope: !180, file: !181, line: 132, baseType: !165, size: 64, offset: 10432)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_len", scope: !180, file: !181, line: 133, baseType: !151, size: 32, offset: 10496)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_max", scope: !180, file: !181, line: 134, baseType: !151, size: 32, offset: 10528)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_reset", scope: !180, file: !181, line: 135, baseType: !147, size: 32, offset: 10560)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_alloc", scope: !180, file: !181, line: 136, baseType: !147, size: 32, offset: 10592)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "counters_reset", scope: !180, file: !181, line: 137, baseType: !147, size: 32, offset: 10624)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "numFailures", scope: !180, file: !181, line: 140, baseType: !151, size: 32, offset: 10656)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "maxFailures", scope: !180, file: !181, line: 141, baseType: !151, size: 32, offset: 10688)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "numLinearSolveFailures", scope: !180, file: !181, line: 143, baseType: !151, size: 32, offset: 10720)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "maxLinearSolveFailures", scope: !180, file: !181, line: 144, baseType: !151, size: 32, offset: 10752)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "domainerror", scope: !180, file: !181, line: 146, baseType: !147, size: 32, offset: 10784)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "jacobiandomainerror", scope: !180, file: !181, line: 147, baseType: !147, size: 32, offset: 10816)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "checkjacdomainerror", scope: !180, file: !181, line: 148, baseType: !147, size: 32, offset: 10848)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_ewconv", scope: !180, file: !181, line: 150, baseType: !147, size: 32, offset: 10880)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "kspconvctx", scope: !180, file: !181, line: 151, baseType: !281, size: 64, offset: 10944)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !180, file: !181, line: 154, baseType: !298, size: 64, offset: 11008)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !180, file: !181, line: 155, baseType: !298, size: 64, offset: 11072)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "vwork", scope: !180, file: !181, line: 157, baseType: !539, size: 64, offset: 11136)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "nvwork", scope: !180, file: !181, line: 158, baseType: !151, size: 32, offset: 11200)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !180, file: !181, line: 160, baseType: !147, size: 32, offset: 11232)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "mf_operator", scope: !180, file: !181, line: 161, baseType: !147, size: 32, offset: 11264)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "mf_version", scope: !180, file: !181, line: 162, baseType: !151, size: 32, offset: 11296)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "vizerotolerance", scope: !180, file: !181, line: 164, baseType: !298, size: 64, offset: 11328)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "xl", scope: !180, file: !181, line: 165, baseType: !396, size: 64, offset: 11392)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "xu", scope: !180, file: !181, line: 165, baseType: !396, size: 64, offset: 11456)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "ntruebounds", scope: !180, file: !181, line: 166, baseType: !151, size: 32, offset: 11520)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "usersetbounds", scope: !180, file: !181, line: 167, baseType: !147, size: 32, offset: 11552)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "alwayscomputesfinalresidual", scope: !180, file: !181, line: 169, baseType: !147, size: 32, offset: 11584)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !158, file: !143, line: 12, baseType: !396, size: 64, offset: 384)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !158, file: !143, line: 13, baseType: !156, size: 64, offset: 448)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !158, file: !143, line: 13, baseType: !156, size: 64, offset: 512)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !204, line: 331, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !204, line: 331, flags: DIFlagFwdDecl)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !204, line: 338, baseType: !577)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !204, line: 338, flags: DIFlagFwdDecl)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !580, line: 1451, baseType: !234)
!580 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEnum", file: !4, line: 58, baseType: !137)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!584 = !{i32 7, !"Dwarf Version", i32 4}
!585 = !{i32 2, !"Debug Info Version", i32 3}
!586 = !{i32 1, !"wchar_size", i32 4}
!587 = !{i32 7, !"PIC Level", i32 2}
!588 = !{i32 7, !"uwtable", i32 1}
!589 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!590 = distinct !DISubprogram(name: "SNESReset_Multiblock", scope: !143, file: !143, line: 26, type: !416, scopeLine: 27, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !591)
!591 = !{!592, !593, !594, !595, !596, !597, !600, !602}
!592 = !DILocalVariable(name: "snes", arg: 1, scope: !590, file: !143, line: 26, type: !178)
!593 = !DILocalVariable(name: "mb", scope: !590, file: !143, line: 28, type: !141)
!594 = !DILocalVariable(name: "blocks", scope: !590, file: !143, line: 29, type: !156)
!595 = !DILocalVariable(name: "next", scope: !590, file: !143, line: 29, type: !156)
!596 = !DILocalVariable(name: "ierr", scope: !590, file: !143, line: 30, type: !199)
!597 = !DILocalVariable(name: "ierr__", scope: !598, file: !143, line: 34, type: !199)
!598 = distinct !DILexicalBlock(scope: !599, file: !143, line: 34, column: 36)
!599 = distinct !DILexicalBlock(scope: !590, file: !143, line: 33, column: 18)
!600 = !DILocalVariable(name: "ierr__", scope: !601, file: !143, line: 38, type: !199)
!601 = distinct !DILexicalBlock(scope: !599, file: !143, line: 38, column: 47)
!602 = !DILocalVariable(name: "ierr__", scope: !603, file: !143, line: 39, type: !199)
!603 = distinct !DILexicalBlock(scope: !599, file: !143, line: 39, column: 37)
!604 = !DILocation(line: 0, scope: !590)
!605 = !DILocation(line: 28, column: 53, scope: !590)
!606 = !{!607, !612, i64 1128}
