; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/color/impls/minpack/color.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/color/impls/minpack/color.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct._p_MatColoring = type { %struct._p_PetscObject, [1 x %struct._MatColoringOps], %struct._p_Mat*, i32, i32, i8*, i32, i32, double*, i32*, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!271 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_SPT", value: 134, isUnsigned: true)
!272 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_DEN", value: 135, isUnsigned: true)
!273 = !DIEnumerator(name: "MATOP_RART", value: 136, isUnsigned: true)
!274 = !DIEnumerator(name: "MATOP_RART_SYMBOLIC", value: 137, isUnsigned: true)
!275 = !DIEnumerator(name: "MATOP_RART_NUMERIC", value: 138, isUnsigned: true)
!276 = !DIEnumerator(name: "MATOP_SET_BLOCK_SIZES", value: 139, isUnsigned: true)
!277 = !DIEnumerator(name: "MATOP_AYPX", value: 140, isUnsigned: true)
!278 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!279 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!280 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!281 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!282 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!283 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!284 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !62, line: 161, baseType: !5, size: 32, elements: !285)
!285 = !{!286, !287, !288, !289, !290, !291, !292, !293}
!286 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!287 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!288 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!289 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!290 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!291 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!292 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!293 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !62, line: 1265, baseType: !5, size: 32, elements: !295)
!295 = !{!296, !297, !298}
!296 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!297 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!298 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!299 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !62, line: 1203, baseType: !5, size: 32, elements: !300)
!300 = !{!301, !302, !303, !304, !305}
!301 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!302 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!303 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!304 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!305 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!306 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !62, line: 187, baseType: !5, size: 32, elements: !307)
!307 = !{!308, !309, !310, !311, !312, !313, !314}
!308 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!309 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!310 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!311 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!312 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!313 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!314 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!315 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !62, line: 1345, baseType: !5, size: 32, elements: !316)
!316 = !{!317, !318, !319, !320}
!317 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_RANDOM", value: 0, isUnsigned: true)
!318 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_LEXICAL", value: 1, isUnsigned: true)
!319 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_LF", value: 2, isUnsigned: true)
!320 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_SL", value: 3, isUnsigned: true)
!321 = !{!322, !325, !329, !330, !333, !415, !98, !530, !531}
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !323, line: 46, baseType: !324)
!323 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!324 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !326, line: 330, baseType: !327)
!326 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !326, line: 330, flags: DIFlagFwdDecl)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !332)
!332 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !336, line: 73, size: 4480, elements: !337)
!336 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!337 = !{!338, !340, !386, !387, !389, !392, !393, !394, !395, !403, !404, !406, !410, !414, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !427, !428, !429, !431, !432, !434, !436, !437, !438, !439, !440, !443, !445, !446, !447, !448, !449, !452, !454, !455, !456, !466, !468, !469, !473, !474, !520, !525, !527, !528, !529}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !335, file: !336, line: 74, baseType: !339, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !98)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !335, file: !336, line: 75, baseType: !341, size: 448, offset: 64)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 448, elements: !384)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !336, line: 53, baseType: !343)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !336, line: 45, size: 448, elements: !344)
!344 = !{!345, !351, !359, !364, !368, !372, !379}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !343, file: !336, line: 46, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!349, !333, !350}
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !98)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !343, file: !336, line: 47, baseType: !352, size: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!349, !333, !355}
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !356, line: 16, baseType: !357)
!356 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !356, line: 16, flags: DIFlagFwdDecl)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !343, file: !336, line: 48, baseType: !360, size: 64, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!349, !363}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !343, file: !336, line: 49, baseType: !365, size: 64, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!349, !333, !330, !333}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !343, file: !336, line: 50, baseType: !369, size: 64, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!349, !333, !330, !363}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !343, file: !336, line: 51, baseType: !373, size: 64, offset: 320)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!349, !333, !330, !376}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{null}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !343, file: !336, line: 52, baseType: !380, size: 64, offset: 384)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!349, !333, !330, !383}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!384 = !{!385}
!385 = !DISubrange(count: 1)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !335, file: !336, line: 76, baseType: !325, size: 64, offset: 512)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !335, file: !336, line: 77, baseType: !388, size: 32, offset: 576)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !98)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !335, file: !336, line: 78, baseType: !390, size: 64, offset: 640)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !391)
!391 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !335, file: !336, line: 78, baseType: !390, size: 64, offset: 704)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !335, file: !336, line: 78, baseType: !390, size: 64, offset: 768)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !335, file: !336, line: 78, baseType: !390, size: 64, offset: 832)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !335, file: !336, line: 79, baseType: !396, size: 64, offset: 896)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !399, line: 27, baseType: !400)
!399 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !401, line: 43, baseType: !402)
!401 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!402 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !335, file: !336, line: 80, baseType: !388, size: 32, offset: 960)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !335, file: !336, line: 81, baseType: !405, size: 32, offset: 992)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !98)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !335, file: !336, line: 82, baseType: !407, size: 64, offset: 1024)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !335, file: !336, line: 83, baseType: !411, size: 64, offset: 1088)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !335, file: !336, line: 84, baseType: !415, size: 64, offset: 1152)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !335, file: !336, line: 85, baseType: !415, size: 64, offset: 1216)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !335, file: !336, line: 86, baseType: !415, size: 64, offset: 1280)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !335, file: !336, line: 87, baseType: !415, size: 64, offset: 1344)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !335, file: !336, line: 88, baseType: !333, size: 64, offset: 1408)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !335, file: !336, line: 89, baseType: !396, size: 64, offset: 1472)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !335, file: !336, line: 90, baseType: !415, size: 64, offset: 1536)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !335, file: !336, line: 91, baseType: !415, size: 64, offset: 1600)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !335, file: !336, line: 92, baseType: !388, size: 32, offset: 1664)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !335, file: !336, line: 93, baseType: !329, size: 64, offset: 1728)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !335, file: !336, line: 94, baseType: !426, size: 64, offset: 1792)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !397)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !335, file: !336, line: 95, baseType: !388, size: 32, offset: 1856)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !335, file: !336, line: 95, baseType: !388, size: 32, offset: 1888)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !335, file: !336, line: 96, baseType: !430, size: 64, offset: 1920)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !335, file: !336, line: 96, baseType: !430, size: 64, offset: 1984)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !335, file: !336, line: 97, baseType: !433, size: 64, offset: 2048)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !335, file: !336, line: 97, baseType: !435, size: 64, offset: 2112)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !335, file: !336, line: 98, baseType: !388, size: 32, offset: 2176)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !335, file: !336, line: 98, baseType: !388, size: 32, offset: 2208)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !335, file: !336, line: 99, baseType: !430, size: 64, offset: 2240)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !335, file: !336, line: 99, baseType: !430, size: 64, offset: 2304)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !335, file: !336, line: 100, baseType: !441, size: 64, offset: 2368)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !391)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !335, file: !336, line: 100, baseType: !444, size: 64, offset: 2432)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !335, file: !336, line: 101, baseType: !388, size: 32, offset: 2496)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !335, file: !336, line: 101, baseType: !388, size: 32, offset: 2528)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !335, file: !336, line: 102, baseType: !430, size: 64, offset: 2560)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !335, file: !336, line: 102, baseType: !430, size: 64, offset: 2624)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !335, file: !336, line: 103, baseType: !450, size: 64, offset: 2688)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !442)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !335, file: !336, line: 103, baseType: !453, size: 64, offset: 2752)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !335, file: !336, line: 104, baseType: !383, size: 64, offset: 2816)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !335, file: !336, line: 105, baseType: !388, size: 32, offset: 2880)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !335, file: !336, line: 106, baseType: !457, size: 128, offset: 2944)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !458, size: 128, elements: !464)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !336, line: 64, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !336, line: 61, size: 128, elements: !461)
!461 = !{!462, !463}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !460, file: !336, line: 62, baseType: !376, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !460, file: !336, line: 63, baseType: !329, size: 64, offset: 64)
!464 = !{!465}
!465 = !DISubrange(count: 2)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !335, file: !336, line: 107, baseType: !467, size: 64, offset: 3072)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 64, elements: !464)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !335, file: !336, line: 108, baseType: !329, size: 64, offset: 3136)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !335, file: !336, line: 109, baseType: !470, size: 64, offset: 3200)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!349, !329}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !335, file: !336, line: 111, baseType: !388, size: 32, offset: 3264)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !335, file: !336, line: 112, baseType: !475, size: 320, offset: 3328)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !476, size: 320, elements: !518)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!349, !479, !333, !329}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !16, line: 108, baseType: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !16, line: 99, size: 640, elements: !482)
!482 = !{!483, !484, !506, !507, !508, !509, !510, !511, !512, !513, !514}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !481, file: !16, line: 100, baseType: !388, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !481, file: !16, line: 101, baseType: !485, size: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !16, line: 82, baseType: !486)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !16, line: 83, size: 768, elements: !488)
!488 = !{!489, !490, !491, !492, !493, !496, !497, !498, !499, !501, !503, !504, !505}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !487, file: !16, line: 84, baseType: !415, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !487, file: !16, line: 85, baseType: !415, size: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !487, file: !16, line: 86, baseType: !329, size: 64, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !487, file: !16, line: 87, baseType: !407, size: 64, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !487, file: !16, line: 88, baseType: !494, size: 64, offset: 256)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !330)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !487, file: !16, line: 89, baseType: !332, size: 8, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !487, file: !16, line: 90, baseType: !415, size: 64, offset: 384)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !487, file: !16, line: 91, baseType: !322, size: 64, offset: 448)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !487, file: !16, line: 92, baseType: !500, size: 32, offset: 512)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !487, file: !16, line: 93, baseType: !502, size: 32, offset: 544)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !16, line: 81, baseType: !15)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !487, file: !16, line: 94, baseType: !485, size: 64, offset: 576)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !487, file: !16, line: 95, baseType: !415, size: 64, offset: 640)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !487, file: !16, line: 96, baseType: !329, size: 64, offset: 704)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !481, file: !16, line: 102, baseType: !415, size: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !481, file: !16, line: 102, baseType: !415, size: 64, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !481, file: !16, line: 103, baseType: !415, size: 64, offset: 256)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !481, file: !16, line: 104, baseType: !325, size: 64, offset: 320)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !481, file: !16, line: 105, baseType: !500, size: 32, offset: 384)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !481, file: !16, line: 105, baseType: !500, size: 32, offset: 416)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !481, file: !16, line: 105, baseType: !500, size: 32, offset: 448)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !481, file: !16, line: 106, baseType: !333, size: 64, offset: 512)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !481, file: !16, line: 107, baseType: !515, size: 64, offset: 576)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !16, line: 10, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !16, line: 10, flags: DIFlagFwdDecl)
!518 = !{!519}
!519 = !DISubrange(count: 5)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !335, file: !336, line: 113, baseType: !521, size: 320, offset: 3648)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !522, size: 320, elements: !518)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!349, !333, !329}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !335, file: !336, line: 114, baseType: !526, size: 320, offset: 3968)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 320, elements: !518)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !335, file: !336, line: 115, baseType: !500, size: 32, offset: 4288)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !335, file: !336, line: 120, baseType: !515, size: 64, offset: 4352)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !335, file: !336, line: 121, baseType: !500, size: 32, offset: 4416)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !36, line: 215, baseType: !532)
!532 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!533 = !{i32 7, !"Dwarf Version", i32 4}
!534 = !{i32 2, !"Debug Info Version", i32 3}
!535 = !{i32 1, !"wchar_size", i32 4}
!536 = !{i32 7, !"PIC Level", i32 2}
!537 = !{i32 7, !"uwtable", i32 1}
!538 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!539 = distinct !DISubprogram(name: "MatFDColoringDegreeSequence_Minpack", scope: !540, file: !540, line: 14, type: !541, scopeLine: 15, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !545)
!540 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/color/impls/minpack/color.c", directory: "/home/users/ndemeye/xSDK")
!541 = !DISubroutineType(types: !542)
!542 = !{!349, !388, !543, !543, !543, !543, !435}
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !388)
!545 = !{!546, !547, !548, !549, !550, !551, !552, !553, !554, !556, !558}
!546 = !DILocalVariable(name: "m", arg: 1, scope: !539, file: !540, line: 14, type: !388)
!547 = !DILocalVariable(name: "cja", arg: 2, scope: !539, file: !540, line: 14, type: !543)
!548 = !DILocalVariable(name: "cia", arg: 3, scope: !539, file: !540, line: 14, type: !543)
!549 = !DILocalVariable(name: "rja", arg: 4, scope: !539, file: !540, line: 14, type: !543)
!550 = !DILocalVariable(name: "ria", arg: 5, scope: !539, file: !540, line: 14, type: !543)
!551 = !DILocalVariable(name: "seq", arg: 6, scope: !539, file: !540, line: 14, type: !435)
!552 = !DILocalVariable(name: "work", scope: !539, file: !540, line: 16, type: !433)
!553 = !DILocalVariable(name: "ierr", scope: !539, file: !540, line: 17, type: !349)
!554 = !DILocalVariable(name: "ierr__", scope: !555, file: !540, line: 20, type: !349)
!555 = distinct !DILexicalBlock(scope: !539, file: !540, line: 20, column: 32)
!556 = !DILocalVariable(name: "ierr__", scope: !557, file: !540, line: 21, type: !349)
!557 = distinct !DILexicalBlock(scope: !539, file: !540, line: 21, column: 30)
!558 = !DILocalVariable(name: "ierr__", scope: !559, file: !540, line: 25, type: !349)
!559 = distinct !DILexicalBlock(scope: !539, file: !540, line: 25, column: 26)
!560 = !DILocation(line: 0, scope: !539)
!561 = !{!562, !562, i64 0}
!562 = !{!"int", !563, i64 0}
!563 = !{!"omnipotent char", !564, i64 0}
!564 = !{!"Simple C/C++ TBAA"}
!565 = !DILocation(line: 16, column: 3, scope: !539)
!566 = !DILocation(line: 19, column: 3, scope: !567)
!567 = distinct !DILexicalBlock(scope: !568, file: !540, line: 19, column: 3)
!568 = distinct !DILexicalBlock(scope: !569, file: !540, line: 19, column: 3)
!569 = distinct !DILexicalBlock(scope: !539, file: !540, line: 19, column: 3)
!570 = !{!571, !571, i64 0}
!571 = !{!"any pointer", !563, i64 0}
!572 = !DILocation(line: 19, column: 3, scope: !568)
!573 = !DILocation(line: 19, column: 3, scope: !574)
!574 = distinct !DILexicalBlock(scope: !575, file: !540, line: 19, column: 3)
!575 = distinct !DILexicalBlock(scope: !567, file: !540, line: 19, column: 3)
!576 = !{!577, !562, i64 1536}
!577 = !{!"", !563, i64 0, !563, i64 512, !563, i64 1024, !563, i64 1280, !562, i64 1536, !562, i64 1540, !563, i64 1544}
!578 = !DILocation(line: 19, column: 3, scope: !575)
!579 = !DILocation(line: 19, column: 3, scope: !580)
!580 = distinct !DILexicalBlock(scope: !574, file: !540, line: 19, column: 3)
!581 = !DILocation(line: 20, column: 10, scope: !539)
!582 = !{!577, !562, i64 1540}
!583 = !DILocation(line: 0, scope: !555)
!584 = !DILocation(line: 20, column: 32, scope: !585)
!585 = distinct !DILexicalBlock(scope: !555, file: !540, line: 20, column: 32)
!586 = !DILocation(line: 20, column: 32, scope: !555)
!587 = !{!"branch_weights", i32 2000, i32 1}
!588 = !DILocation(line: 21, column: 10, scope: !539)
!589 = !DILocation(line: 0, scope: !557)
!590 = !DILocation(line: 21, column: 30, scope: !591)
!591 = distinct !DILexicalBlock(scope: !557, file: !540, line: 21, column: 30)
!592 = !DILocation(line: 21, column: 30, scope: !557)
!593 = !DILocation(line: 23, column: 34, scope: !539)
!594 = !DILocation(line: 23, column: 39, scope: !539)
!595 = !DILocation(line: 23, column: 3, scope: !539)
!596 = !DILocation(line: 25, column: 10, scope: !539)
!597 = !DILocation(line: 0, scope: !559)
!598 = !DILocation(line: 25, column: 26, scope: !599)
!599 = distinct !DILexicalBlock(scope: !559, file: !540, line: 25, column: 26)
!600 = !DILocation(line: 26, column: 3, scope: !601)
!601 = distinct !DILexicalBlock(scope: !602, file: !540, line: 26, column: 3)
!602 = distinct !DILexicalBlock(scope: !603, file: !540, line: 26, column: 3)
!603 = distinct !DILexicalBlock(scope: !539, file: !540, line: 26, column: 3)
!604 = !DILocation(line: 26, column: 3, scope: !602)
!605 = !DILocation(line: 26, column: 3, scope: !606)
!606 = distinct !DILexicalBlock(scope: !607, file: !540, line: 26, column: 3)
!607 = distinct !DILexicalBlock(scope: !601, file: !540, line: 26, column: 3)
!608 = !DILocation(line: 26, column: 3, scope: !607)
!609 = !DILocation(line: 26, column: 3, scope: !610)
!610 = distinct !DILexicalBlock(scope: !611, file: !540, line: 26, column: 3)
!611 = distinct !DILexicalBlock(scope: !606, file: !540, line: 26, column: 3)
!612 = !{!577, !563, i64 1544}
!613 = !DILocation(line: 26, column: 3, scope: !611)
!614 = !DILocation(line: 26, column: 3, scope: !615)
!615 = distinct !DILexicalBlock(scope: !610, file: !540, line: 26, column: 3)
!616 = !DILocation(line: 26, column: 3, scope: !617)
!617 = distinct !DILexicalBlock(scope: !606, file: !540, line: 26, column: 3)
!618 = !DILocation(line: 26, column: 3, scope: !619)
!619 = distinct !DILexicalBlock(scope: !617, file: !540, line: 26, column: 3)
!620 = !DILocation(line: 26, column: 3, scope: !621)
!621 = distinct !DILexicalBlock(scope: !622, file: !540, line: 26, column: 3)
!622 = distinct !DILexicalBlock(scope: !619, file: !540, line: 26, column: 3)
!623 = !DILocation(line: 26, column: 3, scope: !622)
!624 = !DILocation(line: 26, column: 3, scope: !625)
!625 = distinct !DILexicalBlock(scope: !621, file: !540, line: 26, column: 3)
!626 = !DILocation(line: 27, column: 1, scope: !539)
!627 = !DISubprogram(name: "PetscMallocA", scope: !628, file: !628, line: 1288, type: !629, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !631)
!628 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!629 = !DISubroutineType(types: !630)
!630 = !{!349, !98, !3, !98, !330, !330, !324, !329, null}
!631 = !{}
!632 = !DISubprogram(name: "PetscError", scope: !10, file: !10, line: 668, type: !633, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !631)
!633 = !DISubroutineType(types: !634)
!634 = !{!349, !327, !98, !330, !330, !98, !9, !330, null}
!635 = !DISubprogram(name: "MINPACKdegr", scope: !636, file: !636, line: 9, type: !637, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !631)
!636 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/color/impls/minpack/color.h", directory: "/home/users/ndemeye/xSDK")
!637 = !DISubroutineType(types: !638)
!638 = !{!98, !639, !640, !640, !640, !640, !639, !639}
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!642 = distinct !DISubprogram(name: "MatFDColoringMinimumNumberofColors_Private", scope: !540, file: !540, line: 34, type: !643, scopeLine: 35, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !645)
!643 = !DISubroutineType(types: !644)
!644 = !{!349, !388, !433, !433}
!645 = !{!646, !647, !648, !649, !650}
!646 = !DILocalVariable(name: "m", arg: 1, scope: !642, file: !540, line: 34, type: !388)
!647 = !DILocalVariable(name: "ia", arg: 2, scope: !642, file: !540, line: 34, type: !433)
!648 = !DILocalVariable(name: "minc", arg: 3, scope: !642, file: !540, line: 34, type: !433)
!649 = !DILocalVariable(name: "i", scope: !642, file: !540, line: 36, type: !388)
!650 = !DILocalVariable(name: "c", scope: !642, file: !540, line: 36, type: !388)
!651 = !DILocation(line: 0, scope: !642)
!652 = !DILocation(line: 38, column: 3, scope: !653)
!653 = distinct !DILexicalBlock(scope: !654, file: !540, line: 38, column: 3)
!654 = distinct !DILexicalBlock(scope: !655, file: !540, line: 38, column: 3)
!655 = distinct !DILexicalBlock(scope: !642, file: !540, line: 38, column: 3)
!656 = !DILocation(line: 38, column: 3, scope: !654)
!657 = !DILocation(line: 38, column: 3, scope: !658)
!658 = distinct !DILexicalBlock(scope: !659, file: !540, line: 38, column: 3)
!659 = distinct !DILexicalBlock(scope: !653, file: !540, line: 38, column: 3)
!660 = !DILocation(line: 38, column: 3, scope: !659)
!661 = !DILocation(line: 38, column: 3, scope: !662)
!662 = distinct !DILexicalBlock(scope: !658, file: !540, line: 38, column: 3)
!663 = !DILocation(line: 39, column: 14, scope: !664)
!664 = distinct !DILexicalBlock(scope: !665, file: !540, line: 39, column: 3)
!665 = distinct !DILexicalBlock(scope: !642, file: !540, line: 39, column: 3)
!666 = !DILocation(line: 39, column: 3, scope: !665)
!667 = !DILocation(line: 39, column: 27, scope: !664)
!668 = distinct !{!668, !666, !669, !670, !671}
!669 = !DILocation(line: 39, column: 27, scope: !665)
!670 = !{!"llvm.loop.mustprogress"}
!671 = !{!"llvm.loop.isvectorized", i32 1}
!672 = distinct !{!672, !666, !669, !670, !673, !671}
!673 = !{!"llvm.loop.unroll.runtime.disable"}
!674 = !DILocation(line: 40, column: 9, scope: !642)
!675 = !DILocation(line: 41, column: 3, scope: !676)
!676 = distinct !DILexicalBlock(scope: !677, file: !540, line: 41, column: 3)
!677 = distinct !DILexicalBlock(scope: !678, file: !540, line: 41, column: 3)
!678 = distinct !DILexicalBlock(scope: !642, file: !540, line: 41, column: 3)
!679 = !DILocation(line: 41, column: 3, scope: !677)
!680 = !DILocation(line: 41, column: 3, scope: !681)
!681 = distinct !DILexicalBlock(scope: !682, file: !540, line: 41, column: 3)
!682 = distinct !DILexicalBlock(scope: !676, file: !540, line: 41, column: 3)
!683 = !DILocation(line: 41, column: 3, scope: !682)
!684 = !DILocation(line: 41, column: 3, scope: !685)
!685 = distinct !DILexicalBlock(scope: !686, file: !540, line: 41, column: 3)
!686 = distinct !DILexicalBlock(scope: !681, file: !540, line: 41, column: 3)
!687 = !DILocation(line: 41, column: 3, scope: !686)
!688 = !DILocation(line: 41, column: 3, scope: !689)
!689 = distinct !DILexicalBlock(scope: !685, file: !540, line: 41, column: 3)
!690 = !DILocation(line: 41, column: 3, scope: !691)
!691 = distinct !DILexicalBlock(scope: !681, file: !540, line: 41, column: 3)
!692 = !DILocation(line: 41, column: 3, scope: !693)
!693 = distinct !DILexicalBlock(scope: !691, file: !540, line: 41, column: 3)
!694 = !DILocation(line: 41, column: 3, scope: !695)
!695 = distinct !DILexicalBlock(scope: !696, file: !540, line: 41, column: 3)
!696 = distinct !DILexicalBlock(scope: !693, file: !540, line: 41, column: 3)
!697 = !DILocation(line: 41, column: 3, scope: !696)
!698 = !DILocation(line: 41, column: 3, scope: !699)
!699 = distinct !DILexicalBlock(scope: !695, file: !540, line: 41, column: 3)
!700 = !DILocation(line: 42, column: 1, scope: !642)
!701 = distinct !DISubprogram(name: "MatColoringCreate_SL", scope: !540, file: !540, line: 143, type: !702, scopeLine: 144, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1625)
!702 = !DISubroutineType(types: !703)
!703 = !{!349, !704}
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatColoring", file: !62, line: 1312, baseType: !705)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatColoring", file: !707, line: 647, size: 5248, elements: !708)
!707 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!708 = !{!709, !711, !885, !1616, !1617, !1618, !1619, !1620, !1622, !1623, !1624}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !706, file: !707, line: 648, baseType: !710, size: 4480)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !336, line: 122, baseType: !335)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !706, file: !707, line: 648, baseType: !712, size: 320, offset: 4480)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !713, size: 320, elements: !384)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatColoringOps", file: !707, line: 639, size: 320, elements: !714)
!714 = !{!715, !717, !721, !725, !881}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !713, file: !707, line: 640, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !713, file: !707, line: 641, baseType: !718, size: 64, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!349, !479, !704}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !713, file: !707, line: 642, baseType: !722, size: 64, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!349, !704, !355}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !713, file: !707, line: 643, baseType: !726, size: 64, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!349, !704, !729}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !731, line: 51, baseType: !732)
!731 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !41, line: 91, size: 384, elements: !734)
!734 = !{!735, !736, !737, !875, !876, !877, !878, !880}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !733, file: !41, line: 92, baseType: !388, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !733, file: !41, line: 93, baseType: !388, size: 32, offset: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "is", scope: !733, file: !41, line: 94, baseType: !738, size: 64, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !731, line: 11, baseType: !740)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !41, line: 50, size: 7104, elements: !742)
!742 = !{!743, !744, !808, !862, !863, !864, !865, !866, !867, !868, !869, !872}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !741, file: !41, line: 51, baseType: !710, size: 4480)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !741, file: !41, line: 51, baseType: !745, size: 1536, offset: 4480)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !746, size: 1536, elements: !384)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ISOps", file: !41, line: 21, size: 1536, elements: !747)
!747 = !{!748, !753, !754, !758, !762, !763, !768, !772, !773, !777, !778, !782, !783, !788, !792, !796, !800, !801, !802, !803, !804, !805, !806, !807}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "getindices", scope: !746, file: !41, line: 22, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!349, !739, !752}
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "restoreindices", scope: !746, file: !41, line: 23, baseType: !749, size: 64, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "invertpermutation", scope: !746, file: !41, line: 24, baseType: !755, size: 64, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{!349, !739, !388, !738}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "sort", scope: !746, file: !41, line: 25, baseType: !759, size: 64, offset: 192)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{!349, !739}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "sortremovedups", scope: !746, file: !41, line: 26, baseType: !759, size: 64, offset: 256)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "sorted", scope: !746, file: !41, line: 27, baseType: !764, size: 64, offset: 320)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{!349, !739, !767}
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !746, file: !41, line: 28, baseType: !769, size: 64, offset: 384)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{!349, !739, !738}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !746, file: !41, line: 29, baseType: !759, size: 64, offset: 448)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !746, file: !41, line: 30, baseType: !774, size: 64, offset: 512)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!349, !739, !355}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !746, file: !41, line: 31, baseType: !774, size: 64, offset: 576)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !746, file: !41, line: 32, baseType: !779, size: 64, offset: 640)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{!349, !739, !739}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "togeneral", scope: !746, file: !41, line: 33, baseType: !759, size: 64, offset: 704)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "oncomm", scope: !746, file: !41, line: 34, baseType: !784, size: 64, offset: 768)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{!349, !739, !325, !787, !738}
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscCopyMode", file: !4, line: 327, baseType: !30)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksize", scope: !746, file: !41, line: 35, baseType: !789, size: 64, offset: 832)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{!349, !739, !388}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "contiguous", scope: !746, file: !41, line: 36, baseType: !793, size: 64, offset: 896)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DISubroutineType(types: !795)
!795 = !{!349, !739, !388, !388, !433, !767}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "locate", scope: !746, file: !41, line: 37, baseType: !797, size: 64, offset: 960)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{!349, !739, !388, !433}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "sortedlocal", scope: !746, file: !41, line: 38, baseType: !764, size: 64, offset: 1024)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "sortedglobal", scope: !746, file: !41, line: 39, baseType: !764, size: 64, offset: 1088)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "uniquelocal", scope: !746, file: !41, line: 40, baseType: !764, size: 64, offset: 1152)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "uniqueglobal", scope: !746, file: !41, line: 41, baseType: !764, size: 64, offset: 1216)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "permlocal", scope: !746, file: !41, line: 42, baseType: !764, size: 64, offset: 1280)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "permglobal", scope: !746, file: !41, line: 43, baseType: !764, size: 64, offset: 1344)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "intervallocal", scope: !746, file: !41, line: 44, baseType: !764, size: 64, offset: 1408)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "intervalglobal", scope: !746, file: !41, line: 45, baseType: !764, size: 64, offset: 1472)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !741, file: !41, line: 52, baseType: !809, size: 64, offset: 6016)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !731, line: 60, baseType: !810)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !36, line: 240, size: 640, elements: !812)
!812 = !{!813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !858, !859, !860, !861}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !811, file: !36, line: 241, baseType: !325, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !811, file: !36, line: 242, baseType: !405, size: 32, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !811, file: !36, line: 243, baseType: !388, size: 32, offset: 96)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !811, file: !36, line: 243, baseType: !388, size: 32, offset: 128)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !811, file: !36, line: 244, baseType: !388, size: 32, offset: 160)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !811, file: !36, line: 244, baseType: !388, size: 32, offset: 192)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !811, file: !36, line: 245, baseType: !433, size: 64, offset: 256)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !811, file: !36, line: 246, baseType: !500, size: 32, offset: 320)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !811, file: !36, line: 247, baseType: !388, size: 32, offset: 352)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !811, file: !36, line: 251, baseType: !388, size: 32, offset: 384)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !811, file: !36, line: 252, baseType: !824, size: 64, offset: 448)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !731, line: 30, baseType: !825)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !41, line: 73, size: 5440, elements: !827)
!827 = !{!828, !829, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !826, file: !41, line: 74, baseType: !710, size: 4480)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !826, file: !41, line: 74, baseType: !830, size: 256, offset: 4480)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !831, size: 256, elements: !384)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ISLocalToGlobalMappingOps", file: !41, line: 66, size: 256, elements: !832)
!832 = !{!833, !837, !842, !843}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingsetup", scope: !831, file: !41, line: 67, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!349, !824}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingapply", scope: !831, file: !41, line: 68, baseType: !838, size: 64, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!349, !824, !841, !388, !543, !433, !433}
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISGlobalToLocalMappingMode", file: !36, line: 149, baseType: !35)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingapplyblock", scope: !831, file: !41, line: 69, baseType: !838, size: 64, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !831, file: !41, line: 70, baseType: !834, size: 64, offset: 192)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !826, file: !41, line: 75, baseType: !388, size: 32, offset: 4736)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !826, file: !41, line: 76, baseType: !388, size: 32, offset: 4768)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "indices", scope: !826, file: !41, line: 77, baseType: !433, size: 64, offset: 4800)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "globalstart", scope: !826, file: !41, line: 78, baseType: !388, size: 32, offset: 4864)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "globalend", scope: !826, file: !41, line: 79, baseType: !388, size: 32, offset: 4896)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "info_cached", scope: !826, file: !41, line: 80, baseType: !500, size: 32, offset: 4928)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "info_free", scope: !826, file: !41, line: 81, baseType: !500, size: 32, offset: 4960)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "info_nproc", scope: !826, file: !41, line: 82, baseType: !388, size: 32, offset: 4992)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "info_procs", scope: !826, file: !41, line: 83, baseType: !433, size: 64, offset: 5056)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "info_numprocs", scope: !826, file: !41, line: 84, baseType: !433, size: 64, offset: 5120)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "info_indices", scope: !826, file: !41, line: 85, baseType: !435, size: 64, offset: 5184)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "info_nodec", scope: !826, file: !41, line: 86, baseType: !433, size: 64, offset: 5248)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "info_nodei", scope: !826, file: !41, line: 87, baseType: !435, size: 64, offset: 5312)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !826, file: !41, line: 88, baseType: !329, size: 64, offset: 5376)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !811, file: !36, line: 253, baseType: !500, size: 32, offset: 512)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !811, file: !36, line: 254, baseType: !388, size: 32, offset: 544)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !811, file: !36, line: 254, baseType: !388, size: 32, offset: 576)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !811, file: !36, line: 255, baseType: !388, size: 32, offset: 608)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !741, file: !41, line: 53, baseType: !388, size: 32, offset: 6080)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !741, file: !41, line: 53, baseType: !388, size: 32, offset: 6112)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !741, file: !41, line: 54, baseType: !329, size: 64, offset: 6144)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !741, file: !41, line: 55, baseType: !433, size: 64, offset: 6208)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !741, file: !41, line: 55, baseType: !433, size: 64, offset: 6272)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "local_offset", scope: !741, file: !41, line: 56, baseType: !388, size: 32, offset: 6336)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "complement", scope: !741, file: !41, line: 57, baseType: !739, size: 64, offset: 6400)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "info_permanent", scope: !741, file: !41, line: 58, baseType: !870, size: 320, offset: 6464)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 320, elements: !871)
!871 = !{!465, !519}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !741, file: !41, line: 59, baseType: !873, size: 320, offset: 6784)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !874, size: 320, elements: !871)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISInfoBool", file: !41, line: 48, baseType: !40)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !733, file: !41, line: 95, baseType: !325, size: 64, offset: 128)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !733, file: !41, line: 96, baseType: !530, size: 64, offset: 192)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !733, file: !41, line: 97, baseType: !388, size: 32, offset: 256)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !733, file: !41, line: 98, baseType: !879, size: 32, offset: 288)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !36, line: 213, baseType: !46)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !733, file: !41, line: 99, baseType: !500, size: 32, offset: 320)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "weights", scope: !713, file: !707, line: 644, baseType: !882, size: 64, offset: 256)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DISubroutineType(types: !884)
!884 = !{!349, !704, !444, !435}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !706, file: !707, line: 649, baseType: !886, size: 64, offset: 4800)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !62, line: 16, baseType: !887)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !707, line: 436, size: 23424, elements: !889)
!889 = !{!890, !891, !1378, !1379, !1380, !1381, !1383, !1384, !1385, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1512, !1513, !1529, !1530, !1531, !1532, !1533, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1568, !1588, !1589, !1591, !1592, !1593, !1594, !1595, !1596, !1614, !1615}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !888, file: !707, line: 437, baseType: !710, size: 4480)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !888, file: !707, line: 437, baseType: !892, size: 9472, offset: 4480)
!892 = !DICompositeType(tag: DW_TAG_array_type, baseType: !893, size: 9472, elements: !384)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !707, line: 32, size: 9472, elements: !894)
!894 = !{!895, !902, !906, !907, !914, !918, !919, !920, !921, !922, !923, !924, !944, !948, !953, !959, !978, !982, !986, !987, !992, !997, !998, !1003, !1007, !1011, !1015, !1019, !1023, !1024, !1025, !1026, !1027, !1031, !1032, !1037, !1038, !1039, !1040, !1041, !1046, !1053, !1057, !1061, !1065, !1069, !1073, !1074, !1078, !1079, !1086, !1090, !1091, !1092, !1093, !1151, !1155, !1156, !1160, !1161, !1165, !1166, !1170, !1175, !1176, !1180, !1184, !1188, !1189, !1190, !1191, !1192, !1193, !1198, !1199, !1203, !1207, !1211, !1212, !1213, !1217, !1227, !1228, !1232, !1233, !1237, !1238, !1242, !1243, !1248, !1249, !1253, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1267, !1268, !1269, !1270, !1271, !1272, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1287, !1291, !1292, !1293, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1307, !1308, !1309, !1314, !1318, !1319, !1323, !1324, !1325, !1326, !1352, !1356, !1357, !1358, !1359, !1360, !1364, !1365, !1366, !1367, !1368, !1372, !1376, !1377}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !893, file: !707, line: 34, baseType: !896, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DISubroutineType(types: !898)
!898 = !{!349, !886, !388, !543, !388, !543, !899, !901}
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !451)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !50)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !893, file: !707, line: 35, baseType: !903, size: 64, offset: 64)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{!349, !886, !388, !433, !435, !453}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !893, file: !707, line: 36, baseType: !903, size: 64, offset: 128)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !893, file: !707, line: 37, baseType: !908, size: 64, offset: 192)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!349, !886, !911, !911}
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !86, line: 21, baseType: !912)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !86, line: 21, flags: DIFlagFwdDecl)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !893, file: !707, line: 38, baseType: !915, size: 64, offset: 256)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!349, !886, !911, !911, !911}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !893, file: !707, line: 40, baseType: !908, size: 64, offset: 320)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !893, file: !707, line: 41, baseType: !915, size: 64, offset: 384)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !893, file: !707, line: 42, baseType: !908, size: 64, offset: 448)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !893, file: !707, line: 43, baseType: !915, size: 64, offset: 512)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !893, file: !707, line: 44, baseType: !908, size: 64, offset: 576)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !893, file: !707, line: 46, baseType: !915, size: 64, offset: 640)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !893, file: !707, line: 47, baseType: !925, size: 64, offset: 704)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!349, !886, !739, !739, !928}
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !930)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !62, line: 1239, baseType: !931)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 1226, size: 704, elements: !932)
!932 = !{!933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !931, file: !62, line: 1227, baseType: !442, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !931, file: !62, line: 1228, baseType: !442, size: 64, offset: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !931, file: !62, line: 1229, baseType: !442, size: 64, offset: 128)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !931, file: !62, line: 1230, baseType: !442, size: 64, offset: 192)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !931, file: !62, line: 1231, baseType: !442, size: 64, offset: 256)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !931, file: !62, line: 1232, baseType: !442, size: 64, offset: 320)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !931, file: !62, line: 1233, baseType: !442, size: 64, offset: 384)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !931, file: !62, line: 1234, baseType: !442, size: 64, offset: 448)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !931, file: !62, line: 1236, baseType: !442, size: 64, offset: 512)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !931, file: !62, line: 1237, baseType: !442, size: 64, offset: 576)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !931, file: !62, line: 1238, baseType: !442, size: 64, offset: 640)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !893, file: !707, line: 48, baseType: !945, size: 64, offset: 768)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!349, !886, !739, !928}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !893, file: !707, line: 49, baseType: !949, size: 64, offset: 832)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!349, !886, !911, !442, !952, !442, !388, !388, !911}
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !62, line: 1291, baseType: !61)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !893, file: !707, line: 50, baseType: !954, size: 64, offset: 896)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{!349, !886, !957, !958}
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !62, line: 238, baseType: !74)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !893, file: !707, line: 52, baseType: !960, size: 64, offset: 960)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!349, !886, !963, !964}
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !62, line: 612, baseType: !80)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !62, line: 600, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 592, size: 640, elements: !967)
!967 = !{!968, !969, !970, !971, !972, !973, !974, !975, !976, !977}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !966, file: !62, line: 593, baseType: !390, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !966, file: !62, line: 594, baseType: !390, size: 64, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !966, file: !62, line: 594, baseType: !390, size: 64, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !966, file: !62, line: 594, baseType: !390, size: 64, offset: 192)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !966, file: !62, line: 595, baseType: !390, size: 64, offset: 256)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !966, file: !62, line: 596, baseType: !390, size: 64, offset: 320)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !966, file: !62, line: 597, baseType: !390, size: 64, offset: 384)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !966, file: !62, line: 598, baseType: !390, size: 64, offset: 448)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !966, file: !62, line: 598, baseType: !390, size: 64, offset: 512)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !966, file: !62, line: 599, baseType: !390, size: 64, offset: 576)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !893, file: !707, line: 53, baseType: !979, size: 64, offset: 1024)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!349, !886, !886, !767}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !893, file: !707, line: 54, baseType: !983, size: 64, offset: 1088)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!349, !886, !911}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !893, file: !707, line: 55, baseType: !908, size: 64, offset: 1152)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !893, file: !707, line: 56, baseType: !988, size: 64, offset: 1216)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!349, !886, !991, !441}
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !86, line: 155, baseType: !85)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !893, file: !707, line: 58, baseType: !993, size: 64, offset: 1280)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!349, !886, !996}
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !62, line: 424, baseType: !93)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !893, file: !707, line: 59, baseType: !993, size: 64, offset: 1344)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !893, file: !707, line: 60, baseType: !999, size: 64, offset: 1408)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!349, !886, !1002, !500}
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !62, line: 469, baseType: !97)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !893, file: !707, line: 61, baseType: !1004, size: 64, offset: 1472)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!349, !886}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !893, file: !707, line: 63, baseType: !1008, size: 64, offset: 1536)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!349, !886, !388, !543, !451, !911, !911}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !893, file: !707, line: 64, baseType: !1012, size: 64, offset: 1600)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!349, !886, !886, !739, !739, !928}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !893, file: !707, line: 65, baseType: !1016, size: 64, offset: 1664)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!349, !886, !886, !928}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !893, file: !707, line: 66, baseType: !1020, size: 64, offset: 1728)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!349, !886, !886, !739, !928}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !893, file: !707, line: 67, baseType: !1016, size: 64, offset: 1792)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !893, file: !707, line: 69, baseType: !1004, size: 64, offset: 1856)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !893, file: !707, line: 70, baseType: !1012, size: 64, offset: 1920)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !893, file: !707, line: 71, baseType: !1020, size: 64, offset: 1984)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !893, file: !707, line: 72, baseType: !1028, size: 64, offset: 2048)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!349, !886, !958}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !893, file: !707, line: 73, baseType: !1004, size: 64, offset: 2112)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !893, file: !707, line: 75, baseType: !1033, size: 64, offset: 2176)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!349, !886, !1036, !958}
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !62, line: 563, baseType: !128)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !893, file: !707, line: 76, baseType: !908, size: 64, offset: 2240)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !893, file: !707, line: 77, baseType: !908, size: 64, offset: 2304)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !893, file: !707, line: 78, baseType: !925, size: 64, offset: 2368)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !893, file: !707, line: 79, baseType: !945, size: 64, offset: 2432)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !893, file: !707, line: 81, baseType: !1042, size: 64, offset: 2496)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!349, !886, !451, !886, !1045}
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !62, line: 285, baseType: !133)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !893, file: !707, line: 82, baseType: !1047, size: 64, offset: 2560)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!349, !886, !388, !1050, !1050, !957, !1052}
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !739)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !893, file: !707, line: 83, baseType: !1054, size: 64, offset: 2624)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!349, !886, !388, !738, !388}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !893, file: !707, line: 84, baseType: !1058, size: 64, offset: 2688)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!349, !886, !388, !543, !388, !543, !450}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !893, file: !707, line: 85, baseType: !1062, size: 64, offset: 2752)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!349, !886, !886, !1045}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !893, file: !707, line: 87, baseType: !1066, size: 64, offset: 2816)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!349, !886, !911, !433}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !893, file: !707, line: 88, baseType: !1070, size: 64, offset: 2880)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!349, !886, !451}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !893, file: !707, line: 89, baseType: !1070, size: 64, offset: 2944)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !893, file: !707, line: 90, baseType: !1075, size: 64, offset: 3008)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!349, !886, !911, !901}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !893, file: !707, line: 91, baseType: !1008, size: 64, offset: 3072)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !893, file: !707, line: 93, baseType: !1080, size: 64, offset: 3136)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!349, !886, !1083}
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !1084)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !893, file: !707, line: 94, baseType: !1087, size: 64, offset: 3200)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!349, !886, !388, !500, !500, !433, !752, !752, !767}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !893, file: !707, line: 95, baseType: !1087, size: 64, offset: 3264)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !893, file: !707, line: 96, baseType: !1087, size: 64, offset: 3328)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !893, file: !707, line: 97, baseType: !1087, size: 64, offset: 3392)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !893, file: !707, line: 99, baseType: !1094, size: 64, offset: 3456)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{!349, !886, !730, !1097}
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !62, line: 1378, baseType: !1098)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !707, line: 609, size: 6208, elements: !1100)
!1100 = !{!1101, !1102, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1121, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1099, file: !707, line: 610, baseType: !710, size: 4480)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1099, file: !707, line: 610, baseType: !1103, size: 32, offset: 4480)
!1103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 32, elements: !384)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1099, file: !707, line: 611, baseType: !388, size: 32, offset: 4512)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1099, file: !707, line: 611, baseType: !388, size: 32, offset: 4544)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1099, file: !707, line: 611, baseType: !388, size: 32, offset: 4576)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1099, file: !707, line: 612, baseType: !388, size: 32, offset: 4608)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1099, file: !707, line: 613, baseType: !388, size: 32, offset: 4640)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1099, file: !707, line: 614, baseType: !433, size: 64, offset: 4672)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1099, file: !707, line: 615, baseType: !435, size: 64, offset: 4736)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !1099, file: !707, line: 616, baseType: !738, size: 64, offset: 4800)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1099, file: !707, line: 617, baseType: !433, size: 64, offset: 4864)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !1099, file: !707, line: 618, baseType: !1114, size: 64, offset: 4928)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !707, line: 602, baseType: !1116)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !707, line: 598, size: 128, elements: !1117)
!1117 = !{!1118, !1119, !1120}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1116, file: !707, line: 599, baseType: !388, size: 32)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1116, file: !707, line: 600, baseType: !388, size: 32, offset: 32)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1116, file: !707, line: 601, baseType: !450, size: 64, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !1099, file: !707, line: 619, baseType: !1122, size: 64, offset: 4992)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !707, line: 607, baseType: !1124)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !707, line: 604, size: 128, elements: !1125)
!1125 = !{!1126, !1127}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1124, file: !707, line: 605, baseType: !388, size: 32)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1124, file: !707, line: 606, baseType: !450, size: 64, offset: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !1099, file: !707, line: 620, baseType: !450, size: 64, offset: 5056)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !1099, file: !707, line: 621, baseType: !442, size: 64, offset: 5120)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !1099, file: !707, line: 622, baseType: !442, size: 64, offset: 5184)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !1099, file: !707, line: 623, baseType: !911, size: 64, offset: 5248)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !1099, file: !707, line: 623, baseType: !911, size: 64, offset: 5312)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !1099, file: !707, line: 623, baseType: !911, size: 64, offset: 5376)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !1099, file: !707, line: 624, baseType: !500, size: 32, offset: 5440)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1099, file: !707, line: 625, baseType: !1136, size: 64, offset: 5504)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!349}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !1099, file: !707, line: 626, baseType: !329, size: 64, offset: 5568)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !1099, file: !707, line: 627, baseType: !911, size: 64, offset: 5632)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1099, file: !707, line: 628, baseType: !388, size: 32, offset: 5696)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !1099, file: !707, line: 629, baseType: !330, size: 64, offset: 5760)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1099, file: !707, line: 630, baseType: !879, size: 32, offset: 5824)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1099, file: !707, line: 631, baseType: !388, size: 32, offset: 5856)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !1099, file: !707, line: 631, baseType: !388, size: 32, offset: 5888)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1099, file: !707, line: 632, baseType: !500, size: 32, offset: 5920)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !1099, file: !707, line: 633, baseType: !500, size: 32, offset: 5952)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !1099, file: !707, line: 634, baseType: !376, size: 64, offset: 6016)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !1099, file: !707, line: 634, baseType: !329, size: 64, offset: 6080)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !1099, file: !707, line: 635, baseType: !396, size: 64, offset: 6144)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !893, file: !707, line: 100, baseType: !1152, size: 64, offset: 3520)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{!349, !886, !388, !388, !530, !729}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !893, file: !707, line: 101, baseType: !1004, size: 64, offset: 3584)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !893, file: !707, line: 102, baseType: !1157, size: 64, offset: 3648)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!349, !886, !739, !739, !958}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !893, file: !707, line: 103, baseType: !896, size: 64, offset: 3712)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !893, file: !707, line: 105, baseType: !1162, size: 64, offset: 3776)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!349, !886, !739, !739, !957, !958}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !893, file: !707, line: 106, baseType: !1004, size: 64, offset: 3840)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !893, file: !707, line: 107, baseType: !1167, size: 64, offset: 3904)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{!349, !886, !355}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !893, file: !707, line: 108, baseType: !1171, size: 64, offset: 3968)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{!349, !886, !1174, !957, !958}
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !62, line: 25, baseType: !330)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !893, file: !707, line: 109, baseType: !1136, size: 64, offset: 4032)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !893, file: !707, line: 111, baseType: !1177, size: 64, offset: 4096)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = !DISubroutineType(types: !1179)
!1179 = !{!349, !886, !886, !886, !442, !886}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !893, file: !707, line: 112, baseType: !1181, size: 64, offset: 4160)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = !DISubroutineType(types: !1183)
!1183 = !{!349, !886, !886, !886, !886}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !893, file: !707, line: 113, baseType: !1185, size: 64, offset: 4224)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = !DISubroutineType(types: !1187)
!1187 = !{!349, !886, !824, !824}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !893, file: !707, line: 114, baseType: !896, size: 64, offset: 4288)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !893, file: !707, line: 115, baseType: !1008, size: 64, offset: 4352)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !893, file: !707, line: 117, baseType: !1066, size: 64, offset: 4416)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !893, file: !707, line: 118, baseType: !1066, size: 64, offset: 4480)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !893, file: !707, line: 119, baseType: !1171, size: 64, offset: 4544)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !893, file: !707, line: 120, baseType: !1194, size: 64, offset: 4608)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = !DISubroutineType(types: !1196)
!1196 = !{!349, !886, !1197, !767}
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !62, line: 1675, baseType: !139)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !893, file: !707, line: 121, baseType: !1136, size: 64, offset: 4672)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !893, file: !707, line: 123, baseType: !1200, size: 64, offset: 4736)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DISubroutineType(types: !1202)
!1202 = !{!349, !886, !388, !329}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !893, file: !707, line: 124, baseType: !1204, size: 64, offset: 4800)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{!349, !886, !1097, !911, !329}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !893, file: !707, line: 125, baseType: !1208, size: 64, offset: 4864)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{!349, !479, !886}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !893, file: !707, line: 126, baseType: !908, size: 64, offset: 4928)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !893, file: !707, line: 127, baseType: !908, size: 64, offset: 4992)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !893, file: !707, line: 129, baseType: !1214, size: 64, offset: 5056)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1215 = !DISubroutineType(types: !1216)
!1216 = !{!349, !886, !738}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !893, file: !707, line: 130, baseType: !1218, size: 64, offset: 5120)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64)
!1219 = !DISubroutineType(types: !1220)
!1220 = !{!349, !886, !1221, !1221}
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !86, line: 654, baseType: !1222)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !86, line: 653, size: 128, elements: !1224)
!1224 = !{!1225, !1226}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1223, file: !86, line: 653, baseType: !388, size: 32)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1223, file: !86, line: 653, baseType: !911, size: 64, offset: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !893, file: !707, line: 131, baseType: !1218, size: 64, offset: 5184)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !893, file: !707, line: 132, baseType: !1229, size: 64, offset: 5248)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64)
!1230 = !DISubroutineType(types: !1231)
!1231 = !{!349, !886, !433, !433, !433}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !893, file: !707, line: 133, baseType: !1167, size: 64, offset: 5312)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !893, file: !707, line: 135, baseType: !1234, size: 64, offset: 5376)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64)
!1235 = !DISubroutineType(types: !1236)
!1236 = !{!349, !886, !442, !767}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !893, file: !707, line: 136, baseType: !1234, size: 64, offset: 5440)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !893, file: !707, line: 137, baseType: !1239, size: 64, offset: 5504)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{!349, !886, !767}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !893, file: !707, line: 138, baseType: !896, size: 64, offset: 5568)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !893, file: !707, line: 139, baseType: !1244, size: 64, offset: 5632)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1245 = !DISubroutineType(types: !1246)
!1246 = !{!349, !886, !1247, !1247}
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !893, file: !707, line: 141, baseType: !1136, size: 64, offset: 5696)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !893, file: !707, line: 142, baseType: !1250, size: 64, offset: 5760)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{!349, !886, !886, !442, !886}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !893, file: !707, line: 143, baseType: !1254, size: 64, offset: 5824)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!349, !886, !886, !886}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !893, file: !707, line: 144, baseType: !1136, size: 64, offset: 5888)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !893, file: !707, line: 145, baseType: !1250, size: 64, offset: 5952)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !893, file: !707, line: 147, baseType: !1254, size: 64, offset: 6016)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !893, file: !707, line: 148, baseType: !1136, size: 64, offset: 6080)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !893, file: !707, line: 149, baseType: !1250, size: 64, offset: 6144)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !893, file: !707, line: 150, baseType: !1254, size: 64, offset: 6208)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !893, file: !707, line: 151, baseType: !1264, size: 64, offset: 6272)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64)
!1265 = !DISubroutineType(types: !1266)
!1266 = !{!349, !886, !500}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !893, file: !707, line: 153, baseType: !1004, size: 64, offset: 6336)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !893, file: !707, line: 154, baseType: !1004, size: 64, offset: 6400)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !893, file: !707, line: 155, baseType: !1004, size: 64, offset: 6464)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !893, file: !707, line: 156, baseType: !1004, size: 64, offset: 6528)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !893, file: !707, line: 157, baseType: !1167, size: 64, offset: 6592)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !893, file: !707, line: 159, baseType: !1273, size: 64, offset: 6656)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64)
!1274 = !DISubroutineType(types: !1275)
!1275 = !{!349, !886, !388, !899}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !893, file: !707, line: 160, baseType: !1004, size: 64, offset: 6720)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !893, file: !707, line: 161, baseType: !1004, size: 64, offset: 6784)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !893, file: !707, line: 162, baseType: !1004, size: 64, offset: 6848)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !893, file: !707, line: 163, baseType: !1004, size: 64, offset: 6912)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !893, file: !707, line: 165, baseType: !1254, size: 64, offset: 6976)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !893, file: !707, line: 166, baseType: !1254, size: 64, offset: 7040)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !893, file: !707, line: 167, baseType: !1066, size: 64, offset: 7104)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !893, file: !707, line: 168, baseType: !1284, size: 64, offset: 7168)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{!349, !886, !911, !388}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !893, file: !707, line: 169, baseType: !1288, size: 64, offset: 7232)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64)
!1289 = !DISubroutineType(types: !1290)
!1290 = !{!349, !886, !767, !433}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !893, file: !707, line: 171, baseType: !1028, size: 64, offset: 7296)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !893, file: !707, line: 172, baseType: !1004, size: 64, offset: 7360)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !893, file: !707, line: 173, baseType: !1294, size: 64, offset: 7424)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64)
!1295 = !DISubroutineType(types: !1296)
!1296 = !{!349, !886, !433, !752}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !893, file: !707, line: 174, baseType: !1157, size: 64, offset: 7488)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !893, file: !707, line: 175, baseType: !1157, size: 64, offset: 7552)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !893, file: !707, line: 177, baseType: !908, size: 64, offset: 7616)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !893, file: !707, line: 178, baseType: !954, size: 64, offset: 7680)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !893, file: !707, line: 179, baseType: !908, size: 64, offset: 7744)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !893, file: !707, line: 180, baseType: !915, size: 64, offset: 7808)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !893, file: !707, line: 181, baseType: !1304, size: 64, offset: 7872)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64)
!1305 = !DISubroutineType(types: !1306)
!1306 = !{!349, !886, !325, !957, !958}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !893, file: !707, line: 183, baseType: !1214, size: 64, offset: 7936)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !893, file: !707, line: 184, baseType: !988, size: 64, offset: 8000)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !893, file: !707, line: 185, baseType: !1310, size: 64, offset: 8064)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64)
!1311 = !DISubroutineType(types: !1312)
!1312 = !{!349, !886, !1313}
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !893, file: !707, line: 186, baseType: !1315, size: 64, offset: 8128)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64)
!1316 = !DISubroutineType(types: !1317)
!1317 = !{!349, !886, !388, !543, !450}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !893, file: !707, line: 187, baseType: !1047, size: 64, offset: 8192)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !893, file: !707, line: 189, baseType: !1320, size: 64, offset: 8256)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64)
!1321 = !DISubroutineType(types: !1322)
!1322 = !{!349, !886, !388, !388, !433, !899}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !893, file: !707, line: 190, baseType: !1136, size: 64, offset: 8320)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !893, file: !707, line: 191, baseType: !1250, size: 64, offset: 8384)
