; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/order/sorder.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/order/sorder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._n_PetscFunctionList = type opaque
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!263 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!264 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!265 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !38, line: 161, baseType: !7, size: 32, elements: !266)
!266 = !{!267, !268, !269, !270, !271, !272, !273, !274}
!267 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!273 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!274 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!275 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !38, line: 1265, baseType: !7, size: 32, elements: !276)
!276 = !{!277, !278, !279}
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!278 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!279 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!280 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !38, line: 1203, baseType: !7, size: 32, elements: !281)
!281 = !{!282, !283, !284, !285, !286}
!282 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!285 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!286 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!287 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !38, line: 187, baseType: !7, size: 32, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294, !295}
!289 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!294 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!295 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!296 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !297, line: 663, baseType: !7, size: 32, elements: !298)
!297 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!298 = !{!299, !300, !301}
!299 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!300 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!301 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!302 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 327, baseType: !7, size: 32, elements: !303)
!303 = !{!304, !305, !306}
!304 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!305 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!306 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!307 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !308)
!308 = !{!309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326}
!309 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!310 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!311 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!312 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!313 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!314 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!315 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!316 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!317 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!318 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!319 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!320 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!321 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!322 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!323 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!324 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!325 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!326 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!327 = !{!328, !346, !427, !502, !367, !536, !538}
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !331, line: 73, size: 4480, elements: !332)
!331 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!332 = !{!333, !335, !388, !389, !391, !394, !395, !396, !397, !405, !406, !408, !412, !416, !418, !419, !420, !421, !422, !423, !424, !425, !426, !428, !430, !431, !432, !434, !435, !437, !439, !440, !441, !442, !443, !446, !448, !449, !450, !451, !452, !455, !457, !458, !459, !469, !471, !472, !476, !477, !526, !531, !533, !534, !535}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !330, file: !331, line: 74, baseType: !334, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !74)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !330, file: !331, line: 75, baseType: !336, size: 448, offset: 64)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 448, elements: !386)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !331, line: 53, baseType: !338)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !331, line: 45, size: 448, elements: !339)
!339 = !{!340, !350, !358, !363, !370, !374, !381}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !338, file: !331, line: 46, baseType: !341, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!344, !328, !345}
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !74)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !347, line: 330, baseType: !348)
!347 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !347, line: 330, flags: DIFlagFwdDecl)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !338, file: !331, line: 47, baseType: !351, size: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!344, !328, !354}
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !355, line: 16, baseType: !356)
!355 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !355, line: 16, flags: DIFlagFwdDecl)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !338, file: !331, line: 48, baseType: !359, size: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!344, !362}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !338, file: !331, line: 49, baseType: !364, size: 64, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!344, !328, !367, !328}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !369)
!369 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !338, file: !331, line: 50, baseType: !371, size: 64, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!344, !328, !367, !362}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !338, file: !331, line: 51, baseType: !375, size: 64, offset: 320)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!344, !328, !367, !378}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{null}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !338, file: !331, line: 52, baseType: !382, size: 64, offset: 384)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!344, !328, !367, !385}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!386 = !{!387}
!387 = !DISubrange(count: 1)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !330, file: !331, line: 76, baseType: !346, size: 64, offset: 512)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !330, file: !331, line: 77, baseType: !390, size: 32, offset: 576)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !74)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !330, file: !331, line: 78, baseType: !392, size: 64, offset: 640)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !393)
!393 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !330, file: !331, line: 78, baseType: !392, size: 64, offset: 704)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !330, file: !331, line: 78, baseType: !392, size: 64, offset: 768)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !330, file: !331, line: 78, baseType: !392, size: 64, offset: 832)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !330, file: !331, line: 79, baseType: !398, size: 64, offset: 896)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !401, line: 27, baseType: !402)
!401 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !403, line: 43, baseType: !404)
!403 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!404 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !330, file: !331, line: 80, baseType: !390, size: 32, offset: 960)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !330, file: !331, line: 81, baseType: !407, size: 32, offset: 992)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !74)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !330, file: !331, line: 82, baseType: !409, size: 64, offset: 1024)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !410)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !330, file: !331, line: 83, baseType: !413, size: 64, offset: 1088)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !330, file: !331, line: 84, baseType: !417, size: 64, offset: 1152)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !330, file: !331, line: 85, baseType: !417, size: 64, offset: 1216)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !330, file: !331, line: 86, baseType: !417, size: 64, offset: 1280)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !330, file: !331, line: 87, baseType: !417, size: 64, offset: 1344)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !330, file: !331, line: 88, baseType: !328, size: 64, offset: 1408)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !330, file: !331, line: 89, baseType: !398, size: 64, offset: 1472)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !330, file: !331, line: 90, baseType: !417, size: 64, offset: 1536)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !330, file: !331, line: 91, baseType: !417, size: 64, offset: 1600)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !330, file: !331, line: 92, baseType: !390, size: 32, offset: 1664)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !330, file: !331, line: 93, baseType: !427, size: 64, offset: 1728)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !330, file: !331, line: 94, baseType: !429, size: 64, offset: 1792)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !399)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !330, file: !331, line: 95, baseType: !390, size: 32, offset: 1856)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !330, file: !331, line: 95, baseType: !390, size: 32, offset: 1888)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !330, file: !331, line: 96, baseType: !433, size: 64, offset: 1920)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !330, file: !331, line: 96, baseType: !433, size: 64, offset: 1984)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !330, file: !331, line: 97, baseType: !436, size: 64, offset: 2048)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !330, file: !331, line: 97, baseType: !438, size: 64, offset: 2112)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !330, file: !331, line: 98, baseType: !390, size: 32, offset: 2176)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !330, file: !331, line: 98, baseType: !390, size: 32, offset: 2208)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !330, file: !331, line: 99, baseType: !433, size: 64, offset: 2240)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !330, file: !331, line: 99, baseType: !433, size: 64, offset: 2304)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !330, file: !331, line: 100, baseType: !444, size: 64, offset: 2368)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !393)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !330, file: !331, line: 100, baseType: !447, size: 64, offset: 2432)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !330, file: !331, line: 101, baseType: !390, size: 32, offset: 2496)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !330, file: !331, line: 101, baseType: !390, size: 32, offset: 2528)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !330, file: !331, line: 102, baseType: !433, size: 64, offset: 2560)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !330, file: !331, line: 102, baseType: !433, size: 64, offset: 2624)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !330, file: !331, line: 103, baseType: !453, size: 64, offset: 2688)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !445)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !330, file: !331, line: 103, baseType: !456, size: 64, offset: 2752)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !330, file: !331, line: 104, baseType: !385, size: 64, offset: 2816)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !330, file: !331, line: 105, baseType: !390, size: 32, offset: 2880)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !330, file: !331, line: 106, baseType: !460, size: 128, offset: 2944)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !461, size: 128, elements: !467)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !331, line: 64, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !331, line: 61, size: 128, elements: !464)
!464 = !{!465, !466}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !463, file: !331, line: 62, baseType: !378, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !463, file: !331, line: 63, baseType: !427, size: 64, offset: 64)
!467 = !{!468}
!468 = !DISubrange(count: 2)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !330, file: !331, line: 107, baseType: !470, size: 64, offset: 3072)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 64, elements: !467)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !330, file: !331, line: 108, baseType: !427, size: 64, offset: 3136)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !330, file: !331, line: 109, baseType: !473, size: 64, offset: 3200)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!344, !427}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !330, file: !331, line: 111, baseType: !390, size: 32, offset: 3264)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !330, file: !331, line: 112, baseType: !478, size: 320, offset: 3328)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !479, size: 320, elements: !524)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!344, !482, !328, !427}
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !485)
!485 = !{!486, !487, !512, !513, !514, !515, !516, !517, !518, !519, !520}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !484, file: !12, line: 100, baseType: !390, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !484, file: !12, line: 101, baseType: !488, size: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !491)
!491 = !{!492, !493, !494, !495, !496, !499, !500, !501, !505, !507, !509, !510, !511}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !490, file: !12, line: 84, baseType: !417, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !490, file: !12, line: 85, baseType: !417, size: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !490, file: !12, line: 86, baseType: !427, size: 64, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !490, file: !12, line: 87, baseType: !409, size: 64, offset: 192)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !490, file: !12, line: 88, baseType: !497, size: 64, offset: 256)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !367)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !490, file: !12, line: 89, baseType: !369, size: 8, offset: 320)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !490, file: !12, line: 90, baseType: !417, size: 64, offset: 384)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !490, file: !12, line: 91, baseType: !502, size: 64, offset: 448)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !503, line: 46, baseType: !504)
!503 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!504 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !490, file: !12, line: 92, baseType: !506, size: 32, offset: 512)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !490, file: !12, line: 93, baseType: !508, size: 32, offset: 544)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !490, file: !12, line: 94, baseType: !488, size: 64, offset: 576)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !490, file: !12, line: 95, baseType: !417, size: 64, offset: 640)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !490, file: !12, line: 96, baseType: !427, size: 64, offset: 704)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !484, file: !12, line: 102, baseType: !417, size: 64, offset: 128)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !484, file: !12, line: 102, baseType: !417, size: 64, offset: 192)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !484, file: !12, line: 103, baseType: !417, size: 64, offset: 256)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !484, file: !12, line: 104, baseType: !346, size: 64, offset: 320)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !484, file: !12, line: 105, baseType: !506, size: 32, offset: 384)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !484, file: !12, line: 105, baseType: !506, size: 32, offset: 416)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !484, file: !12, line: 105, baseType: !506, size: 32, offset: 448)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !484, file: !12, line: 106, baseType: !328, size: 64, offset: 512)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !484, file: !12, line: 107, baseType: !521, size: 64, offset: 576)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !522)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!524 = !{!525}
!525 = !DISubrange(count: 5)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !330, file: !331, line: 113, baseType: !527, size: 320, offset: 3648)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 320, elements: !524)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!344, !328, !427}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !330, file: !331, line: 114, baseType: !532, size: 320, offset: 3968)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 320, elements: !524)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !330, file: !331, line: 115, baseType: !506, size: 32, offset: 4288)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !330, file: !331, line: 120, baseType: !521, size: 64, offset: 4352)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !330, file: !331, line: 121, baseType: !506, size: 32, offset: 4416)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !537, line: 1451, baseType: !378)
!537 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!539 = !{!0, !540}
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "MatOrderingRegisterAllCalled", scope: !2, file: !542, line: 10, type: !506, isLocal: false, isDefinition: true)
!542 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/order/sorder.c", directory: "/home/users/ndemeye/xSDK")
!543 = !{i32 7, !"Dwarf Version", i32 4}
!544 = !{i32 2, !"Debug Info Version", i32 3}
!545 = !{i32 1, !"wchar_size", i32 4}
!546 = !{i32 7, !"PIC Level", i32 2}
!547 = !{i32 7, !"uwtable", i32 1}
!548 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!549 = distinct !DISubprogram(name: "MatGetOrdering_Flow", scope: !542, file: !542, line: 14, type: !550, scopeLine: 15, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1323)
!550 = !DISubroutineType(types: !551)
!551 = !{!344, !552, !1094, !732, !732}
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !38, line: 16, baseType: !553)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !555, line: 436, size: 23424, elements: !556)
!555 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!556 = !{!557, !559, !1066, !1086, !1087, !1088, !1090, !1091, !1092, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1219, !1220, !1236, !1237, !1238, !1239, !1240, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1275, !1295, !1296, !1298, !1299, !1300, !1301, !1302, !1303, !1321, !1322}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !554, file: !555, line: 437, baseType: !558, size: 4480)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !331, line: 122, baseType: !330)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !554, file: !555, line: 437, baseType: !560, size: 9472, offset: 4480)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 9472, elements: !386)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !555, line: 32, size: 9472, elements: !562)
!562 = !{!563, !572, !576, !577, !584, !588, !589, !590, !591, !592, !593, !594, !618, !622, !627, !633, !652, !657, !661, !662, !667, !672, !673, !678, !682, !686, !690, !694, !698, !699, !700, !701, !702, !706, !707, !712, !713, !714, !715, !716, !721, !728, !733, !737, !741, !745, !749, !750, !754, !755, !762, !767, !768, !769, !770, !832, !840, !841, !845, !846, !850, !851, !855, !860, !861, !865, !869, !876, !877, !878, !879, !880, !881, !886, !887, !891, !895, !899, !900, !901, !905, !915, !916, !920, !921, !925, !926, !930, !931, !936, !937, !941, !945, !946, !947, !948, !949, !950, !951, !955, !956, !957, !958, !959, !960, !964, !965, !966, !967, !968, !969, !970, !971, !975, !979, !980, !981, !985, !986, !987, !988, !989, !990, !991, !995, !996, !997, !1002, !1006, !1007, !1011, !1012, !1013, !1014, !1040, !1044, !1045, !1046, !1047, !1048, !1052, !1053, !1054, !1055, !1056, !1060, !1064, !1065}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !561, file: !555, line: 34, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{!344, !552, !390, !567, !390, !567, !569, !571}
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !390)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !454)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !26)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !561, file: !555, line: 35, baseType: !573, size: 64, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{!344, !552, !390, !436, !438, !456}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !561, file: !555, line: 36, baseType: !573, size: 64, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !561, file: !555, line: 37, baseType: !578, size: 64, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!344, !552, !581, !581}
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !62, line: 21, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !62, line: 21, flags: DIFlagFwdDecl)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !561, file: !555, line: 38, baseType: !585, size: 64, offset: 256)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{!344, !552, !581, !581, !581}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !561, file: !555, line: 40, baseType: !578, size: 64, offset: 320)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !561, file: !555, line: 41, baseType: !585, size: 64, offset: 384)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !561, file: !555, line: 42, baseType: !578, size: 64, offset: 448)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !561, file: !555, line: 43, baseType: !585, size: 64, offset: 512)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !561, file: !555, line: 44, baseType: !578, size: 64, offset: 576)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !561, file: !555, line: 46, baseType: !585, size: 64, offset: 640)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !561, file: !555, line: 47, baseType: !595, size: 64, offset: 704)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!344, !552, !598, !598, !602}
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !599, line: 11, baseType: !600)
!599 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !599, line: 11, flags: DIFlagFwdDecl)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !604)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !38, line: 1239, baseType: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 1226, size: 704, elements: !606)
!606 = !{!607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !605, file: !38, line: 1227, baseType: !445, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !605, file: !38, line: 1228, baseType: !445, size: 64, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !605, file: !38, line: 1229, baseType: !445, size: 64, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !605, file: !38, line: 1230, baseType: !445, size: 64, offset: 192)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !605, file: !38, line: 1231, baseType: !445, size: 64, offset: 256)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !605, file: !38, line: 1232, baseType: !445, size: 64, offset: 320)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !605, file: !38, line: 1233, baseType: !445, size: 64, offset: 384)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !605, file: !38, line: 1234, baseType: !445, size: 64, offset: 448)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !605, file: !38, line: 1236, baseType: !445, size: 64, offset: 512)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !605, file: !38, line: 1237, baseType: !445, size: 64, offset: 576)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !605, file: !38, line: 1238, baseType: !445, size: 64, offset: 640)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !561, file: !555, line: 48, baseType: !619, size: 64, offset: 768)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!344, !552, !598, !602}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !561, file: !555, line: 49, baseType: !623, size: 64, offset: 832)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{!344, !552, !581, !445, !626, !445, !390, !390, !581}
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !38, line: 1291, baseType: !37)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !561, file: !555, line: 50, baseType: !628, size: 64, offset: 896)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!344, !552, !631, !632}
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !38, line: 238, baseType: !50)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !561, file: !555, line: 52, baseType: !634, size: 64, offset: 960)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!344, !552, !637, !638}
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !38, line: 612, baseType: !56)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !38, line: 600, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 592, size: 640, elements: !641)
!641 = !{!642, !643, !644, !645, !646, !647, !648, !649, !650, !651}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !640, file: !38, line: 593, baseType: !392, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !640, file: !38, line: 594, baseType: !392, size: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !640, file: !38, line: 594, baseType: !392, size: 64, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !640, file: !38, line: 594, baseType: !392, size: 64, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !640, file: !38, line: 595, baseType: !392, size: 64, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !640, file: !38, line: 596, baseType: !392, size: 64, offset: 320)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !640, file: !38, line: 597, baseType: !392, size: 64, offset: 384)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !640, file: !38, line: 598, baseType: !392, size: 64, offset: 448)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !640, file: !38, line: 598, baseType: !392, size: 64, offset: 512)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !640, file: !38, line: 599, baseType: !392, size: 64, offset: 576)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !561, file: !555, line: 53, baseType: !653, size: 64, offset: 1024)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{!344, !552, !552, !656}
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !561, file: !555, line: 54, baseType: !658, size: 64, offset: 1088)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!344, !552, !581}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !561, file: !555, line: 55, baseType: !578, size: 64, offset: 1152)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !561, file: !555, line: 56, baseType: !663, size: 64, offset: 1216)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!344, !552, !666, !444}
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !62, line: 155, baseType: !61)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !561, file: !555, line: 58, baseType: !668, size: 64, offset: 1280)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!344, !552, !671}
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !38, line: 424, baseType: !69)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !561, file: !555, line: 59, baseType: !668, size: 64, offset: 1344)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !561, file: !555, line: 60, baseType: !674, size: 64, offset: 1408)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!344, !552, !677, !506}
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !38, line: 469, baseType: !73)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !561, file: !555, line: 61, baseType: !679, size: 64, offset: 1472)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!344, !552}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !561, file: !555, line: 63, baseType: !683, size: 64, offset: 1536)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{!344, !552, !390, !567, !454, !581, !581}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !561, file: !555, line: 64, baseType: !687, size: 64, offset: 1600)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{!344, !552, !552, !598, !598, !602}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !561, file: !555, line: 65, baseType: !691, size: 64, offset: 1664)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!344, !552, !552, !602}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !561, file: !555, line: 66, baseType: !695, size: 64, offset: 1728)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{!344, !552, !552, !598, !602}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !561, file: !555, line: 67, baseType: !691, size: 64, offset: 1792)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !561, file: !555, line: 69, baseType: !679, size: 64, offset: 1856)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !561, file: !555, line: 70, baseType: !687, size: 64, offset: 1920)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !561, file: !555, line: 71, baseType: !695, size: 64, offset: 1984)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !561, file: !555, line: 72, baseType: !703, size: 64, offset: 2048)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{!344, !552, !632}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !561, file: !555, line: 73, baseType: !679, size: 64, offset: 2112)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !561, file: !555, line: 75, baseType: !708, size: 64, offset: 2176)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!344, !552, !711, !632}
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !38, line: 563, baseType: !104)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !561, file: !555, line: 76, baseType: !578, size: 64, offset: 2240)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !561, file: !555, line: 77, baseType: !578, size: 64, offset: 2304)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !561, file: !555, line: 78, baseType: !595, size: 64, offset: 2368)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !561, file: !555, line: 79, baseType: !619, size: 64, offset: 2432)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !561, file: !555, line: 81, baseType: !717, size: 64, offset: 2496)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{!344, !552, !454, !552, !720}
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !38, line: 285, baseType: !109)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !561, file: !555, line: 82, baseType: !722, size: 64, offset: 2560)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!344, !552, !390, !725, !725, !631, !727}
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !598)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !561, file: !555, line: 83, baseType: !729, size: 64, offset: 2624)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!344, !552, !390, !732, !390}
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !561, file: !555, line: 84, baseType: !734, size: 64, offset: 2688)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!344, !552, !390, !567, !390, !567, !453}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !561, file: !555, line: 85, baseType: !738, size: 64, offset: 2752)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!344, !552, !552, !720}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !561, file: !555, line: 87, baseType: !742, size: 64, offset: 2816)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!344, !552, !581, !436}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !561, file: !555, line: 88, baseType: !746, size: 64, offset: 2880)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!344, !552, !454}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !561, file: !555, line: 89, baseType: !746, size: 64, offset: 2944)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !561, file: !555, line: 90, baseType: !751, size: 64, offset: 3008)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!344, !552, !581, !571}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !561, file: !555, line: 91, baseType: !683, size: 64, offset: 3072)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !561, file: !555, line: 93, baseType: !756, size: 64, offset: 3136)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!344, !552, !759}
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !760)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !561, file: !555, line: 94, baseType: !763, size: 64, offset: 3200)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{!344, !552, !390, !506, !506, !436, !766, !766, !656}
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !561, file: !555, line: 95, baseType: !763, size: 64, offset: 3264)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !561, file: !555, line: 96, baseType: !763, size: 64, offset: 3328)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !561, file: !555, line: 97, baseType: !763, size: 64, offset: 3392)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !561, file: !555, line: 99, baseType: !771, size: 64, offset: 3456)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{!344, !552, !774, !777}
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !599, line: 51, baseType: !775)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !599, line: 51, flags: DIFlagFwdDecl)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !38, line: 1378, baseType: !778)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !555, line: 609, size: 6208, elements: !780)
!780 = !{!781, !782, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !801, !808, !809, !810, !811, !812, !813, !814, !815, !819, !820, !821, !822, !823, !825, !826, !827, !828, !829, !830, !831}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !779, file: !555, line: 610, baseType: !558, size: 4480)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !779, file: !555, line: 610, baseType: !783, size: 32, offset: 4480)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 32, elements: !386)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !779, file: !555, line: 611, baseType: !390, size: 32, offset: 4512)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !779, file: !555, line: 611, baseType: !390, size: 32, offset: 4544)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !779, file: !555, line: 611, baseType: !390, size: 32, offset: 4576)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !779, file: !555, line: 612, baseType: !390, size: 32, offset: 4608)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !779, file: !555, line: 613, baseType: !390, size: 32, offset: 4640)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !779, file: !555, line: 614, baseType: !436, size: 64, offset: 4672)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !779, file: !555, line: 615, baseType: !438, size: 64, offset: 4736)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !779, file: !555, line: 616, baseType: !732, size: 64, offset: 4800)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !779, file: !555, line: 617, baseType: !436, size: 64, offset: 4864)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !779, file: !555, line: 618, baseType: !794, size: 64, offset: 4928)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !555, line: 602, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !555, line: 598, size: 128, elements: !797)
!797 = !{!798, !799, !800}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !796, file: !555, line: 599, baseType: !390, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !796, file: !555, line: 600, baseType: !390, size: 32, offset: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !796, file: !555, line: 601, baseType: !453, size: 64, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !779, file: !555, line: 619, baseType: !802, size: 64, offset: 4992)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !555, line: 607, baseType: !804)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !555, line: 604, size: 128, elements: !805)
!805 = !{!806, !807}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !804, file: !555, line: 605, baseType: !390, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !804, file: !555, line: 606, baseType: !453, size: 64, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !779, file: !555, line: 620, baseType: !453, size: 64, offset: 5056)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !779, file: !555, line: 621, baseType: !445, size: 64, offset: 5120)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !779, file: !555, line: 622, baseType: !445, size: 64, offset: 5184)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !779, file: !555, line: 623, baseType: !581, size: 64, offset: 5248)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !779, file: !555, line: 623, baseType: !581, size: 64, offset: 5312)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !779, file: !555, line: 623, baseType: !581, size: 64, offset: 5376)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !779, file: !555, line: 624, baseType: !506, size: 32, offset: 5440)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !779, file: !555, line: 625, baseType: !816, size: 64, offset: 5504)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{!344}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !779, file: !555, line: 626, baseType: !427, size: 64, offset: 5568)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !779, file: !555, line: 627, baseType: !581, size: 64, offset: 5632)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !779, file: !555, line: 628, baseType: !390, size: 32, offset: 5696)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !779, file: !555, line: 629, baseType: !367, size: 64, offset: 5760)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !779, file: !555, line: 630, baseType: !824, size: 32, offset: 5824)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !116, line: 213, baseType: !115)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !779, file: !555, line: 631, baseType: !390, size: 32, offset: 5856)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !779, file: !555, line: 631, baseType: !390, size: 32, offset: 5888)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !779, file: !555, line: 632, baseType: !506, size: 32, offset: 5920)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !779, file: !555, line: 633, baseType: !506, size: 32, offset: 5952)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !779, file: !555, line: 634, baseType: !378, size: 64, offset: 6016)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !779, file: !555, line: 634, baseType: !427, size: 64, offset: 6080)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !779, file: !555, line: 635, baseType: !398, size: 64, offset: 6144)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !561, file: !555, line: 100, baseType: !833, size: 64, offset: 3520)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{!344, !552, !390, !390, !836, !839}
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !116, line: 215, baseType: !838)
!838 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !561, file: !555, line: 101, baseType: !679, size: 64, offset: 3584)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !561, file: !555, line: 102, baseType: !842, size: 64, offset: 3648)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!344, !552, !598, !598, !632}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !561, file: !555, line: 103, baseType: !564, size: 64, offset: 3712)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !561, file: !555, line: 105, baseType: !847, size: 64, offset: 3776)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{!344, !552, !598, !598, !631, !632}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !561, file: !555, line: 106, baseType: !679, size: 64, offset: 3840)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !561, file: !555, line: 107, baseType: !852, size: 64, offset: 3904)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{!344, !552, !354}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !561, file: !555, line: 108, baseType: !856, size: 64, offset: 3968)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{!344, !552, !859, !631, !632}
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !38, line: 25, baseType: !367)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !561, file: !555, line: 109, baseType: !816, size: 64, offset: 4032)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !561, file: !555, line: 111, baseType: !862, size: 64, offset: 4096)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DISubroutineType(types: !864)
!864 = !{!344, !552, !552, !552, !445, !552}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !561, file: !555, line: 112, baseType: !866, size: 64, offset: 4160)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DISubroutineType(types: !868)
!868 = !{!344, !552, !552, !552, !552}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !561, file: !555, line: 113, baseType: !870, size: 64, offset: 4224)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DISubroutineType(types: !872)
!872 = !{!344, !552, !873, !873}
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !599, line: 30, baseType: !874)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !599, line: 30, flags: DIFlagFwdDecl)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !561, file: !555, line: 114, baseType: !564, size: 64, offset: 4288)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !561, file: !555, line: 115, baseType: !683, size: 64, offset: 4352)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !561, file: !555, line: 117, baseType: !742, size: 64, offset: 4416)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !561, file: !555, line: 118, baseType: !742, size: 64, offset: 4480)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !561, file: !555, line: 119, baseType: !856, size: 64, offset: 4544)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !561, file: !555, line: 120, baseType: !882, size: 64, offset: 4608)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DISubroutineType(types: !884)
!884 = !{!344, !552, !885, !656}
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !38, line: 1675, baseType: !120)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !561, file: !555, line: 121, baseType: !816, size: 64, offset: 4672)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !561, file: !555, line: 123, baseType: !888, size: 64, offset: 4736)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DISubroutineType(types: !890)
!890 = !{!344, !552, !390, !427}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !561, file: !555, line: 124, baseType: !892, size: 64, offset: 4800)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DISubroutineType(types: !894)
!894 = !{!344, !552, !777, !581, !427}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !561, file: !555, line: 125, baseType: !896, size: 64, offset: 4864)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DISubroutineType(types: !898)
!898 = !{!344, !482, !552}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !561, file: !555, line: 126, baseType: !578, size: 64, offset: 4928)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !561, file: !555, line: 127, baseType: !578, size: 64, offset: 4992)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !561, file: !555, line: 129, baseType: !902, size: 64, offset: 5056)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{!344, !552, !732}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !561, file: !555, line: 130, baseType: !906, size: 64, offset: 5120)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{!344, !552, !909, !909}
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !62, line: 654, baseType: !910)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !62, line: 653, size: 128, elements: !912)
!912 = !{!913, !914}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !911, file: !62, line: 653, baseType: !390, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !911, file: !62, line: 653, baseType: !581, size: 64, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !561, file: !555, line: 131, baseType: !906, size: 64, offset: 5184)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !561, file: !555, line: 132, baseType: !917, size: 64, offset: 5248)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{!344, !552, !436, !436, !436}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !561, file: !555, line: 133, baseType: !852, size: 64, offset: 5312)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !561, file: !555, line: 135, baseType: !922, size: 64, offset: 5376)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!344, !552, !445, !656}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !561, file: !555, line: 136, baseType: !922, size: 64, offset: 5440)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !561, file: !555, line: 137, baseType: !927, size: 64, offset: 5504)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{!344, !552, !656}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !561, file: !555, line: 138, baseType: !564, size: 64, offset: 5568)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !561, file: !555, line: 139, baseType: !932, size: 64, offset: 5632)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!344, !552, !935, !935}
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !561, file: !555, line: 141, baseType: !816, size: 64, offset: 5696)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !561, file: !555, line: 142, baseType: !938, size: 64, offset: 5760)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!344, !552, !552, !445, !552}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !561, file: !555, line: 143, baseType: !942, size: 64, offset: 5824)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{!344, !552, !552, !552}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !561, file: !555, line: 144, baseType: !816, size: 64, offset: 5888)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !561, file: !555, line: 145, baseType: !938, size: 64, offset: 5952)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !561, file: !555, line: 147, baseType: !942, size: 64, offset: 6016)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !561, file: !555, line: 148, baseType: !816, size: 64, offset: 6080)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !561, file: !555, line: 149, baseType: !938, size: 64, offset: 6144)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !561, file: !555, line: 150, baseType: !942, size: 64, offset: 6208)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !561, file: !555, line: 151, baseType: !952, size: 64, offset: 6272)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DISubroutineType(types: !954)
!954 = !{!344, !552, !506}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !561, file: !555, line: 153, baseType: !679, size: 64, offset: 6336)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !561, file: !555, line: 154, baseType: !679, size: 64, offset: 6400)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !561, file: !555, line: 155, baseType: !679, size: 64, offset: 6464)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !561, file: !555, line: 156, baseType: !679, size: 64, offset: 6528)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !561, file: !555, line: 157, baseType: !852, size: 64, offset: 6592)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !561, file: !555, line: 159, baseType: !961, size: 64, offset: 6656)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!344, !552, !390, !569}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !561, file: !555, line: 160, baseType: !679, size: 64, offset: 6720)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !561, file: !555, line: 161, baseType: !679, size: 64, offset: 6784)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !561, file: !555, line: 162, baseType: !679, size: 64, offset: 6848)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !561, file: !555, line: 163, baseType: !679, size: 64, offset: 6912)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !561, file: !555, line: 165, baseType: !942, size: 64, offset: 6976)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !561, file: !555, line: 166, baseType: !942, size: 64, offset: 7040)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !561, file: !555, line: 167, baseType: !742, size: 64, offset: 7104)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !561, file: !555, line: 168, baseType: !972, size: 64, offset: 7168)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!344, !552, !581, !390}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !561, file: !555, line: 169, baseType: !976, size: 64, offset: 7232)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!344, !552, !656, !436}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !561, file: !555, line: 171, baseType: !703, size: 64, offset: 7296)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !561, file: !555, line: 172, baseType: !679, size: 64, offset: 7360)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !561, file: !555, line: 173, baseType: !982, size: 64, offset: 7424)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!344, !552, !436, !766}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !561, file: !555, line: 174, baseType: !842, size: 64, offset: 7488)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !561, file: !555, line: 175, baseType: !842, size: 64, offset: 7552)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !561, file: !555, line: 177, baseType: !578, size: 64, offset: 7616)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !561, file: !555, line: 178, baseType: !628, size: 64, offset: 7680)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !561, file: !555, line: 179, baseType: !578, size: 64, offset: 7744)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !561, file: !555, line: 180, baseType: !585, size: 64, offset: 7808)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !561, file: !555, line: 181, baseType: !992, size: 64, offset: 7872)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!344, !552, !346, !631, !632}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !561, file: !555, line: 183, baseType: !902, size: 64, offset: 7936)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !561, file: !555, line: 184, baseType: !663, size: 64, offset: 8000)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !561, file: !555, line: 185, baseType: !998, size: 64, offset: 8064)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!344, !552, !1001}
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !561, file: !555, line: 186, baseType: !1003, size: 64, offset: 8128)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!344, !552, !390, !567, !453}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !561, file: !555, line: 187, baseType: !722, size: 64, offset: 8192)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !561, file: !555, line: 189, baseType: !1008, size: 64, offset: 8256)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!344, !552, !390, !390, !436, !569}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !561, file: !555, line: 190, baseType: !816, size: 64, offset: 8320)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !561, file: !555, line: 191, baseType: !938, size: 64, offset: 8384)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !561, file: !555, line: 192, baseType: !942, size: 64, offset: 8448)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !561, file: !555, line: 193, baseType: !1015, size: 64, offset: 8512)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!344, !552, !774, !1018}
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !38, line: 1401, baseType: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !555, line: 660, size: 5312, elements: !1021)
!1021 = !{!1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1020, file: !555, line: 661, baseType: !558, size: 4480)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1020, file: !555, line: 661, baseType: !783, size: 32, offset: 4480)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1020, file: !555, line: 662, baseType: !390, size: 32, offset: 4512)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1020, file: !555, line: 662, baseType: !390, size: 32, offset: 4544)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1020, file: !555, line: 662, baseType: !390, size: 32, offset: 4576)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1020, file: !555, line: 663, baseType: !390, size: 32, offset: 4608)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1020, file: !555, line: 664, baseType: !390, size: 32, offset: 4640)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1020, file: !555, line: 665, baseType: !436, size: 64, offset: 4672)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1020, file: !555, line: 666, baseType: !436, size: 64, offset: 4736)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1020, file: !555, line: 667, baseType: !390, size: 32, offset: 4800)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1020, file: !555, line: 668, baseType: !824, size: 32, offset: 4832)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1020, file: !555, line: 670, baseType: !436, size: 64, offset: 4864)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1020, file: !555, line: 670, baseType: !436, size: 64, offset: 4928)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1020, file: !555, line: 671, baseType: !436, size: 64, offset: 4992)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1020, file: !555, line: 672, baseType: !436, size: 64, offset: 5056)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1020, file: !555, line: 673, baseType: !436, size: 64, offset: 5120)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1020, file: !555, line: 674, baseType: !390, size: 32, offset: 5184)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1020, file: !555, line: 675, baseType: !436, size: 64, offset: 5248)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !561, file: !555, line: 195, baseType: !1041, size: 64, offset: 8576)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!344, !1018, !552, !552}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !561, file: !555, line: 196, baseType: !1041, size: 64, offset: 8640)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !561, file: !555, line: 197, baseType: !816, size: 64, offset: 8704)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !561, file: !555, line: 198, baseType: !938, size: 64, offset: 8768)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !561, file: !555, line: 199, baseType: !942, size: 64, offset: 8832)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !561, file: !555, line: 201, baseType: !1049, size: 64, offset: 8896)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!344, !552, !390, !390}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !561, file: !555, line: 202, baseType: !717, size: 64, offset: 8960)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !561, file: !555, line: 203, baseType: !585, size: 64, offset: 9024)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !561, file: !555, line: 204, baseType: !771, size: 64, offset: 9088)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !561, file: !555, line: 205, baseType: !902, size: 64, offset: 9152)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !561, file: !555, line: 206, baseType: !1057, size: 64, offset: 9216)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!344, !346, !552, !390, !631, !632}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !561, file: !555, line: 208, baseType: !1061, size: 64, offset: 9280)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!344, !390, !727}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !561, file: !555, line: 209, baseType: !942, size: 64, offset: 9344)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !561, file: !555, line: 210, baseType: !734, size: 64, offset: 9408)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !554, file: !555, line: 438, baseType: !1067, size: 64, offset: 13952)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !599, line: 60, baseType: !1068)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !116, line: 240, size: 640, elements: !1070)
!1070 = !{!1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1069, file: !116, line: 241, baseType: !346, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1069, file: !116, line: 242, baseType: !407, size: 32, offset: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1069, file: !116, line: 243, baseType: !390, size: 32, offset: 96)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1069, file: !116, line: 243, baseType: !390, size: 32, offset: 128)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1069, file: !116, line: 244, baseType: !390, size: 32, offset: 160)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1069, file: !116, line: 244, baseType: !390, size: 32, offset: 192)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1069, file: !116, line: 245, baseType: !436, size: 64, offset: 256)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1069, file: !116, line: 246, baseType: !506, size: 32, offset: 320)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1069, file: !116, line: 247, baseType: !390, size: 32, offset: 352)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1069, file: !116, line: 251, baseType: !390, size: 32, offset: 384)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1069, file: !116, line: 252, baseType: !873, size: 64, offset: 448)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1069, file: !116, line: 253, baseType: !506, size: 32, offset: 512)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1069, file: !116, line: 254, baseType: !390, size: 32, offset: 544)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1069, file: !116, line: 254, baseType: !390, size: 32, offset: 576)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1069, file: !116, line: 255, baseType: !390, size: 32, offset: 608)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !554, file: !555, line: 438, baseType: !1067, size: 64, offset: 14016)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !554, file: !555, line: 439, baseType: !427, size: 64, offset: 14080)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !554, file: !555, line: 440, baseType: !1089, size: 32, offset: 14144)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !38, line: 161, baseType: !265)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !554, file: !555, line: 441, baseType: !506, size: 32, offset: 14176)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !554, file: !555, line: 442, baseType: !506, size: 32, offset: 14208)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !554, file: !555, line: 443, baseType: !1093, size: 448, offset: 14272)
!1093 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1094, size: 448, elements: !1095)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !38, line: 1159, baseType: !367)
!1095 = !{!1096}
!1096 = !DISubrange(count: 7)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !554, file: !555, line: 444, baseType: !506, size: 32, offset: 14720)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !554, file: !555, line: 445, baseType: !506, size: 32, offset: 14752)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !554, file: !555, line: 446, baseType: !390, size: 32, offset: 14784)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !554, file: !555, line: 447, baseType: !429, size: 64, offset: 14848)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !554, file: !555, line: 448, baseType: !429, size: 64, offset: 14912)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !554, file: !555, line: 449, baseType: !639, size: 640, offset: 14976)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !554, file: !555, line: 450, baseType: !571, size: 32, offset: 15616)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !554, file: !555, line: 451, baseType: !1105, size: 2880, offset: 15680)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !555, line: 318, baseType: !1106)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !555, line: 319, size: 2880, elements: !1107)
!1107 = !{!1108, !1109, !1110, !1111, !1112, !1113, !1114, !1127, !1128, !1133, !1138, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1153, !1154, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1186, !1187, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1210, !1211, !1212, !1216, !1217}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1106, file: !555, line: 320, baseType: !390, size: 32)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1106, file: !555, line: 321, baseType: !390, size: 32, offset: 32)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1106, file: !555, line: 322, baseType: !390, size: 32, offset: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1106, file: !555, line: 323, baseType: !390, size: 32, offset: 96)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1106, file: !555, line: 324, baseType: !390, size: 32, offset: 128)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1106, file: !555, line: 325, baseType: !390, size: 32, offset: 160)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1106, file: !555, line: 326, baseType: !1115, size: 64, offset: 192)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !555, line: 293, baseType: !1116)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !555, line: 295, size: 448, elements: !1118)
!1118 = !{!1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1117, file: !555, line: 296, baseType: !1115, size: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1117, file: !555, line: 297, baseType: !453, size: 64, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1117, file: !555, line: 297, baseType: !453, size: 64, offset: 128)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1117, file: !555, line: 298, baseType: !436, size: 64, offset: 192)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1117, file: !555, line: 298, baseType: !436, size: 64, offset: 256)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1117, file: !555, line: 299, baseType: !390, size: 32, offset: 320)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1117, file: !555, line: 300, baseType: !390, size: 32, offset: 352)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1117, file: !555, line: 301, baseType: !390, size: 32, offset: 384)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1106, file: !555, line: 326, baseType: !1115, size: 64, offset: 256)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1106, file: !555, line: 328, baseType: !1129, size: 64, offset: 320)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!344, !552, !1132, !436}
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1106, file: !555, line: 329, baseType: !1134, size: 64, offset: 384)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!344, !1132, !1137, !438, !438, !456, !436}
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1106, file: !555, line: 330, baseType: !1139, size: 64, offset: 448)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = !DISubroutineType(types: !1141)
!1141 = !{!344, !1132}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1106, file: !555, line: 331, baseType: !1139, size: 64, offset: 512)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1106, file: !555, line: 334, baseType: !346, size: 64, offset: 576)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1106, file: !555, line: 335, baseType: !407, size: 32, offset: 640)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1106, file: !555, line: 335, baseType: !407, size: 32, offset: 672)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1106, file: !555, line: 336, baseType: !407, size: 32, offset: 704)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1106, file: !555, line: 336, baseType: !407, size: 32, offset: 736)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1106, file: !555, line: 337, baseType: !1149, size: 64, offset: 768)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !347, line: 339, baseType: !1151)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !347, line: 339, flags: DIFlagFwdDecl)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1106, file: !555, line: 338, baseType: !1149, size: 64, offset: 832)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1106, file: !555, line: 339, baseType: !1155, size: 64, offset: 896)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !347, line: 341, baseType: !1157)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !347, line: 351, size: 192, elements: !1158)
!1158 = !{!1159, !1160, !1161, !1162, !1163}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1157, file: !347, line: 354, baseType: !74, size: 32)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1157, file: !347, line: 355, baseType: !74, size: 32, offset: 32)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1157, file: !347, line: 356, baseType: !74, size: 32, offset: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1157, file: !347, line: 361, baseType: !74, size: 32, offset: 96)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1157, file: !347, line: 362, baseType: !502, size: 64, offset: 128)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1106, file: !555, line: 340, baseType: !390, size: 32, offset: 960)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1106, file: !555, line: 340, baseType: !390, size: 32, offset: 992)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1106, file: !555, line: 341, baseType: !453, size: 64, offset: 1024)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1106, file: !555, line: 342, baseType: !436, size: 64, offset: 1088)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1106, file: !555, line: 343, baseType: !456, size: 64, offset: 1152)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1106, file: !555, line: 344, baseType: !438, size: 64, offset: 1216)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1106, file: !555, line: 345, baseType: !390, size: 32, offset: 1280)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1106, file: !555, line: 346, baseType: !1137, size: 64, offset: 1344)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1106, file: !555, line: 347, baseType: !506, size: 32, offset: 1408)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1106, file: !555, line: 348, baseType: !390, size: 32, offset: 1440)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1106, file: !555, line: 351, baseType: !506, size: 32, offset: 1472)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1106, file: !555, line: 352, baseType: !506, size: 32, offset: 1504)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1106, file: !555, line: 353, baseType: !407, size: 32, offset: 1536)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1106, file: !555, line: 354, baseType: !407, size: 32, offset: 1568)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1106, file: !555, line: 355, baseType: !1137, size: 64, offset: 1600)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1106, file: !555, line: 356, baseType: !1137, size: 64, offset: 1664)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1106, file: !555, line: 357, baseType: !1181, size: 64, offset: 1728)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !555, line: 310, baseType: !1183)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !555, line: 308, size: 32, elements: !1184)
!1184 = !{!1185}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1183, file: !555, line: 309, baseType: !390, size: 32)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1106, file: !555, line: 357, baseType: !1181, size: 64, offset: 1792)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1106, file: !555, line: 358, baseType: !1188, size: 64, offset: 1856)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !555, line: 316, baseType: !1190)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !555, line: 312, size: 128, elements: !1191)
!1191 = !{!1192, !1193, !1194}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1190, file: !555, line: 313, baseType: !427, size: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1190, file: !555, line: 314, baseType: !390, size: 32, offset: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1190, file: !555, line: 315, baseType: !369, size: 8, offset: 96)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1106, file: !555, line: 359, baseType: !1188, size: 64, offset: 1920)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1106, file: !555, line: 360, baseType: !1188, size: 64, offset: 1984)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1106, file: !555, line: 361, baseType: !390, size: 32, offset: 2048)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1106, file: !555, line: 362, baseType: !407, size: 32, offset: 2080)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1106, file: !555, line: 363, baseType: !390, size: 32, offset: 2112)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1106, file: !555, line: 364, baseType: !1137, size: 64, offset: 2176)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1106, file: !555, line: 365, baseType: !1155, size: 64, offset: 2240)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1106, file: !555, line: 366, baseType: !407, size: 32, offset: 2304)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1106, file: !555, line: 367, baseType: !407, size: 32, offset: 2336)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1106, file: !555, line: 368, baseType: !1149, size: 64, offset: 2368)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1106, file: !555, line: 369, baseType: !1149, size: 64, offset: 2432)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1106, file: !555, line: 370, baseType: !1207, size: 64, offset: 2496)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !6, line: 678, baseType: !1208)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !6, line: 678, flags: DIFlagFwdDecl)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1106, file: !555, line: 371, baseType: !1207, size: 64, offset: 2560)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1106, file: !555, line: 372, baseType: !1207, size: 64, offset: 2624)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1106, file: !555, line: 373, baseType: !1213, size: 64, offset: 2688)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !347, line: 331, baseType: !1214)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1215 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !347, line: 331, flags: DIFlagFwdDecl)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1106, file: !555, line: 374, baseType: !502, size: 64, offset: 2752)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1106, file: !555, line: 375, baseType: !1218, size: 64, offset: 2816)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !554, file: !555, line: 451, baseType: !1105, size: 2880, offset: 18560)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !554, file: !555, line: 452, baseType: !1221, size: 64, offset: 21440)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !38, line: 1723, baseType: !1222)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !555, line: 681, size: 4864, elements: !1224)
!1224 = !{!1225, !1226, !1227, !1228, !1229, !1230, !1231, !1235}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1223, file: !555, line: 682, baseType: !558, size: 4480)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1223, file: !555, line: 682, baseType: !783, size: 32, offset: 4480)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1223, file: !555, line: 683, baseType: !506, size: 32, offset: 4512)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1223, file: !555, line: 684, baseType: !390, size: 32, offset: 4544)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1223, file: !555, line: 685, baseType: !935, size: 64, offset: 4608)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1223, file: !555, line: 686, baseType: !453, size: 64, offset: 4672)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1223, file: !555, line: 687, baseType: !1232, size: 64, offset: 4736)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = !DISubroutineType(types: !1234)
!1234 = !{!344, !1221, !581, !427}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1223, file: !555, line: 688, baseType: !427, size: 64, offset: 4800)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !554, file: !555, line: 453, baseType: !1221, size: 64, offset: 21504)
