; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/baij/seq/baijfact11.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/baij/seq/baijfact11.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!243 = !DIEnumerator(name: "MATOP_INVERT_BLOCK_DIAGONAL", value: 126, isUnsigned: true)
!244 = !DIEnumerator(name: "MATOP_CREATE_SUB_MATRICES_MPI", value: 128, isUnsigned: true)
!245 = !DIEnumerator(name: "MATOP_SET_VALUES_BATCH", value: 129, isUnsigned: true)
!246 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT", value: 130, isUnsigned: true)
!247 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_SYMBO", value: 131, isUnsigned: true)
!248 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_NUMER", value: 132, isUnsigned: true)
!249 = !DIEnumerator(name: "MATOP_TRANSPOSE_COLORING_CREAT", value: 133, isUnsigned: true)
!250 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_SPT", value: 134, isUnsigned: true)
!251 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_DEN", value: 135, isUnsigned: true)
!252 = !DIEnumerator(name: "MATOP_RART", value: 136, isUnsigned: true)
!253 = !DIEnumerator(name: "MATOP_RART_SYMBOLIC", value: 137, isUnsigned: true)
!254 = !DIEnumerator(name: "MATOP_RART_NUMERIC", value: 138, isUnsigned: true)
!255 = !DIEnumerator(name: "MATOP_SET_BLOCK_SIZES", value: 139, isUnsigned: true)
!256 = !DIEnumerator(name: "MATOP_AYPX", value: 140, isUnsigned: true)
!257 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!258 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!259 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!260 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!261 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!262 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 161, baseType: !5, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272}
!265 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1189, baseType: !5, size: 32, elements: !301)
!301 = !{!302, !303, !304, !305}
!302 = !DIEnumerator(name: "MAT_SHIFT_NONE", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "MAT_SHIFT_NONZERO", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "MAT_SHIFT_POSITIVE_DEFINITE", value: 2, isUnsigned: true)
!305 = !DIEnumerator(name: "MAT_SHIFT_INBLOCKS", value: 3, isUnsigned: true)
!306 = !{!307, !387, !466, !537, !408, !456}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_SeqBAIJ", file: !309, line: 31, baseType: !310)
!309 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/baij/seq/baij.h", directory: "/home/users/ndemeye/xSDK")
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !309, line: 28, size: 2240, elements: !311)
!311 = !{!312, !314, !316, !317, !318, !319, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !339, !340, !341, !342, !343, !344, !345, !352, !354, !359, !360, !361, !362, !1330, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "roworiented", scope: !310, file: !309, line: 29, baseType: !313, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "nonew", scope: !310, file: !309, line: 29, baseType: !315, size: 32, offset: 32)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "nounused", scope: !310, file: !309, line: 29, baseType: !315, size: 32, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "singlemalloc", scope: !310, file: !309, line: 29, baseType: !313, size: 32, offset: 96)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "maxnz", scope: !310, file: !309, line: 29, baseType: !315, size: 32, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "imax", scope: !310, file: !309, line: 29, baseType: !320, size: 64, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "ilen", scope: !310, file: !309, line: 29, baseType: !320, size: 64, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ipre", scope: !310, file: !309, line: 29, baseType: !320, size: 64, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "free_imax_ilen", scope: !310, file: !309, line: 29, baseType: !313, size: 32, offset: 384)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !310, file: !309, line: 29, baseType: !315, size: 32, offset: 416)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !310, file: !309, line: 29, baseType: !315, size: 32, offset: 448)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "keepnonzeropattern", scope: !310, file: !309, line: 29, baseType: !313, size: 32, offset: 480)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ignorezeroentries", scope: !310, file: !309, line: 29, baseType: !313, size: 32, offset: 512)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "free_ij", scope: !310, file: !309, line: 29, baseType: !313, size: 32, offset: 544)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "free_a", scope: !310, file: !309, line: 29, baseType: !313, size: 32, offset: 576)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "compressedrow", scope: !310, file: !309, line: 29, baseType: !331, size: 192, offset: 640)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_CompressedRow", file: !332, line: 407, baseType: !333)
!332 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !332, line: 402, size: 192, elements: !334)
!334 = !{!335, !336, !337, !338}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !333, file: !332, line: 403, baseType: !313, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !333, file: !332, line: 404, baseType: !315, size: 32, offset: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !333, file: !332, line: 405, baseType: !320, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "rindex", scope: !333, file: !332, line: 406, baseType: !320, size: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "nz", scope: !310, file: !309, line: 29, baseType: !315, size: 32, offset: 832)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !310, file: !309, line: 29, baseType: !320, size: 64, offset: 896)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !310, file: !309, line: 29, baseType: !320, size: 64, offset: 960)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "diag", scope: !310, file: !309, line: 29, baseType: !320, size: 64, offset: 1024)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerorowcnt", scope: !310, file: !309, line: 29, baseType: !315, size: 32, offset: 1088)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "free_diag", scope: !310, file: !309, line: 29, baseType: !313, size: 32, offset: 1120)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !310, file: !309, line: 29, baseType: !346, size: 64, offset: 1152)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatScalar", file: !348, line: 799, baseType: !349)
!348 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmath.h", directory: "/home/users/ndemeye/xSDK")
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !351)
!351 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "solve_work", scope: !310, file: !309, line: 29, baseType: !353, size: 64, offset: 1216)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !310, file: !309, line: 29, baseType: !355, size: 64, offset: 1280)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !356, line: 11, baseType: !357)
!356 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !356, line: 11, flags: DIFlagFwdDecl)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !310, file: !309, line: 29, baseType: !355, size: 64, offset: 1344)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "icol", scope: !310, file: !309, line: 29, baseType: !355, size: 64, offset: 1408)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !310, file: !309, line: 29, baseType: !313, size: 32, offset: 1472)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !310, file: !309, line: 29, baseType: !363, size: 64, offset: 1536)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !332, line: 436, size: 23424, elements: !366)
!366 = !{!367, !570, !1073, !1093, !1094, !1095, !1097, !1098, !1099, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1226, !1227, !1243, !1244, !1245, !1246, !1247, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1282, !1302, !1303, !1305, !1306, !1307, !1308, !1309, !1310, !1328, !1329}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !365, file: !332, line: 437, baseType: !368, size: 4480)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !369, line: 122, baseType: !370)
!369 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !369, line: 73, size: 4480, elements: !371)
!371 = !{!372, !374, !429, !430, !431, !433, !434, !435, !436, !444, !445, !447, !451, !455, !457, !458, !459, !460, !461, !462, !463, !464, !465, !467, !469, !470, !471, !473, !474, !475, !477, !478, !479, !480, !481, !483, !485, !486, !487, !488, !489, !490, !492, !493, !494, !504, !506, !507, !511, !512, !560, !565, !567, !568, !569}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !370, file: !369, line: 74, baseType: !373, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !370, file: !369, line: 75, baseType: !375, size: 448, offset: 64)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 448, elements: !427)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !369, line: 53, baseType: !377)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !369, line: 45, size: 448, elements: !378)
!378 = !{!379, !391, !399, !404, !411, !415, !422}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !377, file: !369, line: 46, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!383, !384, !386}
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !388, line: 330, baseType: !389)
!388 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !388, line: 330, flags: DIFlagFwdDecl)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !377, file: !369, line: 47, baseType: !392, size: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!383, !384, !395}
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !396, line: 16, baseType: !397)
!396 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !396, line: 16, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !377, file: !369, line: 48, baseType: !400, size: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!383, !403}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !377, file: !369, line: 49, baseType: !405, size: 64, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!383, !384, !408, !384}
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !410)
!410 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !377, file: !369, line: 50, baseType: !412, size: 64, offset: 256)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!383, !384, !408, !403}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !377, file: !369, line: 51, baseType: !416, size: 64, offset: 320)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!383, !384, !408, !419}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{null}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !377, file: !369, line: 52, baseType: !423, size: 64, offset: 384)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!383, !384, !408, !426}
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!427 = !{!428}
!428 = !DISubrange(count: 1)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !370, file: !369, line: 76, baseType: !387, size: 64, offset: 512)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !370, file: !369, line: 77, baseType: !315, size: 32, offset: 576)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !370, file: !369, line: 78, baseType: !432, size: 64, offset: 640)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !351)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !370, file: !369, line: 78, baseType: !432, size: 64, offset: 704)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !370, file: !369, line: 78, baseType: !432, size: 64, offset: 768)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !370, file: !369, line: 78, baseType: !432, size: 64, offset: 832)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !370, file: !369, line: 79, baseType: !437, size: 64, offset: 896)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !438)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !439)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !440, line: 27, baseType: !441)
!440 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !442, line: 43, baseType: !443)
!442 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!443 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !370, file: !369, line: 80, baseType: !315, size: 32, offset: 960)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !370, file: !369, line: 81, baseType: !446, size: 32, offset: 992)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !370, file: !369, line: 82, baseType: !448, size: 64, offset: 1024)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !370, file: !369, line: 83, baseType: !452, size: 64, offset: 1088)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !370, file: !369, line: 84, baseType: !456, size: 64, offset: 1152)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !370, file: !369, line: 85, baseType: !456, size: 64, offset: 1216)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !370, file: !369, line: 86, baseType: !456, size: 64, offset: 1280)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !370, file: !369, line: 87, baseType: !456, size: 64, offset: 1344)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !370, file: !369, line: 88, baseType: !384, size: 64, offset: 1408)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !370, file: !369, line: 89, baseType: !437, size: 64, offset: 1472)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !370, file: !369, line: 90, baseType: !456, size: 64, offset: 1536)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !370, file: !369, line: 91, baseType: !456, size: 64, offset: 1600)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !370, file: !369, line: 92, baseType: !315, size: 32, offset: 1664)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !370, file: !369, line: 93, baseType: !466, size: 64, offset: 1728)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !370, file: !369, line: 94, baseType: !468, size: 64, offset: 1792)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !438)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !370, file: !369, line: 95, baseType: !315, size: 32, offset: 1856)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !370, file: !369, line: 95, baseType: !315, size: 32, offset: 1888)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !370, file: !369, line: 96, baseType: !472, size: 64, offset: 1920)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !370, file: !369, line: 96, baseType: !472, size: 64, offset: 1984)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !370, file: !369, line: 97, baseType: !320, size: 64, offset: 2048)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !370, file: !369, line: 97, baseType: !476, size: 64, offset: 2112)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !370, file: !369, line: 98, baseType: !315, size: 32, offset: 2176)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !370, file: !369, line: 98, baseType: !315, size: 32, offset: 2208)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !370, file: !369, line: 99, baseType: !472, size: 64, offset: 2240)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !370, file: !369, line: 99, baseType: !472, size: 64, offset: 2304)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !370, file: !369, line: 100, baseType: !482, size: 64, offset: 2368)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !370, file: !369, line: 100, baseType: !484, size: 64, offset: 2432)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !370, file: !369, line: 101, baseType: !315, size: 32, offset: 2496)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !370, file: !369, line: 101, baseType: !315, size: 32, offset: 2528)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !370, file: !369, line: 102, baseType: !472, size: 64, offset: 2560)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !370, file: !369, line: 102, baseType: !472, size: 64, offset: 2624)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !370, file: !369, line: 103, baseType: !353, size: 64, offset: 2688)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !370, file: !369, line: 103, baseType: !491, size: 64, offset: 2752)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !370, file: !369, line: 104, baseType: !426, size: 64, offset: 2816)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !370, file: !369, line: 105, baseType: !315, size: 32, offset: 2880)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !370, file: !369, line: 106, baseType: !495, size: 128, offset: 2944)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !496, size: 128, elements: !502)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !369, line: 64, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !369, line: 61, size: 128, elements: !499)
!499 = !{!500, !501}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !498, file: !369, line: 62, baseType: !419, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !498, file: !369, line: 63, baseType: !466, size: 64, offset: 64)
!502 = !{!503}
!503 = !DISubrange(count: 2)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !370, file: !369, line: 107, baseType: !505, size: 64, offset: 3072)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 64, elements: !502)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !370, file: !369, line: 108, baseType: !466, size: 64, offset: 3136)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !370, file: !369, line: 109, baseType: !508, size: 64, offset: 3200)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!383, !466}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !370, file: !369, line: 111, baseType: !315, size: 32, offset: 3264)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !370, file: !369, line: 112, baseType: !513, size: 320, offset: 3328)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 320, elements: !558)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{!383, !517, !384, !466}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !520)
!520 = !{!521, !522, !546, !547, !548, !549, !550, !551, !552, !553, !554}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !519, file: !10, line: 100, baseType: !315, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !519, file: !10, line: 101, baseType: !523, size: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !524)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !526)
!526 = !{!527, !528, !529, !530, !531, !534, !535, !536, !540, !541, !543, !544, !545}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !525, file: !10, line: 84, baseType: !456, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !525, file: !10, line: 85, baseType: !456, size: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !525, file: !10, line: 86, baseType: !466, size: 64, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !525, file: !10, line: 87, baseType: !448, size: 64, offset: 192)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !525, file: !10, line: 88, baseType: !532, size: 64, offset: 256)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !408)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !525, file: !10, line: 89, baseType: !410, size: 8, offset: 320)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !525, file: !10, line: 90, baseType: !456, size: 64, offset: 384)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !525, file: !10, line: 91, baseType: !537, size: 64, offset: 448)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !538, line: 46, baseType: !539)
!538 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!539 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !525, file: !10, line: 92, baseType: !313, size: 32, offset: 512)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !525, file: !10, line: 93, baseType: !542, size: 32, offset: 544)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !525, file: !10, line: 94, baseType: !523, size: 64, offset: 576)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !525, file: !10, line: 95, baseType: !456, size: 64, offset: 640)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !525, file: !10, line: 96, baseType: !466, size: 64, offset: 704)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !519, file: !10, line: 102, baseType: !456, size: 64, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !519, file: !10, line: 102, baseType: !456, size: 64, offset: 192)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !519, file: !10, line: 103, baseType: !456, size: 64, offset: 256)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !519, file: !10, line: 104, baseType: !387, size: 64, offset: 320)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !519, file: !10, line: 105, baseType: !313, size: 32, offset: 384)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !519, file: !10, line: 105, baseType: !313, size: 32, offset: 416)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !519, file: !10, line: 105, baseType: !313, size: 32, offset: 448)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !519, file: !10, line: 106, baseType: !384, size: 64, offset: 512)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !519, file: !10, line: 107, baseType: !555, size: 64, offset: 576)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!558 = !{!559}
!559 = !DISubrange(count: 5)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !370, file: !369, line: 113, baseType: !561, size: 320, offset: 3648)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !562, size: 320, elements: !558)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!383, !384, !466}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !370, file: !369, line: 114, baseType: !566, size: 320, offset: 3968)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 320, elements: !558)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !370, file: !369, line: 115, baseType: !313, size: 32, offset: 4288)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !370, file: !369, line: 120, baseType: !555, size: 64, offset: 4352)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !370, file: !369, line: 121, baseType: !313, size: 32, offset: 4416)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !365, file: !332, line: 437, baseType: !571, size: 9472, offset: 4480)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !572, size: 9472, elements: !427)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !332, line: 32, size: 9472, elements: !573)
!573 = !{!574, !583, !587, !588, !595, !599, !600, !601, !602, !603, !604, !605, !625, !629, !634, !640, !659, !664, !668, !669, !674, !679, !680, !685, !689, !693, !697, !701, !705, !706, !707, !708, !709, !713, !714, !719, !720, !721, !722, !723, !728, !735, !740, !744, !748, !752, !756, !757, !761, !762, !769, !774, !775, !776, !777, !839, !847, !848, !852, !853, !857, !858, !862, !867, !868, !872, !876, !883, !884, !885, !886, !887, !888, !893, !894, !898, !902, !906, !907, !908, !912, !922, !923, !927, !928, !932, !933, !937, !938, !943, !944, !948, !952, !953, !954, !955, !956, !957, !958, !962, !963, !964, !965, !966, !967, !971, !972, !973, !974, !975, !976, !977, !978, !982, !986, !987, !988, !992, !993, !994, !995, !996, !997, !998, !1002, !1003, !1004, !1009, !1013, !1014, !1018, !1019, !1020, !1021, !1047, !1051, !1052, !1053, !1054, !1055, !1059, !1060, !1061, !1062, !1063, !1067, !1071, !1072}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !572, file: !332, line: 34, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{!383, !363, !315, !578, !315, !578, !580, !582}
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !315)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !349)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !572, file: !332, line: 35, baseType: !584, size: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!383, !363, !315, !320, !476, !491}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !572, file: !332, line: 36, baseType: !584, size: 64, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !572, file: !332, line: 37, baseType: !589, size: 64, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{!383, !363, !592, !592}
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !593)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !572, file: !332, line: 38, baseType: !596, size: 64, offset: 256)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{!383, !363, !592, !592, !592}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !572, file: !332, line: 40, baseType: !589, size: 64, offset: 320)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !572, file: !332, line: 41, baseType: !596, size: 64, offset: 384)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !572, file: !332, line: 42, baseType: !589, size: 64, offset: 448)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !572, file: !332, line: 43, baseType: !596, size: 64, offset: 512)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !572, file: !332, line: 44, baseType: !589, size: 64, offset: 576)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !572, file: !332, line: 46, baseType: !596, size: 64, offset: 640)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !572, file: !332, line: 47, baseType: !606, size: 64, offset: 704)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{!383, !363, !355, !355, !609}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !613)
!613 = !{!614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !612, file: !36, line: 1227, baseType: !350, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !612, file: !36, line: 1228, baseType: !350, size: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !612, file: !36, line: 1229, baseType: !350, size: 64, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !612, file: !36, line: 1230, baseType: !350, size: 64, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !612, file: !36, line: 1231, baseType: !350, size: 64, offset: 256)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !612, file: !36, line: 1232, baseType: !350, size: 64, offset: 320)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !612, file: !36, line: 1233, baseType: !350, size: 64, offset: 384)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !612, file: !36, line: 1234, baseType: !350, size: 64, offset: 448)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !612, file: !36, line: 1236, baseType: !350, size: 64, offset: 512)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !612, file: !36, line: 1237, baseType: !350, size: 64, offset: 576)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !612, file: !36, line: 1238, baseType: !350, size: 64, offset: 640)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !572, file: !332, line: 48, baseType: !626, size: 64, offset: 768)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!383, !363, !355, !609}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !572, file: !332, line: 49, baseType: !630, size: 64, offset: 832)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!383, !363, !592, !350, !633, !350, !315, !315, !592}
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !572, file: !332, line: 50, baseType: !635, size: 64, offset: 896)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!383, !363, !638, !639}
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !572, file: !332, line: 52, baseType: !641, size: 64, offset: 960)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!383, !363, !644, !645}
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !648)
!648 = !{!649, !650, !651, !652, !653, !654, !655, !656, !657, !658}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !647, file: !36, line: 593, baseType: !432, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !647, file: !36, line: 594, baseType: !432, size: 64, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !647, file: !36, line: 594, baseType: !432, size: 64, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !647, file: !36, line: 594, baseType: !432, size: 64, offset: 192)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !647, file: !36, line: 595, baseType: !432, size: 64, offset: 256)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !647, file: !36, line: 596, baseType: !432, size: 64, offset: 320)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !647, file: !36, line: 597, baseType: !432, size: 64, offset: 384)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !647, file: !36, line: 598, baseType: !432, size: 64, offset: 448)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !647, file: !36, line: 598, baseType: !432, size: 64, offset: 512)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !647, file: !36, line: 599, baseType: !432, size: 64, offset: 576)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !572, file: !332, line: 53, baseType: !660, size: 64, offset: 1024)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!383, !363, !363, !663}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !572, file: !332, line: 54, baseType: !665, size: 64, offset: 1088)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!383, !363, !592}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !572, file: !332, line: 55, baseType: !589, size: 64, offset: 1152)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !572, file: !332, line: 56, baseType: !670, size: 64, offset: 1216)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!383, !363, !673, !482}
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !572, file: !332, line: 58, baseType: !675, size: 64, offset: 1280)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!383, !363, !678}
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !572, file: !332, line: 59, baseType: !675, size: 64, offset: 1344)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !572, file: !332, line: 60, baseType: !681, size: 64, offset: 1408)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!383, !363, !684, !313}
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !572, file: !332, line: 61, baseType: !686, size: 64, offset: 1472)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!383, !363}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !572, file: !332, line: 63, baseType: !690, size: 64, offset: 1536)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!383, !363, !315, !578, !349, !592, !592}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !572, file: !332, line: 64, baseType: !694, size: 64, offset: 1600)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!383, !363, !363, !355, !355, !609}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !572, file: !332, line: 65, baseType: !698, size: 64, offset: 1664)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!383, !363, !363, !609}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !572, file: !332, line: 66, baseType: !702, size: 64, offset: 1728)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!383, !363, !363, !355, !609}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !572, file: !332, line: 67, baseType: !698, size: 64, offset: 1792)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !572, file: !332, line: 69, baseType: !686, size: 64, offset: 1856)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !572, file: !332, line: 70, baseType: !694, size: 64, offset: 1920)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !572, file: !332, line: 71, baseType: !702, size: 64, offset: 1984)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !572, file: !332, line: 72, baseType: !710, size: 64, offset: 2048)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!383, !363, !639}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !572, file: !332, line: 73, baseType: !686, size: 64, offset: 2112)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !572, file: !332, line: 75, baseType: !715, size: 64, offset: 2176)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!383, !363, !718, !639}
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !572, file: !332, line: 76, baseType: !589, size: 64, offset: 2240)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !572, file: !332, line: 77, baseType: !589, size: 64, offset: 2304)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !572, file: !332, line: 78, baseType: !606, size: 64, offset: 2368)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !572, file: !332, line: 79, baseType: !626, size: 64, offset: 2432)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !572, file: !332, line: 81, baseType: !724, size: 64, offset: 2496)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!383, !363, !349, !363, !727}
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !572, file: !332, line: 82, baseType: !729, size: 64, offset: 2560)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!383, !363, !315, !732, !732, !638, !734}
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !355)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !572, file: !332, line: 83, baseType: !736, size: 64, offset: 2624)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!383, !363, !315, !739, !315}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !572, file: !332, line: 84, baseType: !741, size: 64, offset: 2688)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{!383, !363, !315, !578, !315, !578, !353}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !572, file: !332, line: 85, baseType: !745, size: 64, offset: 2752)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!383, !363, !363, !727}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !572, file: !332, line: 87, baseType: !749, size: 64, offset: 2816)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!383, !363, !592, !320}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !572, file: !332, line: 88, baseType: !753, size: 64, offset: 2880)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!383, !363, !349}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !572, file: !332, line: 89, baseType: !753, size: 64, offset: 2944)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !572, file: !332, line: 90, baseType: !758, size: 64, offset: 3008)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!383, !363, !592, !582}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !572, file: !332, line: 91, baseType: !690, size: 64, offset: 3072)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !572, file: !332, line: 93, baseType: !763, size: 64, offset: 3136)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{!383, !363, !766}
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !767)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !572, file: !332, line: 94, baseType: !770, size: 64, offset: 3200)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{!383, !363, !315, !313, !313, !320, !773, !773, !663}
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !572, file: !332, line: 95, baseType: !770, size: 64, offset: 3264)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !572, file: !332, line: 96, baseType: !770, size: 64, offset: 3328)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !572, file: !332, line: 97, baseType: !770, size: 64, offset: 3392)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !572, file: !332, line: 99, baseType: !778, size: 64, offset: 3456)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!383, !363, !781, !784}
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !356, line: 51, baseType: !782)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !356, line: 51, flags: DIFlagFwdDecl)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !785)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !332, line: 609, size: 6208, elements: !787)
!787 = !{!788, !789, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !808, !815, !816, !817, !818, !819, !820, !821, !822, !826, !827, !828, !829, !830, !832, !833, !834, !835, !836, !837, !838}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !786, file: !332, line: 610, baseType: !368, size: 4480)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !786, file: !332, line: 610, baseType: !790, size: 32, offset: 4480)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !427)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !786, file: !332, line: 611, baseType: !315, size: 32, offset: 4512)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !786, file: !332, line: 611, baseType: !315, size: 32, offset: 4544)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !786, file: !332, line: 611, baseType: !315, size: 32, offset: 4576)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !786, file: !332, line: 612, baseType: !315, size: 32, offset: 4608)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !786, file: !332, line: 613, baseType: !315, size: 32, offset: 4640)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !786, file: !332, line: 614, baseType: !320, size: 64, offset: 4672)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !786, file: !332, line: 615, baseType: !476, size: 64, offset: 4736)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !786, file: !332, line: 616, baseType: !739, size: 64, offset: 4800)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !786, file: !332, line: 617, baseType: !320, size: 64, offset: 4864)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !786, file: !332, line: 618, baseType: !801, size: 64, offset: 4928)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !332, line: 602, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !332, line: 598, size: 128, elements: !804)
!804 = !{!805, !806, !807}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !803, file: !332, line: 599, baseType: !315, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !803, file: !332, line: 600, baseType: !315, size: 32, offset: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !803, file: !332, line: 601, baseType: !353, size: 64, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !786, file: !332, line: 619, baseType: !809, size: 64, offset: 4992)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !332, line: 607, baseType: !811)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !332, line: 604, size: 128, elements: !812)
!812 = !{!813, !814}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !811, file: !332, line: 605, baseType: !315, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !811, file: !332, line: 606, baseType: !353, size: 64, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !786, file: !332, line: 620, baseType: !353, size: 64, offset: 5056)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !786, file: !332, line: 621, baseType: !350, size: 64, offset: 5120)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !786, file: !332, line: 622, baseType: !350, size: 64, offset: 5184)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !786, file: !332, line: 623, baseType: !592, size: 64, offset: 5248)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !786, file: !332, line: 623, baseType: !592, size: 64, offset: 5312)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !786, file: !332, line: 623, baseType: !592, size: 64, offset: 5376)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !786, file: !332, line: 624, baseType: !313, size: 32, offset: 5440)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !786, file: !332, line: 625, baseType: !823, size: 64, offset: 5504)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{!383}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !786, file: !332, line: 626, baseType: !466, size: 64, offset: 5568)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !786, file: !332, line: 627, baseType: !592, size: 64, offset: 5632)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !786, file: !332, line: 628, baseType: !315, size: 32, offset: 5696)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !786, file: !332, line: 629, baseType: !408, size: 64, offset: 5760)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !786, file: !332, line: 630, baseType: !831, size: 32, offset: 5824)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !786, file: !332, line: 631, baseType: !315, size: 32, offset: 5856)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !786, file: !332, line: 631, baseType: !315, size: 32, offset: 5888)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !786, file: !332, line: 632, baseType: !313, size: 32, offset: 5920)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !786, file: !332, line: 633, baseType: !313, size: 32, offset: 5952)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !786, file: !332, line: 634, baseType: !419, size: 64, offset: 6016)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !786, file: !332, line: 634, baseType: !466, size: 64, offset: 6080)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !786, file: !332, line: 635, baseType: !437, size: 64, offset: 6144)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !572, file: !332, line: 100, baseType: !840, size: 64, offset: 3520)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{!383, !363, !315, !315, !843, !846}
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !845)
!845 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !572, file: !332, line: 101, baseType: !686, size: 64, offset: 3584)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !572, file: !332, line: 102, baseType: !849, size: 64, offset: 3648)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DISubroutineType(types: !851)
!851 = !{!383, !363, !355, !355, !639}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !572, file: !332, line: 103, baseType: !575, size: 64, offset: 3712)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !572, file: !332, line: 105, baseType: !854, size: 64, offset: 3776)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{!383, !363, !355, !355, !638, !639}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !572, file: !332, line: 106, baseType: !686, size: 64, offset: 3840)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !572, file: !332, line: 107, baseType: !859, size: 64, offset: 3904)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!383, !363, !395}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !572, file: !332, line: 108, baseType: !863, size: 64, offset: 3968)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{!383, !363, !866, !638, !639}
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !408)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !572, file: !332, line: 109, baseType: !823, size: 64, offset: 4032)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !572, file: !332, line: 111, baseType: !869, size: 64, offset: 4096)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{!383, !363, !363, !363, !350, !363}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !572, file: !332, line: 112, baseType: !873, size: 64, offset: 4160)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{!383, !363, !363, !363, !363}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !572, file: !332, line: 113, baseType: !877, size: 64, offset: 4224)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DISubroutineType(types: !879)
!879 = !{!383, !363, !880, !880}
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !356, line: 30, baseType: !881)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !356, line: 30, flags: DIFlagFwdDecl)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !572, file: !332, line: 114, baseType: !575, size: 64, offset: 4288)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !572, file: !332, line: 115, baseType: !690, size: 64, offset: 4352)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !572, file: !332, line: 117, baseType: !749, size: 64, offset: 4416)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !572, file: !332, line: 118, baseType: !749, size: 64, offset: 4480)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !572, file: !332, line: 119, baseType: !863, size: 64, offset: 4544)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !572, file: !332, line: 120, baseType: !889, size: 64, offset: 4608)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{!383, !363, !892, !663}
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !572, file: !332, line: 121, baseType: !823, size: 64, offset: 4672)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !572, file: !332, line: 123, baseType: !895, size: 64, offset: 4736)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!383, !363, !315, !466}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !572, file: !332, line: 124, baseType: !899, size: 64, offset: 4800)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{!383, !363, !784, !592, !466}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !572, file: !332, line: 125, baseType: !903, size: 64, offset: 4864)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{!383, !517, !363}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !572, file: !332, line: 126, baseType: !589, size: 64, offset: 4928)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !572, file: !332, line: 127, baseType: !589, size: 64, offset: 4992)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !572, file: !332, line: 129, baseType: !909, size: 64, offset: 5056)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!383, !363, !739}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !572, file: !332, line: 130, baseType: !913, size: 64, offset: 5120)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{!383, !363, !916, !916}
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !917)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !919)
!919 = !{!920, !921}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !918, file: !60, line: 653, baseType: !315, size: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !918, file: !60, line: 653, baseType: !592, size: 64, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !572, file: !332, line: 131, baseType: !913, size: 64, offset: 5184)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !572, file: !332, line: 132, baseType: !924, size: 64, offset: 5248)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{!383, !363, !320, !320, !320}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !572, file: !332, line: 133, baseType: !859, size: 64, offset: 5312)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !572, file: !332, line: 135, baseType: !929, size: 64, offset: 5376)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{!383, !363, !350, !663}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !572, file: !332, line: 136, baseType: !929, size: 64, offset: 5440)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !572, file: !332, line: 137, baseType: !934, size: 64, offset: 5504)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!383, !363, !663}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !572, file: !332, line: 138, baseType: !575, size: 64, offset: 5568)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !572, file: !332, line: 139, baseType: !939, size: 64, offset: 5632)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!383, !363, !942, !942}
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !572, file: !332, line: 141, baseType: !823, size: 64, offset: 5696)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !572, file: !332, line: 142, baseType: !945, size: 64, offset: 5760)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!383, !363, !363, !350, !363}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !572, file: !332, line: 143, baseType: !949, size: 64, offset: 5824)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!383, !363, !363, !363}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !572, file: !332, line: 144, baseType: !823, size: 64, offset: 5888)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !572, file: !332, line: 145, baseType: !945, size: 64, offset: 5952)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !572, file: !332, line: 147, baseType: !949, size: 64, offset: 6016)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !572, file: !332, line: 148, baseType: !823, size: 64, offset: 6080)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !572, file: !332, line: 149, baseType: !945, size: 64, offset: 6144)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !572, file: !332, line: 150, baseType: !949, size: 64, offset: 6208)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !572, file: !332, line: 151, baseType: !959, size: 64, offset: 6272)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!383, !363, !313}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !572, file: !332, line: 153, baseType: !686, size: 64, offset: 6336)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !572, file: !332, line: 154, baseType: !686, size: 64, offset: 6400)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !572, file: !332, line: 155, baseType: !686, size: 64, offset: 6464)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !572, file: !332, line: 156, baseType: !686, size: 64, offset: 6528)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !572, file: !332, line: 157, baseType: !859, size: 64, offset: 6592)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !572, file: !332, line: 159, baseType: !968, size: 64, offset: 6656)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!383, !363, !315, !580}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !572, file: !332, line: 160, baseType: !686, size: 64, offset: 6720)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !572, file: !332, line: 161, baseType: !686, size: 64, offset: 6784)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !572, file: !332, line: 162, baseType: !686, size: 64, offset: 6848)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !572, file: !332, line: 163, baseType: !686, size: 64, offset: 6912)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !572, file: !332, line: 165, baseType: !949, size: 64, offset: 6976)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !572, file: !332, line: 166, baseType: !949, size: 64, offset: 7040)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !572, file: !332, line: 167, baseType: !749, size: 64, offset: 7104)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !572, file: !332, line: 168, baseType: !979, size: 64, offset: 7168)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!383, !363, !592, !315}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !572, file: !332, line: 169, baseType: !983, size: 64, offset: 7232)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!383, !363, !663, !320}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !572, file: !332, line: 171, baseType: !710, size: 64, offset: 7296)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !572, file: !332, line: 172, baseType: !686, size: 64, offset: 7360)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !572, file: !332, line: 173, baseType: !989, size: 64, offset: 7424)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!383, !363, !320, !773}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !572, file: !332, line: 174, baseType: !849, size: 64, offset: 7488)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !572, file: !332, line: 175, baseType: !849, size: 64, offset: 7552)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !572, file: !332, line: 177, baseType: !589, size: 64, offset: 7616)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !572, file: !332, line: 178, baseType: !635, size: 64, offset: 7680)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !572, file: !332, line: 179, baseType: !589, size: 64, offset: 7744)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !572, file: !332, line: 180, baseType: !596, size: 64, offset: 7808)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !572, file: !332, line: 181, baseType: !999, size: 64, offset: 7872)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!383, !363, !387, !638, !639}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !572, file: !332, line: 183, baseType: !909, size: 64, offset: 7936)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !572, file: !332, line: 184, baseType: !670, size: 64, offset: 8000)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !572, file: !332, line: 185, baseType: !1005, size: 64, offset: 8064)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!383, !363, !1008}
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !572, file: !332, line: 186, baseType: !1010, size: 64, offset: 8128)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!383, !363, !315, !578, !353}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !572, file: !332, line: 187, baseType: !729, size: 64, offset: 8192)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !572, file: !332, line: 189, baseType: !1015, size: 64, offset: 8256)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!383, !363, !315, !315, !320, !580}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !572, file: !332, line: 190, baseType: !823, size: 64, offset: 8320)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !572, file: !332, line: 191, baseType: !945, size: 64, offset: 8384)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !572, file: !332, line: 192, baseType: !949, size: 64, offset: 8448)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !572, file: !332, line: 193, baseType: !1022, size: 64, offset: 8512)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!383, !363, !781, !1025}
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1026)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !332, line: 660, size: 5312, elements: !1028)
!1028 = !{!1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1027, file: !332, line: 661, baseType: !368, size: 4480)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1027, file: !332, line: 661, baseType: !790, size: 32, offset: 4480)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1027, file: !332, line: 662, baseType: !315, size: 32, offset: 4512)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1027, file: !332, line: 662, baseType: !315, size: 32, offset: 4544)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1027, file: !332, line: 662, baseType: !315, size: 32, offset: 4576)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1027, file: !332, line: 663, baseType: !315, size: 32, offset: 4608)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1027, file: !332, line: 664, baseType: !315, size: 32, offset: 4640)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1027, file: !332, line: 665, baseType: !320, size: 64, offset: 4672)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1027, file: !332, line: 666, baseType: !320, size: 64, offset: 4736)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1027, file: !332, line: 667, baseType: !315, size: 32, offset: 4800)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1027, file: !332, line: 668, baseType: !831, size: 32, offset: 4832)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1027, file: !332, line: 670, baseType: !320, size: 64, offset: 4864)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1027, file: !332, line: 670, baseType: !320, size: 64, offset: 4928)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1027, file: !332, line: 671, baseType: !320, size: 64, offset: 4992)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1027, file: !332, line: 672, baseType: !320, size: 64, offset: 5056)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1027, file: !332, line: 673, baseType: !320, size: 64, offset: 5120)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1027, file: !332, line: 674, baseType: !315, size: 32, offset: 5184)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1027, file: !332, line: 675, baseType: !320, size: 64, offset: 5248)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !572, file: !332, line: 195, baseType: !1048, size: 64, offset: 8576)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!383, !1025, !363, !363}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !572, file: !332, line: 196, baseType: !1048, size: 64, offset: 8640)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !572, file: !332, line: 197, baseType: !823, size: 64, offset: 8704)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !572, file: !332, line: 198, baseType: !945, size: 64, offset: 8768)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !572, file: !332, line: 199, baseType: !949, size: 64, offset: 8832)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !572, file: !332, line: 201, baseType: !1056, size: 64, offset: 8896)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!383, !363, !315, !315}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !572, file: !332, line: 202, baseType: !724, size: 64, offset: 8960)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !572, file: !332, line: 203, baseType: !596, size: 64, offset: 9024)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !572, file: !332, line: 204, baseType: !778, size: 64, offset: 9088)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !572, file: !332, line: 205, baseType: !909, size: 64, offset: 9152)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !572, file: !332, line: 206, baseType: !1064, size: 64, offset: 9216)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!383, !387, !363, !315, !638, !639}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !572, file: !332, line: 208, baseType: !1068, size: 64, offset: 9280)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!383, !315, !734}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !572, file: !332, line: 209, baseType: !949, size: 64, offset: 9344)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !572, file: !332, line: 210, baseType: !741, size: 64, offset: 9408)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !365, file: !332, line: 438, baseType: !1074, size: 64, offset: 13952)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !356, line: 60, baseType: !1075)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1077)
!1077 = !{!1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1076, file: !114, line: 241, baseType: !387, size: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1076, file: !114, line: 242, baseType: !446, size: 32, offset: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1076, file: !114, line: 243, baseType: !315, size: 32, offset: 96)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1076, file: !114, line: 243, baseType: !315, size: 32, offset: 128)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1076, file: !114, line: 244, baseType: !315, size: 32, offset: 160)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1076, file: !114, line: 244, baseType: !315, size: 32, offset: 192)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1076, file: !114, line: 245, baseType: !320, size: 64, offset: 256)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1076, file: !114, line: 246, baseType: !313, size: 32, offset: 320)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1076, file: !114, line: 247, baseType: !315, size: 32, offset: 352)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1076, file: !114, line: 251, baseType: !315, size: 32, offset: 384)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1076, file: !114, line: 252, baseType: !880, size: 64, offset: 448)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1076, file: !114, line: 253, baseType: !313, size: 32, offset: 512)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1076, file: !114, line: 254, baseType: !315, size: 32, offset: 544)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1076, file: !114, line: 254, baseType: !315, size: 32, offset: 576)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1076, file: !114, line: 255, baseType: !315, size: 32, offset: 608)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !365, file: !332, line: 438, baseType: !1074, size: 64, offset: 14016)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !365, file: !332, line: 439, baseType: !466, size: 64, offset: 14080)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !365, file: !332, line: 440, baseType: !1096, size: 32, offset: 14144)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !365, file: !332, line: 441, baseType: !313, size: 32, offset: 14176)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !365, file: !332, line: 442, baseType: !313, size: 32, offset: 14208)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !365, file: !332, line: 443, baseType: !1100, size: 448, offset: 14272)
!1100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1101, size: 448, elements: !1102)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !408)
!1102 = !{!1103}
!1103 = !DISubrange(count: 7)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !365, file: !332, line: 444, baseType: !313, size: 32, offset: 14720)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !365, file: !332, line: 445, baseType: !313, size: 32, offset: 14752)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !365, file: !332, line: 446, baseType: !315, size: 32, offset: 14784)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !365, file: !332, line: 447, baseType: !468, size: 64, offset: 14848)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !365, file: !332, line: 448, baseType: !468, size: 64, offset: 14912)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !365, file: !332, line: 449, baseType: !646, size: 640, offset: 14976)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !365, file: !332, line: 450, baseType: !582, size: 32, offset: 15616)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !365, file: !332, line: 451, baseType: !1112, size: 2880, offset: 15680)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !332, line: 318, baseType: !1113)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !332, line: 319, size: 2880, elements: !1114)
!1114 = !{!1115, !1116, !1117, !1118, !1119, !1120, !1121, !1134, !1135, !1140, !1145, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1160, !1161, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1193, !1194, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1217, !1218, !1219, !1223, !1224}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1113, file: !332, line: 320, baseType: !315, size: 32)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1113, file: !332, line: 321, baseType: !315, size: 32, offset: 32)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1113, file: !332, line: 322, baseType: !315, size: 32, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1113, file: !332, line: 323, baseType: !315, size: 32, offset: 96)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1113, file: !332, line: 324, baseType: !315, size: 32, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1113, file: !332, line: 325, baseType: !315, size: 32, offset: 160)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1113, file: !332, line: 326, baseType: !1122, size: 64, offset: 192)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !332, line: 293, baseType: !1123)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !332, line: 295, size: 448, elements: !1125)
!1125 = !{!1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1124, file: !332, line: 296, baseType: !1122, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1124, file: !332, line: 297, baseType: !353, size: 64, offset: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1124, file: !332, line: 297, baseType: !353, size: 64, offset: 128)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1124, file: !332, line: 298, baseType: !320, size: 64, offset: 192)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1124, file: !332, line: 298, baseType: !320, size: 64, offset: 256)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1124, file: !332, line: 299, baseType: !315, size: 32, offset: 320)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1124, file: !332, line: 300, baseType: !315, size: 32, offset: 352)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1124, file: !332, line: 301, baseType: !315, size: 32, offset: 384)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1113, file: !332, line: 326, baseType: !1122, size: 64, offset: 256)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1113, file: !332, line: 328, baseType: !1136, size: 64, offset: 320)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!383, !363, !1139, !320}
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1113, file: !332, line: 329, baseType: !1141, size: 64, offset: 384)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!383, !1139, !1144, !476, !476, !491, !320}
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1113, file: !332, line: 330, baseType: !1146, size: 64, offset: 448)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{!383, !1139}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1113, file: !332, line: 331, baseType: !1146, size: 64, offset: 512)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1113, file: !332, line: 334, baseType: !387, size: 64, offset: 576)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1113, file: !332, line: 335, baseType: !446, size: 32, offset: 640)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1113, file: !332, line: 335, baseType: !446, size: 32, offset: 672)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1113, file: !332, line: 336, baseType: !446, size: 32, offset: 704)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1113, file: !332, line: 336, baseType: !446, size: 32, offset: 736)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1113, file: !332, line: 337, baseType: !1156, size: 64, offset: 768)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !388, line: 339, baseType: !1158)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !388, line: 339, flags: DIFlagFwdDecl)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1113, file: !332, line: 338, baseType: !1156, size: 64, offset: 832)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1113, file: !332, line: 339, baseType: !1162, size: 64, offset: 896)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !388, line: 341, baseType: !1164)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !388, line: 351, size: 192, elements: !1165)
!1165 = !{!1166, !1167, !1168, !1169, !1170}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1164, file: !388, line: 354, baseType: !72, size: 32)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1164, file: !388, line: 355, baseType: !72, size: 32, offset: 32)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1164, file: !388, line: 356, baseType: !72, size: 32, offset: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1164, file: !388, line: 361, baseType: !72, size: 32, offset: 96)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1164, file: !388, line: 362, baseType: !537, size: 64, offset: 128)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1113, file: !332, line: 340, baseType: !315, size: 32, offset: 960)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1113, file: !332, line: 340, baseType: !315, size: 32, offset: 992)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1113, file: !332, line: 341, baseType: !353, size: 64, offset: 1024)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1113, file: !332, line: 342, baseType: !320, size: 64, offset: 1088)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1113, file: !332, line: 343, baseType: !491, size: 64, offset: 1152)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1113, file: !332, line: 344, baseType: !476, size: 64, offset: 1216)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1113, file: !332, line: 345, baseType: !315, size: 32, offset: 1280)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1113, file: !332, line: 346, baseType: !1144, size: 64, offset: 1344)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1113, file: !332, line: 347, baseType: !313, size: 32, offset: 1408)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1113, file: !332, line: 348, baseType: !315, size: 32, offset: 1440)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1113, file: !332, line: 351, baseType: !313, size: 32, offset: 1472)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1113, file: !332, line: 352, baseType: !313, size: 32, offset: 1504)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1113, file: !332, line: 353, baseType: !446, size: 32, offset: 1536)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1113, file: !332, line: 354, baseType: !446, size: 32, offset: 1568)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1113, file: !332, line: 355, baseType: !1144, size: 64, offset: 1600)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1113, file: !332, line: 356, baseType: !1144, size: 64, offset: 1664)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1113, file: !332, line: 357, baseType: !1188, size: 64, offset: 1728)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !332, line: 310, baseType: !1190)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !332, line: 308, size: 32, elements: !1191)
!1191 = !{!1192}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1190, file: !332, line: 309, baseType: !315, size: 32)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1113, file: !332, line: 357, baseType: !1188, size: 64, offset: 1792)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1113, file: !332, line: 358, baseType: !1195, size: 64, offset: 1856)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !332, line: 316, baseType: !1197)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !332, line: 312, size: 128, elements: !1198)
!1198 = !{!1199, !1200, !1201}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1197, file: !332, line: 313, baseType: !466, size: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1197, file: !332, line: 314, baseType: !315, size: 32, offset: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1197, file: !332, line: 315, baseType: !410, size: 8, offset: 96)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1113, file: !332, line: 359, baseType: !1195, size: 64, offset: 1920)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1113, file: !332, line: 360, baseType: !1195, size: 64, offset: 1984)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1113, file: !332, line: 361, baseType: !315, size: 32, offset: 2048)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1113, file: !332, line: 362, baseType: !446, size: 32, offset: 2080)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1113, file: !332, line: 363, baseType: !315, size: 32, offset: 2112)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1113, file: !332, line: 364, baseType: !1144, size: 64, offset: 2176)
