; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/dt/dualspace/interface/dualspace.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/dt/dualspace/interface/dualspace.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._n_PetscFunctionList = type opaque
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!137 = !{!138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179}
!138 = !DIEnumerator(name: "PETSC_VIEWER_DEFAULT", value: 0, isUnsigned: true)
!139 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATLAB", value: 1, isUnsigned: true)
!140 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATHEMATICA", value: 2, isUnsigned: true)
!141 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_IMPL", value: 3, isUnsigned: true)
!142 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO", value: 4, isUnsigned: true)
!143 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INFO_DETAIL", value: 5, isUnsigned: true)
!144 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_COMMON", value: 6, isUnsigned: true)
!145 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_SYMMODU", value: 7, isUnsigned: true)
!146 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_INDEX", value: 8, isUnsigned: true)
!147 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_DENSE", value: 9, isUnsigned: true)
!148 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_MATRIXMARKET", value: 10, isUnsigned: true)
!149 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!150 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!151 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!152 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!153 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!154 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!155 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!156 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!157 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!158 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!159 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!160 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!161 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!162 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!163 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!164 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!165 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!166 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!167 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!168 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!169 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!170 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!171 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!172 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!173 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!174 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!175 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!176 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!177 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!178 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!179 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!180 = !{!181, !184, !189, !193, !194, !392, !393, !394, !358, !395, !396, !397, !274}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !183)
!183 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !185, line: 1451, baseType: !186)
!185 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{null}
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !190, line: 330, baseType: !191)
!190 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !190, line: 330, flags: DIFlagFwdDecl)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !197, line: 73, size: 4480, elements: !198)
!197 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!198 = !{!199, !202, !245, !246, !248, !251, !252, !253, !254, !262, !263, !265, !269, !273, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !286, !287, !288, !290, !291, !293, !295, !296, !297, !298, !299, !302, !304, !305, !306, !307, !308, !311, !313, !314, !315, !325, !327, !328, !332, !333, !382, !387, !389, !390, !391}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !196, file: !197, line: 74, baseType: !200, size: 32)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !201)
!201 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !196, file: !197, line: 75, baseType: !203, size: 448, offset: 64)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 448, elements: !243)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !197, line: 53, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !197, line: 45, size: 448, elements: !206)
!206 = !{!207, !213, !221, !226, !230, !234, !238}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !205, file: !197, line: 46, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!211, !194, !212}
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !201)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !205, file: !197, line: 47, baseType: !214, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!211, !194, !217}
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !218, line: 16, baseType: !219)
!218 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !218, line: 16, flags: DIFlagFwdDecl)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !205, file: !197, line: 48, baseType: !222, size: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!211, !225}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !205, file: !197, line: 49, baseType: !227, size: 64, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!211, !194, !181, !194}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !205, file: !197, line: 50, baseType: !231, size: 64, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!211, !194, !181, !225}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !205, file: !197, line: 51, baseType: !235, size: 64, offset: 320)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!211, !194, !181, !186}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !205, file: !197, line: 52, baseType: !239, size: 64, offset: 384)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!211, !194, !181, !242}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!243 = !{!244}
!244 = !DISubrange(count: 1)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !196, file: !197, line: 76, baseType: !189, size: 64, offset: 512)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !196, file: !197, line: 77, baseType: !247, size: 32, offset: 576)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !201)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !196, file: !197, line: 78, baseType: !249, size: 64, offset: 640)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !250)
!250 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !196, file: !197, line: 78, baseType: !249, size: 64, offset: 704)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !196, file: !197, line: 78, baseType: !249, size: 64, offset: 768)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !196, file: !197, line: 78, baseType: !249, size: 64, offset: 832)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !196, file: !197, line: 79, baseType: !255, size: 64, offset: 896)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !258, line: 27, baseType: !259)
!258 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !260, line: 43, baseType: !261)
!260 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!261 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !196, file: !197, line: 80, baseType: !247, size: 32, offset: 960)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !196, file: !197, line: 81, baseType: !264, size: 32, offset: 992)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !201)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !196, file: !197, line: 82, baseType: !266, size: 64, offset: 1024)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !196, file: !197, line: 83, baseType: !270, size: 64, offset: 1088)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !196, file: !197, line: 84, baseType: !274, size: 64, offset: 1152)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !196, file: !197, line: 85, baseType: !274, size: 64, offset: 1216)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !196, file: !197, line: 86, baseType: !274, size: 64, offset: 1280)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !196, file: !197, line: 87, baseType: !274, size: 64, offset: 1344)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !196, file: !197, line: 88, baseType: !194, size: 64, offset: 1408)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !196, file: !197, line: 89, baseType: !255, size: 64, offset: 1472)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !196, file: !197, line: 90, baseType: !274, size: 64, offset: 1536)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !196, file: !197, line: 91, baseType: !274, size: 64, offset: 1600)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !196, file: !197, line: 92, baseType: !247, size: 32, offset: 1664)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !196, file: !197, line: 93, baseType: !193, size: 64, offset: 1728)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !196, file: !197, line: 94, baseType: !285, size: 64, offset: 1792)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !196, file: !197, line: 95, baseType: !247, size: 32, offset: 1856)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !196, file: !197, line: 95, baseType: !247, size: 32, offset: 1888)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !196, file: !197, line: 96, baseType: !289, size: 64, offset: 1920)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !196, file: !197, line: 96, baseType: !289, size: 64, offset: 1984)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !196, file: !197, line: 97, baseType: !292, size: 64, offset: 2048)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !196, file: !197, line: 97, baseType: !294, size: 64, offset: 2112)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !196, file: !197, line: 98, baseType: !247, size: 32, offset: 2176)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !196, file: !197, line: 98, baseType: !247, size: 32, offset: 2208)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !196, file: !197, line: 99, baseType: !289, size: 64, offset: 2240)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !196, file: !197, line: 99, baseType: !289, size: 64, offset: 2304)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !196, file: !197, line: 100, baseType: !300, size: 64, offset: 2368)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !250)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !196, file: !197, line: 100, baseType: !303, size: 64, offset: 2432)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !196, file: !197, line: 101, baseType: !247, size: 32, offset: 2496)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !196, file: !197, line: 101, baseType: !247, size: 32, offset: 2528)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !196, file: !197, line: 102, baseType: !289, size: 64, offset: 2560)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !196, file: !197, line: 102, baseType: !289, size: 64, offset: 2624)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !196, file: !197, line: 103, baseType: !309, size: 64, offset: 2688)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !301)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !196, file: !197, line: 103, baseType: !312, size: 64, offset: 2752)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !196, file: !197, line: 104, baseType: !242, size: 64, offset: 2816)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !196, file: !197, line: 105, baseType: !247, size: 32, offset: 2880)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !196, file: !197, line: 106, baseType: !316, size: 128, offset: 2944)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 128, elements: !323)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !197, line: 64, baseType: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !197, line: 61, size: 128, elements: !320)
!320 = !{!321, !322}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !319, file: !197, line: 62, baseType: !186, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !319, file: !197, line: 63, baseType: !193, size: 64, offset: 64)
!323 = !{!324}
!324 = !DISubrange(count: 2)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !196, file: !197, line: 107, baseType: !326, size: 64, offset: 3072)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 64, elements: !323)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !196, file: !197, line: 108, baseType: !193, size: 64, offset: 3136)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !196, file: !197, line: 109, baseType: !329, size: 64, offset: 3200)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!211, !193}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !196, file: !197, line: 111, baseType: !247, size: 32, offset: 3264)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !196, file: !197, line: 112, baseType: !334, size: 320, offset: 3328)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 320, elements: !380)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!211, !338, !194, !193}
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !341)
!341 = !{!342, !343, !368, !369, !370, !371, !372, !373, !374, !375, !376}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !340, file: !12, line: 100, baseType: !247, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !340, file: !12, line: 101, baseType: !344, size: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !347)
!347 = !{!348, !349, !350, !351, !352, !355, !356, !357, !361, !363, !365, !366, !367}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !346, file: !12, line: 84, baseType: !274, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !346, file: !12, line: 85, baseType: !274, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !346, file: !12, line: 86, baseType: !193, size: 64, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !346, file: !12, line: 87, baseType: !266, size: 64, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !346, file: !12, line: 88, baseType: !353, size: 64, offset: 256)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !346, file: !12, line: 89, baseType: !183, size: 8, offset: 320)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !346, file: !12, line: 90, baseType: !274, size: 64, offset: 384)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !346, file: !12, line: 91, baseType: !358, size: 64, offset: 448)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !359, line: 46, baseType: !360)
!359 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!360 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !346, file: !12, line: 92, baseType: !362, size: 32, offset: 512)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !346, file: !12, line: 93, baseType: !364, size: 32, offset: 544)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !346, file: !12, line: 94, baseType: !344, size: 64, offset: 576)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !346, file: !12, line: 95, baseType: !274, size: 64, offset: 640)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !346, file: !12, line: 96, baseType: !193, size: 64, offset: 704)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !340, file: !12, line: 102, baseType: !274, size: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !340, file: !12, line: 102, baseType: !274, size: 64, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !340, file: !12, line: 103, baseType: !274, size: 64, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !340, file: !12, line: 104, baseType: !189, size: 64, offset: 320)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !340, file: !12, line: 105, baseType: !362, size: 32, offset: 384)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !340, file: !12, line: 105, baseType: !362, size: 32, offset: 416)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !340, file: !12, line: 105, baseType: !362, size: 32, offset: 448)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !340, file: !12, line: 106, baseType: !194, size: 64, offset: 512)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !340, file: !12, line: 107, baseType: !377, size: 64, offset: 576)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!380 = !{!381}
!381 = !DISubrange(count: 5)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !196, file: !197, line: 113, baseType: !383, size: 320, offset: 3648)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 320, elements: !380)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{!211, !194, !193}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !196, file: !197, line: 114, baseType: !388, size: 320, offset: 3968)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 320, elements: !380)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !196, file: !197, line: 115, baseType: !362, size: 32, offset: 4288)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !196, file: !197, line: 120, baseType: !377, size: 64, offset: 4352)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !196, file: !197, line: 121, baseType: !362, size: 32, offset: 4416)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEnum", file: !6, line: 58, baseType: !99)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectDestroyFunction", file: !197, line: 130, baseType: !222)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectViewFunction", file: !197, line: 131, baseType: !214)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !190, line: 331, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !190, line: 331, flags: DIFlagFwdDecl)
!400 = !{!0, !401, !404, !406, !409}
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "PetscDualSpaceList", scope: !2, file: !403, line: 8, type: !266, isLocal: false, isDefinition: true)
!403 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/dm/dt/dualspace/interface/dualspace.c", directory: "/home/users/ndemeye/xSDK")
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "PetscDualSpaceRegisterAllCalled", scope: !2, file: !403, line: 9, type: !362, isLocal: false, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "PetscDualSpaceReferenceCells", scope: !2, file: !403, line: 11, type: !408, isLocal: false, isDefinition: true)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 320, elements: !380)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "PETSCDUALSPACE_SetUp", scope: !2, file: !403, line: 6, type: !411, isLocal: false, isDefinition: true)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogEvent", file: !412, line: 80, baseType: !201)
!412 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!413 = !{i32 7, !"Dwarf Version", i32 4}
!414 = !{i32 2, !"Debug Info Version", i32 3}
!415 = !{i32 1, !"wchar_size", i32 4}
!416 = !{i32 7, !"PIC Level", i32 2}
!417 = !{i32 7, !"uwtable", i32 1}
!418 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!419 = distinct !DISubprogram(name: "PetscDualSpaceLatticePointLexicographic_Internal", scope: !403, file: !403, line: 30, type: !420, scopeLine: 31, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !422)
!420 = !DISubroutineType(types: !421)
!421 = !{!211, !247, !247, !292}
!422 = !{!423, !424, !425}
!423 = !DILocalVariable(name: "len", arg: 1, scope: !419, file: !403, line: 30, type: !247)
!424 = !DILocalVariable(name: "max", arg: 2, scope: !419, file: !403, line: 30, type: !247)
!425 = !DILocalVariable(name: "tup", arg: 3, scope: !419, file: !403, line: 30, type: !292)
!426 = !DILocation(line: 0, scope: !419)
!427 = !DILocation(line: 32, column: 3, scope: !428)
!428 = distinct !DILexicalBlock(scope: !429, file: !403, line: 32, column: 3)
!429 = distinct !DILexicalBlock(scope: !430, file: !403, line: 32, column: 3)
!430 = distinct !DILexicalBlock(scope: !419, file: !403, line: 32, column: 3)
!431 = !{!432, !432, i64 0}
!432 = !{!"any pointer", !433, i64 0}
!433 = !{!"omnipotent char", !434, i64 0}
!434 = !{!"Simple C/C++ TBAA"}
!435 = !DILocation(line: 32, column: 3, scope: !429)
!436 = !DILocation(line: 32, column: 3, scope: !437)
!437 = distinct !DILexicalBlock(scope: !438, file: !403, line: 32, column: 3)
!438 = distinct !DILexicalBlock(scope: !428, file: !403, line: 32, column: 3)
!439 = !{!440, !441, i64 1536}
!440 = !{!"", !433, i64 0, !433, i64 512, !433, i64 1024, !433, i64 1280, !441, i64 1536, !441, i64 1540, !433, i64 1544}
!441 = !{!"int", !433, i64 0}
!442 = !DILocation(line: 32, column: 3, scope: !438)
!443 = !DILocation(line: 32, column: 3, scope: !444)
!444 = distinct !DILexicalBlock(scope: !437, file: !403, line: 32, column: 3)
!445 = !{!441, !441, i64 0}
!446 = !{!440, !441, i64 1540}
!447 = !DILocation(line: 33, column: 3, scope: !419)
!448 = !DILocation(line: 33, column: 13, scope: !419)
!449 = !DILocation(line: 34, column: 12, scope: !450)
!450 = distinct !DILexicalBlock(scope: !419, file: !403, line: 33, column: 17)
!451 = !DILocation(line: 34, column: 9, scope: !450)
!452 = !DILocation(line: 35, column: 10, scope: !453)
!453 = distinct !DILexicalBlock(scope: !450, file: !403, line: 35, column: 9)
!454 = !DILocation(line: 35, column: 9, scope: !450)
!455 = distinct !{!455, !447, !456, !457}
!456 = !DILocation(line: 39, column: 3, scope: !419)
!457 = !{!"llvm.loop.mustprogress"}
!458 = !DILocation(line: 36, column: 16, scope: !459)
!459 = distinct !DILexicalBlock(scope: !453, file: !403, line: 35, column: 15)
!460 = !DILocation(line: 37, column: 7, scope: !459)
!461 = !DILocation(line: 40, column: 3, scope: !419)
!462 = !DILocation(line: 40, column: 13, scope: !419)
!463 = !DILocation(line: 41, column: 3, scope: !464)
!464 = distinct !DILexicalBlock(scope: !465, file: !403, line: 41, column: 3)
!465 = distinct !DILexicalBlock(scope: !466, file: !403, line: 41, column: 3)
!466 = distinct !DILexicalBlock(scope: !419, file: !403, line: 41, column: 3)
!467 = !DILocation(line: 41, column: 3, scope: !465)
!468 = !DILocation(line: 41, column: 3, scope: !469)
!469 = distinct !DILexicalBlock(scope: !470, file: !403, line: 41, column: 3)
!470 = distinct !DILexicalBlock(scope: !464, file: !403, line: 41, column: 3)
!471 = !DILocation(line: 41, column: 3, scope: !470)
!472 = !DILocation(line: 41, column: 3, scope: !473)
!473 = distinct !DILexicalBlock(scope: !474, file: !403, line: 41, column: 3)
!474 = distinct !DILexicalBlock(scope: !469, file: !403, line: 41, column: 3)
!475 = !{!440, !433, i64 1544}
!476 = !DILocation(line: 41, column: 3, scope: !474)
!477 = !DILocation(line: 41, column: 3, scope: !478)
!478 = distinct !DILexicalBlock(scope: !473, file: !403, line: 41, column: 3)
!479 = !DILocation(line: 41, column: 3, scope: !480)
!480 = distinct !DILexicalBlock(scope: !469, file: !403, line: 41, column: 3)
!481 = !DILocation(line: 41, column: 3, scope: !482)
!482 = distinct !DILexicalBlock(scope: !480, file: !403, line: 41, column: 3)
!483 = !DILocation(line: 41, column: 3, scope: !484)
!484 = distinct !DILexicalBlock(scope: !485, file: !403, line: 41, column: 3)
!485 = distinct !DILexicalBlock(scope: !482, file: !403, line: 41, column: 3)
!486 = !DILocation(line: 41, column: 3, scope: !485)
!487 = !DILocation(line: 41, column: 3, scope: !488)
!488 = distinct !DILexicalBlock(scope: !484, file: !403, line: 41, column: 3)
!489 = !DILocation(line: 41, column: 3, scope: !466)
!490 = distinct !DISubprogram(name: "PetscDualSpaceTensorPointLexicographic_Internal", scope: !403, file: !403, line: 61, type: !420, scopeLine: 62, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !491)
!491 = !{!492, !493, !494, !495}
!492 = !DILocalVariable(name: "len", arg: 1, scope: !490, file: !403, line: 61, type: !247)
!493 = !DILocalVariable(name: "max", arg: 2, scope: !490, file: !403, line: 61, type: !247)
!494 = !DILocalVariable(name: "tup", arg: 3, scope: !490, file: !403, line: 61, type: !292)
!495 = !DILocalVariable(name: "i", scope: !490, file: !403, line: 63, type: !247)
!496 = !DILocation(line: 0, scope: !490)
!497 = !DILocation(line: 65, column: 3, scope: !498)
!498 = distinct !DILexicalBlock(scope: !499, file: !403, line: 65, column: 3)
!499 = distinct !DILexicalBlock(scope: !500, file: !403, line: 65, column: 3)
!500 = distinct !DILexicalBlock(scope: !490, file: !403, line: 65, column: 3)
!501 = !DILocation(line: 65, column: 3, scope: !499)
!502 = !DILocation(line: 65, column: 3, scope: !503)
!503 = distinct !DILexicalBlock(scope: !504, file: !403, line: 65, column: 3)
!504 = distinct !DILexicalBlock(scope: !498, file: !403, line: 65, column: 3)
!505 = !DILocation(line: 65, column: 3, scope: !504)
!506 = !DILocation(line: 65, column: 3, scope: !507)
!507 = distinct !DILexicalBlock(scope: !503, file: !403, line: 65, column: 3)
!508 = !DILocation(line: 66, column: 17, scope: !509)
!509 = distinct !DILexicalBlock(scope: !510, file: !403, line: 66, column: 3)
!510 = distinct !DILexicalBlock(scope: !490, file: !403, line: 66, column: 3)
!511 = !DILocation(line: 66, column: 3, scope: !510)
!512 = !DILocation(line: 67, column: 9, scope: !513)
!513 = distinct !DILexicalBlock(scope: !514, file: !403, line: 67, column: 9)
!514 = distinct !DILexicalBlock(scope: !509, file: !403, line: 66, column: 29)
!515 = !DILocation(line: 67, column: 16, scope: !513)
!516 = !DILocation(line: 67, column: 9, scope: !514)
!517 = !DILocation(line: 70, column: 14, scope: !518)
!518 = distinct !DILexicalBlock(scope: !513, file: !403, line: 69, column: 12)
!519 = !DILocation(line: 66, column: 25, scope: !509)
!520 = distinct !{!520, !511, !521, !457}
!521 = !DILocation(line: 72, column: 3, scope: !510)
!522 = !DILocation(line: 73, column: 3, scope: !490)
!523 = !DILocation(line: 0, scope: !510)
!524 = !DILocation(line: 73, column: 9, scope: !490)
!525 = !DILocation(line: 74, column: 3, scope: !526)
!526 = distinct !DILexicalBlock(scope: !527, file: !403, line: 74, column: 3)
!527 = distinct !DILexicalBlock(scope: !528, file: !403, line: 74, column: 3)
!528 = distinct !DILexicalBlock(scope: !490, file: !403, line: 74, column: 3)
!529 = !DILocation(line: 74, column: 3, scope: !527)
!530 = !DILocation(line: 74, column: 3, scope: !531)
!531 = distinct !DILexicalBlock(scope: !532, file: !403, line: 74, column: 3)
!532 = distinct !DILexicalBlock(scope: !526, file: !403, line: 74, column: 3)
!533 = !DILocation(line: 74, column: 3, scope: !532)
!534 = !DILocation(line: 74, column: 3, scope: !535)
!535 = distinct !DILexicalBlock(scope: !536, file: !403, line: 74, column: 3)
!536 = distinct !DILexicalBlock(scope: !531, file: !403, line: 74, column: 3)
!537 = !DILocation(line: 74, column: 3, scope: !536)
!538 = !DILocation(line: 74, column: 3, scope: !539)
!539 = distinct !DILexicalBlock(scope: !535, file: !403, line: 74, column: 3)
!540 = !DILocation(line: 74, column: 3, scope: !541)
!541 = distinct !DILexicalBlock(scope: !531, file: !403, line: 74, column: 3)
!542 = !DILocation(line: 74, column: 3, scope: !543)
!543 = distinct !DILexicalBlock(scope: !541, file: !403, line: 74, column: 3)
!544 = !DILocation(line: 74, column: 3, scope: !545)
!545 = distinct !DILexicalBlock(scope: !546, file: !403, line: 74, column: 3)
!546 = distinct !DILexicalBlock(scope: !543, file: !403, line: 74, column: 3)
!547 = !DILocation(line: 74, column: 3, scope: !546)
!548 = !DILocation(line: 74, column: 3, scope: !549)
!549 = distinct !DILexicalBlock(scope: !545, file: !403, line: 74, column: 3)
!550 = !DILocation(line: 75, column: 1, scope: !490)
!551 = distinct !DISubprogram(name: "PetscDualSpaceRegister", scope: !403, file: !403, line: 109, type: !552, scopeLine: 110, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1406)
!552 = !DISubroutineType(types: !553)
!553 = !{!211, !181, !554}
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!211, !557}
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDualSpace", file: !95, line: 39, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDualSpace", file: !560, line: 94, size: 6528, elements: !561)
!560 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscfeimpl.h", directory: "/home/users/ndemeye/xSDK")
!561 = !{!562, !564, !653, !654, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !559, file: !560, line: 95, baseType: !563, size: 4480)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !197, line: 122, baseType: !196)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !559, file: !560, line: 95, baseType: !565, size: 832, offset: 4480)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 832, elements: !243)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscDualSpaceOps", file: !560, line: 77, size: 832, elements: !567)
!567 = !{!568, !572, !573, !577, !578, !582, !587, !588, !602, !634, !638, !639, !652}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !566, file: !560, line: 78, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{!211, !338, !557}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !566, file: !560, line: 79, baseType: !554, size: 64, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !566, file: !560, line: 80, baseType: !574, size: 64, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!211, !557, !217}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !566, file: !560, line: 81, baseType: !554, size: 64, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !566, file: !560, line: 83, baseType: !579, size: 64, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!211, !557, !557}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "createheightsubspace", scope: !566, file: !560, line: 84, baseType: !583, size: 64, offset: 320)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!211, !557, !247, !586}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "createpointsubspace", scope: !566, file: !560, line: 85, baseType: !583, size: 64, offset: 384)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "getsymmetries", scope: !566, file: !560, line: 86, baseType: !589, size: 64, offset: 448)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{!211, !557, !592, !597}
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !247)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !310)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !566, file: !560, line: 87, baseType: !603, size: 64, offset: 512)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!211, !557, !247, !301, !606, !247, !631, !193, !309}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFEGeom", file: !608, line: 28, baseType: !609)
!608 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscfe.h", directory: "/home/users/ndemeye/xSDK")
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFEGeom", file: !608, line: 11, size: 1024, elements: !610)
!610 = !{!611, !614, !615, !616, !617, !618, !619, !621, !623, !624, !625, !626, !627, !628, !629, !630}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "xi", scope: !609, file: !608, line: 12, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !301)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !609, file: !608, line: 13, baseType: !300, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "J", scope: !609, file: !608, line: 14, baseType: !300, size: 64, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "invJ", scope: !609, file: !608, line: 15, baseType: !300, size: 64, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "detJ", scope: !609, file: !608, line: 16, baseType: !300, size: 64, offset: 256)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !609, file: !608, line: 17, baseType: !300, size: 64, offset: 320)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !609, file: !608, line: 18, baseType: !620, size: 64, offset: 384)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "suppJ", scope: !609, file: !608, line: 19, baseType: !622, size: 128, offset: 448)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 128, elements: !323)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "suppInvJ", scope: !609, file: !608, line: 20, baseType: !622, size: 128, offset: 576)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "suppDetJ", scope: !609, file: !608, line: 21, baseType: !622, size: 128, offset: 704)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !609, file: !608, line: 22, baseType: !247, size: 32, offset: 832)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !609, file: !608, line: 23, baseType: !247, size: 32, offset: 864)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "numCells", scope: !609, file: !608, line: 24, baseType: !247, size: 32, offset: 896)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "numPoints", scope: !609, file: !608, line: 25, baseType: !247, size: 32, offset: 928)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "isAffine", scope: !609, file: !608, line: 26, baseType: !362, size: 32, offset: 960)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "isHybrid", scope: !609, file: !608, line: 27, baseType: !362, size: 32, offset: 992)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!211, !247, !301, !612, !247, !309, !193}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "applyall", scope: !566, file: !560, line: 88, baseType: !635, size: 64, offset: 576)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!211, !557, !600, !309}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "applyint", scope: !566, file: !560, line: 89, baseType: !635, size: 64, offset: 640)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "createalldata", scope: !566, file: !560, line: 90, baseType: !640, size: 64, offset: 704)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!211, !557, !643, !648}
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscQuadrature", file: !645, line: 18, baseType: !646)
!645 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdt.h", directory: "/home/users/ndemeye/xSDK")
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscQuadrature", file: !645, line: 18, flags: DIFlagFwdDecl)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !126, line: 16, baseType: !650)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !126, line: 16, flags: DIFlagFwdDecl)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "createintdata", scope: !566, file: !560, line: 91, baseType: !640, size: 64, offset: 768)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !559, file: !560, line: 96, baseType: !193, size: 64, offset: 5312)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !559, file: !560, line: 97, baseType: !655, size: 64, offset: 5376)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !43, line: 14, baseType: !656)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !49, line: 202, size: 40000, elements: !658)
!658 = !{!659, !660, !883, !887, !888, !889, !890, !900, !901, !909, !910, !918, !919, !920, !921, !925, !926, !930, !932, !934, !935, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !963, !975, !987, !999, !1008, !1009, !1032, !1033, !1034, !1035, !1036, !1037, !1039, !1128, !1129, !1149, !1150, !1151, !1152, !1153, !1154, !1158, !1159, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1174, !1186, !1187, !1188, !1197, !1285, !1286, !1373, !1374, !1375, !1376, !1378, !1380, !1381, !1382, !1383, !1384}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !657, file: !49, line: 203, baseType: !563, size: 4480)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !657, file: !49, line: 203, baseType: !661, size: 3456, offset: 4480)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !662, size: 3456, elements: !243)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMOps", file: !49, line: 30, size: 3456, elements: !663)
!663 = !{!664, !668, !669, !674, !678, !682, !683, !684, !693, !694, !695, !707, !708, !716, !725, !729, !733, !737, !738, !743, !744, !748, !749, !753, !754, !762, !766, !771, !772, !773, !774, !775, !776, !777, !781, !785, !789, !794, !798, !809, !813, !818, !825, !829, !830, !836, !842, !846, !854, !858, !866, !870, !878, !879}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !662, file: !49, line: 31, baseType: !665, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!211, !655, !217}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !662, file: !49, line: 32, baseType: !665, size: 64, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !662, file: !49, line: 33, baseType: !670, size: 64, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!211, !655, !673}
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !662, file: !49, line: 34, baseType: !675, size: 64, offset: 192)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!211, !338, !655}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !662, file: !49, line: 35, baseType: !679, size: 64, offset: 256)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!211, !655}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalsection", scope: !662, file: !49, line: 36, baseType: !679, size: 64, offset: 320)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "createdefaultconstraints", scope: !662, file: !49, line: 37, baseType: !679, size: 64, offset: 384)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "createglobalvector", scope: !662, file: !49, line: 38, baseType: !685, size: 64, offset: 448)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DISubroutineType(types: !687)
!687 = !{!211, !655, !688}
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !690, line: 21, baseType: !691)
!690 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !690, line: 21, flags: DIFlagFwdDecl)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalvector", scope: !662, file: !49, line: 39, baseType: !685, size: 64, offset: 512)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "getlocaltoglobalmapping", scope: !662, file: !49, line: 40, baseType: !679, size: 64, offset: 576)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "createfieldis", scope: !662, file: !49, line: 41, baseType: !696, size: 64, offset: 640)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!211, !655, !292, !699, !701}
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !704, line: 11, baseType: !705)
!704 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !704, line: 11, flags: DIFlagFwdDecl)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatedm", scope: !662, file: !49, line: 42, baseType: !670, size: 64, offset: 704)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatefield", scope: !662, file: !49, line: 43, baseType: !709, size: 64, offset: 768)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!211, !655, !712}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMField", file: !43, line: 165, baseType: !714)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMField", file: !43, line: 165, flags: DIFlagFwdDecl)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "getcoloring", scope: !662, file: !49, line: 45, baseType: !717, size: 64, offset: 832)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{!211, !655, !720, !721}
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !27, line: 213, baseType: !26)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !704, line: 51, baseType: !723)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !704, line: 51, flags: DIFlagFwdDecl)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "creatematrix", scope: !662, file: !49, line: 46, baseType: !726, size: 64, offset: 896)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!211, !655, !648}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "createinterpolation", scope: !662, file: !49, line: 47, baseType: !730, size: 64, offset: 960)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!211, !655, !655, !648, !688}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "createrestriction", scope: !662, file: !49, line: 48, baseType: !734, size: 64, offset: 1024)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!211, !655, !655, !648}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "createmassmatrix", scope: !662, file: !49, line: 49, baseType: !734, size: 64, offset: 1088)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "hascreateinjection", scope: !662, file: !49, line: 50, baseType: !739, size: 64, offset: 1152)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!211, !655, !742}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "createinjection", scope: !662, file: !49, line: 51, baseType: !734, size: 64, offset: 1216)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !662, file: !49, line: 53, baseType: !745, size: 64, offset: 1280)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!211, !655, !189, !673}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "coarsen", scope: !662, file: !49, line: 54, baseType: !745, size: 64, offset: 1344)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "refinehierarchy", scope: !662, file: !49, line: 55, baseType: !750, size: 64, offset: 1408)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!211, !655, !247, !673}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhierarchy", scope: !662, file: !49, line: 56, baseType: !750, size: 64, offset: 1472)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "adaptlabel", scope: !662, file: !49, line: 57, baseType: !755, size: 64, offset: 1536)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{!211, !655, !758, !673}
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabel", file: !759, line: 12, baseType: !760)
!759 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmlabel.h", directory: "/home/users/ndemeye/xSDK")
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMLabel", file: !759, line: 12, flags: DIFlagFwdDecl)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "adaptmetric", scope: !662, file: !49, line: 58, baseType: !763, size: 64, offset: 1600)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{!211, !655, !689, !758, !673}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalbegin", scope: !662, file: !49, line: 60, baseType: !767, size: 64, offset: 1664)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{!211, !655, !689, !770, !689}
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !31)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalend", scope: !662, file: !49, line: 61, baseType: !767, size: 64, offset: 1728)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalbegin", scope: !662, file: !49, line: 62, baseType: !767, size: 64, offset: 1792)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalend", scope: !662, file: !49, line: 63, baseType: !767, size: 64, offset: 1856)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalbegin", scope: !662, file: !49, line: 64, baseType: !767, size: 64, offset: 1920)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalend", scope: !662, file: !49, line: 65, baseType: !767, size: 64, offset: 1984)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !662, file: !49, line: 67, baseType: !679, size: 64, offset: 2048)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !662, file: !49, line: 69, baseType: !778, size: 64, offset: 2112)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!211, !655, !689, !689}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "createsubdm", scope: !662, file: !49, line: 71, baseType: !782, size: 64, offset: 2176)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{!211, !655, !247, !595, !702, !673}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "createsuperdm", scope: !662, file: !49, line: 72, baseType: !786, size: 64, offset: 2240)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!211, !673, !247, !701, !673}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "createfielddecomposition", scope: !662, file: !49, line: 73, baseType: !790, size: 64, offset: 2304)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{!211, !655, !292, !699, !701, !793}
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "createdomaindecomposition", scope: !662, file: !49, line: 74, baseType: !795, size: 64, offset: 2368)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{!211, !655, !292, !699, !701, !701, !793}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "createddscatters", scope: !662, file: !49, line: 75, baseType: !799, size: 64, offset: 2432)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!211, !655, !247, !673, !802, !802, !802}
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !805, line: 59, baseType: !806)
!805 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !805, line: 15, baseType: !807)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !805, line: 15, flags: DIFlagFwdDecl)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "getdimpoints", scope: !662, file: !49, line: 77, baseType: !810, size: 64, offset: 2496)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DISubroutineType(types: !812)
!812 = !{!211, !655, !247, !292, !292}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "locatepoints", scope: !662, file: !49, line: 78, baseType: !814, size: 64, offset: 2560)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{!211, !655, !689, !817, !806}
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMPointLocationType", file: !43, line: 74, baseType: !42)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "getneighbors", scope: !662, file: !49, line: 79, baseType: !819, size: 64, offset: 2624)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{!211, !655, !292, !822}
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "getboundingbox", scope: !662, file: !49, line: 80, baseType: !826, size: 64, offset: 2688)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{!211, !655, !300, !300}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalboundingbox", scope: !662, file: !49, line: 81, baseType: !826, size: 64, offset: 2752)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "locatepointssubdomain", scope: !662, file: !49, line: 82, baseType: !831, size: 64, offset: 2816)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{!211, !655, !689, !834}
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlocal", scope: !662, file: !49, line: 84, baseType: !837, size: 64, offset: 2880)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{!211, !655, !301, !840, !841, !770, !689}
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlabellocal", scope: !662, file: !49, line: 85, baseType: !843, size: 64, offset: 2944)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DISubroutineType(types: !845)
!845 = !{!211, !655, !301, !758, !247, !595, !247, !595, !840, !841, !770, !689}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlocal", scope: !662, file: !49, line: 86, baseType: !847, size: 64, offset: 3008)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{!211, !655, !301, !689, !850, !770, !689}
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{null, !247, !247, !247, !595, !595, !600, !600, !600, !595, !595, !600, !600, !600, !301, !612, !247, !600, !309}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlabellocal", scope: !662, file: !49, line: 87, baseType: !855, size: 64, offset: 3072)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!211, !655, !301, !758, !247, !595, !247, !595, !689, !850, !770, !689}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "projectbdfieldlabellocal", scope: !662, file: !49, line: 88, baseType: !859, size: 64, offset: 3136)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!211, !655, !301, !758, !247, !595, !247, !595, !689, !862, !770, !689}
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{null, !247, !247, !247, !595, !595, !600, !600, !600, !595, !595, !600, !600, !600, !301, !612, !612, !247, !600, !309}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "computel2diff", scope: !662, file: !49, line: 89, baseType: !867, size: 64, offset: 3200)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DISubroutineType(types: !869)
!869 = !{!211, !655, !301, !840, !841, !689, !300}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "computel2gradientdiff", scope: !662, file: !49, line: 90, baseType: !871, size: 64, offset: 3264)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!211, !655, !301, !874, !841, !689, !612, !300}
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!211, !247, !301, !612, !612, !247, !309, !193}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "computel2fielddiff", scope: !662, file: !49, line: 91, baseType: !867, size: 64, offset: 3328)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "getcompatibility", scope: !662, file: !49, line: 93, baseType: !880, size: 64, offset: 3392)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DISubroutineType(types: !882)
!882 = !{!211, !655, !655, !742, !742}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "localin", scope: !657, file: !49, line: 204, baseType: !884, size: 6400, offset: 7936)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !689, size: 6400, elements: !885)
!885 = !{!886}
!886 = !DISubrange(count: 100)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "localout", scope: !657, file: !49, line: 204, baseType: !884, size: 6400, offset: 14336)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "globalin", scope: !657, file: !49, line: 205, baseType: !884, size: 6400, offset: 20736)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "globalout", scope: !657, file: !49, line: 205, baseType: !884, size: 6400, offset: 27136)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "namedglobal", scope: !657, file: !49, line: 206, baseType: !891, size: 64, offset: 33536)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMNamedVecLink", file: !49, line: 141, baseType: !892)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMNamedVecLink", file: !49, line: 142, size: 256, elements: !894)
!894 = !{!895, !896, !897, !899}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !893, file: !49, line: 143, baseType: !689, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !893, file: !49, line: 144, baseType: !274, size: 64, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !893, file: !49, line: 145, baseType: !898, size: 32, offset: 128)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMVecStatus", file: !49, line: 140, baseType: !48)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !893, file: !49, line: 146, baseType: !891, size: 64, offset: 192)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "namedlocal", scope: !657, file: !49, line: 207, baseType: !891, size: 64, offset: 33600)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !657, file: !49, line: 208, baseType: !902, size: 64, offset: 33664)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMWorkLink", file: !49, line: 149, baseType: !903)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMWorkLink", file: !49, line: 150, size: 192, elements: !905)
!905 = !{!906, !907, !908}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !904, file: !49, line: 151, baseType: !358, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !904, file: !49, line: 152, baseType: !193, size: 64, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !904, file: !49, line: 153, baseType: !902, size: 64, offset: 128)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !657, file: !49, line: 208, baseType: !902, size: 64, offset: 33728)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !657, file: !49, line: 209, baseType: !911, size: 64, offset: 33792)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabelLink", file: !49, line: 163, baseType: !912)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DMLabelLink", file: !49, line: 158, size: 192, elements: !914)
!914 = !{!915, !916, !917}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !913, file: !49, line: 159, baseType: !758, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !913, file: !49, line: 160, baseType: !362, size: 32, offset: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !913, file: !49, line: 161, baseType: !912, size: 64, offset: 128)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "depthLabel", scope: !657, file: !49, line: 210, baseType: !758, size: 64, offset: 33856)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "celltypeLabel", scope: !657, file: !49, line: 211, baseType: !758, size: 64, offset: 33920)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !657, file: !49, line: 212, baseType: !193, size: 64, offset: 33984)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "ctxdestroy", scope: !657, file: !49, line: 213, baseType: !922, size: 64, offset: 34048)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!211, !841}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "coloringtype", scope: !657, file: !49, line: 214, baseType: !720, size: 32, offset: 34112)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !657, file: !49, line: 215, baseType: !927, size: 64, offset: 34176)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !126, line: 1378, baseType: !928)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !126, line: 1378, flags: DIFlagFwdDecl)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "vectype", scope: !657, file: !49, line: 216, baseType: !931, size: 64, offset: 34240)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecType", file: !690, line: 83, baseType: !181)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "mattype", scope: !657, file: !49, line: 217, baseType: !933, size: 64, offset: 34304)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !126, line: 25, baseType: !181)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !657, file: !49, line: 218, baseType: !247, size: 32, offset: 34368)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "ltogmap", scope: !657, file: !49, line: 219, baseType: !936, size: 64, offset: 34432)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !704, line: 30, baseType: !937)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !704, line: 30, flags: DIFlagFwdDecl)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_only", scope: !657, file: !49, line: 220, baseType: !362, size: 32, offset: 34496)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "structure_only", scope: !657, file: !49, line: 221, baseType: !362, size: 32, offset: 34528)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "levelup", scope: !657, file: !49, line: 222, baseType: !247, size: 32, offset: 34560)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "leveldown", scope: !657, file: !49, line: 222, baseType: !247, size: 32, offset: 34592)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !657, file: !49, line: 223, baseType: !362, size: 32, offset: 34624)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !657, file: !49, line: 224, baseType: !362, size: 32, offset: 34656)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !657, file: !49, line: 225, baseType: !193, size: 64, offset: 34688)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "coarseMesh", scope: !657, file: !49, line: 227, baseType: !655, size: 64, offset: 34752)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "fineMesh", scope: !657, file: !49, line: 228, baseType: !655, size: 64, offset: 34816)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !657, file: !49, line: 229, baseType: !949, size: 64, offset: 34880)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCoarsenHookLink", file: !49, line: 100, baseType: !950)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMCoarsenHookLink", file: !49, line: 101, size: 256, elements: !952)
!952 = !{!953, !957, !961, !962}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !951, file: !49, line: 102, baseType: !954, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{!211, !655, !655, !193}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !951, file: !49, line: 103, baseType: !958, size: 64, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!211, !655, !649, !689, !649, !655, !193}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !951, file: !49, line: 104, baseType: !193, size: 64, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !951, file: !49, line: 105, baseType: !949, size: 64, offset: 192)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !657, file: !49, line: 230, baseType: !964, size: 64, offset: 34944)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMRefineHookLink", file: !49, line: 108, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMRefineHookLink", file: !49, line: 109, size: 256, elements: !967)
!967 = !{!968, !969, !973, !974}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !966, file: !49, line: 110, baseType: !954, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "interphook", scope: !966, file: !49, line: 111, baseType: !970, size: 64, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!211, !655, !649, !655, !193}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !966, file: !49, line: 112, baseType: !193, size: 64, offset: 128)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !966, file: !49, line: 113, baseType: !964, size: 64, offset: 192)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "subdomainhook", scope: !657, file: !49, line: 231, baseType: !976, size: 64, offset: 35008)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSubDomainHookLink", file: !49, line: 116, baseType: !977)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMSubDomainHookLink", file: !49, line: 117, size: 256, elements: !979)
!979 = !{!980, !981, !985, !986}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "ddhook", scope: !978, file: !49, line: 118, baseType: !954, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !978, file: !49, line: 119, baseType: !982, size: 64, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!211, !655, !804, !804, !655, !193}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !978, file: !49, line: 120, baseType: !193, size: 64, offset: 128)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !978, file: !49, line: 121, baseType: !976, size: 64, offset: 192)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "gtolhook", scope: !657, file: !49, line: 232, baseType: !988, size: 64, offset: 35072)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGlobalToLocalHookLink", file: !49, line: 124, baseType: !989)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMGlobalToLocalHookLink", file: !49, line: 125, size: 256, elements: !991)
!991 = !{!992, !996, !997, !998}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !990, file: !49, line: 126, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!211, !655, !689, !770, !689, !193}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !990, file: !49, line: 127, baseType: !993, size: 64, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !990, file: !49, line: 128, baseType: !193, size: 64, offset: 128)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !990, file: !49, line: 129, baseType: !988, size: 64, offset: 192)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "ltoghook", scope: !657, file: !49, line: 233, baseType: !1000, size: 64, offset: 35136)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLocalToGlobalHookLink", file: !49, line: 132, baseType: !1001)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMLocalToGlobalHookLink", file: !49, line: 133, size: 256, elements: !1003)
!1003 = !{!1004, !1005, !1006, !1007}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !1002, file: !49, line: 134, baseType: !993, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !1002, file: !49, line: 135, baseType: !993, size: 64, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !1002, file: !49, line: 136, baseType: !193, size: 64, offset: 128)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1002, file: !49, line: 137, baseType: !1000, size: 64, offset: 192)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !657, file: !49, line: 235, baseType: !247, size: 32, offset: 35200)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "auxData", scope: !657, file: !49, line: 237, baseType: !1010, size: 64, offset: 35264)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapAux", file: !49, line: 27, baseType: !1011)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapAux_t", file: !49, line: 27, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapAux_s", file: !49, line: 27, size: 320, elements: !1014)
!1014 = !{!1015, !1019, !1020, !1021, !1022, !1024, !1031}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !1013, file: !49, line: 27, baseType: !1016, size: 32)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !1017, line: 166, baseType: !1018)
!1017 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/khash/khash.h", directory: "/home/users/ndemeye/xSDK")
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !1017, line: 139, baseType: !7)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1013, file: !49, line: 27, baseType: !1016, size: 32, offset: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !1013, file: !49, line: 27, baseType: !1016, size: 32, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !1013, file: !49, line: 27, baseType: !1016, size: 32, offset: 96)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1013, file: !49, line: 27, baseType: !1023, size: 64, offset: 128)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !1013, file: !49, line: 27, baseType: !1025, size: 64, offset: 192)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHashAuxKey", file: !49, line: 21, baseType: !1027)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscHashAuxKey", file: !49, line: 17, size: 128, elements: !1028)
!1028 = !{!1029, !1030}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1027, file: !49, line: 19, baseType: !758, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1027, file: !49, line: 20, baseType: !247, size: 32, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !1013, file: !49, line: 27, baseType: !688, size: 64, offset: 256)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "sfMigration", scope: !657, file: !49, line: 239, baseType: !806, size: 64, offset: 35328)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !657, file: !49, line: 240, baseType: !806, size: 64, offset: 35392)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "sectionSF", scope: !657, file: !49, line: 241, baseType: !806, size: 64, offset: 35456)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "sfNatural", scope: !657, file: !49, line: 242, baseType: !806, size: 64, offset: 35520)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "useNatural", scope: !657, file: !49, line: 243, baseType: !362, size: 32, offset: 35584)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !657, file: !49, line: 245, baseType: !1038, size: 64, offset: 35616)
!1038 = !DICompositeType(tag: DW_TAG_array_type, baseType: !362, size: 64, elements: !323)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "localSection", scope: !657, file: !49, line: 246, baseType: !1040, size: 64, offset: 35712)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !1041, line: 18, baseType: !1042)
!1041 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !1044, line: 29, size: 5760, elements: !1045)
!1044 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sectionimpl.h", directory: "/home/users/ndemeye/xSDK")
!1045 = !{!1046, !1047, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1065, !1066, !1067, !1068, !1093, !1094, !1095}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1043, file: !1044, line: 30, baseType: !563, size: 4480)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1043, file: !1044, line: 30, baseType: !1048, size: 32, offset: 4480)
!1048 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 32, elements: !243)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "pStart", scope: !1043, file: !1044, line: 31, baseType: !247, size: 32, offset: 4512)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "pEnd", scope: !1043, file: !1044, line: 31, baseType: !247, size: 32, offset: 4544)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !1043, file: !1044, line: 32, baseType: !703, size: 64, offset: 4608)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "pointMajor", scope: !1043, file: !1044, line: 33, baseType: !362, size: 32, offset: 4672)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "includesConstraints", scope: !1043, file: !1044, line: 34, baseType: !362, size: 32, offset: 4704)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "atlasDof", scope: !1043, file: !1044, line: 35, baseType: !292, size: 64, offset: 4736)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "atlasOff", scope: !1043, file: !1044, line: 36, baseType: !292, size: 64, offset: 4800)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "maxDof", scope: !1043, file: !1044, line: 37, baseType: !247, size: 32, offset: 4864)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !1043, file: !1044, line: 38, baseType: !1040, size: 64, offset: 4928)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "bcIndices", scope: !1043, file: !1044, line: 39, baseType: !292, size: 64, offset: 4992)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !1043, file: !1044, line: 40, baseType: !362, size: 32, offset: 5056)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "numFields", scope: !1043, file: !1044, line: 42, baseType: !247, size: 32, offset: 5088)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "fieldNames", scope: !1043, file: !1044, line: 43, baseType: !700, size: 64, offset: 5120)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "numFieldComponents", scope: !1043, file: !1044, line: 44, baseType: !292, size: 64, offset: 5184)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !1043, file: !1044, line: 45, baseType: !1064, size: 64, offset: 5248)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "useFieldOff", scope: !1043, file: !1044, line: 46, baseType: !362, size: 32, offset: 5312)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "compNames", scope: !1043, file: !1044, line: 47, baseType: !699, size: 64, offset: 5376)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "clObj", scope: !1043, file: !1044, line: 49, baseType: !194, size: 64, offset: 5440)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "clHash", scope: !1043, file: !1044, line: 50, baseType: !1069, size: 64, offset: 5504)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClPerm", file: !1044, line: 27, baseType: !1070)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_ClPerm_t", file: !1044, line: 27, baseType: !1072)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_ClPerm_s", file: !1044, line: 27, size: 320, elements: !1073)
!1073 = !{!1074, !1075, !1076, !1077, !1078, !1079, !1086}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !1072, file: !1044, line: 27, baseType: !1016, size: 32)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1072, file: !1044, line: 27, baseType: !1016, size: 32, offset: 32)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !1072, file: !1044, line: 27, baseType: !1016, size: 32, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !1072, file: !1044, line: 27, baseType: !1016, size: 32, offset: 96)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1072, file: !1044, line: 27, baseType: !1023, size: 64, offset: 128)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !1072, file: !1044, line: 27, baseType: !1080, size: 64, offset: 192)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermKey", file: !1044, line: 10, baseType: !1082)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PetscSectionClosurePermKey", file: !1044, line: 8, size: 64, elements: !1083)
!1083 = !{!1084, !1085}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1082, file: !1044, line: 9, baseType: !247, size: 32)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1082, file: !1044, line: 9, baseType: !247, size: 32, offset: 32)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !1072, file: !1044, line: 27, baseType: !1087, size: 64, offset: 256)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermVal", file: !1044, line: 14, baseType: !1089)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1044, line: 12, size: 128, elements: !1090)
!1090 = !{!1091, !1092}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !1089, file: !1044, line: 13, baseType: !292, size: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "invPerm", scope: !1089, file: !1044, line: 13, baseType: !292, size: 64, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "clSection", scope: !1043, file: !1044, line: 51, baseType: !1040, size: 64, offset: 5568)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "clPoints", scope: !1043, file: !1044, line: 52, baseType: !703, size: 64, offset: 5632)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !1043, file: !1044, line: 53, baseType: !1096, size: 64, offset: 5696)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionSym", file: !1041, line: 33, baseType: !1097)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSectionSym", file: !1044, line: 72, size: 4864, elements: !1099)
!1099 = !{!1100, !1101, !1117, !1118, !1127}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1098, file: !1044, line: 73, baseType: !563, size: 4480)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1098, file: !1044, line: 73, baseType: !1102, size: 192, offset: 4480)
!1102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1103, size: 192, elements: !243)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSectionSymOps", file: !1044, line: 56, size: 192, elements: !1104)
!1104 = !{!1105, !1109, !1113}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "getpoints", scope: !1103, file: !1044, line: 57, baseType: !1106, size: 64)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!211, !1096, !1040, !247, !595, !594, !599}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !1103, file: !1044, line: 58, baseType: !1110, size: 64, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!211, !1096}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !1103, file: !1044, line: 59, baseType: !1114, size: 64, offset: 128)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!211, !1096, !217}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1098, file: !1044, line: 74, baseType: !193, size: 64, offset: 4672)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !1098, file: !1044, line: 75, baseType: !1119, size: 64, offset: 4736)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "SymWorkLink", file: !1044, line: 62, baseType: !1120)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_SymWorkLink", file: !1044, line: 64, size: 256, elements: !1122)
!1122 = !{!1123, !1124, !1125, !1126}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1121, file: !1044, line: 66, baseType: !1119, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "perms", scope: !1121, file: !1044, line: 67, baseType: !594, size: 64, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "rots", scope: !1121, file: !1044, line: 68, baseType: !599, size: 64, offset: 128)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "numPoints", scope: !1121, file: !1044, line: 69, baseType: !247, size: 32, offset: 192)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !1098, file: !1044, line: 76, baseType: !1119, size: 64, offset: 4800)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "globalSection", scope: !657, file: !49, line: 247, baseType: !1040, size: 64, offset: 35776)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !657, file: !49, line: 248, baseType: !1130, size: 64, offset: 35840)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !704, line: 60, baseType: !1131)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !27, line: 240, size: 640, elements: !1133)
!1133 = !{!1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1132, file: !27, line: 241, baseType: !189, size: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1132, file: !27, line: 242, baseType: !264, size: 32, offset: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1132, file: !27, line: 243, baseType: !247, size: 32, offset: 96)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1132, file: !27, line: 243, baseType: !247, size: 32, offset: 128)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1132, file: !27, line: 244, baseType: !247, size: 32, offset: 160)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1132, file: !27, line: 244, baseType: !247, size: 32, offset: 192)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1132, file: !27, line: 245, baseType: !292, size: 64, offset: 256)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1132, file: !27, line: 246, baseType: !362, size: 32, offset: 320)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1132, file: !27, line: 247, baseType: !247, size: 32, offset: 352)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1132, file: !27, line: 251, baseType: !247, size: 32, offset: 384)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1132, file: !27, line: 252, baseType: !936, size: 64, offset: 448)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1132, file: !27, line: 253, baseType: !362, size: 32, offset: 512)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1132, file: !27, line: 254, baseType: !247, size: 32, offset: 544)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1132, file: !27, line: 254, baseType: !247, size: 32, offset: 576)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1132, file: !27, line: 255, baseType: !247, size: 32, offset: 608)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintSection", scope: !657, file: !49, line: 250, baseType: !1040, size: 64, offset: 35904)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintMat", scope: !657, file: !49, line: 251, baseType: !649, size: 64, offset: 35968)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "transformDM", scope: !657, file: !49, line: 253, baseType: !655, size: 64, offset: 36032)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !657, file: !49, line: 254, baseType: !689, size: 64, offset: 36096)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "transformCtx", scope: !657, file: !49, line: 255, baseType: !193, size: 64, offset: 36160)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "transformSetUp", scope: !657, file: !49, line: 256, baseType: !1155, size: 64, offset: 36224)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{!211, !655, !193}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "transformDestroy", scope: !657, file: !49, line: 257, baseType: !1155, size: 64, offset: 36288)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "transformGetMatrix", scope: !657, file: !49, line: 258, baseType: !1160, size: 64, offset: 36352)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = !DISubroutineType(types: !1162)
!1162 = !{!211, !655, !612, !362, !599, !193}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !657, file: !49, line: 260, baseType: !247, size: 32, offset: 36416)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateDM", scope: !657, file: !49, line: 261, baseType: !655, size: 64, offset: 36480)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "coordinates", scope: !657, file: !49, line: 262, baseType: !689, size: 64, offset: 36544)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatesLocal", scope: !657, file: !49, line: 263, baseType: !689, size: 64, offset: 36608)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !657, file: !49, line: 264, baseType: !362, size: 32, offset: 36672)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateField", scope: !657, file: !49, line: 265, baseType: !713, size: 64, offset: 36736)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !657, file: !49, line: 266, baseType: !300, size: 64, offset: 36800)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "maxCell", scope: !657, file: !49, line: 266, baseType: !300, size: 64, offset: 36864)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "bdtype", scope: !657, file: !49, line: 267, baseType: !1172, size: 64, offset: 36928)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryType", file: !43, line: 42, baseType: !53)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "nullspaceConstructors", scope: !657, file: !49, line: 269, baseType: !1175, size: 640, offset: 36992)
!1175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1176, size: 640, elements: !1184)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "NullSpaceFunc", file: !49, line: 15, baseType: !1177)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = !DISubroutineType(types: !1179)
!1179 = !{!211, !655, !247, !247, !1180}
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !126, line: 1723, baseType: !1182)
