; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/pipefgmres/pipefgmres.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/pipefgmres/pipefgmres.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._n_PetscSegBuffer = type opaque

!93 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !104, line: 70, baseType: !7, size: 32, elements: !105)
!104 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!105 = !{!106, !107, !108}
!106 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!107 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!108 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 451, baseType: !28, size: 32, elements: !110)
!110 = !{!111, !112, !113, !114, !115}
!111 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!112 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!113 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!114 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!115 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!116 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 297, baseType: !7, size: 32, elements: !117)
!117 = !{!118, !119, !120}
!118 = !DIEnumerator(name: "KSP_GMRES_CGS_REFINE_NEVER", value: 0, isUnsigned: true)
!119 = !DIEnumerator(name: "KSP_GMRES_CGS_REFINE_IFNEEDED", value: 1, isUnsigned: true)
!120 = !DIEnumerator(name: "KSP_GMRES_CGS_REFINE_ALWAYS", value: 2, isUnsigned: true)
!121 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !122, line: 663, baseType: !7, size: 32, elements: !123)
!122 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!123 = !{!124, !125, !126}
!124 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!125 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!126 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!127 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !128)
!128 = !{!129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146}
!129 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!130 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!131 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!132 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!133 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!134 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!135 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!136 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!137 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!138 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!139 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!140 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!141 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!142 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!143 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!144 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!145 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!146 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!147 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !148, line: 155, baseType: !7, size: 32, elements: !149)
!148 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!149 = !{!150, !151, !152, !153, !154}
!150 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!151 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!152 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!153 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!154 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!155 = !{!156, !207, !286, !204, !357, !228, !165, !653, !164, !266, !655, !658, !276, !28, !7}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP_PIPEFGMRES", file: !158, line: 27, baseType: !159)
!158 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/ksp/impls/gmres/pipefgmres/pipefgmresimpl.h", directory: "/home/users/ndemeye/xSDK")
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 7, size: 1984, elements: !160)
!160 = !{!161, !166, !167, !168, !169, !170, !171, !172, !174, !175, !176, !178, !179, !629, !631, !632, !633, !634, !635, !636, !637, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "hh_origin", scope: !159, file: !158, line: 8, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !165)
!165 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "hes_origin", scope: !159, file: !158, line: 8, baseType: !162, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "hes_ritz", scope: !159, file: !158, line: 8, baseType: !162, size: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "cc_origin", scope: !159, file: !158, line: 8, baseType: !162, size: 64, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "ss_origin", scope: !159, file: !158, line: 8, baseType: !162, size: 64, offset: 256)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "rs_origin", scope: !159, file: !158, line: 8, baseType: !162, size: 64, offset: 320)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "orthogwork", scope: !159, file: !158, line: 8, baseType: !162, size: 64, offset: 384)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "Dsvd", scope: !159, file: !158, line: 8, baseType: !173, size: 64, offset: 448)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Rsvd", scope: !159, file: !158, line: 8, baseType: !162, size: 64, offset: 512)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "haptol", scope: !159, file: !158, line: 8, baseType: !164, size: 64, offset: 576)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "max_k", scope: !159, file: !158, line: 8, baseType: !177, size: 32, offset: 640)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nextra_vecs", scope: !159, file: !158, line: 8, baseType: !177, size: 32, offset: 672)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "orthog", scope: !159, file: !158, line: 8, baseType: !180, size: 64, offset: 704)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!183, !184, !177}
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !35, line: 22, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !104, line: 75, size: 12800, elements: !187)
!187 = !{!188, !391, !444, !449, !450, !451, !452, !482, !483, !484, !485, !486, !488, !493, !494, !495, !496, !497, !498, !499, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !522, !528, !529, !530, !531, !536, !537, !538, !539, !544, !545, !546, !547, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !599, !600, !601, !602, !603, !610, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !626, !627, !628}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !186, file: !104, line: 76, baseType: !189, size: 4480)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !190, line: 122, baseType: !191)
!190 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !190, line: 73, size: 4480, elements: !192)
!192 = !{!193, !195, !249, !250, !251, !253, !254, !255, !256, !264, !265, !267, !271, !275, !277, !278, !279, !280, !281, !282, !283, !284, !285, !287, !289, !290, !291, !293, !294, !296, !298, !299, !300, !301, !302, !303, !305, !306, !307, !308, !309, !310, !312, !313, !314, !324, !326, !327, !331, !332, !381, !386, !388, !389, !390}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !191, file: !190, line: 74, baseType: !194, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !191, file: !190, line: 75, baseType: !196, size: 448, offset: 64)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 448, elements: !247)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !190, line: 53, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !190, line: 45, size: 448, elements: !199)
!199 = !{!200, !211, !219, !224, !231, !235, !242}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !198, file: !190, line: 46, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!183, !204, !206}
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !208, line: 330, baseType: !209)
!208 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !208, line: 330, flags: DIFlagFwdDecl)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !198, file: !190, line: 47, baseType: !212, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!183, !204, !215}
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !216, line: 16, baseType: !217)
!216 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !216, line: 16, flags: DIFlagFwdDecl)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !198, file: !190, line: 48, baseType: !220, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!183, !223}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !198, file: !190, line: 49, baseType: !225, size: 64, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!183, !204, !228, !204}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !230)
!230 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !198, file: !190, line: 50, baseType: !232, size: 64, offset: 256)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!183, !204, !228, !223}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !198, file: !190, line: 51, baseType: !236, size: 64, offset: 320)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!183, !204, !228, !239}
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{null}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !198, file: !190, line: 52, baseType: !243, size: 64, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!183, !204, !228, !246}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!247 = !{!248}
!248 = !DISubrange(count: 1)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !191, file: !190, line: 76, baseType: !207, size: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !191, file: !190, line: 77, baseType: !177, size: 32, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !191, file: !190, line: 78, baseType: !252, size: 64, offset: 640)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !165)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !191, file: !190, line: 78, baseType: !252, size: 64, offset: 704)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !191, file: !190, line: 78, baseType: !252, size: 64, offset: 768)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !191, file: !190, line: 78, baseType: !252, size: 64, offset: 832)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !191, file: !190, line: 79, baseType: !257, size: 64, offset: 896)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !260, line: 27, baseType: !261)
!260 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !262, line: 43, baseType: !263)
!262 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!263 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !191, file: !190, line: 80, baseType: !177, size: 32, offset: 960)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !191, file: !190, line: 81, baseType: !266, size: 32, offset: 992)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !191, file: !190, line: 82, baseType: !268, size: 64, offset: 1024)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !191, file: !190, line: 83, baseType: !272, size: 64, offset: 1088)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !191, file: !190, line: 84, baseType: !276, size: 64, offset: 1152)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !191, file: !190, line: 85, baseType: !276, size: 64, offset: 1216)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !191, file: !190, line: 86, baseType: !276, size: 64, offset: 1280)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !191, file: !190, line: 87, baseType: !276, size: 64, offset: 1344)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !191, file: !190, line: 88, baseType: !204, size: 64, offset: 1408)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !191, file: !190, line: 89, baseType: !257, size: 64, offset: 1472)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !191, file: !190, line: 90, baseType: !276, size: 64, offset: 1536)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !191, file: !190, line: 91, baseType: !276, size: 64, offset: 1600)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !191, file: !190, line: 92, baseType: !177, size: 32, offset: 1664)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !191, file: !190, line: 93, baseType: !286, size: 64, offset: 1728)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !191, file: !190, line: 94, baseType: !288, size: 64, offset: 1792)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !258)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !191, file: !190, line: 95, baseType: !177, size: 32, offset: 1856)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !191, file: !190, line: 95, baseType: !177, size: 32, offset: 1888)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !191, file: !190, line: 96, baseType: !292, size: 64, offset: 1920)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !191, file: !190, line: 96, baseType: !292, size: 64, offset: 1984)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !191, file: !190, line: 97, baseType: !295, size: 64, offset: 2048)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !191, file: !190, line: 97, baseType: !297, size: 64, offset: 2112)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !191, file: !190, line: 98, baseType: !177, size: 32, offset: 2176)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !191, file: !190, line: 98, baseType: !177, size: 32, offset: 2208)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !191, file: !190, line: 99, baseType: !292, size: 64, offset: 2240)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !191, file: !190, line: 99, baseType: !292, size: 64, offset: 2304)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !191, file: !190, line: 100, baseType: !173, size: 64, offset: 2368)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !191, file: !190, line: 100, baseType: !304, size: 64, offset: 2432)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !191, file: !190, line: 101, baseType: !177, size: 32, offset: 2496)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !191, file: !190, line: 101, baseType: !177, size: 32, offset: 2528)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !191, file: !190, line: 102, baseType: !292, size: 64, offset: 2560)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !191, file: !190, line: 102, baseType: !292, size: 64, offset: 2624)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !191, file: !190, line: 103, baseType: !162, size: 64, offset: 2688)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !191, file: !190, line: 103, baseType: !311, size: 64, offset: 2752)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !191, file: !190, line: 104, baseType: !246, size: 64, offset: 2816)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !191, file: !190, line: 105, baseType: !177, size: 32, offset: 2880)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !191, file: !190, line: 106, baseType: !315, size: 128, offset: 2944)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 128, elements: !322)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !190, line: 64, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !190, line: 61, size: 128, elements: !319)
!319 = !{!320, !321}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !318, file: !190, line: 62, baseType: !239, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !318, file: !190, line: 63, baseType: !286, size: 64, offset: 64)
!322 = !{!323}
!323 = !DISubrange(count: 2)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !191, file: !190, line: 107, baseType: !325, size: 64, offset: 3072)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 64, elements: !322)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !191, file: !190, line: 108, baseType: !286, size: 64, offset: 3136)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !191, file: !190, line: 109, baseType: !328, size: 64, offset: 3200)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!183, !286}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !191, file: !190, line: 111, baseType: !177, size: 32, offset: 3264)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !191, file: !190, line: 112, baseType: !333, size: 320, offset: 3328)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 320, elements: !379)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!183, !337, !204, !286}
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !340)
!340 = !{!341, !342, !367, !368, !369, !370, !371, !372, !373, !374, !375}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !339, file: !12, line: 100, baseType: !177, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !339, file: !12, line: 101, baseType: !343, size: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !346)
!346 = !{!347, !348, !349, !350, !351, !354, !355, !356, !360, !362, !364, !365, !366}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !345, file: !12, line: 84, baseType: !276, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !345, file: !12, line: 85, baseType: !276, size: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !345, file: !12, line: 86, baseType: !286, size: 64, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !345, file: !12, line: 87, baseType: !268, size: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !345, file: !12, line: 88, baseType: !352, size: 64, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !228)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !345, file: !12, line: 89, baseType: !230, size: 8, offset: 320)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !345, file: !12, line: 90, baseType: !276, size: 64, offset: 384)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !345, file: !12, line: 91, baseType: !357, size: 64, offset: 448)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !358, line: 46, baseType: !359)
!358 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!359 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !345, file: !12, line: 92, baseType: !361, size: 32, offset: 512)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !345, file: !12, line: 93, baseType: !363, size: 32, offset: 544)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !345, file: !12, line: 94, baseType: !343, size: 64, offset: 576)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !345, file: !12, line: 95, baseType: !276, size: 64, offset: 640)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !345, file: !12, line: 96, baseType: !286, size: 64, offset: 704)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !339, file: !12, line: 102, baseType: !276, size: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !339, file: !12, line: 102, baseType: !276, size: 64, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !339, file: !12, line: 103, baseType: !276, size: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !339, file: !12, line: 104, baseType: !207, size: 64, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !339, file: !12, line: 105, baseType: !361, size: 32, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !339, file: !12, line: 105, baseType: !361, size: 32, offset: 416)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !339, file: !12, line: 105, baseType: !361, size: 32, offset: 448)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !339, file: !12, line: 106, baseType: !204, size: 64, offset: 512)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !339, file: !12, line: 107, baseType: !376, size: 64, offset: 576)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!379 = !{!380}
!380 = !DISubrange(count: 5)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !191, file: !190, line: 113, baseType: !382, size: 320, offset: 3648)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 320, elements: !379)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!183, !204, !286}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !191, file: !190, line: 114, baseType: !387, size: 320, offset: 3968)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 320, elements: !379)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !191, file: !190, line: 115, baseType: !361, size: 32, offset: 4288)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !191, file: !190, line: 120, baseType: !376, size: 64, offset: 4352)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !191, file: !190, line: 121, baseType: !361, size: 32, offset: 4416)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !186, file: !104, line: 76, baseType: !392, size: 896, offset: 4480)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, size: 896, elements: !247)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !104, line: 18, size: 896, elements: !394)
!394 = !{!395, !403, !407, !411, !419, !420, !424, !425, !429, !433, !437, !438, !442, !443}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !393, file: !104, line: 19, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!183, !184, !399, !402}
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !148, line: 21, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !148, line: 21, flags: DIFlagFwdDecl)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !393, file: !104, line: 22, baseType: !404, size: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!183, !184, !399, !399, !402}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !393, file: !104, line: 25, baseType: !408, size: 64, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!183, !184}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !393, file: !104, line: 26, baseType: !412, size: 64, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!183, !184, !415, !415}
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !416, line: 16, baseType: !417)
!416 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !416, line: 16, flags: DIFlagFwdDecl)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !393, file: !104, line: 27, baseType: !408, size: 64, offset: 256)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !393, file: !104, line: 28, baseType: !421, size: 64, offset: 320)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!183, !337, !184}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !393, file: !104, line: 29, baseType: !408, size: 64, offset: 384)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !393, file: !104, line: 30, baseType: !426, size: 64, offset: 448)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!183, !184, !173, !173}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !393, file: !104, line: 31, baseType: !430, size: 64, offset: 512)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!183, !184, !177, !173, !173, !295}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !393, file: !104, line: 32, baseType: !434, size: 64, offset: 576)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{!183, !184, !361, !361, !295, !402, !173, !173}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !393, file: !104, line: 33, baseType: !408, size: 64, offset: 640)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !393, file: !104, line: 34, baseType: !439, size: 64, offset: 704)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!183, !184, !215}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !393, file: !104, line: 35, baseType: !408, size: 64, offset: 768)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !393, file: !104, line: 36, baseType: !439, size: 64, offset: 832)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !186, file: !104, line: 77, baseType: !445, size: 64, offset: 5376)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !446, line: 14, baseType: !447)
!446 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !446, line: 14, flags: DIFlagFwdDecl)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !186, file: !104, line: 78, baseType: !361, size: 32, offset: 5440)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !186, file: !104, line: 79, baseType: !361, size: 32, offset: 5472)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !186, file: !104, line: 81, baseType: !177, size: 32, offset: 5504)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !186, file: !104, line: 82, baseType: !453, size: 64, offset: 5568)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !35, line: 752, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !104, line: 54, size: 5184, elements: !456)
!456 = !{!457, !458, !478, !479, !480, !481}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !455, file: !104, line: 55, baseType: !189, size: 4480)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !455, file: !104, line: 55, baseType: !459, size: 448, offset: 4480)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 448, elements: !247)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !104, line: 41, size: 448, elements: !461)
!461 = !{!462, !466, !467, !471, !472, !473, !477}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !460, file: !104, line: 42, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!183, !453, !399, !399}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !460, file: !104, line: 43, baseType: !463, size: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !460, file: !104, line: 44, baseType: !468, size: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!183, !453}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !460, file: !104, line: 45, baseType: !468, size: 64, offset: 192)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !460, file: !104, line: 46, baseType: !468, size: 64, offset: 256)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !460, file: !104, line: 47, baseType: !474, size: 64, offset: 320)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!183, !453, !215}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !460, file: !104, line: 48, baseType: !468, size: 64, offset: 384)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !455, file: !104, line: 56, baseType: !184, size: 64, offset: 4928)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !455, file: !104, line: 57, baseType: !415, size: 64, offset: 4992)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !455, file: !104, line: 58, baseType: !288, size: 64, offset: 5056)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !455, file: !104, line: 59, baseType: !286, size: 64, offset: 5120)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !186, file: !104, line: 83, baseType: !361, size: 32, offset: 5632)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !186, file: !104, line: 84, baseType: !361, size: 32, offset: 5664)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !186, file: !104, line: 85, baseType: !361, size: 32, offset: 5696)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !186, file: !104, line: 86, baseType: !361, size: 32, offset: 5728)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !186, file: !104, line: 87, baseType: !487, size: 32, offset: 5760)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !27, line: 85, baseType: !26)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !186, file: !104, line: 88, baseType: !489, size: 384, offset: 5792)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 384, elements: !490)
!490 = !{!491, !492}
!491 = !DISubrange(count: 4)
!492 = !DISubrange(count: 3)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !186, file: !104, line: 89, baseType: !164, size: 64, offset: 6208)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !186, file: !104, line: 90, baseType: !164, size: 64, offset: 6272)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !186, file: !104, line: 91, baseType: !164, size: 64, offset: 6336)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !186, file: !104, line: 92, baseType: !164, size: 64, offset: 6400)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !186, file: !104, line: 93, baseType: !164, size: 64, offset: 6464)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !186, file: !104, line: 94, baseType: !164, size: 64, offset: 6528)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !186, file: !104, line: 95, baseType: !500, size: 32, offset: 6592)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !35, line: 540, baseType: !34)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !186, file: !104, line: 96, baseType: !361, size: 32, offset: 6624)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !186, file: !104, line: 98, baseType: !399, size: 64, offset: 6656)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !186, file: !104, line: 98, baseType: !399, size: 64, offset: 6720)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !186, file: !104, line: 102, baseType: !173, size: 64, offset: 6784)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !186, file: !104, line: 103, baseType: !173, size: 64, offset: 6848)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !186, file: !104, line: 104, baseType: !177, size: 32, offset: 6912)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !186, file: !104, line: 105, baseType: !177, size: 32, offset: 6944)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !186, file: !104, line: 106, baseType: !361, size: 32, offset: 6976)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !186, file: !104, line: 107, baseType: !173, size: 64, offset: 7040)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !186, file: !104, line: 108, baseType: !173, size: 64, offset: 7104)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !186, file: !104, line: 109, baseType: !177, size: 32, offset: 7168)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !186, file: !104, line: 110, baseType: !177, size: 32, offset: 7200)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !186, file: !104, line: 111, baseType: !361, size: 32, offset: 7232)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !186, file: !104, line: 113, baseType: !177, size: 32, offset: 7264)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !186, file: !104, line: 114, baseType: !361, size: 32, offset: 7296)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !186, file: !104, line: 117, baseType: !177, size: 32, offset: 7328)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !186, file: !104, line: 120, baseType: !518, size: 320, offset: 7360)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !519, size: 320, elements: !379)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{!183, !184, !177, !164, !286}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !186, file: !104, line: 121, baseType: !523, size: 320, offset: 7680)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !524, size: 320, elements: !379)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!183, !527}
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !186, file: !104, line: 122, baseType: !387, size: 320, offset: 8000)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !186, file: !104, line: 123, baseType: !177, size: 32, offset: 8320)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !186, file: !104, line: 124, baseType: !361, size: 32, offset: 8352)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !186, file: !104, line: 126, baseType: !532, size: 320, offset: 8384)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !533, size: 320, elements: !379)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!183, !184, !286}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !186, file: !104, line: 127, baseType: !523, size: 320, offset: 8704)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !186, file: !104, line: 128, baseType: !387, size: 320, offset: 9024)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !186, file: !104, line: 129, baseType: !177, size: 32, offset: 9344)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !186, file: !104, line: 131, baseType: !540, size: 64, offset: 9408)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!183, !184, !177, !164, !543, !286}
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !186, file: !104, line: 132, baseType: !328, size: 64, offset: 9472)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !186, file: !104, line: 133, baseType: !286, size: 64, offset: 9536)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !186, file: !104, line: 135, baseType: !286, size: 64, offset: 9600)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !186, file: !104, line: 137, baseType: !548, size: 64, offset: 9664)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !27, line: 11, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !27, line: 11, flags: DIFlagFwdDecl)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !186, file: !104, line: 139, baseType: !286, size: 64, offset: 9728)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !186, file: !104, line: 142, baseType: !361, size: 32, offset: 9792)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !186, file: !104, line: 142, baseType: !361, size: 32, offset: 9824)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !186, file: !104, line: 142, baseType: !361, size: 32, offset: 9856)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !186, file: !104, line: 142, baseType: !361, size: 32, offset: 9888)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !186, file: !104, line: 142, baseType: !361, size: 32, offset: 9920)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !186, file: !104, line: 142, baseType: !361, size: 32, offset: 9952)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !186, file: !104, line: 142, baseType: !361, size: 32, offset: 9984)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !186, file: !104, line: 142, baseType: !361, size: 32, offset: 10016)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !186, file: !104, line: 142, baseType: !361, size: 32, offset: 10048)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !186, file: !104, line: 142, baseType: !361, size: 32, offset: 10080)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !186, file: !104, line: 142, baseType: !361, size: 32, offset: 10112)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !186, file: !104, line: 142, baseType: !361, size: 32, offset: 10144)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !186, file: !104, line: 142, baseType: !361, size: 32, offset: 10176)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !186, file: !104, line: 142, baseType: !361, size: 32, offset: 10208)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !186, file: !104, line: 143, baseType: !215, size: 64, offset: 10240)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !186, file: !104, line: 143, baseType: !215, size: 64, offset: 10304)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !186, file: !104, line: 143, baseType: !215, size: 64, offset: 10368)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !186, file: !104, line: 143, baseType: !215, size: 64, offset: 10432)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !186, file: !104, line: 143, baseType: !215, size: 64, offset: 10496)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !186, file: !104, line: 143, baseType: !215, size: 64, offset: 10560)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !186, file: !104, line: 143, baseType: !215, size: 64, offset: 10624)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !186, file: !104, line: 143, baseType: !215, size: 64, offset: 10688)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !186, file: !104, line: 143, baseType: !215, size: 64, offset: 10752)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !186, file: !104, line: 143, baseType: !215, size: 64, offset: 10816)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !186, file: !104, line: 143, baseType: !215, size: 64, offset: 10880)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !186, file: !104, line: 143, baseType: !215, size: 64, offset: 10944)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !186, file: !104, line: 143, baseType: !215, size: 64, offset: 11008)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !186, file: !104, line: 143, baseType: !215, size: 64, offset: 11072)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !186, file: !104, line: 144, baseType: !581, size: 32, offset: 11136)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !59, line: 162, baseType: !58)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !186, file: !104, line: 144, baseType: !581, size: 32, offset: 11168)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !186, file: !104, line: 144, baseType: !581, size: 32, offset: 11200)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !186, file: !104, line: 144, baseType: !581, size: 32, offset: 11232)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !186, file: !104, line: 144, baseType: !581, size: 32, offset: 11264)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !186, file: !104, line: 144, baseType: !581, size: 32, offset: 11296)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !186, file: !104, line: 144, baseType: !581, size: 32, offset: 11328)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !186, file: !104, line: 144, baseType: !581, size: 32, offset: 11360)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !186, file: !104, line: 144, baseType: !581, size: 32, offset: 11392)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !186, file: !104, line: 144, baseType: !581, size: 32, offset: 11424)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !186, file: !104, line: 144, baseType: !581, size: 32, offset: 11456)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !186, file: !104, line: 144, baseType: !581, size: 32, offset: 11488)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !186, file: !104, line: 144, baseType: !581, size: 32, offset: 11520)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !186, file: !104, line: 144, baseType: !581, size: 32, offset: 11552)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !186, file: !104, line: 147, baseType: !177, size: 32, offset: 11584)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !186, file: !104, line: 148, baseType: !402, size: 64, offset: 11648)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !186, file: !104, line: 150, baseType: !598, size: 32, offset: 11712)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !104, line: 70, baseType: !103)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !186, file: !104, line: 151, baseType: !361, size: 32, offset: 11744)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !186, file: !104, line: 153, baseType: !177, size: 32, offset: 11776)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !186, file: !104, line: 154, baseType: !177, size: 32, offset: 11808)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !186, file: !104, line: 156, baseType: !361, size: 32, offset: 11840)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !186, file: !104, line: 161, baseType: !604, size: 192, offset: 11904)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !186, file: !104, line: 157, size: 192, elements: !605)
!605 = !{!606, !607, !608, !609}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !604, file: !104, line: 158, baseType: !415, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !604, file: !104, line: 158, baseType: !415, size: 64, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !604, file: !104, line: 159, baseType: !361, size: 32, offset: 128)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !604, file: !104, line: 160, baseType: !361, size: 32, offset: 160)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !186, file: !104, line: 163, baseType: !611, size: 32, offset: 12096)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !35, line: 451, baseType: !109)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !186, file: !104, line: 165, baseType: !487, size: 32, offset: 12128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !186, file: !104, line: 166, baseType: !611, size: 32, offset: 12160)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !186, file: !104, line: 171, baseType: !361, size: 32, offset: 12192)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !186, file: !104, line: 172, baseType: !361, size: 32, offset: 12224)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !186, file: !104, line: 173, baseType: !361, size: 32, offset: 12256)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !186, file: !104, line: 174, baseType: !399, size: 64, offset: 12288)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !186, file: !104, line: 175, baseType: !399, size: 64, offset: 12352)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !186, file: !104, line: 177, baseType: !177, size: 32, offset: 12416)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !186, file: !104, line: 178, baseType: !361, size: 32, offset: 12448)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !186, file: !104, line: 180, baseType: !215, size: 64, offset: 12480)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !186, file: !104, line: 182, baseType: !623, size: 64, offset: 12544)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{!183, !184, !399, !399, !286}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !186, file: !104, line: 183, baseType: !623, size: 64, offset: 12608)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !186, file: !104, line: 184, baseType: !286, size: 64, offset: 12672)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !186, file: !104, line: 184, baseType: !286, size: 64, offset: 12736)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "cgstype", scope: !159, file: !158, line: 8, baseType: !630, size: 32, offset: 768)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGMRESCGSRefinementType", file: !35, line: 297, baseType: !116)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !159, file: !158, line: 8, baseType: !402, size: 64, offset: 832)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "vecb", scope: !159, file: !158, line: 8, baseType: !402, size: 64, offset: 896)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "q_preallocate", scope: !159, file: !158, line: 8, baseType: !177, size: 32, offset: 960)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "delta_allocate", scope: !159, file: !158, line: 8, baseType: !177, size: 32, offset: 992)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "vv_allocated", scope: !159, file: !158, line: 8, baseType: !177, size: 32, offset: 1024)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "vecs_allocated", scope: !159, file: !158, line: 8, baseType: !177, size: 32, offset: 1056)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "user_work", scope: !159, file: !158, line: 8, baseType: !638, size: 64, offset: 1088)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "mwork_alloc", scope: !159, file: !158, line: 8, baseType: !295, size: 64, offset: 1152)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "nwork_alloc", scope: !159, file: !158, line: 8, baseType: !177, size: 32, offset: 1216)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !159, file: !158, line: 8, baseType: !177, size: 32, offset: 1248)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "fullcycle", scope: !159, file: !158, line: 8, baseType: !177, size: 32, offset: 1280)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "nrs", scope: !159, file: !158, line: 8, baseType: !162, size: 64, offset: 1344)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "sol_temp", scope: !159, file: !158, line: 8, baseType: !399, size: 64, offset: 1408)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !159, file: !158, line: 8, baseType: !164, size: 64, offset: 1472)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "breakdowntol", scope: !159, file: !158, line: 8, baseType: !164, size: 64, offset: 1536)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "prevecs", scope: !159, file: !158, line: 11, baseType: !402, size: 64, offset: 1600)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "prevecs_user_work", scope: !159, file: !158, line: 14, baseType: !638, size: 64, offset: 1664)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "zvecs", scope: !159, file: !158, line: 18, baseType: !402, size: 64, offset: 1728)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "zvecs_user_work", scope: !159, file: !158, line: 19, baseType: !638, size: 64, offset: 1792)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !159, file: !158, line: 22, baseType: !163, size: 64, offset: 1856)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "redux", scope: !159, file: !158, line: 25, baseType: !402, size: 64, offset: 1920)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !654, line: 1451, baseType: !239)
!654 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !208, line: 331, baseType: !656)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !208, line: 331, flags: DIFlagFwdDecl)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !208, line: 338, baseType: !659)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !208, line: 338, flags: DIFlagFwdDecl)
!661 = !{!0, !662}
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "cited", scope: !2, file: !664, line: 7, type: !361, isLocal: true, isDefinition: true)
!664 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/gmres/pipefgmres/pipefgmres.c", directory: "/home/users/ndemeye/xSDK")
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 3072, elements: !666)
!666 = !{!667}
!667 = !DISubrange(count: 384)
!668 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!669 = !{i32 7, !"Dwarf Version", i32 4}
!670 = !{i32 2, !"Debug Info Version", i32 3}
!671 = !{i32 1, !"wchar_size", i32 4}
!672 = !{i32 7, !"PIC Level", i32 2}
!673 = !{i32 7, !"uwtable", i32 1}
!674 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!675 = distinct !DISubprogram(name: "KSPBuildSolution_PIPEFGMRES", scope: !664, file: !664, line: 566, type: !397, scopeLine: 567, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !676)
!676 = !{!677, !678, !679, !680, !681, !682, !688, !690, !694, !696}
!677 = !DILocalVariable(name: "ksp", arg: 1, scope: !675, file: !664, line: 566, type: !184)
!678 = !DILocalVariable(name: "ptr", arg: 2, scope: !675, file: !664, line: 566, type: !399)
!679 = !DILocalVariable(name: "result", arg: 3, scope: !675, file: !664, line: 566, type: !402)
!680 = !DILocalVariable(name: "pipefgmres", scope: !675, file: !664, line: 568, type: !156)
!681 = !DILocalVariable(name: "ierr", scope: !675, file: !664, line: 569, type: !183)
!682 = !DILocalVariable(name: "ierr__", scope: !683, file: !664, line: 574, type: !183)
!683 = distinct !DILexicalBlock(scope: !684, file: !664, line: 574, column: 63)
!684 = distinct !DILexicalBlock(scope: !685, file: !664, line: 573, column: 32)
!685 = distinct !DILexicalBlock(scope: !686, file: !664, line: 573, column: 9)
!686 = distinct !DILexicalBlock(scope: !687, file: !664, line: 572, column: 13)
!687 = distinct !DILexicalBlock(scope: !675, file: !664, line: 572, column: 7)
!688 = !DILocalVariable(name: "ierr__", scope: !689, file: !664, line: 575, type: !183)
!689 = distinct !DILexicalBlock(scope: !684, file: !664, line: 575, column: 87)
!690 = !DILocalVariable(name: "ierr__", scope: !691, file: !664, line: 581, type: !183)
!691 = distinct !DILexicalBlock(scope: !692, file: !664, line: 581, column: 61)
!692 = distinct !DILexicalBlock(scope: !693, file: !664, line: 579, column: 25)
!693 = distinct !DILexicalBlock(scope: !675, file: !664, line: 579, column: 7)
!694 = !DILocalVariable(name: "ierr__", scope: !695, file: !664, line: 582, type: !183)
!695 = distinct !DILexicalBlock(scope: !692, file: !664, line: 582, column: 89)
!696 = !DILocalVariable(name: "ierr__", scope: !697, file: !664, line: 585, type: !183)
