; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/shell/shell.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/shell/shell.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_MatRootName = type { i8*, i8*, i8*, %struct._p_MatRootName* }

!318 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!319 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!320 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!321 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !322)
!322 = !{!323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340}
!323 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!324 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!325 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!326 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!327 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!328 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!329 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!330 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!331 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!332 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!333 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!334 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!335 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!336 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!337 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!338 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!339 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!340 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!341 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !38, line: 30, baseType: !7, size: 32, elements: !342)
!342 = !{!343, !344, !345, !346, !347}
!343 = !DIEnumerator(name: "SCATTER_FORWARD", value: 0, isUnsigned: true)
!344 = !DIEnumerator(name: "SCATTER_REVERSE", value: 1, isUnsigned: true)
!345 = !DIEnumerator(name: "SCATTER_FORWARD_LOCAL", value: 2, isUnsigned: true)
!346 = !DIEnumerator(name: "SCATTER_REVERSE_LOCAL", value: 3, isUnsigned: true)
!347 = !DIEnumerator(name: "SCATTER_LOCAL", value: 2, isUnsigned: true)
!348 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 327, baseType: !7, size: 32, elements: !349)
!349 = !{!350, !351, !352}
!350 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!351 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!352 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!353 = !{!354, !1628, !413, !392, !473, !389, !1639, !1640, !453, !1479, !1642, !463, !93, !986, !1155, !1044, !431, !966, !364, !424, !548, !439, !552, !7, !1645, !1655}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_Shell", file: !356, line: 63, baseType: !357)
!356 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/impls/shell/shell.c", directory: "/home/users/ndemeye/xSDK")
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !356, line: 31, size: 1792, elements: !358)
!358 = !{!359, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1618, !1619, !1638}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !357, file: !356, line: 32, baseType: !360, size: 320)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 320, elements: !432)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatShellOps", file: !356, line: 11, size: 320, elements: !362)
!362 = !{!363, !1589, !1590, !1591, !1592}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !361, file: !356, line: 12, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!367, !368, !605, !605}
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !93)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !65, line: 16, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !371, line: 436, size: 23424, elements: !372)
!371 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!372 = !{!373, !582, !1364, !1365, !1366, !1367, !1369, !1370, !1371, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1485, !1486, !1502, !1503, !1504, !1505, !1506, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1541, !1561, !1562, !1564, !1565, !1566, !1567, !1568, !1569, !1587, !1588}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !370, file: !371, line: 437, baseType: !374, size: 4480)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !375, line: 122, baseType: !376)
!375 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !375, line: 73, size: 4480, elements: !377)
!377 = !{!378, !380, !434, !435, !437, !440, !441, !442, !443, !451, !452, !454, !458, !462, !464, !465, !466, !467, !468, !469, !470, !471, !472, !474, !476, !477, !478, !480, !481, !483, !485, !486, !487, !488, !489, !492, !494, !495, !496, !497, !498, !501, !503, !504, !505, !515, !517, !518, !522, !523, !572, !577, !579, !580, !581}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !376, file: !375, line: 74, baseType: !379, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !93)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !376, file: !375, line: 75, baseType: !381, size: 448, offset: 64)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !382, size: 448, elements: !432)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !375, line: 53, baseType: !383)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !375, line: 45, size: 448, elements: !384)
!384 = !{!385, !396, !404, !409, !416, !420, !427}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !383, file: !375, line: 46, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!367, !389, !391}
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !393, line: 330, baseType: !394)
!393 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !393, line: 330, flags: DIFlagFwdDecl)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !383, file: !375, line: 47, baseType: !397, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!367, !389, !400}
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !401, line: 16, baseType: !402)
!401 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !401, line: 16, flags: DIFlagFwdDecl)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !383, file: !375, line: 48, baseType: !405, size: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!367, !408}
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !383, file: !375, line: 49, baseType: !410, size: 64, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!367, !389, !413, !389}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !415)
!415 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !383, file: !375, line: 50, baseType: !417, size: 64, offset: 256)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!367, !389, !413, !408}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !383, file: !375, line: 51, baseType: !421, size: 64, offset: 320)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!367, !389, !413, !424}
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{null}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !383, file: !375, line: 52, baseType: !428, size: 64, offset: 384)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!367, !389, !413, !431}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!432 = !{!433}
!433 = !DISubrange(count: 1)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !376, file: !375, line: 76, baseType: !392, size: 64, offset: 512)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !376, file: !375, line: 77, baseType: !436, size: 32, offset: 576)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !93)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !376, file: !375, line: 78, baseType: !438, size: 64, offset: 640)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !439)
!439 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !376, file: !375, line: 78, baseType: !438, size: 64, offset: 704)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !376, file: !375, line: 78, baseType: !438, size: 64, offset: 768)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !376, file: !375, line: 78, baseType: !438, size: 64, offset: 832)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !376, file: !375, line: 79, baseType: !444, size: 64, offset: 896)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !445)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !447, line: 27, baseType: !448)
!447 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !449, line: 43, baseType: !450)
!449 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!450 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !376, file: !375, line: 80, baseType: !436, size: 32, offset: 960)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !376, file: !375, line: 81, baseType: !453, size: 32, offset: 992)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !93)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !376, file: !375, line: 82, baseType: !455, size: 64, offset: 1024)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !456)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !376, file: !375, line: 83, baseType: !459, size: 64, offset: 1088)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !376, file: !375, line: 84, baseType: !463, size: 64, offset: 1152)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !376, file: !375, line: 85, baseType: !463, size: 64, offset: 1216)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !376, file: !375, line: 86, baseType: !463, size: 64, offset: 1280)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !376, file: !375, line: 87, baseType: !463, size: 64, offset: 1344)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !376, file: !375, line: 88, baseType: !389, size: 64, offset: 1408)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !376, file: !375, line: 89, baseType: !444, size: 64, offset: 1472)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !376, file: !375, line: 90, baseType: !463, size: 64, offset: 1536)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !376, file: !375, line: 91, baseType: !463, size: 64, offset: 1600)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !376, file: !375, line: 92, baseType: !436, size: 32, offset: 1664)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !376, file: !375, line: 93, baseType: !473, size: 64, offset: 1728)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !376, file: !375, line: 94, baseType: !475, size: 64, offset: 1792)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !445)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !376, file: !375, line: 95, baseType: !436, size: 32, offset: 1856)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !376, file: !375, line: 95, baseType: !436, size: 32, offset: 1888)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !376, file: !375, line: 96, baseType: !479, size: 64, offset: 1920)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !376, file: !375, line: 96, baseType: !479, size: 64, offset: 1984)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !376, file: !375, line: 97, baseType: !482, size: 64, offset: 2048)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !376, file: !375, line: 97, baseType: !484, size: 64, offset: 2112)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !376, file: !375, line: 98, baseType: !436, size: 32, offset: 2176)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !376, file: !375, line: 98, baseType: !436, size: 32, offset: 2208)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !376, file: !375, line: 99, baseType: !479, size: 64, offset: 2240)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !376, file: !375, line: 99, baseType: !479, size: 64, offset: 2304)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !376, file: !375, line: 100, baseType: !490, size: 64, offset: 2368)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !439)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !376, file: !375, line: 100, baseType: !493, size: 64, offset: 2432)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !376, file: !375, line: 101, baseType: !436, size: 32, offset: 2496)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !376, file: !375, line: 101, baseType: !436, size: 32, offset: 2528)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !376, file: !375, line: 102, baseType: !479, size: 64, offset: 2560)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !376, file: !375, line: 102, baseType: !479, size: 64, offset: 2624)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !376, file: !375, line: 103, baseType: !499, size: 64, offset: 2688)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !491)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !376, file: !375, line: 103, baseType: !502, size: 64, offset: 2752)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !376, file: !375, line: 104, baseType: !431, size: 64, offset: 2816)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !376, file: !375, line: 105, baseType: !436, size: 32, offset: 2880)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !376, file: !375, line: 106, baseType: !506, size: 128, offset: 2944)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 128, elements: !513)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !375, line: 64, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !375, line: 61, size: 128, elements: !510)
!510 = !{!511, !512}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !509, file: !375, line: 62, baseType: !424, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !509, file: !375, line: 63, baseType: !473, size: 64, offset: 64)
!513 = !{!514}
!514 = !DISubrange(count: 2)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !376, file: !375, line: 107, baseType: !516, size: 64, offset: 3072)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 64, elements: !513)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !376, file: !375, line: 108, baseType: !473, size: 64, offset: 3136)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !376, file: !375, line: 109, baseType: !519, size: 64, offset: 3200)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{!367, !473}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !376, file: !375, line: 111, baseType: !436, size: 32, offset: 3264)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !376, file: !375, line: 112, baseType: !524, size: 320, offset: 3328)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !525, size: 320, elements: !570)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!367, !528, !389, !473}
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !531)
!531 = !{!532, !533, !558, !559, !560, !561, !562, !563, !564, !565, !566}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !530, file: !12, line: 100, baseType: !436, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !530, file: !12, line: 101, baseType: !534, size: 64, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !535)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !537)
!537 = !{!538, !539, !540, !541, !542, !545, !546, !547, !551, !553, !555, !556, !557}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !536, file: !12, line: 84, baseType: !463, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !536, file: !12, line: 85, baseType: !463, size: 64, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !536, file: !12, line: 86, baseType: !473, size: 64, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !536, file: !12, line: 87, baseType: !455, size: 64, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !536, file: !12, line: 88, baseType: !543, size: 64, offset: 256)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !413)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !536, file: !12, line: 89, baseType: !415, size: 8, offset: 320)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !536, file: !12, line: 90, baseType: !463, size: 64, offset: 384)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !536, file: !12, line: 91, baseType: !548, size: 64, offset: 448)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !549, line: 46, baseType: !550)
!549 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!550 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !536, file: !12, line: 92, baseType: !552, size: 32, offset: 512)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !536, file: !12, line: 93, baseType: !554, size: 32, offset: 544)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !536, file: !12, line: 94, baseType: !534, size: 64, offset: 576)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !536, file: !12, line: 95, baseType: !463, size: 64, offset: 640)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !536, file: !12, line: 96, baseType: !473, size: 64, offset: 704)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !530, file: !12, line: 102, baseType: !463, size: 64, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !530, file: !12, line: 102, baseType: !463, size: 64, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !530, file: !12, line: 103, baseType: !463, size: 64, offset: 256)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !530, file: !12, line: 104, baseType: !392, size: 64, offset: 320)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !530, file: !12, line: 105, baseType: !552, size: 32, offset: 384)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !530, file: !12, line: 105, baseType: !552, size: 32, offset: 416)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !530, file: !12, line: 105, baseType: !552, size: 32, offset: 448)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !530, file: !12, line: 106, baseType: !389, size: 64, offset: 512)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !530, file: !12, line: 107, baseType: !567, size: 64, offset: 576)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !568)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!570 = !{!571}
!571 = !DISubrange(count: 5)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !376, file: !375, line: 113, baseType: !573, size: 320, offset: 3648)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 320, elements: !570)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!367, !389, !473}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !376, file: !375, line: 114, baseType: !578, size: 320, offset: 3968)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 320, elements: !570)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !376, file: !375, line: 115, baseType: !552, size: 32, offset: 4288)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !376, file: !375, line: 120, baseType: !567, size: 64, offset: 4352)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !376, file: !375, line: 121, baseType: !552, size: 32, offset: 4416)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !370, file: !371, line: 437, baseType: !583, size: 9472, offset: 4480)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !584, size: 9472, elements: !432)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !371, line: 32, size: 9472, elements: !585)
!585 = !{!586, !595, !599, !600, !601, !900, !901, !902, !903, !904, !905, !906, !926, !930, !935, !941, !960, !965, !969, !970, !974, !979, !980, !985, !989, !993, !997, !1001, !1005, !1006, !1007, !1008, !1009, !1013, !1014, !1019, !1020, !1021, !1022, !1023, !1028, !1035, !1039, !1043, !1047, !1051, !1055, !1056, !1060, !1061, !1065, !1070, !1071, !1072, !1073, !1135, !1143, !1144, !1148, !1149, !1153, !1154, !1158, !1163, !1164, !1168, !1172, !1176, !1177, !1178, !1179, !1180, !1181, !1186, !1187, !1191, !1195, !1199, !1200, !1201, !1205, !1215, !1216, !1220, !1221, !1225, !1226, !1230, !1231, !1235, !1236, !1240, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1254, !1255, !1256, !1257, !1258, !1259, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1274, !1278, !1279, !1280, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1294, !1295, !1296, !1300, !1304, !1305, !1309, !1310, !1311, !1312, !1338, !1342, !1343, !1344, !1345, !1346, !1350, !1351, !1352, !1353, !1354, !1358, !1362, !1363}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !584, file: !371, line: 34, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!367, !368, !436, !590, !436, !590, !592, !594}
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !436)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !500)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !26)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !584, file: !371, line: 35, baseType: !596, size: 64, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{!367, !368, !436, !482, !484, !502}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !584, file: !371, line: 36, baseType: !596, size: 64, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !584, file: !371, line: 37, baseType: !364, size: 64, offset: 192)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !584, file: !371, line: 38, baseType: !602, size: 64, offset: 256)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!367, !368, !605, !605, !605}
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !38, line: 21, baseType: !606)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !608, line: 142, size: 12800, elements: !609)
!608 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!609 = !{!610, !611, !826, !846, !847, !848, !894, !895, !896, !897, !899}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !607, file: !608, line: 143, baseType: !374, size: 4480)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !607, file: !608, line: 143, baseType: !612, size: 5248, offset: 4480)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 5248, elements: !432)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !608, line: 23, size: 5248, elements: !614)
!614 = !{!615, !620, !625, !629, !633, !639, !644, !645, !646, !650, !654, !655, !656, !660, !664, !668, !669, !673, !677, !681, !682, !686, !690, !691, !695, !699, !700, !701, !705, !706, !713, !718, !719, !720, !724, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !745, !746, !747, !751, !755, !756, !757, !758, !762, !763, !764, !765, !766, !767, !768, !772, !773, !777, !784, !785, !790, !791, !795, !796, !797, !798, !799, !800, !801, !802, !806, !807, !808, !814, !818, !819, !820}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !613, file: !608, line: 24, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{!367, !605, !619}
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !613, file: !608, line: 25, baseType: !621, size: 64, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!367, !605, !436, !624}
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !613, file: !608, line: 26, baseType: !626, size: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!367, !436, !619}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !613, file: !608, line: 27, baseType: !630, size: 64, offset: 192)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!367, !605, !605, !499}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !613, file: !608, line: 28, baseType: !634, size: 64, offset: 256)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!367, !605, !436, !637, !499}
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !605)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !613, file: !608, line: 29, baseType: !640, size: 64, offset: 320)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!367, !605, !643, !490}
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !38, line: 155, baseType: !37)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !613, file: !608, line: 30, baseType: !630, size: 64, offset: 384)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !613, file: !608, line: 31, baseType: !634, size: 64, offset: 448)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !613, file: !608, line: 32, baseType: !647, size: 64, offset: 512)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!367, !605, !500}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !613, file: !608, line: 33, baseType: !651, size: 64, offset: 576)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!367, !605, !605}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !613, file: !608, line: 34, baseType: !647, size: 64, offset: 640)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !613, file: !608, line: 35, baseType: !651, size: 64, offset: 704)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !613, file: !608, line: 36, baseType: !657, size: 64, offset: 768)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!367, !605, !500, !605}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !613, file: !608, line: 37, baseType: !661, size: 64, offset: 832)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!367, !605, !500, !500, !605}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !613, file: !608, line: 38, baseType: !665, size: 64, offset: 896)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!367, !605, !436, !592, !619}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !613, file: !608, line: 39, baseType: !657, size: 64, offset: 960)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !613, file: !608, line: 40, baseType: !670, size: 64, offset: 1024)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!367, !605, !500, !605, !605}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !613, file: !608, line: 41, baseType: !674, size: 64, offset: 1088)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!367, !605, !500, !500, !500, !605, !605}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !613, file: !608, line: 42, baseType: !678, size: 64, offset: 1152)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{!367, !605, !605, !605}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !613, file: !608, line: 43, baseType: !678, size: 64, offset: 1216)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !613, file: !608, line: 44, baseType: !683, size: 64, offset: 1280)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{!367, !605, !436, !590, !592, !594}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !613, file: !608, line: 45, baseType: !687, size: 64, offset: 1344)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{!367, !605}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !613, file: !608, line: 46, baseType: !687, size: 64, offset: 1408)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !613, file: !608, line: 47, baseType: !692, size: 64, offset: 1472)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!367, !605, !502}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !613, file: !608, line: 48, baseType: !696, size: 64, offset: 1536)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!367, !605, !482}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !613, file: !608, line: 49, baseType: !696, size: 64, offset: 1600)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !613, file: !608, line: 50, baseType: !692, size: 64, offset: 1664)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !613, file: !608, line: 51, baseType: !702, size: 64, offset: 1728)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!367, !605, !482, !490}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !613, file: !608, line: 52, baseType: !702, size: 64, offset: 1792)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !613, file: !608, line: 53, baseType: !707, size: 64, offset: 1856)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{!367, !605, !710}
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !711)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !613, file: !608, line: 54, baseType: !714, size: 64, offset: 1920)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!367, !605, !717, !552}
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !38, line: 475, baseType: !45)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !613, file: !608, line: 55, baseType: !683, size: 64, offset: 1984)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !613, file: !608, line: 56, baseType: !687, size: 64, offset: 2048)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !613, file: !608, line: 57, baseType: !721, size: 64, offset: 2112)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{!367, !605, !400}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !613, file: !608, line: 58, baseType: !725, size: 64, offset: 2176)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{!367, !605, !592}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !613, file: !608, line: 59, baseType: !725, size: 64, offset: 2240)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !613, file: !608, line: 60, baseType: !630, size: 64, offset: 2304)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !613, file: !608, line: 61, baseType: !630, size: 64, offset: 2368)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !613, file: !608, line: 62, baseType: !640, size: 64, offset: 2432)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !613, file: !608, line: 63, baseType: !634, size: 64, offset: 2496)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !613, file: !608, line: 64, baseType: !634, size: 64, offset: 2560)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !613, file: !608, line: 65, baseType: !721, size: 64, offset: 2624)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !613, file: !608, line: 66, baseType: !687, size: 64, offset: 2688)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !613, file: !608, line: 67, baseType: !687, size: 64, offset: 2752)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !613, file: !608, line: 68, baseType: !738, size: 64, offset: 2816)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!367, !605, !741}
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !742, line: 30, baseType: !743)
!742 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !742, line: 30, flags: DIFlagFwdDecl)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !613, file: !608, line: 69, baseType: !683, size: 64, offset: 2880)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !613, file: !608, line: 70, baseType: !687, size: 64, offset: 2944)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !613, file: !608, line: 71, baseType: !748, size: 64, offset: 3008)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{!367, !528, !605}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !613, file: !608, line: 72, baseType: !752, size: 64, offset: 3072)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{!367, !605, !605, !490}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !613, file: !608, line: 73, baseType: !678, size: 64, offset: 3136)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !613, file: !608, line: 74, baseType: !678, size: 64, offset: 3200)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !613, file: !608, line: 75, baseType: !678, size: 64, offset: 3264)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !613, file: !608, line: 76, baseType: !759, size: 64, offset: 3328)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{!367, !605, !436, !590, !499}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !613, file: !608, line: 77, baseType: !687, size: 64, offset: 3392)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !613, file: !608, line: 78, baseType: !687, size: 64, offset: 3456)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !613, file: !608, line: 79, baseType: !687, size: 64, offset: 3520)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !613, file: !608, line: 80, baseType: !687, size: 64, offset: 3584)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !613, file: !608, line: 81, baseType: !647, size: 64, offset: 3648)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !613, file: !608, line: 82, baseType: !687, size: 64, offset: 3712)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !613, file: !608, line: 83, baseType: !769, size: 64, offset: 3776)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{!367, !605, !436, !605, !594}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !613, file: !608, line: 84, baseType: !769, size: 64, offset: 3840)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !613, file: !608, line: 85, baseType: !774, size: 64, offset: 3904)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!367, !605, !605, !499, !499}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !613, file: !608, line: 86, baseType: !778, size: 64, offset: 3968)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!367, !605, !781, !619}
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !742, line: 11, baseType: !782)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !742, line: 11, flags: DIFlagFwdDecl)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !613, file: !608, line: 87, baseType: !778, size: 64, offset: 4032)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !613, file: !608, line: 88, baseType: !786, size: 64, offset: 4096)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!367, !605, !789}
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !613, file: !608, line: 89, baseType: !786, size: 64, offset: 4160)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !613, file: !608, line: 90, baseType: !792, size: 64, offset: 4224)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{!367, !605, !436, !590, !590, !605, !594}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !613, file: !608, line: 91, baseType: !792, size: 64, offset: 4288)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !613, file: !608, line: 92, baseType: !721, size: 64, offset: 4352)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !613, file: !608, line: 93, baseType: !721, size: 64, offset: 4416)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !613, file: !608, line: 94, baseType: !651, size: 64, offset: 4480)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !613, file: !608, line: 95, baseType: !651, size: 64, offset: 4544)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !613, file: !608, line: 96, baseType: !651, size: 64, offset: 4608)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !613, file: !608, line: 97, baseType: !651, size: 64, offset: 4672)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !613, file: !608, line: 98, baseType: !803, size: 64, offset: 4736)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DISubroutineType(types: !805)
!805 = !{!367, !605, !552}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !613, file: !608, line: 99, baseType: !692, size: 64, offset: 4800)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !613, file: !608, line: 100, baseType: !692, size: 64, offset: 4864)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !613, file: !608, line: 101, baseType: !809, size: 64, offset: 4928)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!367, !605, !502, !812}
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !6, line: 701, baseType: !50)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !613, file: !608, line: 102, baseType: !815, size: 64, offset: 4992)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DISubroutineType(types: !817)
!817 = !{!367, !605, !789, !812}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !613, file: !608, line: 103, baseType: !692, size: 64, offset: 5056)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !613, file: !608, line: 104, baseType: !786, size: 64, offset: 5120)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !613, file: !608, line: 105, baseType: !821, size: 64, offset: 5184)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{!367, !436, !637, !619, !824}
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !607, file: !608, line: 144, baseType: !827, size: 64, offset: 9728)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !742, line: 60, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !135, line: 240, size: 640, elements: !830)
!830 = !{!831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !829, file: !135, line: 241, baseType: !392, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !829, file: !135, line: 242, baseType: !453, size: 32, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !829, file: !135, line: 243, baseType: !436, size: 32, offset: 96)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !829, file: !135, line: 243, baseType: !436, size: 32, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !829, file: !135, line: 244, baseType: !436, size: 32, offset: 160)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !829, file: !135, line: 244, baseType: !436, size: 32, offset: 192)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !829, file: !135, line: 245, baseType: !482, size: 64, offset: 256)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !829, file: !135, line: 246, baseType: !552, size: 32, offset: 320)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !829, file: !135, line: 247, baseType: !436, size: 32, offset: 352)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !829, file: !135, line: 251, baseType: !436, size: 32, offset: 384)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !829, file: !135, line: 252, baseType: !741, size: 64, offset: 448)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !829, file: !135, line: 253, baseType: !552, size: 32, offset: 512)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !829, file: !135, line: 254, baseType: !436, size: 32, offset: 544)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !829, file: !135, line: 254, baseType: !436, size: 32, offset: 576)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !829, file: !135, line: 255, baseType: !436, size: 32, offset: 608)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !607, file: !608, line: 145, baseType: !473, size: 64, offset: 9792)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !607, file: !608, line: 146, baseType: !552, size: 32, offset: 9856)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !607, file: !608, line: 147, baseType: !849, size: 1344, offset: 9920)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !608, line: 140, baseType: !850)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !608, line: 114, size: 1344, elements: !851)
!851 = !{!852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !870, !871, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !850, file: !608, line: 115, baseType: !436, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !850, file: !608, line: 116, baseType: !436, size: 32, offset: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !850, file: !608, line: 117, baseType: !436, size: 32, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !850, file: !608, line: 118, baseType: !436, size: 32, offset: 96)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !850, file: !608, line: 119, baseType: !436, size: 32, offset: 128)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !850, file: !608, line: 120, baseType: !436, size: 32, offset: 160)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !850, file: !608, line: 121, baseType: !482, size: 64, offset: 192)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !850, file: !608, line: 122, baseType: !499, size: 64, offset: 256)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !850, file: !608, line: 124, baseType: !392, size: 64, offset: 320)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !850, file: !608, line: 125, baseType: !453, size: 32, offset: 384)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !850, file: !608, line: 125, baseType: !453, size: 32, offset: 416)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !850, file: !608, line: 126, baseType: !453, size: 32, offset: 448)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !850, file: !608, line: 126, baseType: !453, size: 32, offset: 480)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !850, file: !608, line: 127, baseType: !866, size: 64, offset: 512)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !393, line: 339, baseType: !868)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !393, line: 339, flags: DIFlagFwdDecl)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !850, file: !608, line: 128, baseType: !866, size: 64, offset: 576)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !850, file: !608, line: 129, baseType: !872, size: 64, offset: 640)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !393, line: 341, baseType: !874)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !393, line: 351, size: 192, elements: !875)
!875 = !{!876, !877, !878, !879, !880}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !874, file: !393, line: 354, baseType: !93, size: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !874, file: !393, line: 355, baseType: !93, size: 32, offset: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !874, file: !393, line: 356, baseType: !93, size: 32, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !874, file: !393, line: 361, baseType: !93, size: 32, offset: 96)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !874, file: !393, line: 362, baseType: !548, size: 64, offset: 128)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !850, file: !608, line: 130, baseType: !436, size: 32, offset: 704)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !850, file: !608, line: 130, baseType: !436, size: 32, offset: 736)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !850, file: !608, line: 131, baseType: !499, size: 64, offset: 768)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !850, file: !608, line: 131, baseType: !499, size: 64, offset: 832)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !850, file: !608, line: 132, baseType: !482, size: 64, offset: 896)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !850, file: !608, line: 132, baseType: !482, size: 64, offset: 960)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !850, file: !608, line: 133, baseType: !436, size: 32, offset: 1024)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !850, file: !608, line: 134, baseType: !482, size: 64, offset: 1088)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !850, file: !608, line: 135, baseType: !436, size: 32, offset: 1152)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !850, file: !608, line: 136, baseType: !552, size: 32, offset: 1184)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !850, file: !608, line: 137, baseType: !552, size: 32, offset: 1216)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !850, file: !608, line: 138, baseType: !594, size: 32, offset: 1248)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !850, file: !608, line: 139, baseType: !482, size: 64, offset: 1280)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !607, file: !608, line: 147, baseType: !849, size: 1344, offset: 11264)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !607, file: !608, line: 148, baseType: !552, size: 32, offset: 12608)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !607, file: !608, line: 149, baseType: !436, size: 32, offset: 12640)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !607, file: !608, line: 150, baseType: !898, size: 32, offset: 12672)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !38, line: 472, baseType: !57)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !607, file: !608, line: 157, baseType: !463, size: 64, offset: 12736)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !584, file: !371, line: 40, baseType: !364, size: 64, offset: 320)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !584, file: !371, line: 41, baseType: !602, size: 64, offset: 384)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !584, file: !371, line: 42, baseType: !364, size: 64, offset: 448)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !584, file: !371, line: 43, baseType: !602, size: 64, offset: 512)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !584, file: !371, line: 44, baseType: !364, size: 64, offset: 576)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !584, file: !371, line: 46, baseType: !602, size: 64, offset: 640)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !584, file: !371, line: 47, baseType: !907, size: 64, offset: 704)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!367, !368, !781, !781, !910}
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !912)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !65, line: 1239, baseType: !913)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !65, line: 1226, size: 704, elements: !914)
!914 = !{!915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !913, file: !65, line: 1227, baseType: !491, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !913, file: !65, line: 1228, baseType: !491, size: 64, offset: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !913, file: !65, line: 1229, baseType: !491, size: 64, offset: 128)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !913, file: !65, line: 1230, baseType: !491, size: 64, offset: 192)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !913, file: !65, line: 1231, baseType: !491, size: 64, offset: 256)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !913, file: !65, line: 1232, baseType: !491, size: 64, offset: 320)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !913, file: !65, line: 1233, baseType: !491, size: 64, offset: 384)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !913, file: !65, line: 1234, baseType: !491, size: 64, offset: 448)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !913, file: !65, line: 1236, baseType: !491, size: 64, offset: 512)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !913, file: !65, line: 1237, baseType: !491, size: 64, offset: 576)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !913, file: !65, line: 1238, baseType: !491, size: 64, offset: 640)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !584, file: !371, line: 48, baseType: !927, size: 64, offset: 768)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{!367, !368, !781, !910}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !584, file: !371, line: 49, baseType: !931, size: 64, offset: 832)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{!367, !368, !605, !491, !934, !491, !436, !436, !605}
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !65, line: 1291, baseType: !64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !584, file: !371, line: 50, baseType: !936, size: 64, offset: 896)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!367, !368, !939, !940}
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !65, line: 238, baseType: !77)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !584, file: !371, line: 52, baseType: !942, size: 64, offset: 960)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{!367, !368, !945, !946}
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !65, line: 612, baseType: !83)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !65, line: 600, baseType: !948)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !65, line: 592, size: 640, elements: !949)
!949 = !{!950, !951, !952, !953, !954, !955, !956, !957, !958, !959}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !948, file: !65, line: 593, baseType: !438, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !948, file: !65, line: 594, baseType: !438, size: 64, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !948, file: !65, line: 594, baseType: !438, size: 64, offset: 128)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !948, file: !65, line: 594, baseType: !438, size: 64, offset: 192)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !948, file: !65, line: 595, baseType: !438, size: 64, offset: 256)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !948, file: !65, line: 596, baseType: !438, size: 64, offset: 320)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !948, file: !65, line: 597, baseType: !438, size: 64, offset: 384)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !948, file: !65, line: 598, baseType: !438, size: 64, offset: 448)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !948, file: !65, line: 598, baseType: !438, size: 64, offset: 512)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !948, file: !65, line: 599, baseType: !438, size: 64, offset: 576)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !584, file: !371, line: 53, baseType: !961, size: 64, offset: 1024)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!367, !368, !368, !964}
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !584, file: !371, line: 54, baseType: !966, size: 64, offset: 1088)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!367, !368, !605}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !584, file: !371, line: 55, baseType: !364, size: 64, offset: 1152)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !584, file: !371, line: 56, baseType: !971, size: 64, offset: 1216)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!367, !368, !643, !490}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !584, file: !371, line: 58, baseType: !975, size: 64, offset: 1280)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!367, !368, !978}
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !65, line: 424, baseType: !88)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !584, file: !371, line: 59, baseType: !975, size: 64, offset: 1344)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !584, file: !371, line: 60, baseType: !981, size: 64, offset: 1408)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!367, !368, !984, !552}
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !65, line: 469, baseType: !92)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !584, file: !371, line: 61, baseType: !986, size: 64, offset: 1472)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!367, !368}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !584, file: !371, line: 63, baseType: !990, size: 64, offset: 1536)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!367, !368, !436, !590, !500, !605, !605}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !584, file: !371, line: 64, baseType: !994, size: 64, offset: 1600)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!367, !368, !368, !781, !781, !910}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !584, file: !371, line: 65, baseType: !998, size: 64, offset: 1664)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!367, !368, !368, !910}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !584, file: !371, line: 66, baseType: !1002, size: 64, offset: 1728)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!367, !368, !368, !781, !910}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !584, file: !371, line: 67, baseType: !998, size: 64, offset: 1792)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !584, file: !371, line: 69, baseType: !986, size: 64, offset: 1856)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !584, file: !371, line: 70, baseType: !994, size: 64, offset: 1920)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !584, file: !371, line: 71, baseType: !1002, size: 64, offset: 1984)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !584, file: !371, line: 72, baseType: !1010, size: 64, offset: 2048)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!367, !368, !940}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !584, file: !371, line: 73, baseType: !986, size: 64, offset: 2112)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !584, file: !371, line: 75, baseType: !1015, size: 64, offset: 2176)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!367, !368, !1018, !940}
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !65, line: 563, baseType: !123)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !584, file: !371, line: 76, baseType: !364, size: 64, offset: 2240)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !584, file: !371, line: 77, baseType: !364, size: 64, offset: 2304)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !584, file: !371, line: 78, baseType: !907, size: 64, offset: 2368)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !584, file: !371, line: 79, baseType: !927, size: 64, offset: 2432)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !584, file: !371, line: 81, baseType: !1024, size: 64, offset: 2496)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!367, !368, !500, !368, !1027}
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !65, line: 285, baseType: !128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !584, file: !371, line: 82, baseType: !1029, size: 64, offset: 2560)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!367, !368, !436, !1032, !1032, !939, !1034}
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !781)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !584, file: !371, line: 83, baseType: !1036, size: 64, offset: 2624)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!367, !368, !436, !825, !436}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !584, file: !371, line: 84, baseType: !1040, size: 64, offset: 2688)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!367, !368, !436, !590, !436, !590, !499}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !584, file: !371, line: 85, baseType: !1044, size: 64, offset: 2752)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!367, !368, !368, !1027}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !584, file: !371, line: 87, baseType: !1048, size: 64, offset: 2816)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!367, !368, !605, !482}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !584, file: !371, line: 88, baseType: !1052, size: 64, offset: 2880)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!367, !368, !500}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !584, file: !371, line: 89, baseType: !1052, size: 64, offset: 2944)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !584, file: !371, line: 90, baseType: !1057, size: 64, offset: 3008)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!367, !368, !605, !594}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !584, file: !371, line: 91, baseType: !990, size: 64, offset: 3072)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !584, file: !371, line: 93, baseType: !1062, size: 64, offset: 3136)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!367, !368, !710}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !584, file: !371, line: 94, baseType: !1066, size: 64, offset: 3200)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!367, !368, !436, !552, !552, !482, !1069, !1069, !964}
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !584, file: !371, line: 95, baseType: !1066, size: 64, offset: 3264)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !584, file: !371, line: 96, baseType: !1066, size: 64, offset: 3328)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !584, file: !371, line: 97, baseType: !1066, size: 64, offset: 3392)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !584, file: !371, line: 99, baseType: !1074, size: 64, offset: 3456)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!367, !368, !1077, !1080}
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !742, line: 51, baseType: !1078)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !742, line: 51, flags: DIFlagFwdDecl)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !65, line: 1378, baseType: !1081)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !371, line: 609, size: 6208, elements: !1083)
!1083 = !{!1084, !1085, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1104, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1122, !1123, !1124, !1125, !1126, !1128, !1129, !1130, !1131, !1132, !1133, !1134}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1082, file: !371, line: 610, baseType: !374, size: 4480)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1082, file: !371, line: 610, baseType: !1086, size: 32, offset: 4480)
!1086 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 32, elements: !432)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1082, file: !371, line: 611, baseType: !436, size: 32, offset: 4512)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1082, file: !371, line: 611, baseType: !436, size: 32, offset: 4544)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1082, file: !371, line: 611, baseType: !436, size: 32, offset: 4576)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1082, file: !371, line: 612, baseType: !436, size: 32, offset: 4608)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1082, file: !371, line: 613, baseType: !436, size: 32, offset: 4640)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1082, file: !371, line: 614, baseType: !482, size: 64, offset: 4672)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1082, file: !371, line: 615, baseType: !484, size: 64, offset: 4736)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !1082, file: !371, line: 616, baseType: !825, size: 64, offset: 4800)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1082, file: !371, line: 617, baseType: !482, size: 64, offset: 4864)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !1082, file: !371, line: 618, baseType: !1097, size: 64, offset: 4928)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !371, line: 602, baseType: !1099)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !371, line: 598, size: 128, elements: !1100)
!1100 = !{!1101, !1102, !1103}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1099, file: !371, line: 599, baseType: !436, size: 32)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1099, file: !371, line: 600, baseType: !436, size: 32, offset: 32)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1099, file: !371, line: 601, baseType: !499, size: 64, offset: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !1082, file: !371, line: 619, baseType: !1105, size: 64, offset: 4992)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !371, line: 607, baseType: !1107)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !371, line: 604, size: 128, elements: !1108)
!1108 = !{!1109, !1110}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1107, file: !371, line: 605, baseType: !436, size: 32)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1107, file: !371, line: 606, baseType: !499, size: 64, offset: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !1082, file: !371, line: 620, baseType: !499, size: 64, offset: 5056)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !1082, file: !371, line: 621, baseType: !491, size: 64, offset: 5120)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !1082, file: !371, line: 622, baseType: !491, size: 64, offset: 5184)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !1082, file: !371, line: 623, baseType: !605, size: 64, offset: 5248)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !1082, file: !371, line: 623, baseType: !605, size: 64, offset: 5312)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !1082, file: !371, line: 623, baseType: !605, size: 64, offset: 5376)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !1082, file: !371, line: 624, baseType: !552, size: 32, offset: 5440)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1082, file: !371, line: 625, baseType: !1119, size: 64, offset: 5504)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = !DISubroutineType(types: !1121)
!1121 = !{!367}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !1082, file: !371, line: 626, baseType: !473, size: 64, offset: 5568)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !1082, file: !371, line: 627, baseType: !605, size: 64, offset: 5632)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1082, file: !371, line: 628, baseType: !436, size: 32, offset: 5696)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !1082, file: !371, line: 629, baseType: !413, size: 64, offset: 5760)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1082, file: !371, line: 630, baseType: !1127, size: 32, offset: 5824)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !135, line: 213, baseType: !134)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1082, file: !371, line: 631, baseType: !436, size: 32, offset: 5856)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !1082, file: !371, line: 631, baseType: !436, size: 32, offset: 5888)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1082, file: !371, line: 632, baseType: !552, size: 32, offset: 5920)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !1082, file: !371, line: 633, baseType: !552, size: 32, offset: 5952)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !1082, file: !371, line: 634, baseType: !424, size: 64, offset: 6016)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !1082, file: !371, line: 634, baseType: !473, size: 64, offset: 6080)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !1082, file: !371, line: 635, baseType: !444, size: 64, offset: 6144)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !584, file: !371, line: 100, baseType: !1136, size: 64, offset: 3520)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!367, !368, !436, !436, !1139, !1142}
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !135, line: 215, baseType: !1141)
!1141 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !584, file: !371, line: 101, baseType: !986, size: 64, offset: 3584)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !584, file: !371, line: 102, baseType: !1145, size: 64, offset: 3648)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!367, !368, !781, !781, !940}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !584, file: !371, line: 103, baseType: !587, size: 64, offset: 3712)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !584, file: !371, line: 105, baseType: !1150, size: 64, offset: 3776)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!367, !368, !781, !781, !939, !940}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !584, file: !371, line: 106, baseType: !986, size: 64, offset: 3840)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !584, file: !371, line: 107, baseType: !1155, size: 64, offset: 3904)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{!367, !368, !400}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !584, file: !371, line: 108, baseType: !1159, size: 64, offset: 3968)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!367, !368, !1162, !939, !940}
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !65, line: 25, baseType: !413)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !584, file: !371, line: 109, baseType: !1119, size: 64, offset: 4032)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !584, file: !371, line: 111, baseType: !1165, size: 64, offset: 4096)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = !DISubroutineType(types: !1167)
!1167 = !{!367, !368, !368, !368, !491, !368}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !584, file: !371, line: 112, baseType: !1169, size: 64, offset: 4160)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!367, !368, !368, !368, !368}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !584, file: !371, line: 113, baseType: !1173, size: 64, offset: 4224)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = !DISubroutineType(types: !1175)
!1175 = !{!367, !368, !741, !741}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !584, file: !371, line: 114, baseType: !587, size: 64, offset: 4288)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !584, file: !371, line: 115, baseType: !990, size: 64, offset: 4352)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !584, file: !371, line: 117, baseType: !1048, size: 64, offset: 4416)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !584, file: !371, line: 118, baseType: !1048, size: 64, offset: 4480)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !584, file: !371, line: 119, baseType: !1159, size: 64, offset: 4544)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !584, file: !371, line: 120, baseType: !1182, size: 64, offset: 4608)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = !DISubroutineType(types: !1184)
!1184 = !{!367, !368, !1185, !964}
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !65, line: 1675, baseType: !139)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !584, file: !371, line: 121, baseType: !1119, size: 64, offset: 4672)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !584, file: !371, line: 123, baseType: !1188, size: 64, offset: 4736)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = !DISubroutineType(types: !1190)
!1190 = !{!367, !368, !436, !473}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !584, file: !371, line: 124, baseType: !1192, size: 64, offset: 4800)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1193 = !DISubroutineType(types: !1194)
!1194 = !{!367, !368, !1080, !605, !473}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !584, file: !371, line: 125, baseType: !1196, size: 64, offset: 4864)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{!367, !528, !368}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !584, file: !371, line: 126, baseType: !364, size: 64, offset: 4928)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !584, file: !371, line: 127, baseType: !364, size: 64, offset: 4992)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !584, file: !371, line: 129, baseType: !1202, size: 64, offset: 5056)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = !DISubroutineType(types: !1204)
!1204 = !{!367, !368, !825}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !584, file: !371, line: 130, baseType: !1206, size: 64, offset: 5120)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{!367, !368, !1209, !1209}
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !38, line: 654, baseType: !1210)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !38, line: 653, size: 128, elements: !1212)
!1212 = !{!1213, !1214}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1211, file: !38, line: 653, baseType: !436, size: 32)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1211, file: !38, line: 653, baseType: !605, size: 64, offset: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !584, file: !371, line: 131, baseType: !1206, size: 64, offset: 5184)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !584, file: !371, line: 132, baseType: !1217, size: 64, offset: 5248)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64)
!1218 = !DISubroutineType(types: !1219)
!1219 = !{!367, !368, !482, !482, !482}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !584, file: !371, line: 133, baseType: !1155, size: 64, offset: 5312)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !584, file: !371, line: 135, baseType: !1222, size: 64, offset: 5376)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{!367, !368, !491, !964}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !584, file: !371, line: 136, baseType: !1222, size: 64, offset: 5440)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !584, file: !371, line: 137, baseType: !1227, size: 64, offset: 5504)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{!367, !368, !964}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !584, file: !371, line: 138, baseType: !587, size: 64, offset: 5568)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !584, file: !371, line: 139, baseType: !1232, size: 64, offset: 5632)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = !DISubroutineType(types: !1234)
!1234 = !{!367, !368, !619, !619}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !584, file: !371, line: 141, baseType: !1119, size: 64, offset: 5696)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !584, file: !371, line: 142, baseType: !1237, size: 64, offset: 5760)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64)
!1238 = !DISubroutineType(types: !1239)
!1239 = !{!367, !368, !368, !491, !368}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !584, file: !371, line: 143, baseType: !1241, size: 64, offset: 5824)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1242 = !DISubroutineType(types: !1243)
!1243 = !{!367, !368, !368, !368}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !584, file: !371, line: 144, baseType: !1119, size: 64, offset: 5888)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !584, file: !371, line: 145, baseType: !1237, size: 64, offset: 5952)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !584, file: !371, line: 147, baseType: !1241, size: 64, offset: 6016)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !584, file: !371, line: 148, baseType: !1119, size: 64, offset: 6080)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !584, file: !371, line: 149, baseType: !1237, size: 64, offset: 6144)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !584, file: !371, line: 150, baseType: !1241, size: 64, offset: 6208)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !584, file: !371, line: 151, baseType: !1251, size: 64, offset: 6272)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = !DISubroutineType(types: !1253)
!1253 = !{!367, !368, !552}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !584, file: !371, line: 153, baseType: !986, size: 64, offset: 6336)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !584, file: !371, line: 154, baseType: !986, size: 64, offset: 6400)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !584, file: !371, line: 155, baseType: !986, size: 64, offset: 6464)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !584, file: !371, line: 156, baseType: !986, size: 64, offset: 6528)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !584, file: !371, line: 157, baseType: !1155, size: 64, offset: 6592)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !584, file: !371, line: 159, baseType: !1260, size: 64, offset: 6656)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{!367, !368, !436, !592}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !584, file: !371, line: 160, baseType: !986, size: 64, offset: 6720)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !584, file: !371, line: 161, baseType: !986, size: 64, offset: 6784)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !584, file: !371, line: 162, baseType: !986, size: 64, offset: 6848)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !584, file: !371, line: 163, baseType: !986, size: 64, offset: 6912)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !584, file: !371, line: 165, baseType: !1241, size: 64, offset: 6976)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !584, file: !371, line: 166, baseType: !1241, size: 64, offset: 7040)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !584, file: !371, line: 167, baseType: !1048, size: 64, offset: 7104)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !584, file: !371, line: 168, baseType: !1271, size: 64, offset: 7168)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{!367, !368, !605, !436}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !584, file: !371, line: 169, baseType: !1275, size: 64, offset: 7232)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!367, !368, !964, !482}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !584, file: !371, line: 171, baseType: !1010, size: 64, offset: 7296)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !584, file: !371, line: 172, baseType: !986, size: 64, offset: 7360)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !584, file: !371, line: 173, baseType: !1281, size: 64, offset: 7424)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64)
!1282 = !DISubroutineType(types: !1283)
!1283 = !{!367, !368, !482, !1069}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !584, file: !371, line: 174, baseType: !1145, size: 64, offset: 7488)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !584, file: !371, line: 175, baseType: !1145, size: 64, offset: 7552)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !584, file: !371, line: 177, baseType: !364, size: 64, offset: 7616)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !584, file: !371, line: 178, baseType: !936, size: 64, offset: 7680)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !584, file: !371, line: 179, baseType: !364, size: 64, offset: 7744)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !584, file: !371, line: 180, baseType: !602, size: 64, offset: 7808)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !584, file: !371, line: 181, baseType: !1291, size: 64, offset: 7872)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64)
!1292 = !DISubroutineType(types: !1293)
!1293 = !{!367, !368, !392, !939, !940}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !584, file: !371, line: 183, baseType: !1202, size: 64, offset: 7936)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !584, file: !371, line: 184, baseType: !971, size: 64, offset: 8000)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !584, file: !371, line: 185, baseType: !1297, size: 64, offset: 8064)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64)
!1298 = !DISubroutineType(types: !1299)
!1299 = !{!367, !368, !789}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !584, file: !371, line: 186, baseType: !1301, size: 64, offset: 8128)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64)
!1302 = !DISubroutineType(types: !1303)
!1303 = !{!367, !368, !436, !590, !499}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !584, file: !371, line: 187, baseType: !1029, size: 64, offset: 8192)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !584, file: !371, line: 189, baseType: !1306, size: 64, offset: 8256)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64)
!1307 = !DISubroutineType(types: !1308)
!1308 = !{!367, !368, !436, !436, !482, !592}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !584, file: !371, line: 190, baseType: !1119, size: 64, offset: 8320)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !584, file: !371, line: 191, baseType: !1237, size: 64, offset: 8384)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !584, file: !371, line: 192, baseType: !1241, size: 64, offset: 8448)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !584, file: !371, line: 193, baseType: !1313, size: 64, offset: 8512)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64)
!1314 = !DISubroutineType(types: !1315)
!1315 = !{!367, !368, !1077, !1316}
!1316 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !65, line: 1401, baseType: !1317)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64)
!1318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !371, line: 660, size: 5312, elements: !1319)
!1319 = !{!1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1318, file: !371, line: 661, baseType: !374, size: 4480)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1318, file: !371, line: 661, baseType: !1086, size: 32, offset: 4480)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1318, file: !371, line: 662, baseType: !436, size: 32, offset: 4512)
