; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/richardson/snesrichardson.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/richardson/snesrichardson.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_datatype_t = type opaque

!35 = !DIEnumerator(name: "SNES_DIVERGED_FNORM_NAN", value: -4)
!36 = !DIEnumerator(name: "SNES_DIVERGED_MAX_IT", value: -5)
!37 = !DIEnumerator(name: "SNES_DIVERGED_LINE_SEARCH", value: -6)
!38 = !DIEnumerator(name: "SNES_DIVERGED_INNER", value: -7)
!39 = !DIEnumerator(name: "SNES_DIVERGED_LOCAL_MIN", value: -8)
!40 = !DIEnumerator(name: "SNES_DIVERGED_DTOL", value: -9)
!41 = !DIEnumerator(name: "SNES_DIVERGED_JACOBIAN_DOMAIN", value: -10)
!42 = !DIEnumerator(name: "SNES_DIVERGED_TR_DELTA", value: -11)
!43 = !DIEnumerator(name: "SNES_CONVERGED_TR_DELTA", value: -11)
!44 = !DIEnumerator(name: "SNES_CONVERGED_ITERATING", value: 0)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !46, line: 85, baseType: !26, size: 32, elements: !47)
!46 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpctypes.h", directory: "/home/users/ndemeye/xSDK")
!47 = !{!48, !49, !50, !51}
!48 = !DIEnumerator(name: "PC_SIDE_DEFAULT", value: -1)
!49 = !DIEnumerator(name: "PC_LEFT", value: 0)
!50 = !DIEnumerator(name: "PC_RIGHT", value: 1)
!51 = !DIEnumerator(name: "PC_SYMMETRIC", value: 2)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !53, line: 285, baseType: !5, size: 32, elements: !54)
!53 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!54 = !{!55, !56, !57, !58}
!55 = !DIEnumerator(name: "DIFFERENT_NONZERO_PATTERN", value: 0, isUnsigned: true)
!56 = !DIEnumerator(name: "SUBSET_NONZERO_PATTERN", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 406, baseType: !26, size: 32, elements: !60)
!60 = !{!61, !62, !63, !64, !65, !66}
!61 = !DIEnumerator(name: "SNES_NORM_DEFAULT", value: -1)
!62 = !DIEnumerator(name: "SNES_NORM_NONE", value: 0)
!63 = !DIEnumerator(name: "SNES_NORM_ALWAYS", value: 1)
!64 = !DIEnumerator(name: "SNES_NORM_INITIAL_ONLY", value: 2)
!65 = !DIEnumerator(name: "SNES_NORM_FINAL_ONLY", value: 3)
!66 = !DIEnumerator(name: "SNES_NORM_INITIAL_FINAL_ONLY", value: 4)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 493, baseType: !26, size: 32, elements: !68)
!68 = !{!69, !70, !71}
!69 = !DIEnumerator(name: "SNES_FUNCTION_DEFAULT", value: -1)
!70 = !DIEnumerator(name: "SNES_FUNCTION_UNPRECONDITIONED", value: 0)
!71 = !DIEnumerator(name: "SNES_FUNCTION_PRECONDITIONED", value: 1)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !73, line: 663, baseType: !5, size: 32, elements: !74)
!73 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!74 = !{!75, !76, !77}
!75 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 616, baseType: !5, size: 32, elements: !79)
!79 = !{!80, !81, !82, !83, !84, !85}
!80 = !DIEnumerator(name: "SNES_LINESEARCH_SUCCEEDED", value: 0, isUnsigned: true)
!81 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_NANORINF", value: 1, isUnsigned: true)
!82 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_DOMAIN", value: 2, isUnsigned: true)
!83 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_REDUCT", value: 3, isUnsigned: true)
!84 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_USER", value: 4, isUnsigned: true)
!85 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_FUNCTION", value: 5, isUnsigned: true)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !87, line: 155, baseType: !5, size: 32, elements: !88)
!87 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!88 = !{!89, !90, !91, !92, !93}
!89 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!90 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!91 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!92 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!93 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!94 = !{!95, !98, !102, !103, !175, !303, !306, !185, !26, !269, !5}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!97 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !99, line: 330, baseType: !100)
!99 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !99, line: 330, flags: DIFlagFwdDecl)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !106, line: 73, size: 4480, elements: !107)
!106 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!107 = !{!108, !110, !156, !157, !159, !162, !163, !164, !165, !173, !174, !176, !180, !184, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !197, !198, !199, !201, !202, !204, !206, !207, !208, !209, !210, !213, !215, !216, !217, !218, !219, !222, !224, !225, !226, !236, !238, !239, !243, !244, !293, !298, !300, !301, !302}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !105, file: !106, line: 74, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !105, file: !106, line: 75, baseType: !111, size: 448, offset: 64)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 448, elements: !154)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !106, line: 53, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !106, line: 45, size: 448, elements: !114)
!114 = !{!115, !121, !129, !134, !138, !142, !149}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !113, file: !106, line: 46, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!119, !103, !120}
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !113, file: !106, line: 47, baseType: !122, size: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!119, !103, !125}
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !126, line: 16, baseType: !127)
!126 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !126, line: 16, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !113, file: !106, line: 48, baseType: !130, size: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!119, !133}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !113, file: !106, line: 49, baseType: !135, size: 64, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!119, !103, !95, !103}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !113, file: !106, line: 50, baseType: !139, size: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!119, !103, !95, !133}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !113, file: !106, line: 51, baseType: !143, size: 64, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!119, !103, !95, !146}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{null}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !113, file: !106, line: 52, baseType: !150, size: 64, offset: 384)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!119, !103, !95, !153}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!154 = !{!155}
!155 = !DISubrange(count: 1)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !105, file: !106, line: 76, baseType: !98, size: 64, offset: 512)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !105, file: !106, line: 77, baseType: !158, size: 32, offset: 576)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !105, file: !106, line: 78, baseType: !160, size: 64, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !161)
!161 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !105, file: !106, line: 78, baseType: !160, size: 64, offset: 704)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !105, file: !106, line: 78, baseType: !160, size: 64, offset: 768)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !105, file: !106, line: 78, baseType: !160, size: 64, offset: 832)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !105, file: !106, line: 79, baseType: !166, size: 64, offset: 896)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !169, line: 27, baseType: !170)
!169 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !171, line: 43, baseType: !172)
!171 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!172 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !105, file: !106, line: 80, baseType: !158, size: 32, offset: 960)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !105, file: !106, line: 81, baseType: !175, size: 32, offset: 992)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !105, file: !106, line: 82, baseType: !177, size: 64, offset: 1024)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !105, file: !106, line: 83, baseType: !181, size: 64, offset: 1088)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !105, file: !106, line: 84, baseType: !185, size: 64, offset: 1152)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !105, file: !106, line: 85, baseType: !185, size: 64, offset: 1216)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !105, file: !106, line: 86, baseType: !185, size: 64, offset: 1280)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !105, file: !106, line: 87, baseType: !185, size: 64, offset: 1344)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !105, file: !106, line: 88, baseType: !103, size: 64, offset: 1408)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !105, file: !106, line: 89, baseType: !166, size: 64, offset: 1472)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !105, file: !106, line: 90, baseType: !185, size: 64, offset: 1536)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !105, file: !106, line: 91, baseType: !185, size: 64, offset: 1600)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !105, file: !106, line: 92, baseType: !158, size: 32, offset: 1664)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !105, file: !106, line: 93, baseType: !102, size: 64, offset: 1728)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !105, file: !106, line: 94, baseType: !196, size: 64, offset: 1792)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !167)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !105, file: !106, line: 95, baseType: !158, size: 32, offset: 1856)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !105, file: !106, line: 95, baseType: !158, size: 32, offset: 1888)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !105, file: !106, line: 96, baseType: !200, size: 64, offset: 1920)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !105, file: !106, line: 96, baseType: !200, size: 64, offset: 1984)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !105, file: !106, line: 97, baseType: !203, size: 64, offset: 2048)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !105, file: !106, line: 97, baseType: !205, size: 64, offset: 2112)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !105, file: !106, line: 98, baseType: !158, size: 32, offset: 2176)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !105, file: !106, line: 98, baseType: !158, size: 32, offset: 2208)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !105, file: !106, line: 99, baseType: !200, size: 64, offset: 2240)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !105, file: !106, line: 99, baseType: !200, size: 64, offset: 2304)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !105, file: !106, line: 100, baseType: !211, size: 64, offset: 2368)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !161)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !105, file: !106, line: 100, baseType: !214, size: 64, offset: 2432)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !105, file: !106, line: 101, baseType: !158, size: 32, offset: 2496)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !105, file: !106, line: 101, baseType: !158, size: 32, offset: 2528)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !105, file: !106, line: 102, baseType: !200, size: 64, offset: 2560)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !105, file: !106, line: 102, baseType: !200, size: 64, offset: 2624)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !105, file: !106, line: 103, baseType: !220, size: 64, offset: 2688)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !212)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !105, file: !106, line: 103, baseType: !223, size: 64, offset: 2752)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !105, file: !106, line: 104, baseType: !153, size: 64, offset: 2816)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !105, file: !106, line: 105, baseType: !158, size: 32, offset: 2880)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !105, file: !106, line: 106, baseType: !227, size: 128, offset: 2944)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 128, elements: !234)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !106, line: 64, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !106, line: 61, size: 128, elements: !231)
!231 = !{!232, !233}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !230, file: !106, line: 62, baseType: !146, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !230, file: !106, line: 63, baseType: !102, size: 64, offset: 64)
!234 = !{!235}
!235 = !DISubrange(count: 2)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !105, file: !106, line: 107, baseType: !237, size: 64, offset: 3072)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 64, elements: !234)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !105, file: !106, line: 108, baseType: !102, size: 64, offset: 3136)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !105, file: !106, line: 109, baseType: !240, size: 64, offset: 3200)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!119, !102}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !105, file: !106, line: 111, baseType: !158, size: 32, offset: 3264)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !105, file: !106, line: 112, baseType: !245, size: 320, offset: 3328)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 320, elements: !291)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!119, !249, !103, !102}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !252)
!252 = !{!253, !254, !279, !280, !281, !282, !283, !284, !285, !286, !287}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !251, file: !10, line: 100, baseType: !158, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !251, file: !10, line: 101, baseType: !255, size: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !258)
!258 = !{!259, !260, !261, !262, !263, !266, !267, !268, !272, !274, !276, !277, !278}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !257, file: !10, line: 84, baseType: !185, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !257, file: !10, line: 85, baseType: !185, size: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !257, file: !10, line: 86, baseType: !102, size: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !257, file: !10, line: 87, baseType: !177, size: 64, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !257, file: !10, line: 88, baseType: !264, size: 64, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !257, file: !10, line: 89, baseType: !97, size: 8, offset: 320)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !257, file: !10, line: 90, baseType: !185, size: 64, offset: 384)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !257, file: !10, line: 91, baseType: !269, size: 64, offset: 448)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !270, line: 46, baseType: !271)
!270 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!271 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !257, file: !10, line: 92, baseType: !273, size: 32, offset: 512)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !257, file: !10, line: 93, baseType: !275, size: 32, offset: 544)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !257, file: !10, line: 94, baseType: !255, size: 64, offset: 576)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !257, file: !10, line: 95, baseType: !185, size: 64, offset: 640)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !257, file: !10, line: 96, baseType: !102, size: 64, offset: 704)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !251, file: !10, line: 102, baseType: !185, size: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !251, file: !10, line: 102, baseType: !185, size: 64, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !251, file: !10, line: 103, baseType: !185, size: 64, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !251, file: !10, line: 104, baseType: !98, size: 64, offset: 320)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !251, file: !10, line: 105, baseType: !273, size: 32, offset: 384)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !251, file: !10, line: 105, baseType: !273, size: 32, offset: 416)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !251, file: !10, line: 105, baseType: !273, size: 32, offset: 448)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !251, file: !10, line: 106, baseType: !103, size: 64, offset: 512)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !251, file: !10, line: 107, baseType: !288, size: 64, offset: 576)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!291 = !{!292}
!292 = !DISubrange(count: 5)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !105, file: !106, line: 113, baseType: !294, size: 320, offset: 3648)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 320, elements: !291)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!119, !103, !102}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !105, file: !106, line: 114, baseType: !299, size: 320, offset: 3968)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 320, elements: !291)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !105, file: !106, line: 115, baseType: !273, size: 32, offset: 4288)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !105, file: !106, line: 120, baseType: !288, size: 64, offset: 4352)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !105, file: !106, line: 121, baseType: !273, size: 32, offset: 4416)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !99, line: 331, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !99, line: 331, flags: DIFlagFwdDecl)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !99, line: 338, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !99, line: 338, flags: DIFlagFwdDecl)
!309 = !{i32 7, !"Dwarf Version", i32 4}
!310 = !{i32 2, !"Debug Info Version", i32 3}
!311 = !{i32 1, !"wchar_size", i32 4}
!312 = !{i32 7, !"PIC Level", i32 2}
!313 = !{i32 7, !"uwtable", i32 1}
!314 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!315 = distinct !DISubprogram(name: "SNESReset_NRichardson", scope: !316, file: !316, line: 3, type: !317, scopeLine: 4, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !506)
!316 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/snes/impls/richardson/snesrichardson.c", directory: "/home/users/ndemeye/xSDK")
!317 = !DISubroutineType(types: !318)
!318 = !{!119, !319}
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !25, line: 18, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !322, line: 38, size: 11648, elements: !323)
!322 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/snesimpl.h", directory: "/home/users/ndemeye/xSDK")
!323 = !{!324, !326, !390, !395, !396, !397, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !413, !417, !418, !420, !421, !422, !423, !424, !429, !431, !432, !433, !434, !435, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !471, !473, !474, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !321, file: !322, line: 39, baseType: !325, size: 4480)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !106, line: 122, baseType: !105)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !321, file: !322, line: 39, baseType: !327, size: 1088, offset: 4480)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 1088, elements: !154)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SNESOps", file: !322, line: 12, size: 1088, elements: !329)
!329 = !{!330, !337, !341, !345, !351, !352, !354, !355, !359, !363, !364, !365, !370, !374, !378, !382, !389}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "computeinitialguess", scope: !328, file: !322, line: 13, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!119, !319, !334, !102}
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !87, line: 21, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !87, line: 21, flags: DIFlagFwdDecl)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "computescaling", scope: !328, file: !322, line: 14, baseType: !338, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!119, !334, !334, !102}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !328, file: !322, line: 15, baseType: !342, size: 64, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!119, !319, !158}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !328, file: !322, line: 16, baseType: !346, size: 64, offset: 192)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!119, !319, !158, !212, !212, !212, !349, !102}
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESConvergedReason", file: !25, line: 257, baseType: !24)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !328, file: !322, line: 17, baseType: !240, size: 64, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !328, file: !322, line: 18, baseType: !353, size: 64, offset: 320)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !328, file: !322, line: 19, baseType: !353, size: 64, offset: 384)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !328, file: !322, line: 20, baseType: !356, size: 64, offset: 448)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{!119, !319, !125}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !328, file: !322, line: 21, baseType: !360, size: 64, offset: 512)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!119, !249, !319}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !328, file: !322, line: 22, baseType: !353, size: 64, offset: 576)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !328, file: !322, line: 23, baseType: !353, size: 64, offset: 640)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "usercompute", scope: !328, file: !322, line: 24, baseType: !366, size: 64, offset: 704)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!119, !319, !369}
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "userdestroy", scope: !328, file: !322, line: 25, baseType: !371, size: 64, offset: 768)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!119, !369}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !328, file: !322, line: 26, baseType: !375, size: 64, offset: 832)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!119, !319, !334, !334}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "computepfunction", scope: !328, file: !322, line: 27, baseType: !379, size: 64, offset: 896)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!119, !319, !334, !334, !102}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "computepjacobian", scope: !328, file: !322, line: 28, baseType: !383, size: 64, offset: 960)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!119, !319, !334, !386, !386, !102}
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !53, line: 16, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !53, line: 16, flags: DIFlagFwdDecl)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !328, file: !322, line: 29, baseType: !356, size: 64, offset: 1024)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !321, file: !322, line: 40, baseType: !391, size: 64, offset: 5568)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !392, line: 14, baseType: !393)
!392 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !392, line: 14, flags: DIFlagFwdDecl)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !321, file: !322, line: 41, baseType: !273, size: 32, offset: 5632)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "npc", scope: !321, file: !322, line: 42, baseType: !319, size: 64, offset: 5696)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "npcside", scope: !321, file: !322, line: 43, baseType: !398, size: 32, offset: 5760)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !46, line: 85, baseType: !45)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "usesnpc", scope: !321, file: !322, line: 44, baseType: !273, size: 32, offset: 5792)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !321, file: !322, line: 47, baseType: !102, size: 64, offset: 5824)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !321, file: !322, line: 49, baseType: !334, size: 64, offset: 5888)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !321, file: !322, line: 50, baseType: !334, size: 64, offset: 5952)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !321, file: !322, line: 52, baseType: !334, size: 64, offset: 6016)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !321, file: !322, line: 54, baseType: !386, size: 64, offset: 6080)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !321, file: !322, line: 55, baseType: !386, size: 64, offset: 6144)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "picard", scope: !321, file: !322, line: 56, baseType: !386, size: 64, offset: 6208)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "initialguessP", scope: !321, file: !322, line: 57, baseType: !102, size: 64, offset: 6272)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !321, file: !322, line: 58, baseType: !409, size: 64, offset: 6336)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !410, line: 22, baseType: !411)
!410 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !410, line: 22, flags: DIFlagFwdDecl)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !321, file: !322, line: 59, baseType: !414, size: 64, offset: 6400)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearch", file: !25, line: 526, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_LineSearch", file: !25, line: 526, flags: DIFlagFwdDecl)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "usesksp", scope: !321, file: !322, line: 60, baseType: !273, size: 32, offset: 6464)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "matstruct", scope: !321, file: !322, line: 61, baseType: !419, size: 32, offset: 6496)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !53, line: 285, baseType: !52)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_update", scope: !321, file: !322, line: 63, baseType: !334, size: 64, offset: 6528)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "scaling", scope: !321, file: !322, line: 65, baseType: !334, size: 64, offset: 6592)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "scaP", scope: !321, file: !322, line: 66, baseType: !102, size: 64, offset: 6656)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !321, file: !322, line: 68, baseType: !212, size: 64, offset: 6720)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !321, file: !322, line: 74, baseType: !425, size: 320, offset: 6784)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 320, elements: !291)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!119, !319, !158, !212, !102}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !321, file: !322, line: 75, baseType: !430, size: 320, offset: 7104)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !371, size: 320, elements: !291)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !321, file: !322, line: 76, baseType: !299, size: 320, offset: 7424)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !321, file: !322, line: 77, baseType: !158, size: 32, offset: 7744)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !321, file: !322, line: 78, baseType: !102, size: 64, offset: 7808)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !321, file: !322, line: 79, baseType: !350, size: 32, offset: 7872)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !321, file: !322, line: 80, baseType: !436, size: 320, offset: 7936)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !437, size: 320, elements: !291)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!119, !319, !102}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !321, file: !322, line: 81, baseType: !430, size: 320, offset: 8256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !321, file: !322, line: 82, baseType: !299, size: 320, offset: 8576)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !321, file: !322, line: 83, baseType: !158, size: 32, offset: 8896)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !321, file: !322, line: 84, baseType: !273, size: 32, offset: 8928)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !321, file: !322, line: 88, baseType: !273, size: 32, offset: 8960)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !321, file: !322, line: 89, baseType: !102, size: 64, offset: 9024)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !321, file: !322, line: 93, baseType: !158, size: 32, offset: 9088)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !321, file: !322, line: 94, baseType: !158, size: 32, offset: 9120)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !321, file: !322, line: 95, baseType: !158, size: 32, offset: 9152)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !321, file: !322, line: 96, baseType: !158, size: 32, offset: 9184)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "linear_its", scope: !321, file: !322, line: 97, baseType: !158, size: 32, offset: 9216)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !321, file: !322, line: 98, baseType: !212, size: 64, offset: 9280)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !321, file: !322, line: 99, baseType: !212, size: 64, offset: 9344)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !321, file: !322, line: 100, baseType: !212, size: 64, offset: 9408)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !321, file: !322, line: 101, baseType: !212, size: 64, offset: 9472)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !321, file: !322, line: 102, baseType: !212, size: 64, offset: 9536)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !321, file: !322, line: 103, baseType: !212, size: 64, offset: 9600)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "stol", scope: !321, file: !322, line: 104, baseType: !212, size: 64, offset: 9664)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "deltatol", scope: !321, file: !322, line: 105, baseType: !212, size: 64, offset: 9728)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "forceiteration", scope: !321, file: !322, line: 106, baseType: !273, size: 32, offset: 9792)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "lagpreconditioner", scope: !321, file: !322, line: 107, baseType: !158, size: 32, offset: 9824)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "lagjacobian", scope: !321, file: !322, line: 108, baseType: !158, size: 32, offset: 9856)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "jac_iter", scope: !321, file: !322, line: 109, baseType: !158, size: 32, offset: 9888)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "lagjac_persist", scope: !321, file: !322, line: 110, baseType: !273, size: 32, offset: 9920)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "pre_iter", scope: !321, file: !322, line: 111, baseType: !158, size: 32, offset: 9952)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "lagpre_persist", scope: !321, file: !322, line: 112, baseType: !273, size: 32, offset: 9984)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "gridsequence", scope: !321, file: !322, line: 113, baseType: !158, size: 32, offset: 10016)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "tolerancesset", scope: !321, file: !322, line: 115, baseType: !273, size: 32, offset: 10048)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_init_set", scope: !321, file: !322, line: 117, baseType: !273, size: 32, offset: 10080)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "normschedule", scope: !321, file: !322, line: 119, baseType: !470, size: 32, offset: 10112)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESNormSchedule", file: !25, line: 411, baseType: !59)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !321, file: !322, line: 120, baseType: !472, size: 32, offset: 10144)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESFunctionType", file: !25, line: 495, baseType: !67)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !321, file: !322, line: 124, baseType: !158, size: 32, offset: 10176)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !321, file: !322, line: 125, baseType: !475, size: 64, offset: 10240)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !321, file: !322, line: 129, baseType: !158, size: 32, offset: 10304)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist", scope: !321, file: !322, line: 130, baseType: !211, size: 64, offset: 10368)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_its", scope: !321, file: !322, line: 132, baseType: !203, size: 64, offset: 10432)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_len", scope: !321, file: !322, line: 133, baseType: !158, size: 32, offset: 10496)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_max", scope: !321, file: !322, line: 134, baseType: !158, size: 32, offset: 10528)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_reset", scope: !321, file: !322, line: 135, baseType: !273, size: 32, offset: 10560)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_alloc", scope: !321, file: !322, line: 136, baseType: !273, size: 32, offset: 10592)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "counters_reset", scope: !321, file: !322, line: 137, baseType: !273, size: 32, offset: 10624)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "numFailures", scope: !321, file: !322, line: 140, baseType: !158, size: 32, offset: 10656)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "maxFailures", scope: !321, file: !322, line: 141, baseType: !158, size: 32, offset: 10688)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "numLinearSolveFailures", scope: !321, file: !322, line: 143, baseType: !158, size: 32, offset: 10720)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "maxLinearSolveFailures", scope: !321, file: !322, line: 144, baseType: !158, size: 32, offset: 10752)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "domainerror", scope: !321, file: !322, line: 146, baseType: !273, size: 32, offset: 10784)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "jacobiandomainerror", scope: !321, file: !322, line: 147, baseType: !273, size: 32, offset: 10816)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "checkjacdomainerror", scope: !321, file: !322, line: 148, baseType: !273, size: 32, offset: 10848)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_ewconv", scope: !321, file: !322, line: 150, baseType: !273, size: 32, offset: 10880)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "kspconvctx", scope: !321, file: !322, line: 151, baseType: !102, size: 64, offset: 10944)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !321, file: !322, line: 154, baseType: !212, size: 64, offset: 11008)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !321, file: !322, line: 155, baseType: !212, size: 64, offset: 11072)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "vwork", scope: !321, file: !322, line: 157, baseType: !475, size: 64, offset: 11136)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "nvwork", scope: !321, file: !322, line: 158, baseType: !158, size: 32, offset: 11200)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !321, file: !322, line: 160, baseType: !273, size: 32, offset: 11232)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "mf_operator", scope: !321, file: !322, line: 161, baseType: !273, size: 32, offset: 11264)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "mf_version", scope: !321, file: !322, line: 162, baseType: !158, size: 32, offset: 11296)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "vizerotolerance", scope: !321, file: !322, line: 164, baseType: !212, size: 64, offset: 11328)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "xl", scope: !321, file: !322, line: 165, baseType: !334, size: 64, offset: 11392)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "xu", scope: !321, file: !322, line: 165, baseType: !334, size: 64, offset: 11456)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ntruebounds", scope: !321, file: !322, line: 166, baseType: !158, size: 32, offset: 11520)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "usersetbounds", scope: !321, file: !322, line: 167, baseType: !273, size: 32, offset: 11552)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "alwayscomputesfinalresidual", scope: !321, file: !322, line: 169, baseType: !273, size: 32, offset: 11584)
!506 = !{!507}
!507 = !DILocalVariable(name: "snes", arg: 1, scope: !315, file: !316, line: 3, type: !319)
!508 = !DILocation(line: 0, scope: !315)
!509 = !DILocation(line: 5, column: 3, scope: !510)
!510 = distinct !DILexicalBlock(scope: !511, file: !316, line: 5, column: 3)
!511 = distinct !DILexicalBlock(scope: !512, file: !316, line: 5, column: 3)
!512 = distinct !DILexicalBlock(scope: !315, file: !316, line: 5, column: 3)
!513 = !{!514, !514, i64 0}
!514 = !{!"any pointer", !515, i64 0}
!515 = !{!"omnipotent char", !516, i64 0}
!516 = !{!"Simple C/C++ TBAA"}
!517 = !DILocation(line: 5, column: 3, scope: !511)
!518 = !DILocation(line: 5, column: 3, scope: !519)
!519 = distinct !DILexicalBlock(scope: !520, file: !316, line: 5, column: 3)
!520 = distinct !DILexicalBlock(scope: !510, file: !316, line: 5, column: 3)
!521 = !{!522, !523, i64 1536}
!522 = !{!"", !515, i64 0, !515, i64 512, !515, i64 1024, !515, i64 1280, !523, i64 1536, !523, i64 1540, !515, i64 1544}
!523 = !{!"int", !515, i64 0}
!524 = !DILocation(line: 5, column: 3, scope: !520)
!525 = !DILocation(line: 5, column: 3, scope: !526)
!526 = distinct !DILexicalBlock(scope: !519, file: !316, line: 5, column: 3)
!527 = !{!523, !523, i64 0}
!528 = !DILocation(line: 6, column: 3, scope: !529)
!529 = distinct !DILexicalBlock(scope: !530, file: !316, line: 6, column: 3)
!530 = distinct !DILexicalBlock(scope: !531, file: !316, line: 6, column: 3)
!531 = distinct !DILexicalBlock(scope: !315, file: !316, line: 6, column: 3)
!532 = !{!522, !523, i64 1540}
!533 = !DILocation(line: 6, column: 3, scope: !534)
!534 = distinct !DILexicalBlock(scope: !535, file: !316, line: 6, column: 3)
!535 = distinct !DILexicalBlock(scope: !529, file: !316, line: 6, column: 3)
!536 = !DILocation(line: 6, column: 3, scope: !535)
!537 = !DILocation(line: 6, column: 3, scope: !538)
!538 = distinct !DILexicalBlock(scope: !539, file: !316, line: 6, column: 3)
!539 = distinct !DILexicalBlock(scope: !534, file: !316, line: 6, column: 3)
!540 = !{!522, !515, i64 1544}
!541 = !DILocation(line: 6, column: 3, scope: !539)
!542 = !DILocation(line: 6, column: 3, scope: !543)
!543 = distinct !DILexicalBlock(scope: !538, file: !316, line: 6, column: 3)
!544 = !DILocation(line: 6, column: 3, scope: !545)
!545 = distinct !DILexicalBlock(scope: !534, file: !316, line: 6, column: 3)
!546 = !DILocation(line: 6, column: 3, scope: !547)
!547 = distinct !DILexicalBlock(scope: !545, file: !316, line: 6, column: 3)
!548 = !DILocation(line: 6, column: 3, scope: !549)
!549 = distinct !DILexicalBlock(scope: !550, file: !316, line: 6, column: 3)
!550 = distinct !DILexicalBlock(scope: !547, file: !316, line: 6, column: 3)
!551 = !DILocation(line: 6, column: 3, scope: !550)
!552 = !DILocation(line: 6, column: 3, scope: !553)
!553 = distinct !DILexicalBlock(scope: !549, file: !316, line: 6, column: 3)
!554 = !DILocation(line: 6, column: 3, scope: !531)
!555 = distinct !DISubprogram(name: "SNESDestroy_NRichardson", scope: !316, file: !316, line: 17, type: !317, scopeLine: 18, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !556)
!556 = !{!557, !558, !559, !561}
!557 = !DILocalVariable(name: "snes", arg: 1, scope: !555, file: !316, line: 17, type: !319)
!558 = !DILocalVariable(name: "ierr", scope: !555, file: !316, line: 19, type: !119)
!559 = !DILocalVariable(name: "ierr__", scope: !560, file: !316, line: 22, type: !119)
!560 = distinct !DILexicalBlock(scope: !555, file: !316, line: 22, column: 38)
!561 = !DILocalVariable(name: "ierr__", scope: !562, file: !316, line: 23, type: !119)
!562 = distinct !DILexicalBlock(scope: !555, file: !316, line: 23, column: 32)
!563 = !DILocation(line: 0, scope: !555)
!564 = !DILocation(line: 21, column: 3, scope: !565)
