; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ts/characteristic/interface/characteristic.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ts/characteristic/interface/characteristic.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._n_PetscFunctionList = type opaque
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!24 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!25 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 663, baseType: !7, size: 32, elements: !28)
!27 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!28 = !{!29, !30, !31}
!29 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!31 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !33)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51}
!34 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!35 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!37 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!38 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!39 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!40 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!41 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!42 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!43 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!44 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!45 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!46 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!47 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!48 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!49 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!50 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!51 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !53, line: 624, baseType: !7, size: 32, elements: !54)
!53 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!54 = !{!55, !56, !57, !58}
!55 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!56 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 42, baseType: !7, size: 32, elements: !61)
!60 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!61 = !{!62, !63, !64, !65, !66}
!62 = !DIEnumerator(name: "DM_BOUNDARY_NONE", value: 0, isUnsigned: true)
!63 = !DIEnumerator(name: "DM_BOUNDARY_GHOSTED", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "DM_BOUNDARY_MIRROR", value: 2, isUnsigned: true)
!65 = !DIEnumerator(name: "DM_BOUNDARY_PERIODIC", value: 3, isUnsigned: true)
!66 = !DIEnumerator(name: "DM_BOUNDARY_TWIST", value: 4, isUnsigned: true)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !68, line: 14, baseType: !7, size: 32, elements: !69)
!68 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmdatypes.h", directory: "/home/users/ndemeye/xSDK")
!69 = !{!70, !71}
!70 = !DIEnumerator(name: "DMDA_STENCIL_STAR", value: 0, isUnsigned: true)
!71 = !DIEnumerator(name: "DMDA_STENCIL_BOX", value: 1, isUnsigned: true)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 580, baseType: !7, size: 32, elements: !73)
!73 = !{!74, !75, !76, !77, !78, !79, !80, !81, !82}
!74 = !DIEnumerator(name: "NOT_SET_VALUES", value: 0, isUnsigned: true)
!75 = !DIEnumerator(name: "INSERT_VALUES", value: 1, isUnsigned: true)
!76 = !DIEnumerator(name: "ADD_VALUES", value: 2, isUnsigned: true)
!77 = !DIEnumerator(name: "MAX_VALUES", value: 3, isUnsigned: true)
!78 = !DIEnumerator(name: "MIN_VALUES", value: 4, isUnsigned: true)
!79 = !DIEnumerator(name: "INSERT_ALL_VALUES", value: 5, isUnsigned: true)
!80 = !DIEnumerator(name: "ADD_ALL_VALUES", value: 6, isUnsigned: true)
!81 = !DIEnumerator(name: "INSERT_BC_VALUES", value: 7, isUnsigned: true)
!82 = !DIEnumerator(name: "ADD_BC_VALUES", value: 8, isUnsigned: true)
!83 = !{!84, !87, !88, !174, !95, !124, !258, !292, !293, !294, !295, !210, !297, !149, !201}
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !53, line: 330, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !53, line: 330, flags: DIFlagFwdDecl)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !91, line: 73, size: 4480, elements: !92)
!91 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!92 = !{!93, !96, !145, !146, !148, !151, !152, !153, !154, !162, !163, !165, !169, !173, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !186, !187, !188, !190, !191, !193, !195, !196, !197, !198, !199, !202, !204, !205, !206, !207, !208, !211, !213, !214, !215, !225, !227, !228, !232, !233, !282, !287, !289, !290, !291}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !90, file: !91, line: 74, baseType: !94, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !95)
!95 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !90, file: !91, line: 75, baseType: !97, size: 448, offset: 64)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 448, elements: !143)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !91, line: 53, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 45, size: 448, elements: !100)
!100 = !{!101, !107, !115, !120, !127, !131, !138}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !99, file: !91, line: 46, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!105, !88, !106}
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !95)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !99, file: !91, line: 47, baseType: !108, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!105, !88, !111}
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !112, line: 16, baseType: !113)
!112 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !112, line: 16, flags: DIFlagFwdDecl)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !99, file: !91, line: 48, baseType: !116, size: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!105, !119}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !99, file: !91, line: 49, baseType: !121, size: 64, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!105, !88, !124, !88}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!126 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !99, file: !91, line: 50, baseType: !128, size: 64, offset: 256)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!105, !88, !124, !119}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !99, file: !91, line: 51, baseType: !132, size: 64, offset: 320)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!105, !88, !124, !135}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{null}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !99, file: !91, line: 52, baseType: !139, size: 64, offset: 384)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!105, !88, !124, !142}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!143 = !{!144}
!144 = !DISubrange(count: 1)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !90, file: !91, line: 76, baseType: !84, size: 64, offset: 512)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !90, file: !91, line: 77, baseType: !147, size: 32, offset: 576)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !95)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !90, file: !91, line: 78, baseType: !149, size: 64, offset: 640)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !150)
!150 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !90, file: !91, line: 78, baseType: !149, size: 64, offset: 704)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !90, file: !91, line: 78, baseType: !149, size: 64, offset: 768)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !90, file: !91, line: 78, baseType: !149, size: 64, offset: 832)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !90, file: !91, line: 79, baseType: !155, size: 64, offset: 896)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !158, line: 27, baseType: !159)
!158 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !160, line: 43, baseType: !161)
!160 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!161 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !90, file: !91, line: 80, baseType: !147, size: 32, offset: 960)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !90, file: !91, line: 81, baseType: !164, size: 32, offset: 992)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !95)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !90, file: !91, line: 82, baseType: !166, size: 64, offset: 1024)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !90, file: !91, line: 83, baseType: !170, size: 64, offset: 1088)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !90, file: !91, line: 84, baseType: !174, size: 64, offset: 1152)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !90, file: !91, line: 85, baseType: !174, size: 64, offset: 1216)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !90, file: !91, line: 86, baseType: !174, size: 64, offset: 1280)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !90, file: !91, line: 87, baseType: !174, size: 64, offset: 1344)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !90, file: !91, line: 88, baseType: !88, size: 64, offset: 1408)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !90, file: !91, line: 89, baseType: !155, size: 64, offset: 1472)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !90, file: !91, line: 90, baseType: !174, size: 64, offset: 1536)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !90, file: !91, line: 91, baseType: !174, size: 64, offset: 1600)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !90, file: !91, line: 92, baseType: !147, size: 32, offset: 1664)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !90, file: !91, line: 93, baseType: !87, size: 64, offset: 1728)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !90, file: !91, line: 94, baseType: !185, size: 64, offset: 1792)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !156)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !90, file: !91, line: 95, baseType: !147, size: 32, offset: 1856)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !90, file: !91, line: 95, baseType: !147, size: 32, offset: 1888)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !90, file: !91, line: 96, baseType: !189, size: 64, offset: 1920)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !90, file: !91, line: 96, baseType: !189, size: 64, offset: 1984)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !90, file: !91, line: 97, baseType: !192, size: 64, offset: 2048)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !90, file: !91, line: 97, baseType: !194, size: 64, offset: 2112)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !90, file: !91, line: 98, baseType: !147, size: 32, offset: 2176)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !90, file: !91, line: 98, baseType: !147, size: 32, offset: 2208)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !90, file: !91, line: 99, baseType: !189, size: 64, offset: 2240)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !90, file: !91, line: 99, baseType: !189, size: 64, offset: 2304)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !90, file: !91, line: 100, baseType: !200, size: 64, offset: 2368)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !150)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !90, file: !91, line: 100, baseType: !203, size: 64, offset: 2432)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !90, file: !91, line: 101, baseType: !147, size: 32, offset: 2496)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !90, file: !91, line: 101, baseType: !147, size: 32, offset: 2528)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !90, file: !91, line: 102, baseType: !189, size: 64, offset: 2560)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !90, file: !91, line: 102, baseType: !189, size: 64, offset: 2624)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !90, file: !91, line: 103, baseType: !209, size: 64, offset: 2688)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !201)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !90, file: !91, line: 103, baseType: !212, size: 64, offset: 2752)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !90, file: !91, line: 104, baseType: !142, size: 64, offset: 2816)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !90, file: !91, line: 105, baseType: !147, size: 32, offset: 2880)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !90, file: !91, line: 106, baseType: !216, size: 128, offset: 2944)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 128, elements: !223)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !91, line: 64, baseType: !219)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 61, size: 128, elements: !220)
!220 = !{!221, !222}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !219, file: !91, line: 62, baseType: !135, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !219, file: !91, line: 63, baseType: !87, size: 64, offset: 64)
!223 = !{!224}
!224 = !DISubrange(count: 2)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !90, file: !91, line: 107, baseType: !226, size: 64, offset: 3072)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 64, elements: !223)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !90, file: !91, line: 108, baseType: !87, size: 64, offset: 3136)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !90, file: !91, line: 109, baseType: !229, size: 64, offset: 3200)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!105, !87}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !90, file: !91, line: 111, baseType: !147, size: 32, offset: 3264)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !90, file: !91, line: 112, baseType: !234, size: 320, offset: 3328)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 320, elements: !280)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!105, !238, !88, !87}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !241)
!241 = !{!242, !243, !268, !269, !270, !271, !272, !273, !274, !275, !276}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !240, file: !12, line: 100, baseType: !147, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !240, file: !12, line: 101, baseType: !244, size: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !247)
!247 = !{!248, !249, !250, !251, !252, !255, !256, !257, !261, !263, !265, !266, !267}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !246, file: !12, line: 84, baseType: !174, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !246, file: !12, line: 85, baseType: !174, size: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !246, file: !12, line: 86, baseType: !87, size: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !246, file: !12, line: 87, baseType: !166, size: 64, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !246, file: !12, line: 88, baseType: !253, size: 64, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !124)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !246, file: !12, line: 89, baseType: !126, size: 8, offset: 320)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !246, file: !12, line: 90, baseType: !174, size: 64, offset: 384)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !246, file: !12, line: 91, baseType: !258, size: 64, offset: 448)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !259, line: 46, baseType: !260)
!259 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!260 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !246, file: !12, line: 92, baseType: !262, size: 32, offset: 512)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !246, file: !12, line: 93, baseType: !264, size: 32, offset: 544)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !246, file: !12, line: 94, baseType: !244, size: 64, offset: 576)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !246, file: !12, line: 95, baseType: !174, size: 64, offset: 640)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !246, file: !12, line: 96, baseType: !87, size: 64, offset: 704)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !240, file: !12, line: 102, baseType: !174, size: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !240, file: !12, line: 102, baseType: !174, size: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !240, file: !12, line: 103, baseType: !174, size: 64, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !240, file: !12, line: 104, baseType: !84, size: 64, offset: 320)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !240, file: !12, line: 105, baseType: !262, size: 32, offset: 384)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !240, file: !12, line: 105, baseType: !262, size: 32, offset: 416)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !240, file: !12, line: 105, baseType: !262, size: 32, offset: 448)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !240, file: !12, line: 106, baseType: !88, size: 64, offset: 512)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !240, file: !12, line: 107, baseType: !277, size: 64, offset: 576)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!280 = !{!281}
!281 = !DISubrange(count: 5)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !90, file: !91, line: 113, baseType: !283, size: 320, offset: 3648)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !284, size: 320, elements: !280)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!105, !88, !87}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !90, file: !91, line: 114, baseType: !288, size: 320, offset: 3968)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 320, elements: !280)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !90, file: !91, line: 115, baseType: !262, size: 32, offset: 4288)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !90, file: !91, line: 120, baseType: !277, size: 64, offset: 4352)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !90, file: !91, line: 121, baseType: !262, size: 32, offset: 4416)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectDestroyFunction", file: !91, line: 130, baseType: !116)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectViewFunction", file: !91, line: 131, baseType: !108)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !296, line: 1451, baseType: !135)
!296 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !53, line: 331, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !53, line: 331, flags: DIFlagFwdDecl)
!300 = !{!0, !301, !304, !306, !310, !312, !314, !316, !318, !320, !322, !324, !326}
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "CharacteristicRegisterAllCalled", scope: !2, file: !303, line: 14, type: !262, isLocal: false, isDefinition: true)
!303 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ts/characteristic/interface/characteristic.c", directory: "/home/users/ndemeye/xSDK")
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "CHARACTERISTIC_CLASSID", scope: !2, file: !303, line: 6, type: !94, isLocal: false, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "CHARACTERISTIC_SetUp", scope: !2, file: !303, line: 7, type: !308, isLocal: false, isDefinition: true)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogEvent", file: !309, line: 80, baseType: !95)
!309 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "CHARACTERISTIC_Solve", scope: !2, file: !303, line: 7, type: !308, isLocal: false, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "CHARACTERISTIC_QueueSetup", scope: !2, file: !303, line: 7, type: !308, isLocal: false, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "CHARACTERISTIC_DAUpdate", scope: !2, file: !303, line: 7, type: !308, isLocal: false, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "CHARACTERISTIC_HalfTimeLocal", scope: !2, file: !303, line: 8, type: !308, isLocal: false, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "CHARACTERISTIC_HalfTimeRemote", scope: !2, file: !303, line: 8, type: !308, isLocal: false, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "CHARACTERISTIC_HalfTimeExchange", scope: !2, file: !303, line: 8, type: !308, isLocal: false, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "CHARACTERISTIC_FullTimeLocal", scope: !2, file: !303, line: 9, type: !308, isLocal: false, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "CHARACTERISTIC_FullTimeRemote", scope: !2, file: !303, line: 9, type: !308, isLocal: false, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "CHARACTERISTIC_FullTimeExchange", scope: !2, file: !303, line: 9, type: !308, isLocal: false, isDefinition: true)
!328 = !{i32 7, !"Dwarf Version", i32 4}
!329 = !{i32 2, !"Debug Info Version", i32 3}
!330 = !{i32 1, !"wchar_size", i32 4}
!331 = !{i32 7, !"PIC Level", i32 2}
!332 = !{i32 7, !"uwtable", i32 1}
!333 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!334 = distinct !DISubprogram(name: "CharacteristicView", scope: !303, file: !303, line: 23, type: !335, scopeLine: 24, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !437)
!335 = !DISubroutineType(types: !336)
!336 = !{!105, !337, !111}
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "Characteristic", file: !338, line: 19, baseType: !339)
!338 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsccharacteristic.h", directory: "/home/users/ndemeye/xSDK")
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Characteristic", file: !341, line: 41, size: 6848, elements: !342)
!341 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/characteristicimpl.h", directory: "/home/users/ndemeye/xSDK")
!342 = !{!343, !345, !356, !357, !358, !359, !363, !368, !369, !370, !371, !375, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !417, !418, !419, !420, !421, !426, !436}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !340, file: !341, line: 42, baseType: !344, size: 4480)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !91, line: 122, baseType: !90)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !340, file: !341, line: 42, baseType: !346, size: 192, offset: 4480)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 192, elements: !143)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CharacteristicOps", file: !341, line: 35, size: 192, elements: !348)
!348 = !{!349, !351, !355}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !347, file: !341, line: 36, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !347, file: !341, line: 37, baseType: !352, size: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!105, !337}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !347, file: !341, line: 38, baseType: !352, size: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !340, file: !341, line: 43, baseType: !147, size: 32, offset: 4672)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "structured", scope: !340, file: !341, line: 44, baseType: !262, size: 32, offset: 4704)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "numIds", scope: !340, file: !341, line: 45, baseType: !147, size: 32, offset: 4736)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "velocityDA", scope: !340, file: !341, line: 47, baseType: !360, size: 64, offset: 4800)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !60, line: 14, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !60, line: 14, flags: DIFlagFwdDecl)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "velocity", scope: !340, file: !341, line: 48, baseType: !364, size: 64, offset: 4864)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !365, line: 21, baseType: !366)
!365 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !365, line: 21, flags: DIFlagFwdDecl)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "velocityOld", scope: !340, file: !341, line: 49, baseType: !364, size: 64, offset: 4928)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "numVelocityComp", scope: !340, file: !341, line: 50, baseType: !147, size: 32, offset: 4992)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "velocityComp", scope: !340, file: !341, line: 51, baseType: !192, size: 64, offset: 5056)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "velocityInterp", scope: !340, file: !341, line: 52, baseType: !372, size: 64, offset: 5120)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!105, !364, !200, !147, !192, !209, !87}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "velocityInterpLocal", scope: !340, file: !341, line: 53, baseType: !376, size: 64, offset: 5184)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!105, !87, !200, !147, !192, !209, !87}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "velocityCtx", scope: !340, file: !341, line: 54, baseType: !87, size: 64, offset: 5248)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "fieldDA", scope: !340, file: !341, line: 56, baseType: !360, size: 64, offset: 5312)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !340, file: !341, line: 57, baseType: !364, size: 64, offset: 5376)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "fieldOld", scope: !340, file: !341, line: 58, baseType: !364, size: 64, offset: 5440)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "numFieldComp", scope: !340, file: !341, line: 59, baseType: !147, size: 32, offset: 5504)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "fieldComp", scope: !340, file: !341, line: 60, baseType: !192, size: 64, offset: 5568)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "fieldInterp", scope: !340, file: !341, line: 61, baseType: !372, size: 64, offset: 5632)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "fieldInterpLocal", scope: !340, file: !341, line: 62, baseType: !376, size: 64, offset: 5696)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "fieldCtx", scope: !340, file: !341, line: 63, baseType: !87, size: 64, offset: 5760)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "itemType", scope: !340, file: !341, line: 65, baseType: !297, size: 64, offset: 5824)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !340, file: !341, line: 66, baseType: !390, size: 64, offset: 5888)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "Queue", file: !341, line: 33, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "CharacteristicPointDA2D", file: !341, line: 31, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Item", file: !341, line: 25, size: 1024, elements: !394)
!394 = !{!395, !396, !397, !398, !399, !400, !401, !402}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !393, file: !341, line: 26, baseType: !95, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !393, file: !341, line: 27, baseType: !95, size: 32, offset: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !393, file: !341, line: 27, baseType: !95, size: 32, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !393, file: !341, line: 28, baseType: !210, size: 64, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !393, file: !341, line: 28, baseType: !210, size: 64, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !393, file: !341, line: 29, baseType: !210, size: 64, offset: 256)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !393, file: !341, line: 29, baseType: !210, size: 64, offset: 320)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !393, file: !341, line: 30, baseType: !403, size: 640, offset: 384)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 640, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 10)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "queueSize", scope: !340, file: !341, line: 67, baseType: !147, size: 32, offset: 5952)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "queueMax", scope: !340, file: !341, line: 68, baseType: !147, size: 32, offset: 5984)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "queueLocal", scope: !340, file: !341, line: 69, baseType: !390, size: 64, offset: 6016)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "queueLocalSize", scope: !340, file: !341, line: 70, baseType: !147, size: 32, offset: 6080)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "queueLocalMax", scope: !340, file: !341, line: 71, baseType: !147, size: 32, offset: 6112)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "queueRemote", scope: !340, file: !341, line: 72, baseType: !390, size: 64, offset: 6144)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "queueRemoteSize", scope: !340, file: !341, line: 73, baseType: !147, size: 32, offset: 6208)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "queueRemoteMax", scope: !340, file: !341, line: 74, baseType: !147, size: 32, offset: 6240)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "numNeighbors", scope: !340, file: !341, line: 75, baseType: !147, size: 32, offset: 6272)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "neighbors", scope: !340, file: !341, line: 76, baseType: !416, size: 64, offset: 6336)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "needCount", scope: !340, file: !341, line: 77, baseType: !192, size: 64, offset: 6400)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "localOffsets", scope: !340, file: !341, line: 78, baseType: !192, size: 64, offset: 6464)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "fillCount", scope: !340, file: !341, line: 79, baseType: !192, size: 64, offset: 6528)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "remoteOffsets", scope: !340, file: !341, line: 80, baseType: !192, size: 64, offset: 6592)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !340, file: !341, line: 81, baseType: !422, size: 64, offset: 6656)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !53, line: 339, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !53, line: 339, flags: DIFlagFwdDecl)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !340, file: !341, line: 82, baseType: !427, size: 64, offset: 6720)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !53, line: 341, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !53, line: 351, size: 192, elements: !430)
!430 = !{!431, !432, !433, !434, !435}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !429, file: !53, line: 354, baseType: !95, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !429, file: !53, line: 355, baseType: !95, size: 32, offset: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !429, file: !53, line: 356, baseType: !95, size: 32, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !429, file: !53, line: 361, baseType: !95, size: 32, offset: 96)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !429, file: !53, line: 362, baseType: !258, size: 64, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !340, file: !341, line: 83, baseType: !87, size: 64, offset: 6784)
!437 = !{!438, !439, !440, !441, !442, !446, !448, !449, !451, !457, !458, !460}
!438 = !DILocalVariable(name: "c", arg: 1, scope: !334, file: !303, line: 23, type: !337)
!439 = !DILocalVariable(name: "viewer", arg: 2, scope: !334, file: !303, line: 23, type: !111)
!440 = !DILocalVariable(name: "iascii", scope: !334, file: !303, line: 25, type: !262)
!441 = !DILocalVariable(name: "ierr", scope: !334, file: !303, line: 26, type: !105)
!442 = !DILocalVariable(name: "ierr__", scope: !443, file: !303, line: 31, type: !105)
!443 = distinct !DILexicalBlock(scope: !444, file: !303, line: 31, column: 79)
!444 = distinct !DILexicalBlock(scope: !445, file: !303, line: 30, column: 16)
!445 = distinct !DILexicalBlock(scope: !334, file: !303, line: 30, column: 7)
!446 = !DILocalVariable(name: "_7_ierr", scope: !447, file: !303, line: 34, type: !105)
!447 = distinct !DILexicalBlock(scope: !334, file: !303, line: 34, column: 3)
!448 = !DILocalVariable(name: "_7_flag", scope: !447, file: !303, line: 34, type: !164)
!449 = !DILocalVariable(name: "_7_errorcode", scope: !450, file: !303, line: 34, type: !105)
!450 = distinct !DILexicalBlock(scope: !447, file: !303, line: 34, column: 3)
!451 = !DILocalVariable(name: "_7_errorstring", scope: !452, file: !303, line: 34, type: !454)
!452 = distinct !DILexicalBlock(scope: !453, file: !303, line: 34, column: 3)
!453 = distinct !DILexicalBlock(scope: !450, file: !303, line: 34, column: 3)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 2048, elements: !455)
!455 = !{!456}
!456 = !DISubrange(count: 256)
!457 = !DILocalVariable(name: "_7_resultlen", scope: !452, file: !303, line: 34, type: !164)
!458 = !DILocalVariable(name: "ierr__", scope: !459, file: !303, line: 36, type: !105)
!459 = distinct !DILexicalBlock(scope: !334, file: !303, line: 36, column: 82)
!460 = !DILocalVariable(name: "ierr__", scope: !461, file: !303, line: 39, type: !105)
!461 = distinct !DILexicalBlock(scope: !462, file: !303, line: 39, column: 41)
!462 = distinct !DILexicalBlock(scope: !463, file: !303, line: 38, column: 23)
!463 = distinct !DILexicalBlock(scope: !464, file: !303, line: 38, column: 9)
!464 = distinct !DILexicalBlock(scope: !465, file: !303, line: 37, column: 16)
!465 = distinct !DILexicalBlock(scope: !334, file: !303, line: 37, column: 7)
!466 = !DILocation(line: 0, scope: !334)
!467 = !{!468, !468, i64 0}
!468 = !{!"any pointer", !469, i64 0}
!469 = !{!"omnipotent char", !470, i64 0}
!470 = !{!"Simple C/C++ TBAA"}
!471 = !DILocation(line: 25, column: 3, scope: !334)
!472 = !DILocation(line: 28, column: 3, scope: !473)
!473 = distinct !DILexicalBlock(scope: !474, file: !303, line: 28, column: 3)
!474 = distinct !DILexicalBlock(scope: !475, file: !303, line: 28, column: 3)
!475 = distinct !DILexicalBlock(scope: !334, file: !303, line: 28, column: 3)
!476 = !DILocation(line: 28, column: 3, scope: !474)
!477 = !DILocation(line: 28, column: 3, scope: !478)
!478 = distinct !DILexicalBlock(scope: !479, file: !303, line: 28, column: 3)
!479 = distinct !DILexicalBlock(scope: !473, file: !303, line: 28, column: 3)
!480 = !{!481, !482, i64 1536}
!481 = !{!"", !469, i64 0, !469, i64 512, !469, i64 1024, !469, i64 1280, !482, i64 1536, !482, i64 1540, !469, i64 1544}
!482 = !{!"int", !469, i64 0}
!483 = !DILocation(line: 28, column: 3, scope: !479)
!484 = !DILocation(line: 28, column: 3, scope: !485)
!485 = distinct !DILexicalBlock(scope: !478, file: !303, line: 28, column: 3)
!486 = !{!482, !482, i64 0}
!487 = !{!481, !482, i64 1540}
!488 = !DILocation(line: 29, column: 3, scope: !489)
!489 = distinct !DILexicalBlock(scope: !490, file: !303, line: 29, column: 3)
!490 = distinct !DILexicalBlock(scope: !334, file: !303, line: 29, column: 3)
!491 = !DILocation(line: 29, column: 3, scope: !490)
!492 = !DILocation(line: 29, column: 3, scope: !493)
!493 = distinct !DILexicalBlock(scope: !490, file: !303, line: 29, column: 3)
!494 = !DILocation(line: 29, column: 3, scope: !495)
!495 = distinct !DILexicalBlock(scope: !490, file: !303, line: 29, column: 3)
!496 = !{!497, !482, i64 0}
!497 = !{!"_p_PetscObject", !482, i64 0, !469, i64 8, !468, i64 64, !482, i64 72, !498, i64 80, !498, i64 88, !498, i64 96, !498, i64 104, !499, i64 112, !482, i64 120, !482, i64 124, !468, i64 128, !468, i64 136, !468, i64 144, !468, i64 152, !468, i64 160, !468, i64 168, !468, i64 176, !499, i64 184, !468, i64 192, !468, i64 200, !482, i64 208, !468, i64 216, !499, i64 224, !482, i64 232, !482, i64 236, !468, i64 240, !468, i64 248, !468, i64 256, !468, i64 264, !482, i64 272, !482, i64 276, !468, i64 280, !468, i64 288, !468, i64 296, !468, i64 304, !482, i64 312, !482, i64 316, !468, i64 320, !468, i64 328, !468, i64 336, !468, i64 344, !468, i64 352, !482, i64 360, !469, i64 368, !469, i64 384, !468, i64 392, !468, i64 400, !482, i64 408, !469, i64 416, !469, i64 456, !469, i64 496, !469, i64 536, !468, i64 544, !469, i64 552}
!498 = !{!"double", !469, i64 0}
!499 = !{!"long", !469, i64 0}
!500 = !DILocation(line: 29, column: 3, scope: !501)
!501 = distinct !DILexicalBlock(scope: !502, file: !303, line: 29, column: 3)
!502 = distinct !DILexicalBlock(scope: !495, file: !303, line: 29, column: 3)
!503 = !DILocation(line: 29, column: 3, scope: !502)
!504 = !DILocation(line: 30, column: 8, scope: !445)
!505 = !DILocation(line: 30, column: 7, scope: !334)
!506 = !DILocation(line: 31, column: 38, scope: !444)
!507 = !DILocation(line: 31, column: 12, scope: !444)
!508 = !DILocation(line: 0, scope: !443)
!509 = !DILocation(line: 31, column: 79, scope: !510)
!510 = distinct !DILexicalBlock(scope: !443, file: !303, line: 31, column: 79)
!511 = !DILocation(line: 31, column: 79, scope: !443)
!512 = !{!"branch_weights", i32 2000, i32 1}
!513 = !DILocation(line: 33, column: 3, scope: !514)
!514 = distinct !DILexicalBlock(scope: !515, file: !303, line: 33, column: 3)
!515 = distinct !DILexicalBlock(scope: !334, file: !303, line: 33, column: 3)
!516 = !DILocation(line: 33, column: 3, scope: !515)
!517 = !DILocation(line: 33, column: 3, scope: !518)
!518 = distinct !DILexicalBlock(scope: !515, file: !303, line: 33, column: 3)
!519 = !DILocation(line: 33, column: 3, scope: !520)
!520 = distinct !DILexicalBlock(scope: !515, file: !303, line: 33, column: 3)
!521 = !DILocation(line: 33, column: 3, scope: !522)
!522 = distinct !DILexicalBlock(scope: !523, file: !303, line: 33, column: 3)
!523 = distinct !DILexicalBlock(scope: !520, file: !303, line: 33, column: 3)
!524 = !DILocation(line: 33, column: 3, scope: !523)
!525 = !DILocation(line: 34, column: 3, scope: !447)
!526 = !DILocation(line: 0, scope: !447)
!527 = !DILocation(line: 0, scope: !450)
!528 = !DILocation(line: 34, column: 3, scope: !453)
!529 = !DILocation(line: 34, column: 3, scope: !450)
!530 = !DILocation(line: 34, column: 3, scope: !452)
!531 = !DILocation(line: 0, scope: !452)
!532 = !DILocation(line: 34, column: 3, scope: !533)
!533 = distinct !DILexicalBlock(scope: !447, file: !303, line: 34, column: 3)
!534 = !DILocation(line: 34, column: 3, scope: !334)
!535 = !DILocation(line: 36, column: 47, scope: !334)
!536 = !DILocation(line: 36, column: 10, scope: !334)
!537 = !DILocation(line: 0, scope: !459)
!538 = !DILocation(line: 36, column: 82, scope: !539)
!539 = distinct !DILexicalBlock(scope: !459, file: !303, line: 36, column: 82)
!540 = !DILocation(line: 36, column: 82, scope: !459)
!541 = !DILocation(line: 37, column: 8, scope: !465)
!542 = !{!469, !469, i64 0}
!543 = !DILocation(line: 37, column: 7, scope: !334)
!544 = !DILocation(line: 38, column: 17, scope: !463)
!545 = !{!546, !468, i64 0}
!546 = !{!"_CharacteristicOps", !468, i64 0, !468, i64 8, !468, i64 16}
!547 = !DILocation(line: 38, column: 9, scope: !463)
!548 = !DILocation(line: 38, column: 9, scope: !464)
!549 = !DILocation(line: 39, column: 33, scope: !462)
!550 = !DILocation(line: 39, column: 14, scope: !462)
!551 = !DILocation(line: 0, scope: !461)
!552 = !DILocation(line: 39, column: 41, scope: !553)
!553 = distinct !DILexicalBlock(scope: !461, file: !303, line: 39, column: 41)
!554 = !DILocation(line: 39, column: 41, scope: !461)
!555 = !DILocation(line: 42, column: 3, scope: !556)
!556 = distinct !DILexicalBlock(scope: !557, file: !303, line: 42, column: 3)
!557 = distinct !DILexicalBlock(scope: !558, file: !303, line: 42, column: 3)
!558 = distinct !DILexicalBlock(scope: !334, file: !303, line: 42, column: 3)
!559 = !DILocation(line: 42, column: 3, scope: !557)
!560 = !DILocation(line: 42, column: 3, scope: !561)
!561 = distinct !DILexicalBlock(scope: !562, file: !303, line: 42, column: 3)
!562 = distinct !DILexicalBlock(scope: !556, file: !303, line: 42, column: 3)
!563 = !DILocation(line: 42, column: 3, scope: !562)
!564 = !DILocation(line: 42, column: 3, scope: !565)
!565 = distinct !DILexicalBlock(scope: !566, file: !303, line: 42, column: 3)
!566 = distinct !DILexicalBlock(scope: !561, file: !303, line: 42, column: 3)
!567 = !{!481, !469, i64 1544}
!568 = !DILocation(line: 42, column: 3, scope: !566)
!569 = !DILocation(line: 42, column: 3, scope: !570)
!570 = distinct !DILexicalBlock(scope: !565, file: !303, line: 42, column: 3)
!571 = !DILocation(line: 42, column: 3, scope: !572)
!572 = distinct !DILexicalBlock(scope: !561, file: !303, line: 42, column: 3)
!573 = !DILocation(line: 42, column: 3, scope: !574)
!574 = distinct !DILexicalBlock(scope: !572, file: !303, line: 42, column: 3)
!575 = !DILocation(line: 42, column: 3, scope: !576)
!576 = distinct !DILexicalBlock(scope: !577, file: !303, line: 42, column: 3)
!577 = distinct !DILexicalBlock(scope: !574, file: !303, line: 42, column: 3)
!578 = !DILocation(line: 42, column: 3, scope: !577)
!579 = !DILocation(line: 42, column: 3, scope: !580)
!580 = distinct !DILexicalBlock(scope: !576, file: !303, line: 42, column: 3)
!581 = !DILocation(line: 43, column: 1, scope: !334)
!582 = !DISubprogram(name: "PetscError", scope: !27, file: !27, line: 668, type: !583, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !585)
!583 = !DISubroutineType(types: !584)
!584 = !{!105, !85, !95, !124, !124, !95, !26, !124, null}
!585 = !{}
!586 = !DISubprogram(name: "PetscCheckPointer", scope: !91, file: !91, line: 183, type: !587, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !585)
!587 = !DISubroutineType(types: !588)
!588 = !{!5, !589, !32}
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!591 = !DISubprogram(name: "PetscViewerASCIIGetStdout", scope: !592, file: !592, line: 282, type: !593, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !585)
!592 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewer.h", directory: "/home/users/ndemeye/xSDK")
!593 = !DISubroutineType(types: !594)
!594 = !{!95, !85, !595}
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!596 = !DISubprogram(name: "PetscObjectComm", scope: !296, file: !296, line: 2649, type: !597, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !585)
!597 = !DISubroutineType(types: !598)
!598 = !{!85, !89}
!599 = !DISubprogram(name: "MPI_Comm_compare", scope: !53, file: !53, line: 1277, type: !600, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !585)
!600 = !DISubroutineType(types: !601)
!601 = !{!95, !85, !85, !602}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!603 = !DISubprogram(name: "MPI_Error_string", scope: !53, file: !53, line: 1357, type: !604, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !585)
!604 = !DISubroutineType(types: !605)
!605 = !{!95, !95, !174, !602}
!606 = !DISubprogram(name: "PetscObjectTypeCompare", scope: !296, file: !296, line: 1505, type: !607, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !585)
!607 = !DISubroutineType(types: !608)
!608 = !{!95, !89, !124, !609}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!610 = distinct !DISubprogram(name: "CharacteristicDestroy", scope: !303, file: !303, line: 45, type: !611, scopeLine: 46, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !614)
!611 = !DISubroutineType(types: !612)
!612 = !{!105, !613}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!614 = !{!615, !616, !617, !621, !623, !626, !627, !629, !631, !633, !635, !637, !639, !641, !643, !645, !647}
!615 = !DILocalVariable(name: "c", arg: 1, scope: !610, file: !303, line: 45, type: !613)
!616 = !DILocalVariable(name: "ierr", scope: !610, file: !303, line: 47, type: !105)
!617 = !DILocalVariable(name: "ierr__", scope: !618, file: !303, line: 55, type: !105)
!618 = distinct !DILexicalBlock(scope: !619, file: !303, line: 55, column: 40)
!619 = distinct !DILexicalBlock(scope: !620, file: !303, line: 54, column: 27)
!620 = distinct !DILexicalBlock(scope: !610, file: !303, line: 54, column: 7)
!621 = !DILocalVariable(name: "_7_errorcode", scope: !622, file: !303, line: 57, type: !105)
!622 = distinct !DILexicalBlock(scope: !610, file: !303, line: 57, column: 41)
!623 = !DILocalVariable(name: "_7_errorstring", scope: !624, file: !303, line: 57, type: !454)
!624 = distinct !DILexicalBlock(scope: !625, file: !303, line: 57, column: 41)
!625 = distinct !DILexicalBlock(scope: !622, file: !303, line: 57, column: 41)
!626 = !DILocalVariable(name: "_7_resultlen", scope: !624, file: !303, line: 57, type: !164)
!627 = !DILocalVariable(name: "ierr__", scope: !628, file: !303, line: 58, type: !105)
!628 = distinct !DILexicalBlock(scope: !610, file: !303, line: 58, column: 33)
!629 = !DILocalVariable(name: "ierr__", scope: !630, file: !303, line: 59, type: !105)
!630 = distinct !DILexicalBlock(scope: !610, file: !303, line: 59, column: 38)
!631 = !DILocalVariable(name: "ierr__", scope: !632, file: !303, line: 60, type: !105)
!632 = distinct !DILexicalBlock(scope: !610, file: !303, line: 60, column: 39)
!633 = !DILocalVariable(name: "ierr__", scope: !634, file: !303, line: 61, type: !105)
!634 = distinct !DILexicalBlock(scope: !610, file: !303, line: 61, column: 37)
!635 = !DILocalVariable(name: "ierr__", scope: !636, file: !303, line: 62, type: !105)
!636 = distinct !DILexicalBlock(scope: !610, file: !303, line: 62, column: 37)
!637 = !DILocalVariable(name: "ierr__", scope: !638, file: !303, line: 63, type: !105)
!638 = distinct !DILexicalBlock(scope: !610, file: !303, line: 63, column: 40)
!639 = !DILocalVariable(name: "ierr__", scope: !640, file: !303, line: 64, type: !105)
!640 = distinct !DILexicalBlock(scope: !610, file: !303, line: 64, column: 37)
!641 = !DILocalVariable(name: "ierr__", scope: !642, file: !303, line: 65, type: !105)
!642 = distinct !DILexicalBlock(scope: !610, file: !303, line: 65, column: 41)
!643 = !DILocalVariable(name: "ierr__", scope: !644, file: !303, line: 66, type: !105)
!644 = distinct !DILexicalBlock(scope: !610, file: !303, line: 66, column: 35)
!645 = !DILocalVariable(name: "ierr__", scope: !646, file: !303, line: 67, type: !105)
!646 = distinct !DILexicalBlock(scope: !610, file: !303, line: 67, column: 34)
!647 = !DILocalVariable(name: "ierr__", scope: !648, file: !303, line: 68, type: !105)
!648 = distinct !DILexicalBlock(scope: !610, file: !303, line: 68, column: 32)
!649 = !DILocation(line: 0, scope: !610)
!650 = !DILocation(line: 49, column: 3, scope: !651)
!651 = distinct !DILexicalBlock(scope: !652, file: !303, line: 49, column: 3)
!652 = distinct !DILexicalBlock(scope: !653, file: !303, line: 49, column: 3)
!653 = distinct !DILexicalBlock(scope: !610, file: !303, line: 49, column: 3)
!654 = !DILocation(line: 49, column: 3, scope: !652)
!655 = !DILocation(line: 49, column: 3, scope: !656)
!656 = distinct !DILexicalBlock(scope: !657, file: !303, line: 49, column: 3)
!657 = distinct !DILexicalBlock(scope: !651, file: !303, line: 49, column: 3)
!658 = !DILocation(line: 49, column: 3, scope: !657)
!659 = !DILocation(line: 49, column: 3, scope: !660)
!660 = distinct !DILexicalBlock(scope: !656, file: !303, line: 49, column: 3)
!661 = !DILocation(line: 50, column: 8, scope: !662)
!662 = distinct !DILexicalBlock(scope: !610, file: !303, line: 50, column: 7)
!663 = !DILocation(line: 50, column: 7, scope: !610)
!664 = !DILocation(line: 50, column: 12, scope: !665)
!665 = distinct !DILexicalBlock(scope: !666, file: !303, line: 50, column: 12)
!666 = distinct !DILexicalBlock(scope: !667, file: !303, line: 50, column: 12)
!667 = distinct !DILexicalBlock(scope: !668, file: !303, line: 50, column: 12)
!668 = distinct !DILexicalBlock(scope: !669, file: !303, line: 50, column: 12)
!669 = distinct !DILexicalBlock(scope: !662, file: !303, line: 50, column: 12)
!670 = !DILocation(line: 50, column: 12, scope: !666)
!671 = !DILocation(line: 50, column: 12, scope: !672)
!672 = distinct !DILexicalBlock(scope: !673, file: !303, line: 50, column: 12)
!673 = distinct !DILexicalBlock(scope: !665, file: !303, line: 50, column: 12)
!674 = !DILocation(line: 50, column: 12, scope: !673)
!675 = !DILocation(line: 50, column: 12, scope: !676)
!676 = distinct !DILexicalBlock(scope: !672, file: !303, line: 50, column: 12)
!677 = !DILocation(line: 50, column: 12, scope: !678)
!678 = distinct !DILexicalBlock(scope: !665, file: !303, line: 50, column: 12)
!679 = !DILocation(line: 50, column: 12, scope: !680)
!680 = distinct !DILexicalBlock(scope: !678, file: !303, line: 50, column: 12)
!681 = !DILocation(line: 50, column: 12, scope: !682)
!682 = distinct !DILexicalBlock(scope: !683, file: !303, line: 50, column: 12)
!683 = distinct !DILexicalBlock(scope: !680, file: !303, line: 50, column: 12)
!684 = !DILocation(line: 50, column: 12, scope: !683)
!685 = !DILocation(line: 50, column: 12, scope: !686)
!686 = distinct !DILexicalBlock(scope: !682, file: !303, line: 50, column: 12)
!687 = !DILocation(line: 51, column: 3, scope: !688)
!688 = distinct !DILexicalBlock(scope: !689, file: !303, line: 51, column: 3)
!689 = distinct !DILexicalBlock(scope: !610, file: !303, line: 51, column: 3)
!690 = !DILocation(line: 51, column: 3, scope: !689)
!691 = !DILocation(line: 51, column: 3, scope: !692)
!692 = distinct !DILexicalBlock(scope: !689, file: !303, line: 51, column: 3)
!693 = !DILocation(line: 51, column: 3, scope: !694)
!694 = distinct !DILexicalBlock(scope: !695, file: !303, line: 51, column: 3)
!695 = distinct !DILexicalBlock(scope: !692, file: !303, line: 51, column: 3)
!696 = !DILocation(line: 51, column: 3, scope: !695)
!697 = !DILocation(line: 52, column: 30, scope: !698)
!698 = distinct !DILexicalBlock(scope: !610, file: !303, line: 52, column: 7)
!699 = !DILocation(line: 52, column: 7, scope: !698)
!700 = !{!497, !482, i64 120}
!701 = !DILocation(line: 52, column: 36, scope: !698)
!702 = !DILocation(line: 52, column: 7, scope: !610)
!703 = !DILocation(line: 52, column: 41, scope: !704)
!704 = distinct !DILexicalBlock(scope: !705, file: !303, line: 52, column: 41)
!705 = distinct !DILexicalBlock(scope: !706, file: !303, line: 52, column: 41)
!706 = distinct !DILexicalBlock(scope: !698, file: !303, line: 52, column: 41)
!707 = !DILocation(line: 52, column: 41, scope: !705)
!708 = !DILocation(line: 52, column: 41, scope: !709)
!709 = distinct !DILexicalBlock(scope: !710, file: !303, line: 52, column: 41)
!710 = distinct !DILexicalBlock(scope: !704, file: !303, line: 52, column: 41)
!711 = !DILocation(line: 52, column: 41, scope: !710)
!712 = !DILocation(line: 52, column: 41, scope: !713)
!713 = distinct !DILexicalBlock(scope: !714, file: !303, line: 52, column: 41)
!714 = distinct !DILexicalBlock(scope: !709, file: !303, line: 52, column: 41)
!715 = !DILocation(line: 52, column: 41, scope: !714)
!716 = !DILocation(line: 52, column: 41, scope: !717)
!717 = distinct !DILexicalBlock(scope: !713, file: !303, line: 52, column: 41)
!718 = !DILocation(line: 52, column: 41, scope: !719)
!719 = distinct !DILexicalBlock(scope: !709, file: !303, line: 52, column: 41)
!720 = !DILocation(line: 52, column: 41, scope: !721)
!721 = distinct !DILexicalBlock(scope: !719, file: !303, line: 52, column: 41)
!722 = !DILocation(line: 52, column: 41, scope: !723)
!723 = distinct !DILexicalBlock(scope: !724, file: !303, line: 52, column: 41)
!724 = distinct !DILexicalBlock(scope: !721, file: !303, line: 52, column: 41)
!725 = !DILocation(line: 52, column: 41, scope: !724)
!726 = !DILocation(line: 52, column: 41, scope: !727)
!727 = distinct !DILexicalBlock(scope: !723, file: !303, line: 52, column: 41)
!728 = !DILocation(line: 54, column: 18, scope: !620)
!729 = !{!546, !468, i64 8}
!730 = !DILocation(line: 54, column: 7, scope: !620)
!731 = !DILocation(line: 54, column: 7, scope: !610)
!732 = !DILocation(line: 55, column: 12, scope: !619)
!733 = !DILocation(line: 0, scope: !618)
!734 = !DILocation(line: 55, column: 40, scope: !735)
!735 = distinct !DILexicalBlock(scope: !618, file: !303, line: 55, column: 40)
!736 = !DILocation(line: 55, column: 40, scope: !618)
!737 = !DILocation(line: 57, column: 26, scope: !610)
!738 = !DILocation(line: 57, column: 31, scope: !610)
!739 = !DILocation(line: 57, column: 10, scope: !610)
!740 = !DILocation(line: 0, scope: !622)
!741 = !DILocation(line: 57, column: 41, scope: !625)
!742 = !DILocation(line: 57, column: 41, scope: !622)
!743 = !DILocation(line: 57, column: 41, scope: !624)
!744 = !DILocation(line: 0, scope: !624)
!745 = !DILocation(line: 58, column: 10, scope: !610)
!746 = !{!747, !468, i64 736}
!747 = !{!"_p_Characteristic", !497, i64 0, !469, i64 560, !482, i64 584, !469, i64 588, !482, i64 592, !468, i64 600, !468, i64 608, !468, i64 616, !482, i64 624, !468, i64 632, !468, i64 640, !468, i64 648, !468, i64 656, !468, i64 664, !468, i64 672, !468, i64 680, !482, i64 688, !468, i64 696, !468, i64 704, !468, i64 712, !468, i64 720, !468, i64 728, !468, i64 736, !482, i64 744, !482, i64 748, !468, i64 752, !482, i64 760, !482, i64 764, !468, i64 768, !482, i64 776, !482, i64 780, !482, i64 784, !468, i64 792, !468, i64 800, !468, i64 808, !468, i64 816, !468, i64 824, !468, i64 832, !468, i64 840, !468, i64 848}
!748 = !DILocation(line: 0, scope: !628)
!749 = !DILocation(line: 58, column: 33, scope: !750)
!750 = distinct !DILexicalBlock(scope: !628, file: !303, line: 58, column: 33)
!751 = !DILocation(line: 59, column: 10, scope: !610)
!752 = !{!747, !468, i64 752}
!753 = !DILocation(line: 0, scope: !630)
!754 = !DILocation(line: 59, column: 38, scope: !755)
!755 = distinct !DILexicalBlock(scope: !630, file: !303, line: 59, column: 38)
!756 = !DILocation(line: 60, column: 10, scope: !610)
!757 = !{!747, !468, i64 768}
!758 = !DILocation(line: 0, scope: !632)
!759 = !DILocation(line: 60, column: 39, scope: !760)
!760 = distinct !DILexicalBlock(scope: !632, file: !303, line: 60, column: 39)
!761 = !DILocation(line: 61, column: 10, scope: !610)
!762 = !{!747, !468, i64 792}
!763 = !DILocation(line: 0, scope: !634)
!764 = !DILocation(line: 61, column: 37, scope: !765)
!765 = distinct !DILexicalBlock(scope: !634, file: !303, line: 61, column: 37)
!766 = !DILocation(line: 62, column: 10, scope: !610)
!767 = !{!747, !468, i64 800}
!768 = !DILocation(line: 0, scope: !636)
!769 = !DILocation(line: 62, column: 37, scope: !770)
!770 = distinct !DILexicalBlock(scope: !636, file: !303, line: 62, column: 37)
!771 = !DILocation(line: 63, column: 10, scope: !610)
!772 = !{!747, !468, i64 808}
!773 = !DILocation(line: 0, scope: !638)
!774 = !DILocation(line: 63, column: 40, scope: !775)
!775 = distinct !DILexicalBlock(scope: !638, file: !303, line: 63, column: 40)
!776 = !DILocation(line: 64, column: 10, scope: !610)
!777 = !{!747, !468, i64 816}
!778 = !DILocation(line: 0, scope: !640)
!779 = !DILocation(line: 64, column: 37, scope: !780)
!780 = distinct !DILexicalBlock(scope: !640, file: !303, line: 64, column: 37)
!781 = !DILocation(line: 65, column: 10, scope: !610)
!782 = !{!747, !468, i64 824}
!783 = !DILocation(line: 0, scope: !642)
!784 = !DILocation(line: 65, column: 41, scope: !785)
!785 = distinct !DILexicalBlock(scope: !642, file: !303, line: 65, column: 41)
!786 = !DILocation(line: 66, column: 10, scope: !610)
!787 = !{!747, !468, i64 832}
!788 = !DILocation(line: 0, scope: !644)
!789 = !DILocation(line: 66, column: 35, scope: !790)
!790 = distinct !DILexicalBlock(scope: !644, file: !303, line: 66, column: 35)
!791 = !DILocation(line: 67, column: 10, scope: !610)
!792 = !{!747, !468, i64 840}
!793 = !DILocation(line: 0, scope: !646)
!794 = !DILocation(line: 67, column: 34, scope: !795)
!795 = distinct !DILexicalBlock(scope: !646, file: !303, line: 67, column: 34)
!796 = !DILocation(line: 68, column: 10, scope: !610)
!797 = !{!"branch_weights", i32 2146410443, i32 1073205}
!798 = !DILocation(line: 0, scope: !648)
!799 = !DILocation(line: 68, column: 32, scope: !800)
!800 = distinct !DILexicalBlock(scope: !648, file: !303, line: 68, column: 32)
!801 = !DILocation(line: 69, column: 3, scope: !802)
!802 = distinct !DILexicalBlock(scope: !803, file: !303, line: 69, column: 3)
!803 = distinct !DILexicalBlock(scope: !804, file: !303, line: 69, column: 3)
!804 = distinct !DILexicalBlock(scope: !610, file: !303, line: 69, column: 3)
!805 = !DILocation(line: 69, column: 3, scope: !803)
!806 = !DILocation(line: 69, column: 3, scope: !807)
!807 = distinct !DILexicalBlock(scope: !808, file: !303, line: 69, column: 3)
!808 = distinct !DILexicalBlock(scope: !802, file: !303, line: 69, column: 3)
!809 = !DILocation(line: 69, column: 3, scope: !808)
!810 = !DILocation(line: 69, column: 3, scope: !811)
!811 = distinct !DILexicalBlock(scope: !812, file: !303, line: 69, column: 3)
!812 = distinct !DILexicalBlock(scope: !807, file: !303, line: 69, column: 3)
!813 = !DILocation(line: 69, column: 3, scope: !812)
!814 = !DILocation(line: 69, column: 3, scope: !815)
!815 = distinct !DILexicalBlock(scope: !811, file: !303, line: 69, column: 3)
!816 = !DILocation(line: 69, column: 3, scope: !817)
!817 = distinct !DILexicalBlock(scope: !807, file: !303, line: 69, column: 3)
!818 = !DILocation(line: 69, column: 3, scope: !819)
!819 = distinct !DILexicalBlock(scope: !817, file: !303, line: 69, column: 3)
!820 = !DILocation(line: 69, column: 3, scope: !821)
!821 = distinct !DILexicalBlock(scope: !822, file: !303, line: 69, column: 3)
!822 = distinct !DILexicalBlock(scope: !819, file: !303, line: 69, column: 3)
!823 = !DILocation(line: 69, column: 3, scope: !822)
!824 = !DILocation(line: 69, column: 3, scope: !825)
!825 = distinct !DILexicalBlock(scope: !821, file: !303, line: 69, column: 3)
!826 = !DILocation(line: 70, column: 1, scope: !610)
!827 = !DISubprogram(name: "MPI_Type_free", scope: !53, file: !53, line: 1778, type: !828, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !585)
!828 = !DISubroutineType(types: !829)
!829 = !{!95, !830}
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!831 = !DISubprogram(name: "PetscHeaderDestroy_Private", scope: !91, file: !91, line: 174, type: !832, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !585)
!832 = !DISubroutineType(types: !833)
!833 = !{!95, !89}
!834 = distinct !DISubprogram(name: "CharacteristicCreate", scope: !303, file: !303, line: 72, type: !835, scopeLine: 73, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !837)
!835 = !DISubroutineType(types: !836)
!836 = !{!105, !84, !613}
!837 = !{!838, !839, !840, !841, !842, !844}
!838 = !DILocalVariable(name: "comm", arg: 1, scope: !834, file: !303, line: 72, type: !84)
!839 = !DILocalVariable(name: "c", arg: 2, scope: !834, file: !303, line: 72, type: !613)
!840 = !DILocalVariable(name: "newC", scope: !834, file: !303, line: 74, type: !337)
!841 = !DILocalVariable(name: "ierr", scope: !834, file: !303, line: 75, type: !105)
!842 = !DILocalVariable(name: "ierr__", scope: !843, file: !303, line: 80, type: !105)
!843 = distinct !DILexicalBlock(scope: !834, file: !303, line: 80, column: 44)
!844 = !DILocalVariable(name: "ierr__", scope: !845, file: !303, line: 82, type: !105)
!845 = distinct !DILexicalBlock(scope: !834, file: !303, line: 82, column: 161)
!846 = !DILocation(line: 0, scope: !834)
!847 = !DILocation(line: 74, column: 3, scope: !834)
!848 = !DILocation(line: 77, column: 3, scope: !849)
!849 = distinct !DILexicalBlock(scope: !850, file: !303, line: 77, column: 3)
!850 = distinct !DILexicalBlock(scope: !851, file: !303, line: 77, column: 3)
!851 = distinct !DILexicalBlock(scope: !834, file: !303, line: 77, column: 3)
!852 = !DILocation(line: 77, column: 3, scope: !850)
!853 = !DILocation(line: 77, column: 3, scope: !854)
!854 = distinct !DILexicalBlock(scope: !855, file: !303, line: 77, column: 3)
!855 = distinct !DILexicalBlock(scope: !849, file: !303, line: 77, column: 3)
!856 = !DILocation(line: 77, column: 3, scope: !855)
!857 = !DILocation(line: 77, column: 3, scope: !858)
!858 = distinct !DILexicalBlock(scope: !854, file: !303, line: 77, column: 3)
!859 = !DILocation(line: 78, column: 3, scope: !860)
!860 = distinct !DILexicalBlock(scope: !861, file: !303, line: 78, column: 3)
!861 = distinct !DILexicalBlock(scope: !834, file: !303, line: 78, column: 3)
!862 = !DILocation(line: 78, column: 3, scope: !861)
!863 = !DILocation(line: 78, column: 3, scope: !864)
!864 = distinct !DILexicalBlock(scope: !861, file: !303, line: 78, column: 3)
!865 = !DILocation(line: 79, column: 6, scope: !834)
!866 = !DILocation(line: 80, column: 10, scope: !834)
!867 = !DILocation(line: 0, scope: !843)
!868 = !DILocation(line: 80, column: 44, scope: !869)
!869 = distinct !DILexicalBlock(scope: !843, file: !303, line: 80, column: 44)
!870 = !DILocation(line: 80, column: 44, scope: !843)
!871 = !DILocation(line: 82, column: 10, scope: !834)
!872 = !DILocation(line: 0, scope: !845)
!873 = !DILocation(line: 82, column: 161, scope: !845)
!874 = !DILocation(line: 82, column: 161, scope: !875)
!875 = distinct !DILexicalBlock(scope: !845, file: !303, line: 82, column: 161)
!876 = !DILocation(line: 83, column: 10, scope: !834)
!877 = !DILocation(line: 83, column: 8, scope: !834)
!878 = !DILocation(line: 85, column: 9, scope: !834)
!879 = !DILocation(line: 85, column: 29, scope: !834)
!880 = !{!747, !469, i64 588}
!881 = !DILocation(line: 86, column: 9, scope: !834)
!882 = !DILocation(line: 86, column: 29, scope: !834)
!883 = !{!747, !482, i64 592}
!884 = !DILocation(line: 87, column: 9, scope: !834)
!885 = !DILocation(line: 91, column: 9, scope: !834)
!886 = !DILocation(line: 97, column: 9, scope: !834)
!887 = !DILocation(line: 97, column: 29, scope: !834)
!888 = !{!747, !482, i64 688}
!889 = !DILocation(line: 98, column: 9, scope: !834)
!890 = !DILocation(line: 113, column: 9, scope: !834)
!891 = !DILocation(line: 120, column: 3, scope: !892)
!892 = distinct !DILexicalBlock(scope: !893, file: !303, line: 120, column: 3)
!893 = distinct !DILexicalBlock(scope: !894, file: !303, line: 120, column: 3)
!894 = distinct !DILexicalBlock(scope: !834, file: !303, line: 120, column: 3)
!895 = !DILocation(line: 87, column: 29, scope: !834)
!896 = !DILocation(line: 91, column: 29, scope: !834)
!897 = !DILocation(line: 98, column: 29, scope: !834)
!898 = !DILocation(line: 113, column: 29, scope: !834)
!899 = !DILocation(line: 120, column: 3, scope: !893)
!900 = !DILocation(line: 120, column: 3, scope: !901)
!901 = distinct !DILexicalBlock(scope: !902, file: !303, line: 120, column: 3)
!902 = distinct !DILexicalBlock(scope: !892, file: !303, line: 120, column: 3)
!903 = !DILocation(line: 120, column: 3, scope: !902)
!904 = !DILocation(line: 120, column: 3, scope: !905)
!905 = distinct !DILexicalBlock(scope: !906, file: !303, line: 120, column: 3)
!906 = distinct !DILexicalBlock(scope: !901, file: !303, line: 120, column: 3)
!907 = !DILocation(line: 120, column: 3, scope: !906)
!908 = !DILocation(line: 120, column: 3, scope: !909)
!909 = distinct !DILexicalBlock(scope: !905, file: !303, line: 120, column: 3)
!910 = !DILocation(line: 120, column: 3, scope: !911)
!911 = distinct !DILexicalBlock(scope: !901, file: !303, line: 120, column: 3)
!912 = !DILocation(line: 120, column: 3, scope: !913)
!913 = distinct !DILexicalBlock(scope: !911, file: !303, line: 120, column: 3)
!914 = !DILocation(line: 120, column: 3, scope: !915)
!915 = distinct !DILexicalBlock(scope: !916, file: !303, line: 120, column: 3)
!916 = distinct !DILexicalBlock(scope: !913, file: !303, line: 120, column: 3)
!917 = !DILocation(line: 120, column: 3, scope: !916)
!918 = !DILocation(line: 120, column: 3, scope: !919)
!919 = distinct !DILexicalBlock(scope: !915, file: !303, line: 120, column: 3)
!920 = !DILocation(line: 121, column: 1, scope: !834)
!921 = !DISubprogram(name: "CharacteristicInitializePackage", scope: !338, file: !338, line: 10, type: !922, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !585)
!922 = !DISubroutineType(types: !923)
!923 = !{!95}
!924 = !DISubprogram(name: "PetscMallocA", scope: !296, file: !296, line: 1288, type: !925, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !585)
!925 = !DISubroutineType(types: !926)
!926 = !{!105, !95, !5, !95, !124, !124, !260, !87, null}
!927 = !DISubprogram(name: "PetscHeaderCreate_Private", scope: !91, file: !91, line: 160, type: !928, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !585)
!928 = !DISubroutineType(types: !929)
!929 = !{!95, !89, !95, !124, !124, !124, !85, !930, !934}
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{!95, !933}
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!95, !89, !113}
!937 = !DISubprogram(name: "PetscLogObjectMemory", scope: !309, file: !309, line: 228, type: !938, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !585)
!938 = !DISubroutineType(types: !939)
!939 = !{!95, !89, !150}
!940 = distinct !DISubprogram(name: "CharacteristicSetType", scope: !303, file: !303, line: 156, type: !941, scopeLine: 157, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !944)
!941 = !DISubroutineType(types: !942)
!942 = !{!105, !337, !943}
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "CharacteristicType", file: !338, line: 29, baseType: !124)
!944 = !{!945, !946, !947, !948, !949, !950, !952, !956, !958, !960}
!945 = !DILocalVariable(name: "c", arg: 1, scope: !940, file: !303, line: 156, type: !337)
!946 = !DILocalVariable(name: "type", arg: 2, scope: !940, file: !303, line: 156, type: !943)
!947 = !DILocalVariable(name: "ierr", scope: !940, file: !303, line: 158, type: !105)
!948 = !DILocalVariable(name: "r", scope: !940, file: !303, line: 158, type: !352)
!949 = !DILocalVariable(name: "match", scope: !940, file: !303, line: 159, type: !262)
!950 = !DILocalVariable(name: "ierr__", scope: !951, file: !303, line: 165, type: !105)
!951 = distinct !DILexicalBlock(scope: !940, file: !303, line: 165, column: 64)
!952 = !DILocalVariable(name: "ierr__", scope: !953, file: !303, line: 170, type: !105)
!953 = distinct !DILexicalBlock(scope: !954, file: !303, line: 170, column: 34)
!954 = distinct !DILexicalBlock(scope: !955, file: !303, line: 168, column: 16)
!955 = distinct !DILexicalBlock(scope: !940, file: !303, line: 168, column: 7)
!956 = !DILocalVariable(name: "ierr__", scope: !957, file: !303, line: 175, type: !105)
!957 = distinct !DILexicalBlock(scope: !940, file: !303, line: 175, column: 61)
!958 = !DILocalVariable(name: "ierr__", scope: !959, file: !303, line: 178, type: !105)
!959 = distinct !DILexicalBlock(scope: !940, file: !303, line: 178, column: 18)
!960 = !DILocalVariable(name: "ierr__", scope: !961, file: !303, line: 179, type: !105)
!961 = distinct !DILexicalBlock(scope: !940, file: !303, line: 179, column: 59)
!962 = !DILocation(line: 0, scope: !940)
!963 = !DILocation(line: 158, column: 3, scope: !940)
!964 = !DILocation(line: 159, column: 3, scope: !940)
!965 = !DILocation(line: 161, column: 3, scope: !966)
!966 = distinct !DILexicalBlock(scope: !967, file: !303, line: 161, column: 3)
!967 = distinct !DILexicalBlock(scope: !968, file: !303, line: 161, column: 3)
!968 = distinct !DILexicalBlock(scope: !940, file: !303, line: 161, column: 3)
!969 = !DILocation(line: 161, column: 3, scope: !967)
!970 = !DILocation(line: 161, column: 3, scope: !971)
!971 = distinct !DILexicalBlock(scope: !972, file: !303, line: 161, column: 3)
!972 = distinct !DILexicalBlock(scope: !966, file: !303, line: 161, column: 3)
!973 = !DILocation(line: 161, column: 3, scope: !972)
!974 = !DILocation(line: 161, column: 3, scope: !975)
!975 = distinct !DILexicalBlock(scope: !971, file: !303, line: 161, column: 3)
!976 = !DILocation(line: 162, column: 3, scope: !977)
!977 = distinct !DILexicalBlock(scope: !978, file: !303, line: 162, column: 3)
!978 = distinct !DILexicalBlock(scope: !940, file: !303, line: 162, column: 3)
!979 = !DILocation(line: 162, column: 3, scope: !978)
!980 = !DILocation(line: 162, column: 3, scope: !981)
!981 = distinct !DILexicalBlock(scope: !978, file: !303, line: 162, column: 3)
!982 = !DILocation(line: 162, column: 3, scope: !983)
!983 = distinct !DILexicalBlock(scope: !978, file: !303, line: 162, column: 3)
!984 = !DILocation(line: 162, column: 3, scope: !985)
!985 = distinct !DILexicalBlock(scope: !986, file: !303, line: 162, column: 3)
!986 = distinct !DILexicalBlock(scope: !983, file: !303, line: 162, column: 3)
!987 = !DILocation(line: 162, column: 3, scope: !986)
!988 = !DILocation(line: 163, column: 3, scope: !989)
!989 = distinct !DILexicalBlock(scope: !990, file: !303, line: 163, column: 3)
!990 = distinct !DILexicalBlock(scope: !940, file: !303, line: 163, column: 3)
!991 = !DILocation(line: 163, column: 3, scope: !990)
!992 = !DILocation(line: 163, column: 3, scope: !993)
!993 = distinct !DILexicalBlock(scope: !990, file: !303, line: 163, column: 3)
!994 = !DILocation(line: 165, column: 10, scope: !940)
!995 = !DILocation(line: 0, scope: !951)
!996 = !DILocation(line: 165, column: 64, scope: !997)
!997 = distinct !DILexicalBlock(scope: !951, file: !303, line: 165, column: 64)
!998 = !DILocation(line: 165, column: 64, scope: !951)
!999 = !DILocation(line: 166, column: 7, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !940, file: !303, line: 166, column: 7)
!1001 = !DILocation(line: 166, column: 7, scope: !940)
!1002 = !DILocation(line: 166, column: 14, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !1004, file: !303, line: 166, column: 14)
!1004 = distinct !DILexicalBlock(scope: !1005, file: !303, line: 166, column: 14)
!1005 = distinct !DILexicalBlock(scope: !1000, file: !303, line: 166, column: 14)
!1006 = !DILocation(line: 166, column: 14, scope: !1004)
!1007 = !DILocation(line: 166, column: 14, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !1009, file: !303, line: 166, column: 14)
!1009 = distinct !DILexicalBlock(scope: !1003, file: !303, line: 166, column: 14)
!1010 = !DILocation(line: 166, column: 14, scope: !1009)
!1011 = !DILocation(line: 166, column: 14, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !1013, file: !303, line: 166, column: 14)
!1013 = distinct !DILexicalBlock(scope: !1008, file: !303, line: 166, column: 14)
!1014 = !DILocation(line: 166, column: 14, scope: !1013)
!1015 = !DILocation(line: 166, column: 14, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !1012, file: !303, line: 166, column: 14)
!1017 = !DILocation(line: 166, column: 14, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !1008, file: !303, line: 166, column: 14)
!1019 = !DILocation(line: 166, column: 14, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !1018, file: !303, line: 166, column: 14)
!1021 = !DILocation(line: 166, column: 14, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1023, file: !303, line: 166, column: 14)
!1023 = distinct !DILexicalBlock(scope: !1020, file: !303, line: 166, column: 14)
!1024 = !DILocation(line: 166, column: 14, scope: !1023)
!1025 = !DILocation(line: 166, column: 14, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1022, file: !303, line: 166, column: 14)
!1027 = !DILocation(line: 168, column: 10, scope: !955)
!1028 = !{!747, !468, i64 848}
!1029 = !DILocation(line: 168, column: 7, scope: !955)
!1030 = !DILocation(line: 168, column: 7, scope: !940)
!1031 = !DILocation(line: 170, column: 22, scope: !954)
!1032 = !DILocation(line: 170, column: 12, scope: !954)
!1033 = !DILocation(line: 0, scope: !953)
!1034 = !DILocation(line: 170, column: 34, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !953, file: !303, line: 170, column: 34)
!1036 = !DILocation(line: 170, column: 34, scope: !953)
!1037 = !DILocation(line: 171, column: 21, scope: !954)
!1038 = !DILocation(line: 172, column: 21, scope: !954)
!1039 = !DILocation(line: 173, column: 3, scope: !954)
!1040 = !DILocation(line: 175, column: 11, scope: !940)
!1041 = !DILocation(line: 0, scope: !957)
!1042 = !DILocation(line: 175, column: 61, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !957, file: !303, line: 175, column: 61)
!1044 = !DILocation(line: 175, column: 61, scope: !957)
!1045 = !DILocation(line: 176, column: 8, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !940, file: !303, line: 176, column: 7)
!1047 = !DILocation(line: 176, column: 7, scope: !940)
!1048 = !DILocation(line: 176, column: 11, scope: !1046)
!1049 = !DILocation(line: 177, column: 6, scope: !940)
!1050 = !DILocation(line: 177, column: 18, scope: !940)
!1051 = !{!747, !482, i64 584}
!1052 = !DILocation(line: 178, column: 10, scope: !940)
!1053 = !DILocation(line: 0, scope: !959)
!1054 = !DILocation(line: 178, column: 18, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !959, file: !303, line: 178, column: 18)
!1056 = !DILocation(line: 178, column: 18, scope: !959)
!1057 = !DILocation(line: 179, column: 10, scope: !940)
!1058 = !DILocation(line: 0, scope: !961)
!1059 = !DILocation(line: 179, column: 59, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !961, file: !303, line: 179, column: 59)
!1061 = !DILocation(line: 179, column: 59, scope: !961)
!1062 = !DILocation(line: 180, column: 3, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1064, file: !303, line: 180, column: 3)
!1064 = distinct !DILexicalBlock(scope: !1065, file: !303, line: 180, column: 3)
!1065 = distinct !DILexicalBlock(scope: !940, file: !303, line: 180, column: 3)
!1066 = !DILocation(line: 180, column: 3, scope: !1064)
!1067 = !DILocation(line: 180, column: 3, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !1069, file: !303, line: 180, column: 3)
!1069 = distinct !DILexicalBlock(scope: !1063, file: !303, line: 180, column: 3)
!1070 = !DILocation(line: 180, column: 3, scope: !1069)
!1071 = !DILocation(line: 180, column: 3, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1073, file: !303, line: 180, column: 3)
!1073 = distinct !DILexicalBlock(scope: !1068, file: !303, line: 180, column: 3)
!1074 = !DILocation(line: 180, column: 3, scope: !1073)
!1075 = !DILocation(line: 180, column: 3, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !1072, file: !303, line: 180, column: 3)
!1077 = !DILocation(line: 180, column: 3, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1068, file: !303, line: 180, column: 3)
!1079 = !DILocation(line: 180, column: 3, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1078, file: !303, line: 180, column: 3)
!1081 = !DILocation(line: 180, column: 3, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1083, file: !303, line: 180, column: 3)
!1083 = distinct !DILexicalBlock(scope: !1080, file: !303, line: 180, column: 3)
!1084 = !DILocation(line: 180, column: 3, scope: !1083)
!1085 = !DILocation(line: 180, column: 3, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1082, file: !303, line: 180, column: 3)
!1087 = !DILocation(line: 181, column: 1, scope: !940)
!1088 = !DISubprogram(name: "PetscFunctionListFind_Private", scope: !296, file: !296, line: 1567, type: !1089, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !585)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!95, !167, !124, !142}
!1091 = !DISubprogram(name: "PetscObjectChangeTypeName", scope: !296, file: !296, line: 1500, type: !1092, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !585)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!95, !89, !124}
!1094 = distinct !DISubprogram(name: "CharacteristicSetUp", scope: !303, file: !303, line: 196, type: !353, scopeLine: 197, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1095)
!1095 = !{!1096, !1097, !1098, !1102, !1104, !1108}
!1096 = !DILocalVariable(name: "c", arg: 1, scope: !1094, file: !303, line: 196, type: !337)
!1097 = !DILocalVariable(name: "ierr", scope: !1094, file: !303, line: 198, type: !105)
!1098 = !DILocalVariable(name: "ierr__", scope: !1099, file: !303, line: 204, type: !105)
!1099 = distinct !DILexicalBlock(scope: !1100, file: !303, line: 204, column: 55)
!1100 = distinct !DILexicalBlock(scope: !1101, file: !303, line: 203, column: 37)
!1101 = distinct !DILexicalBlock(scope: !1094, file: !303, line: 203, column: 7)
!1102 = !DILocalVariable(name: "ierr__", scope: !1103, file: !303, line: 209, type: !105)
!1103 = distinct !DILexicalBlock(scope: !1094, file: !303, line: 209, column: 68)
!1104 = !DILocalVariable(name: "ierr__", scope: !1105, file: !303, line: 211, type: !105)
!1105 = distinct !DILexicalBlock(scope: !1106, file: !303, line: 211, column: 32)
!1106 = distinct !DILexicalBlock(scope: !1107, file: !303, line: 210, column: 24)
!1107 = distinct !DILexicalBlock(scope: !1094, file: !303, line: 210, column: 7)
!1108 = !DILocalVariable(name: "ierr__", scope: !1109, file: !303, line: 213, type: !105)
!1109 = distinct !DILexicalBlock(scope: !1094, file: !303, line: 213, column: 66)
!1110 = !DILocation(line: 0, scope: !1094)
!1111 = !DILocation(line: 200, column: 3, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1113, file: !303, line: 200, column: 3)
!1113 = distinct !DILexicalBlock(scope: !1114, file: !303, line: 200, column: 3)
!1114 = distinct !DILexicalBlock(scope: !1094, file: !303, line: 200, column: 3)
!1115 = !DILocation(line: 200, column: 3, scope: !1113)
!1116 = !DILocation(line: 200, column: 3, scope: !1117)
!1117 = distinct !DILexicalBlock(scope: !1118, file: !303, line: 200, column: 3)
!1118 = distinct !DILexicalBlock(scope: !1112, file: !303, line: 200, column: 3)
!1119 = !DILocation(line: 200, column: 3, scope: !1118)
!1120 = !DILocation(line: 200, column: 3, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1117, file: !303, line: 200, column: 3)
!1122 = !DILocation(line: 201, column: 3, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !1124, file: !303, line: 201, column: 3)
!1124 = distinct !DILexicalBlock(scope: !1094, file: !303, line: 201, column: 3)
!1125 = !DILocation(line: 201, column: 3, scope: !1124)
!1126 = !DILocation(line: 201, column: 3, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !1124, file: !303, line: 201, column: 3)
!1128 = !DILocation(line: 201, column: 3, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1124, file: !303, line: 201, column: 3)
!1130 = !DILocation(line: 201, column: 3, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !1132, file: !303, line: 201, column: 3)
!1132 = distinct !DILexicalBlock(scope: !1129, file: !303, line: 201, column: 3)
!1133 = !DILocation(line: 201, column: 3, scope: !1132)
!1134 = !DILocation(line: 203, column: 26, scope: !1101)
!1135 = !{!497, !468, i64 168}
!1136 = !DILocation(line: 203, column: 8, scope: !1101)
!1137 = !DILocation(line: 203, column: 7, scope: !1094)
!1138 = !DILocation(line: 204, column: 12, scope: !1100)
!1139 = !DILocation(line: 0, scope: !1099)
!1140 = !DILocation(line: 204, column: 55, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1099, file: !303, line: 204, column: 55)
!1142 = !DILocation(line: 204, column: 55, scope: !1099)
!1143 = !DILocation(line: 207, column: 10, scope: !1144)
!1144 = distinct !DILexicalBlock(scope: !1094, file: !303, line: 207, column: 7)
!1145 = !DILocation(line: 207, column: 22, scope: !1144)
!1146 = !DILocation(line: 207, column: 7, scope: !1094)
!1147 = !DILocation(line: 207, column: 28, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1149, file: !303, line: 207, column: 28)
!1149 = distinct !DILexicalBlock(scope: !1150, file: !303, line: 207, column: 28)
!1150 = distinct !DILexicalBlock(scope: !1144, file: !303, line: 207, column: 28)
!1151 = !DILocation(line: 207, column: 28, scope: !1149)
!1152 = !DILocation(line: 207, column: 28, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !1154, file: !303, line: 207, column: 28)
!1154 = distinct !DILexicalBlock(scope: !1148, file: !303, line: 207, column: 28)
!1155 = !DILocation(line: 207, column: 28, scope: !1154)
!1156 = !DILocation(line: 207, column: 28, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1158, file: !303, line: 207, column: 28)
!1158 = distinct !DILexicalBlock(scope: !1153, file: !303, line: 207, column: 28)
!1159 = !DILocation(line: 207, column: 28, scope: !1158)
!1160 = !DILocation(line: 207, column: 28, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !1157, file: !303, line: 207, column: 28)
!1162 = !DILocation(line: 207, column: 28, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1153, file: !303, line: 207, column: 28)
!1164 = !DILocation(line: 207, column: 28, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !1163, file: !303, line: 207, column: 28)
!1166 = !DILocation(line: 207, column: 28, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1168, file: !303, line: 207, column: 28)
!1168 = distinct !DILexicalBlock(scope: !1165, file: !303, line: 207, column: 28)
!1169 = !DILocation(line: 207, column: 28, scope: !1168)
!1170 = !DILocation(line: 207, column: 28, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !1167, file: !303, line: 207, column: 28)
!1172 = !DILocation(line: 209, column: 10, scope: !1094)
!1173 = !{!1174, !468, i64 24}
!1174 = !{!"_n_PetscStageLog", !482, i64 0, !482, i64 4, !468, i64 8, !482, i64 16, !468, i64 24, !468, i64 32, !468, i64 40}
!1175 = !{!1174, !482, i64 16}
!1176 = !{!1177, !469, i64 20}
!1177 = !{!"_PetscStageInfo", !468, i64 0, !469, i64 8, !1178, i64 16, !468, i64 280, !468, i64 288}
!1178 = !{!"", !482, i64 0, !469, i64 4, !469, i64 8, !482, i64 12, !482, i64 16, !498, i64 24, !498, i64 32, !498, i64 40, !498, i64 48, !498, i64 56, !498, i64 64, !498, i64 72, !469, i64 80, !469, i64 144, !498, i64 208, !498, i64 216, !498, i64 224, !498, i64 232, !498, i64 240, !498, i64 248, !498, i64 256}
!1179 = !{!1177, !468, i64 280}
!1180 = !{!1181, !468, i64 8}
!1181 = !{!"_n_PetscEventPerfLog", !482, i64 0, !482, i64 4, !468, i64 8}
!1182 = !{!1178, !469, i64 4}
!1183 = !DILocation(line: 0, scope: !1103)
!1184 = !DILocation(line: 209, column: 68, scope: !1185)
!1185 = distinct !DILexicalBlock(scope: !1103, file: !303, line: 209, column: 68)
!1186 = !DILocation(line: 209, column: 68, scope: !1103)
!1187 = !DILocation(line: 210, column: 11, scope: !1107)
!1188 = !DILocation(line: 210, column: 8, scope: !1107)
!1189 = !DILocation(line: 210, column: 7, scope: !1094)
!1190 = !DILocation(line: 211, column: 22, scope: !1106)
!1191 = !{!546, !468, i64 16}
!1192 = !DILocation(line: 211, column: 12, scope: !1106)
!1193 = !DILocation(line: 0, scope: !1105)
!1194 = !DILocation(line: 211, column: 32, scope: !1195)
!1195 = distinct !DILexicalBlock(scope: !1105, file: !303, line: 211, column: 32)
!1196 = !DILocation(line: 211, column: 32, scope: !1105)
!1197 = !DILocation(line: 213, column: 10, scope: !1094)
!1198 = !DILocation(line: 0, scope: !1109)
!1199 = !DILocation(line: 213, column: 66, scope: !1200)
!1200 = distinct !DILexicalBlock(scope: !1109, file: !303, line: 213, column: 66)
!1201 = !DILocation(line: 213, column: 66, scope: !1109)
!1202 = !DILocation(line: 214, column: 18, scope: !1094)
!1203 = !DILocation(line: 215, column: 3, scope: !1204)
!1204 = distinct !DILexicalBlock(scope: !1205, file: !303, line: 215, column: 3)
!1205 = distinct !DILexicalBlock(scope: !1206, file: !303, line: 215, column: 3)
!1206 = distinct !DILexicalBlock(scope: !1094, file: !303, line: 215, column: 3)
!1207 = !DILocation(line: 215, column: 3, scope: !1205)
!1208 = !DILocation(line: 215, column: 3, scope: !1209)
!1209 = distinct !DILexicalBlock(scope: !1210, file: !303, line: 215, column: 3)
!1210 = distinct !DILexicalBlock(scope: !1204, file: !303, line: 215, column: 3)
!1211 = !DILocation(line: 215, column: 3, scope: !1210)
!1212 = !DILocation(line: 215, column: 3, scope: !1213)
!1213 = distinct !DILexicalBlock(scope: !1214, file: !303, line: 215, column: 3)
!1214 = distinct !DILexicalBlock(scope: !1209, file: !303, line: 215, column: 3)
!1215 = !DILocation(line: 215, column: 3, scope: !1214)
!1216 = !DILocation(line: 215, column: 3, scope: !1217)
!1217 = distinct !DILexicalBlock(scope: !1213, file: !303, line: 215, column: 3)
!1218 = !DILocation(line: 215, column: 3, scope: !1219)
!1219 = distinct !DILexicalBlock(scope: !1209, file: !303, line: 215, column: 3)
!1220 = !DILocation(line: 215, column: 3, scope: !1221)
!1221 = distinct !DILexicalBlock(scope: !1219, file: !303, line: 215, column: 3)
!1222 = !DILocation(line: 215, column: 3, scope: !1223)
!1223 = distinct !DILexicalBlock(scope: !1224, file: !303, line: 215, column: 3)
!1224 = distinct !DILexicalBlock(scope: !1221, file: !303, line: 215, column: 3)
!1225 = !DILocation(line: 215, column: 3, scope: !1224)
!1226 = !DILocation(line: 215, column: 3, scope: !1227)
!1227 = distinct !DILexicalBlock(scope: !1223, file: !303, line: 215, column: 3)
!1228 = !DILocation(line: 216, column: 1, scope: !1094)
!1229 = distinct !DISubprogram(name: "CharacteristicRegister", scope: !303, file: !303, line: 249, type: !1230, scopeLine: 250, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1232)
!1230 = !DISubroutineType(types: !1231)
!1231 = !{!105, !124, !352}
!1232 = !{!1233, !1234, !1235, !1236, !1238}
!1233 = !DILocalVariable(name: "sname", arg: 1, scope: !1229, file: !303, line: 249, type: !124)
!1234 = !DILocalVariable(name: "function", arg: 2, scope: !1229, file: !303, line: 249, type: !352)
!1235 = !DILocalVariable(name: "ierr", scope: !1229, file: !303, line: 251, type: !105)
!1236 = !DILocalVariable(name: "ierr__", scope: !1237, file: !303, line: 254, type: !105)
!1237 = distinct !DILexicalBlock(scope: !1229, file: !303, line: 254, column: 44)
!1238 = !DILocalVariable(name: "ierr__", scope: !1239, file: !303, line: 255, type: !105)
!1239 = distinct !DILexicalBlock(scope: !1229, file: !303, line: 255, column: 67)
!1240 = !DILocation(line: 0, scope: !1229)
!1241 = !DILocation(line: 253, column: 3, scope: !1242)
!1242 = distinct !DILexicalBlock(scope: !1243, file: !303, line: 253, column: 3)
!1243 = distinct !DILexicalBlock(scope: !1244, file: !303, line: 253, column: 3)
!1244 = distinct !DILexicalBlock(scope: !1229, file: !303, line: 253, column: 3)
!1245 = !DILocation(line: 253, column: 3, scope: !1243)
!1246 = !DILocation(line: 253, column: 3, scope: !1247)
!1247 = distinct !DILexicalBlock(scope: !1248, file: !303, line: 253, column: 3)
!1248 = distinct !DILexicalBlock(scope: !1242, file: !303, line: 253, column: 3)
!1249 = !DILocation(line: 253, column: 3, scope: !1248)
!1250 = !DILocation(line: 253, column: 3, scope: !1251)
!1251 = distinct !DILexicalBlock(scope: !1247, file: !303, line: 253, column: 3)
!1252 = !DILocation(line: 254, column: 10, scope: !1229)
!1253 = !DILocation(line: 0, scope: !1237)
!1254 = !DILocation(line: 254, column: 44, scope: !1255)
!1255 = distinct !DILexicalBlock(scope: !1237, file: !303, line: 254, column: 44)
!1256 = !DILocation(line: 254, column: 44, scope: !1237)
!1257 = !DILocation(line: 255, column: 10, scope: !1229)
!1258 = !DILocation(line: 0, scope: !1239)
!1259 = !DILocation(line: 255, column: 67, scope: !1260)
!1260 = distinct !DILexicalBlock(scope: !1239, file: !303, line: 255, column: 67)
!1261 = !DILocation(line: 255, column: 67, scope: !1239)
!1262 = !DILocation(line: 256, column: 3, scope: !1263)
!1263 = distinct !DILexicalBlock(scope: !1264, file: !303, line: 256, column: 3)
!1264 = distinct !DILexicalBlock(scope: !1265, file: !303, line: 256, column: 3)
!1265 = distinct !DILexicalBlock(scope: !1229, file: !303, line: 256, column: 3)
!1266 = !DILocation(line: 256, column: 3, scope: !1264)
!1267 = !DILocation(line: 256, column: 3, scope: !1268)
!1268 = distinct !DILexicalBlock(scope: !1269, file: !303, line: 256, column: 3)
!1269 = distinct !DILexicalBlock(scope: !1263, file: !303, line: 256, column: 3)
!1270 = !DILocation(line: 256, column: 3, scope: !1269)
!1271 = !DILocation(line: 256, column: 3, scope: !1272)
!1272 = distinct !DILexicalBlock(scope: !1273, file: !303, line: 256, column: 3)
!1273 = distinct !DILexicalBlock(scope: !1268, file: !303, line: 256, column: 3)
!1274 = !DILocation(line: 256, column: 3, scope: !1273)
!1275 = !DILocation(line: 256, column: 3, scope: !1276)
