; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/utils/pdisplay.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/utils/pdisplay.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_datatype_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._n_PetscOptions = type opaque
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.ompi_op_t = type opaque

@petscstack = external local_unnamed_addr global %struct.PetscStack*, align 8
@__func__.PetscOptionsGetenv = private unnamed_addr constant [19 x i8] c"PetscOptionsGetenv\00", align 1
@.str = private unnamed_addr constant [78 x i8] c"/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/utils/pdisplay.c\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"PETSC_\00", align 1
@ompi_mpi_comm_self = external global %struct.ompi_predefined_communicator_t, align 1

!635 = distinct !DILocation(line: 90, column: 10, scope: !558)
!636 = !DILocation(line: 500, column: 3, scope: !218, inlinedAt: !635)
!637 = !DILocation(line: 500, column: 21, scope: !218, inlinedAt: !635)
!638 = !DILocation(line: 500, column: 55, scope: !218, inlinedAt: !635)
!639 = !DILocation(line: 500, column: 60, scope: !218, inlinedAt: !635)
!640 = !DILocation(line: 501, column: 1, scope: !218, inlinedAt: !635)
!641 = !DILocation(line: 0, scope: !574)
!642 = !DILocation(line: 90, column: 83, scope: !574)
!643 = !DILocation(line: 90, column: 83, scope: !576)
!644 = !DILocation(line: 0, scope: !576)
!645 = !DILocation(line: 90, column: 83, scope: !577)
!646 = !DILocation(line: 91, column: 10, scope: !558)
!647 = !DILocation(line: 0, scope: !580)
!648 = !DILocation(line: 91, column: 51, scope: !649)
!649 = distinct !DILexicalBlock(scope: !580, file: !40, line: 91, column: 51)
!650 = !DILocation(line: 91, column: 51, scope: !580)
!651 = !DILocation(line: 93, column: 29, scope: !558)
!652 = !DILocation(line: 93, column: 14, scope: !558)
!653 = !DILocation(line: 95, column: 10, scope: !582)
!654 = !DILocation(line: 0, scope: !218, inlinedAt: !655)
!655 = distinct !DILocation(line: 95, column: 10, scope: !582)
!656 = !DILocation(line: 500, column: 3, scope: !218, inlinedAt: !655)
!657 = !DILocation(line: 500, column: 21, scope: !218, inlinedAt: !655)
!658 = !DILocation(line: 500, column: 55, scope: !218, inlinedAt: !655)
!659 = !DILocation(line: 500, column: 60, scope: !218, inlinedAt: !655)
!660 = !DILocation(line: 501, column: 1, scope: !218, inlinedAt: !655)
!661 = !DILocation(line: 0, scope: !582)
!662 = !DILocation(line: 0, scope: !589)
!663 = !DILocation(line: 95, column: 10, scope: !592)
!664 = !DILocation(line: 95, column: 10, scope: !589)
!665 = !DILocation(line: 95, column: 10, scope: !591)
!666 = !DILocation(line: 0, scope: !591)
!667 = !DILocation(line: 95, column: 10, scope: !668)
!668 = distinct !DILexicalBlock(scope: !582, file: !40, line: 95, column: 10)
!669 = !DILocation(line: 95, column: 10, scope: !670)
!670 = distinct !DILexicalBlock(scope: !582, file: !40, line: 95, column: 10)
!671 = !DILocation(line: 95, column: 10, scope: !672)
!672 = distinct !DILexicalBlock(scope: !582, file: !40, line: 95, column: 10)
!673 = !DILocation(line: 0, scope: !218, inlinedAt: !674)
!674 = distinct !DILocation(line: 95, column: 10, scope: !582)
!675 = !DILocation(line: 500, column: 3, scope: !218, inlinedAt: !674)
!676 = !DILocation(line: 500, column: 21, scope: !218, inlinedAt: !674)
!677 = !DILocation(line: 500, column: 55, scope: !218, inlinedAt: !674)
!678 = !DILocation(line: 500, column: 60, scope: !218, inlinedAt: !674)
!679 = !DILocation(line: 501, column: 1, scope: !218, inlinedAt: !674)
!680 = !DILocation(line: 0, scope: !595)
!681 = !DILocation(line: 95, column: 10, scope: !598)
!682 = !DILocation(line: 95, column: 10, scope: !595)
!683 = !DILocation(line: 95, column: 10, scope: !597)
!684 = !DILocation(line: 0, scope: !597)
!685 = !DILocation(line: 95, column: 10, scope: !558)
!686 = !DILocation(line: 97, column: 25, scope: !558)
!687 = !DILocation(line: 97, column: 12, scope: !558)
!688 = !DILocation(line: 98, column: 3, scope: !689)
!689 = distinct !DILexicalBlock(scope: !690, file: !40, line: 98, column: 3)
!690 = distinct !DILexicalBlock(scope: !691, file: !40, line: 98, column: 3)
!691 = distinct !DILexicalBlock(scope: !558, file: !40, line: 98, column: 3)
!692 = !DILocation(line: 98, column: 3, scope: !690)
!693 = !DILocation(line: 98, column: 3, scope: !694)
!694 = distinct !DILexicalBlock(scope: !695, file: !40, line: 98, column: 3)
!695 = distinct !DILexicalBlock(scope: !689, file: !40, line: 98, column: 3)
!696 = !DILocation(line: 98, column: 3, scope: !695)
!697 = !DILocation(line: 98, column: 3, scope: !698)
!698 = distinct !DILexicalBlock(scope: !699, file: !40, line: 98, column: 3)
!699 = distinct !DILexicalBlock(scope: !694, file: !40, line: 98, column: 3)
!700 = !DILocation(line: 98, column: 3, scope: !699)
!701 = !DILocation(line: 98, column: 3, scope: !702)
!702 = distinct !DILexicalBlock(scope: !698, file: !40, line: 98, column: 3)
!703 = !DILocation(line: 98, column: 3, scope: !704)
!704 = distinct !DILexicalBlock(scope: !694, file: !40, line: 98, column: 3)
!705 = !DILocation(line: 98, column: 3, scope: !706)
!706 = distinct !DILexicalBlock(scope: !704, file: !40, line: 98, column: 3)
!707 = !DILocation(line: 98, column: 3, scope: !708)
!708 = distinct !DILexicalBlock(scope: !709, file: !40, line: 98, column: 3)
!709 = distinct !DILexicalBlock(scope: !706, file: !40, line: 98, column: 3)
!710 = !DILocation(line: 98, column: 3, scope: !709)
!711 = !DILocation(line: 98, column: 3, scope: !712)
!712 = distinct !DILexicalBlock(scope: !708, file: !40, line: 98, column: 3)
!713 = !DILocation(line: 99, column: 1, scope: !558)
!714 = !DISubprogram(name: "PetscOptionsGetBool", scope: !309, file: !309, line: 20, type: !715, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !295)
!715 = !DISubroutineType(types: !716)
!716 = !{!28, !312, !32, !32, !294, !294}
!717 = !DISubprogram(name: "PetscPOpen", scope: !186, file: !186, line: 1672, type: !718, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !295)
!718 = !DISubroutineType(types: !719)
!719 = !{!28, !20, !32, !32, !32, !720}
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !723, line: 245, size: 1728, elements: !724)
!723 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/libio.h", directory: "")
!724 = !{!725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !744, !745, !746, !747, !751, !753, !755, !759, !762, !764, !765, !766, !767, !768, !769, !770}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !722, file: !723, line: 246, baseType: !28, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !722, file: !723, line: 251, baseType: !26, size: 64, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !722, file: !723, line: 252, baseType: !26, size: 64, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !722, file: !723, line: 253, baseType: !26, size: 64, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !722, file: !723, line: 254, baseType: !26, size: 64, offset: 256)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !722, file: !723, line: 255, baseType: !26, size: 64, offset: 320)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !722, file: !723, line: 256, baseType: !26, size: 64, offset: 384)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !722, file: !723, line: 257, baseType: !26, size: 64, offset: 448)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !722, file: !723, line: 258, baseType: !26, size: 64, offset: 512)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !722, file: !723, line: 260, baseType: !26, size: 64, offset: 576)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !722, file: !723, line: 261, baseType: !26, size: 64, offset: 640)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !722, file: !723, line: 262, baseType: !26, size: 64, offset: 704)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !722, file: !723, line: 264, baseType: !738, size: 64, offset: 768)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !723, line: 160, size: 192, elements: !740)
!740 = !{!741, !742, !743}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !739, file: !723, line: 161, baseType: !738, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !739, file: !723, line: 162, baseType: !721, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !739, file: !723, line: 166, baseType: !28, size: 32, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !722, file: !723, line: 266, baseType: !721, size: 64, offset: 832)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !722, file: !723, line: 268, baseType: !28, size: 32, offset: 896)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !722, file: !723, line: 272, baseType: !28, size: 32, offset: 928)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !722, file: !723, line: 274, baseType: !748, size: 64, offset: 960)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !749, line: 140, baseType: !750)
!749 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!750 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !722, file: !723, line: 278, baseType: !752, size: 16, offset: 1024)
!752 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !722, file: !723, line: 279, baseType: !754, size: 8, offset: 1040)
!754 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !722, file: !723, line: 280, baseType: !756, size: 8, offset: 1048)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8, elements: !757)
!757 = !{!758}
!758 = !DISubrange(count: 1)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !722, file: !723, line: 284, baseType: !760, size: 64, offset: 1088)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !723, line: 154, baseType: null)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !722, file: !723, line: 293, baseType: !763, size: 64, offset: 1152)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !749, line: 141, baseType: !750)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !722, file: !723, line: 301, baseType: !22, size: 64, offset: 1216)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !722, file: !723, line: 302, baseType: !22, size: 64, offset: 1280)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !722, file: !723, line: 303, baseType: !22, size: 64, offset: 1344)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !722, file: !723, line: 304, baseType: !22, size: 64, offset: 1408)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !722, file: !723, line: 306, baseType: !23, size: 64, offset: 1472)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !722, file: !723, line: 307, baseType: !28, size: 32, offset: 1536)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !722, file: !723, line: 309, baseType: !771, size: 160, offset: 1568)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 160, elements: !772)
!772 = !{!773}
!773 = !DISubrange(count: 20)
!774 = !DISubprogram(name: "PetscSleep", scope: !186, file: !186, line: 1420, type: !775, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !295)
!775 = !DISubroutineType(types: !776)
!776 = !{!28, !777}
!777 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!778 = !DISubprogram(name: "PetscGetHostName", scope: !186, file: !186, line: 2487, type: !779, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !295)
!779 = !DISubroutineType(types: !780)
!780 = !{!28, !26, !25}
!781 = distinct !DISubprogram(name: "PetscMemcpy", scope: !186, file: !186, line: 1792, type: !782, scopeLine: 1793, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !786)
!782 = !DISubroutineType(types: !783)
!783 = !{!53, !22, !784, !23}
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!786 = !{!787, !788, !789, !790, !791, !792}
!787 = !DILocalVariable(name: "a", arg: 1, scope: !781, file: !186, line: 1792, type: !22)
!788 = !DILocalVariable(name: "b", arg: 2, scope: !781, file: !186, line: 1792, type: !784)
!789 = !DILocalVariable(name: "n", arg: 3, scope: !781, file: !186, line: 1792, type: !23)
!790 = !DILocalVariable(name: "al", scope: !781, file: !186, line: 1795, type: !23)
!791 = !DILocalVariable(name: "bl", scope: !781, file: !186, line: 1795, type: !23)
!792 = !DILocalVariable(name: "nl", scope: !781, file: !186, line: 1796, type: !23)
!793 = !DILocation(line: 0, scope: !781)
!794 = !DILocation(line: 1795, column: 15, scope: !781)
!795 = !DILocation(line: 1795, column: 31, scope: !781)
!796 = !DILocation(line: 1797, column: 3, scope: !797)
!797 = distinct !DILexicalBlock(scope: !798, file: !186, line: 1797, column: 3)
!798 = distinct !DILexicalBlock(scope: !799, file: !186, line: 1797, column: 3)
!799 = distinct !DILexicalBlock(scope: !781, file: !186, line: 1797, column: 3)
!800 = !DILocation(line: 1797, column: 3, scope: !798)
!801 = !DILocation(line: 1797, column: 3, scope: !802)
!802 = distinct !DILexicalBlock(scope: !803, file: !186, line: 1797, column: 3)
!803 = distinct !DILexicalBlock(scope: !797, file: !186, line: 1797, column: 3)
!804 = !DILocation(line: 1797, column: 3, scope: !803)
!805 = !DILocation(line: 1797, column: 3, scope: !806)
!806 = distinct !DILexicalBlock(scope: !802, file: !186, line: 1797, column: 3)
!807 = !DILocation(line: 1798, column: 13, scope: !808)
!808 = distinct !DILexicalBlock(scope: !781, file: !186, line: 1798, column: 7)
!809 = !DILocation(line: 1798, column: 20, scope: !808)
!810 = !DILocation(line: 1799, column: 13, scope: !811)
!811 = distinct !DILexicalBlock(scope: !781, file: !186, line: 1799, column: 7)
!812 = !DILocation(line: 1799, column: 20, scope: !811)
!813 = !DILocation(line: 1803, column: 9, scope: !814)
!814 = distinct !DILexicalBlock(scope: !781, file: !186, line: 1803, column: 7)
!815 = !DILocation(line: 1803, column: 14, scope: !814)
!816 = !DILocation(line: 1805, column: 13, scope: !817)
!817 = distinct !DILexicalBlock(scope: !818, file: !186, line: 1805, column: 9)
!818 = distinct !DILexicalBlock(scope: !814, file: !186, line: 1803, column: 24)
!819 = !DILocation(line: 1805, column: 18, scope: !817)
!820 = !DILocation(line: 1805, column: 57, scope: !817)
!821 = !DILocation(line: 1828, column: 5, scope: !818)
!822 = !DILocation(line: 1831, column: 3, scope: !823)
!823 = distinct !DILexicalBlock(scope: !824, file: !186, line: 1831, column: 3)
!824 = distinct !DILexicalBlock(scope: !825, file: !186, line: 1831, column: 3)
!825 = distinct !DILexicalBlock(scope: !781, file: !186, line: 1831, column: 3)
