; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/aij/seq/aijfact.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/aij/seq/aijfact.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!254 = !DIEnumerator(name: "MATOP_RART_NUMERIC", value: 138, isUnsigned: true)
!255 = !DIEnumerator(name: "MATOP_SET_BLOCK_SIZES", value: 139, isUnsigned: true)
!256 = !DIEnumerator(name: "MATOP_AYPX", value: 140, isUnsigned: true)
!257 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!258 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!259 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!260 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!261 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!262 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 161, baseType: !5, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272}
!265 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !301)
!301 = !{!302, !303, !304}
!302 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!305 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 481, baseType: !72, size: 32, elements: !306)
!306 = !{!307, !308, !309, !310, !311, !312}
!307 = !DIEnumerator(name: "FILE_MODE_UNDEFINED", value: -1)
!308 = !DIEnumerator(name: "FILE_MODE_READ", value: 0)
!309 = !DIEnumerator(name: "FILE_MODE_WRITE", value: 1)
!310 = !DIEnumerator(name: "FILE_MODE_APPEND", value: 2)
!311 = !DIEnumerator(name: "FILE_MODE_UPDATE", value: 3)
!312 = !DIEnumerator(name: "FILE_MODE_APPEND_UPDATE", value: 4)
!313 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1189, baseType: !5, size: 32, elements: !314)
!314 = !{!315, !316, !317, !318}
!315 = !DIEnumerator(name: "MAT_SHIFT_NONE", value: 0, isUnsigned: true)
!316 = !DIEnumerator(name: "MAT_SHIFT_NONZERO", value: 1, isUnsigned: true)
!317 = !DIEnumerator(name: "MAT_SHIFT_POSITIVE_DEFINITE", value: 2, isUnsigned: true)
!318 = !DIEnumerator(name: "MAT_SHIFT_INBLOCKS", value: 3, isUnsigned: true)
!319 = !{!320, !550, !400, !479, !397, !421, !1410, !1411, !363, !364, !328, !1413, !469, !451, !423}
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_SeqAIJ", file: !322, line: 125, baseType: !323)
!322 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/aij/seq/aij.h", directory: "/home/users/ndemeye/xSDK")
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !322, line: 114, size: 2816, elements: !324)
!324 = !{!325, !327, !329, !330, !331, !332, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !352, !353, !354, !355, !356, !357, !358, !365, !367, !372, !373, !374, !375, !1343, !1384, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "roworiented", scope: !323, file: !322, line: 115, baseType: !326, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "nonew", scope: !323, file: !322, line: 115, baseType: !328, size: 32, offset: 32)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "nounused", scope: !323, file: !322, line: 115, baseType: !328, size: 32, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "singlemalloc", scope: !323, file: !322, line: 115, baseType: !326, size: 32, offset: 96)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "maxnz", scope: !323, file: !322, line: 115, baseType: !328, size: 32, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "imax", scope: !323, file: !322, line: 115, baseType: !333, size: 64, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ilen", scope: !323, file: !322, line: 115, baseType: !333, size: 64, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ipre", scope: !323, file: !322, line: 115, baseType: !333, size: 64, offset: 320)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "free_imax_ilen", scope: !323, file: !322, line: 115, baseType: !326, size: 32, offset: 384)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !323, file: !322, line: 115, baseType: !328, size: 32, offset: 416)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !323, file: !322, line: 115, baseType: !328, size: 32, offset: 448)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "keepnonzeropattern", scope: !323, file: !322, line: 115, baseType: !326, size: 32, offset: 480)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ignorezeroentries", scope: !323, file: !322, line: 115, baseType: !326, size: 32, offset: 512)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "free_ij", scope: !323, file: !322, line: 115, baseType: !326, size: 32, offset: 544)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "free_a", scope: !323, file: !322, line: 115, baseType: !326, size: 32, offset: 576)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "compressedrow", scope: !323, file: !322, line: 115, baseType: !344, size: 192, offset: 640)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_CompressedRow", file: !345, line: 407, baseType: !346)
!345 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !345, line: 402, size: 192, elements: !347)
!347 = !{!348, !349, !350, !351}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !346, file: !345, line: 403, baseType: !326, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !346, file: !345, line: 404, baseType: !328, size: 32, offset: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !346, file: !345, line: 405, baseType: !333, size: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "rindex", scope: !346, file: !345, line: 406, baseType: !333, size: 64, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "nz", scope: !323, file: !322, line: 115, baseType: !328, size: 32, offset: 832)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !323, file: !322, line: 115, baseType: !333, size: 64, offset: 896)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !323, file: !322, line: 115, baseType: !333, size: 64, offset: 960)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "diag", scope: !323, file: !322, line: 115, baseType: !333, size: 64, offset: 1024)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerorowcnt", scope: !323, file: !322, line: 115, baseType: !328, size: 32, offset: 1088)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "free_diag", scope: !323, file: !322, line: 115, baseType: !326, size: 32, offset: 1120)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !323, file: !322, line: 115, baseType: !359, size: 64, offset: 1152)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatScalar", file: !361, line: 799, baseType: !362)
!361 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmath.h", directory: "/home/users/ndemeye/xSDK")
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !363)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !364)
!364 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "solve_work", scope: !323, file: !322, line: 115, baseType: !366, size: 64, offset: 1216)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !323, file: !322, line: 115, baseType: !368, size: 64, offset: 1280)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !369, line: 11, baseType: !370)
!369 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !369, line: 11, flags: DIFlagFwdDecl)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !323, file: !322, line: 115, baseType: !368, size: 64, offset: 1344)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "icol", scope: !323, file: !322, line: 115, baseType: !368, size: 64, offset: 1408)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !323, file: !322, line: 115, baseType: !326, size: 32, offset: 1472)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !323, file: !322, line: 115, baseType: !376, size: 64, offset: 1536)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !345, line: 436, size: 23424, elements: !379)
!379 = !{!380, !583, !1086, !1106, !1107, !1108, !1110, !1111, !1112, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1239, !1240, !1256, !1257, !1258, !1259, !1260, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1295, !1315, !1316, !1318, !1319, !1320, !1321, !1322, !1323, !1341, !1342}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !378, file: !345, line: 437, baseType: !381, size: 4480)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !382, line: 122, baseType: !383)
!382 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !382, line: 73, size: 4480, elements: !384)
!384 = !{!385, !387, !442, !443, !444, !446, !447, !448, !449, !457, !458, !460, !464, !468, !470, !471, !472, !473, !474, !475, !476, !477, !478, !480, !482, !483, !484, !486, !487, !488, !490, !491, !492, !493, !494, !496, !498, !499, !500, !501, !502, !503, !505, !506, !507, !517, !519, !520, !524, !525, !573, !578, !580, !581, !582}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !383, file: !382, line: 74, baseType: !386, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !383, file: !382, line: 75, baseType: !388, size: 448, offset: 64)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 448, elements: !440)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !382, line: 53, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !382, line: 45, size: 448, elements: !391)
!391 = !{!392, !404, !412, !417, !424, !428, !435}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !390, file: !382, line: 46, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!396, !397, !399}
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !401, line: 330, baseType: !402)
!401 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !401, line: 330, flags: DIFlagFwdDecl)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !390, file: !382, line: 47, baseType: !405, size: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!396, !397, !408}
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !409, line: 16, baseType: !410)
!409 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !409, line: 16, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !390, file: !382, line: 48, baseType: !413, size: 64, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!396, !416}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !390, file: !382, line: 49, baseType: !418, size: 64, offset: 192)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!396, !397, !421, !397}
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !423)
!423 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !390, file: !382, line: 50, baseType: !425, size: 64, offset: 256)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!396, !397, !421, !416}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !390, file: !382, line: 51, baseType: !429, size: 64, offset: 320)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!396, !397, !421, !432}
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{null}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !390, file: !382, line: 52, baseType: !436, size: 64, offset: 384)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!396, !397, !421, !439}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!440 = !{!441}
!441 = !DISubrange(count: 1)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !383, file: !382, line: 76, baseType: !400, size: 64, offset: 512)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !383, file: !382, line: 77, baseType: !328, size: 32, offset: 576)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !383, file: !382, line: 78, baseType: !445, size: 64, offset: 640)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !364)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !383, file: !382, line: 78, baseType: !445, size: 64, offset: 704)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !383, file: !382, line: 78, baseType: !445, size: 64, offset: 768)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !383, file: !382, line: 78, baseType: !445, size: 64, offset: 832)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !383, file: !382, line: 79, baseType: !450, size: 64, offset: 896)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !452)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !453, line: 27, baseType: !454)
!453 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !455, line: 43, baseType: !456)
!455 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!456 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !383, file: !382, line: 80, baseType: !328, size: 32, offset: 960)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !383, file: !382, line: 81, baseType: !459, size: 32, offset: 992)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !383, file: !382, line: 82, baseType: !461, size: 64, offset: 1024)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !462)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !383, file: !382, line: 83, baseType: !465, size: 64, offset: 1088)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !383, file: !382, line: 84, baseType: !469, size: 64, offset: 1152)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !383, file: !382, line: 85, baseType: !469, size: 64, offset: 1216)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !383, file: !382, line: 86, baseType: !469, size: 64, offset: 1280)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !383, file: !382, line: 87, baseType: !469, size: 64, offset: 1344)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !383, file: !382, line: 88, baseType: !397, size: 64, offset: 1408)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !383, file: !382, line: 89, baseType: !450, size: 64, offset: 1472)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !383, file: !382, line: 90, baseType: !469, size: 64, offset: 1536)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !383, file: !382, line: 91, baseType: !469, size: 64, offset: 1600)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !383, file: !382, line: 92, baseType: !328, size: 32, offset: 1664)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !383, file: !382, line: 93, baseType: !479, size: 64, offset: 1728)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !383, file: !382, line: 94, baseType: !481, size: 64, offset: 1792)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !451)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !383, file: !382, line: 95, baseType: !328, size: 32, offset: 1856)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !383, file: !382, line: 95, baseType: !328, size: 32, offset: 1888)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !383, file: !382, line: 96, baseType: !485, size: 64, offset: 1920)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !383, file: !382, line: 96, baseType: !485, size: 64, offset: 1984)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !383, file: !382, line: 97, baseType: !333, size: 64, offset: 2048)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !383, file: !382, line: 97, baseType: !489, size: 64, offset: 2112)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !383, file: !382, line: 98, baseType: !328, size: 32, offset: 2176)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !383, file: !382, line: 98, baseType: !328, size: 32, offset: 2208)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !383, file: !382, line: 99, baseType: !485, size: 64, offset: 2240)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !383, file: !382, line: 99, baseType: !485, size: 64, offset: 2304)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !383, file: !382, line: 100, baseType: !495, size: 64, offset: 2368)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !383, file: !382, line: 100, baseType: !497, size: 64, offset: 2432)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !383, file: !382, line: 101, baseType: !328, size: 32, offset: 2496)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !383, file: !382, line: 101, baseType: !328, size: 32, offset: 2528)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !383, file: !382, line: 102, baseType: !485, size: 64, offset: 2560)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !383, file: !382, line: 102, baseType: !485, size: 64, offset: 2624)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !383, file: !382, line: 103, baseType: !366, size: 64, offset: 2688)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !383, file: !382, line: 103, baseType: !504, size: 64, offset: 2752)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !383, file: !382, line: 104, baseType: !439, size: 64, offset: 2816)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !383, file: !382, line: 105, baseType: !328, size: 32, offset: 2880)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !383, file: !382, line: 106, baseType: !508, size: 128, offset: 2944)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !509, size: 128, elements: !515)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !382, line: 64, baseType: !511)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !382, line: 61, size: 128, elements: !512)
!512 = !{!513, !514}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !511, file: !382, line: 62, baseType: !432, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !511, file: !382, line: 63, baseType: !479, size: 64, offset: 64)
!515 = !{!516}
!516 = !DISubrange(count: 2)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !383, file: !382, line: 107, baseType: !518, size: 64, offset: 3072)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 64, elements: !515)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !383, file: !382, line: 108, baseType: !479, size: 64, offset: 3136)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !383, file: !382, line: 109, baseType: !521, size: 64, offset: 3200)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{!396, !479}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !383, file: !382, line: 111, baseType: !328, size: 32, offset: 3264)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !383, file: !382, line: 112, baseType: !526, size: 320, offset: 3328)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !527, size: 320, elements: !571)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!396, !530, !397, !479}
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !532)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !533)
!533 = !{!534, !535, !559, !560, !561, !562, !563, !564, !565, !566, !567}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !532, file: !10, line: 100, baseType: !328, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !532, file: !10, line: 101, baseType: !536, size: 64, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !537)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !539)
!539 = !{!540, !541, !542, !543, !544, !547, !548, !549, !553, !554, !556, !557, !558}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !538, file: !10, line: 84, baseType: !469, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !538, file: !10, line: 85, baseType: !469, size: 64, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !538, file: !10, line: 86, baseType: !479, size: 64, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !538, file: !10, line: 87, baseType: !461, size: 64, offset: 192)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !538, file: !10, line: 88, baseType: !545, size: 64, offset: 256)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !421)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !538, file: !10, line: 89, baseType: !423, size: 8, offset: 320)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !538, file: !10, line: 90, baseType: !469, size: 64, offset: 384)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !538, file: !10, line: 91, baseType: !550, size: 64, offset: 448)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !551, line: 46, baseType: !552)
!551 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!552 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !538, file: !10, line: 92, baseType: !326, size: 32, offset: 512)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !538, file: !10, line: 93, baseType: !555, size: 32, offset: 544)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !538, file: !10, line: 94, baseType: !536, size: 64, offset: 576)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !538, file: !10, line: 95, baseType: !469, size: 64, offset: 640)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !538, file: !10, line: 96, baseType: !479, size: 64, offset: 704)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !532, file: !10, line: 102, baseType: !469, size: 64, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !532, file: !10, line: 102, baseType: !469, size: 64, offset: 192)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !532, file: !10, line: 103, baseType: !469, size: 64, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !532, file: !10, line: 104, baseType: !400, size: 64, offset: 320)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !532, file: !10, line: 105, baseType: !326, size: 32, offset: 384)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !532, file: !10, line: 105, baseType: !326, size: 32, offset: 416)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !532, file: !10, line: 105, baseType: !326, size: 32, offset: 448)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !532, file: !10, line: 106, baseType: !397, size: 64, offset: 512)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !532, file: !10, line: 107, baseType: !568, size: 64, offset: 576)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!571 = !{!572}
!572 = !DISubrange(count: 5)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !383, file: !382, line: 113, baseType: !574, size: 320, offset: 3648)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 320, elements: !571)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{!396, !397, !479}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !383, file: !382, line: 114, baseType: !579, size: 320, offset: 3968)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !479, size: 320, elements: !571)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !383, file: !382, line: 115, baseType: !326, size: 32, offset: 4288)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !383, file: !382, line: 120, baseType: !568, size: 64, offset: 4352)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !383, file: !382, line: 121, baseType: !326, size: 32, offset: 4416)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !378, file: !345, line: 437, baseType: !584, size: 9472, offset: 4480)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 9472, elements: !440)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !345, line: 32, size: 9472, elements: !586)
!586 = !{!587, !596, !600, !601, !608, !612, !613, !614, !615, !616, !617, !618, !638, !642, !647, !653, !672, !677, !681, !682, !687, !692, !693, !698, !702, !706, !710, !714, !718, !719, !720, !721, !722, !726, !727, !732, !733, !734, !735, !736, !741, !748, !753, !757, !761, !765, !769, !770, !774, !775, !782, !787, !788, !789, !790, !852, !860, !861, !865, !866, !870, !871, !875, !880, !881, !885, !889, !896, !897, !898, !899, !900, !901, !906, !907, !911, !915, !919, !920, !921, !925, !935, !936, !940, !941, !945, !946, !950, !951, !956, !957, !961, !965, !966, !967, !968, !969, !970, !971, !975, !976, !977, !978, !979, !980, !984, !985, !986, !987, !988, !989, !990, !991, !995, !999, !1000, !1001, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1015, !1016, !1017, !1022, !1026, !1027, !1031, !1032, !1033, !1034, !1060, !1064, !1065, !1066, !1067, !1068, !1072, !1073, !1074, !1075, !1076, !1080, !1084, !1085}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !585, file: !345, line: 34, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!396, !376, !328, !591, !328, !591, !593, !595}
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !328)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !362)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !585, file: !345, line: 35, baseType: !597, size: 64, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{!396, !376, !328, !333, !489, !504}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !585, file: !345, line: 36, baseType: !597, size: 64, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !585, file: !345, line: 37, baseType: !602, size: 64, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!396, !376, !605, !605}
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !606)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !585, file: !345, line: 38, baseType: !609, size: 64, offset: 256)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{!396, !376, !605, !605, !605}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !585, file: !345, line: 40, baseType: !602, size: 64, offset: 320)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !585, file: !345, line: 41, baseType: !609, size: 64, offset: 384)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !585, file: !345, line: 42, baseType: !602, size: 64, offset: 448)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !585, file: !345, line: 43, baseType: !609, size: 64, offset: 512)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !585, file: !345, line: 44, baseType: !602, size: 64, offset: 576)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !585, file: !345, line: 46, baseType: !609, size: 64, offset: 640)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !585, file: !345, line: 47, baseType: !619, size: 64, offset: 704)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!396, !376, !368, !368, !622}
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !624)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !625)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !626)
!626 = !{!627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !625, file: !36, line: 1227, baseType: !363, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !625, file: !36, line: 1228, baseType: !363, size: 64, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !625, file: !36, line: 1229, baseType: !363, size: 64, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !625, file: !36, line: 1230, baseType: !363, size: 64, offset: 192)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !625, file: !36, line: 1231, baseType: !363, size: 64, offset: 256)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !625, file: !36, line: 1232, baseType: !363, size: 64, offset: 320)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !625, file: !36, line: 1233, baseType: !363, size: 64, offset: 384)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !625, file: !36, line: 1234, baseType: !363, size: 64, offset: 448)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !625, file: !36, line: 1236, baseType: !363, size: 64, offset: 512)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !625, file: !36, line: 1237, baseType: !363, size: 64, offset: 576)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !625, file: !36, line: 1238, baseType: !363, size: 64, offset: 640)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !585, file: !345, line: 48, baseType: !639, size: 64, offset: 768)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!396, !376, !368, !622}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !585, file: !345, line: 49, baseType: !643, size: 64, offset: 832)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!396, !376, !605, !363, !646, !363, !328, !328, !605}
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !585, file: !345, line: 50, baseType: !648, size: 64, offset: 896)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!396, !376, !651, !652}
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !585, file: !345, line: 52, baseType: !654, size: 64, offset: 960)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!396, !376, !657, !658}
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !661)
!661 = !{!662, !663, !664, !665, !666, !667, !668, !669, !670, !671}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !660, file: !36, line: 593, baseType: !445, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !660, file: !36, line: 594, baseType: !445, size: 64, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !660, file: !36, line: 594, baseType: !445, size: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !660, file: !36, line: 594, baseType: !445, size: 64, offset: 192)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !660, file: !36, line: 595, baseType: !445, size: 64, offset: 256)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !660, file: !36, line: 596, baseType: !445, size: 64, offset: 320)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !660, file: !36, line: 597, baseType: !445, size: 64, offset: 384)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !660, file: !36, line: 598, baseType: !445, size: 64, offset: 448)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !660, file: !36, line: 598, baseType: !445, size: 64, offset: 512)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !660, file: !36, line: 599, baseType: !445, size: 64, offset: 576)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !585, file: !345, line: 53, baseType: !673, size: 64, offset: 1024)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!396, !376, !376, !676}
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !585, file: !345, line: 54, baseType: !678, size: 64, offset: 1088)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{!396, !376, !605}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !585, file: !345, line: 55, baseType: !602, size: 64, offset: 1152)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !585, file: !345, line: 56, baseType: !683, size: 64, offset: 1216)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{!396, !376, !686, !495}
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !585, file: !345, line: 58, baseType: !688, size: 64, offset: 1280)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!396, !376, !691}
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !585, file: !345, line: 59, baseType: !688, size: 64, offset: 1344)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !585, file: !345, line: 60, baseType: !694, size: 64, offset: 1408)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!396, !376, !697, !326}
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !585, file: !345, line: 61, baseType: !699, size: 64, offset: 1472)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DISubroutineType(types: !701)
!701 = !{!396, !376}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !585, file: !345, line: 63, baseType: !703, size: 64, offset: 1536)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{!396, !376, !328, !591, !362, !605, !605}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !585, file: !345, line: 64, baseType: !707, size: 64, offset: 1600)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{!396, !376, !376, !368, !368, !622}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !585, file: !345, line: 65, baseType: !711, size: 64, offset: 1664)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!396, !376, !376, !622}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !585, file: !345, line: 66, baseType: !715, size: 64, offset: 1728)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!396, !376, !376, !368, !622}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !585, file: !345, line: 67, baseType: !711, size: 64, offset: 1792)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !585, file: !345, line: 69, baseType: !699, size: 64, offset: 1856)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !585, file: !345, line: 70, baseType: !707, size: 64, offset: 1920)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !585, file: !345, line: 71, baseType: !715, size: 64, offset: 1984)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !585, file: !345, line: 72, baseType: !723, size: 64, offset: 2048)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!396, !376, !652}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !585, file: !345, line: 73, baseType: !699, size: 64, offset: 2112)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !585, file: !345, line: 75, baseType: !728, size: 64, offset: 2176)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!396, !376, !731, !652}
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !585, file: !345, line: 76, baseType: !602, size: 64, offset: 2240)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !585, file: !345, line: 77, baseType: !602, size: 64, offset: 2304)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !585, file: !345, line: 78, baseType: !619, size: 64, offset: 2368)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !585, file: !345, line: 79, baseType: !639, size: 64, offset: 2432)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !585, file: !345, line: 81, baseType: !737, size: 64, offset: 2496)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!396, !376, !362, !376, !740}
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !585, file: !345, line: 82, baseType: !742, size: 64, offset: 2560)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!396, !376, !328, !745, !745, !651, !747}
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !368)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !585, file: !345, line: 83, baseType: !749, size: 64, offset: 2624)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!396, !376, !328, !752, !328}
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !585, file: !345, line: 84, baseType: !754, size: 64, offset: 2688)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{!396, !376, !328, !591, !328, !591, !366}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !585, file: !345, line: 85, baseType: !758, size: 64, offset: 2752)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!396, !376, !376, !740}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !585, file: !345, line: 87, baseType: !762, size: 64, offset: 2816)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{!396, !376, !605, !333}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !585, file: !345, line: 88, baseType: !766, size: 64, offset: 2880)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{!396, !376, !362}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !585, file: !345, line: 89, baseType: !766, size: 64, offset: 2944)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !585, file: !345, line: 90, baseType: !771, size: 64, offset: 3008)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{!396, !376, !605, !595}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !585, file: !345, line: 91, baseType: !703, size: 64, offset: 3072)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !585, file: !345, line: 93, baseType: !776, size: 64, offset: 3136)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{!396, !376, !779}
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !780)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !585, file: !345, line: 94, baseType: !783, size: 64, offset: 3200)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{!396, !376, !328, !326, !326, !333, !786, !786, !676}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !585, file: !345, line: 95, baseType: !783, size: 64, offset: 3264)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !585, file: !345, line: 96, baseType: !783, size: 64, offset: 3328)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !585, file: !345, line: 97, baseType: !783, size: 64, offset: 3392)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !585, file: !345, line: 99, baseType: !791, size: 64, offset: 3456)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!396, !376, !794, !797}
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !369, line: 51, baseType: !795)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !369, line: 51, flags: DIFlagFwdDecl)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !798)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !345, line: 609, size: 6208, elements: !800)
!800 = !{!801, !802, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !821, !828, !829, !830, !831, !832, !833, !834, !835, !839, !840, !841, !842, !843, !845, !846, !847, !848, !849, !850, !851}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !799, file: !345, line: 610, baseType: !381, size: 4480)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !799, file: !345, line: 610, baseType: !803, size: 32, offset: 4480)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !440)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !799, file: !345, line: 611, baseType: !328, size: 32, offset: 4512)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !799, file: !345, line: 611, baseType: !328, size: 32, offset: 4544)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !799, file: !345, line: 611, baseType: !328, size: 32, offset: 4576)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !799, file: !345, line: 612, baseType: !328, size: 32, offset: 4608)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !799, file: !345, line: 613, baseType: !328, size: 32, offset: 4640)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !799, file: !345, line: 614, baseType: !333, size: 64, offset: 4672)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !799, file: !345, line: 615, baseType: !489, size: 64, offset: 4736)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !799, file: !345, line: 616, baseType: !752, size: 64, offset: 4800)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !799, file: !345, line: 617, baseType: !333, size: 64, offset: 4864)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !799, file: !345, line: 618, baseType: !814, size: 64, offset: 4928)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !345, line: 602, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !345, line: 598, size: 128, elements: !817)
!817 = !{!818, !819, !820}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !816, file: !345, line: 599, baseType: !328, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !816, file: !345, line: 600, baseType: !328, size: 32, offset: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !816, file: !345, line: 601, baseType: !366, size: 64, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !799, file: !345, line: 619, baseType: !822, size: 64, offset: 4992)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !345, line: 607, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !345, line: 604, size: 128, elements: !825)
!825 = !{!826, !827}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !824, file: !345, line: 605, baseType: !328, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !824, file: !345, line: 606, baseType: !366, size: 64, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !799, file: !345, line: 620, baseType: !366, size: 64, offset: 5056)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !799, file: !345, line: 621, baseType: !363, size: 64, offset: 5120)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !799, file: !345, line: 622, baseType: !363, size: 64, offset: 5184)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !799, file: !345, line: 623, baseType: !605, size: 64, offset: 5248)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !799, file: !345, line: 623, baseType: !605, size: 64, offset: 5312)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !799, file: !345, line: 623, baseType: !605, size: 64, offset: 5376)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !799, file: !345, line: 624, baseType: !326, size: 32, offset: 5440)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !799, file: !345, line: 625, baseType: !836, size: 64, offset: 5504)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{!396}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !799, file: !345, line: 626, baseType: !479, size: 64, offset: 5568)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !799, file: !345, line: 627, baseType: !605, size: 64, offset: 5632)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !799, file: !345, line: 628, baseType: !328, size: 32, offset: 5696)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !799, file: !345, line: 629, baseType: !421, size: 64, offset: 5760)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !799, file: !345, line: 630, baseType: !844, size: 32, offset: 5824)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !799, file: !345, line: 631, baseType: !328, size: 32, offset: 5856)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !799, file: !345, line: 631, baseType: !328, size: 32, offset: 5888)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !799, file: !345, line: 632, baseType: !326, size: 32, offset: 5920)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !799, file: !345, line: 633, baseType: !326, size: 32, offset: 5952)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !799, file: !345, line: 634, baseType: !432, size: 64, offset: 6016)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !799, file: !345, line: 634, baseType: !479, size: 64, offset: 6080)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !799, file: !345, line: 635, baseType: !450, size: 64, offset: 6144)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !585, file: !345, line: 100, baseType: !853, size: 64, offset: 3520)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{!396, !376, !328, !328, !856, !859}
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !858)
!858 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !585, file: !345, line: 101, baseType: !699, size: 64, offset: 3584)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !585, file: !345, line: 102, baseType: !862, size: 64, offset: 3648)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DISubroutineType(types: !864)
!864 = !{!396, !376, !368, !368, !652}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !585, file: !345, line: 103, baseType: !588, size: 64, offset: 3712)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !585, file: !345, line: 105, baseType: !867, size: 64, offset: 3776)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DISubroutineType(types: !869)
!869 = !{!396, !376, !368, !368, !651, !652}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !585, file: !345, line: 106, baseType: !699, size: 64, offset: 3840)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !585, file: !345, line: 107, baseType: !872, size: 64, offset: 3904)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!396, !376, !408}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !585, file: !345, line: 108, baseType: !876, size: 64, offset: 3968)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{!396, !376, !879, !651, !652}
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !421)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !585, file: !345, line: 109, baseType: !836, size: 64, offset: 4032)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !585, file: !345, line: 111, baseType: !882, size: 64, offset: 4096)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DISubroutineType(types: !884)
!884 = !{!396, !376, !376, !376, !363, !376}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !585, file: !345, line: 112, baseType: !886, size: 64, offset: 4160)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DISubroutineType(types: !888)
!888 = !{!396, !376, !376, !376, !376}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !585, file: !345, line: 113, baseType: !890, size: 64, offset: 4224)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{!396, !376, !893, !893}
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !369, line: 30, baseType: !894)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !369, line: 30, flags: DIFlagFwdDecl)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !585, file: !345, line: 114, baseType: !588, size: 64, offset: 4288)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !585, file: !345, line: 115, baseType: !703, size: 64, offset: 4352)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !585, file: !345, line: 117, baseType: !762, size: 64, offset: 4416)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !585, file: !345, line: 118, baseType: !762, size: 64, offset: 4480)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !585, file: !345, line: 119, baseType: !876, size: 64, offset: 4544)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !585, file: !345, line: 120, baseType: !902, size: 64, offset: 4608)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{!396, !376, !905, !676}
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !585, file: !345, line: 121, baseType: !836, size: 64, offset: 4672)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !585, file: !345, line: 123, baseType: !908, size: 64, offset: 4736)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!396, !376, !328, !479}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !585, file: !345, line: 124, baseType: !912, size: 64, offset: 4800)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{!396, !376, !797, !605, !479}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !585, file: !345, line: 125, baseType: !916, size: 64, offset: 4864)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!396, !530, !376}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !585, file: !345, line: 126, baseType: !602, size: 64, offset: 4928)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !585, file: !345, line: 127, baseType: !602, size: 64, offset: 4992)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !585, file: !345, line: 129, baseType: !922, size: 64, offset: 5056)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!396, !376, !752}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !585, file: !345, line: 130, baseType: !926, size: 64, offset: 5120)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{!396, !376, !929, !929}
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !930)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !932)
!932 = !{!933, !934}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !931, file: !60, line: 653, baseType: !328, size: 32)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !931, file: !60, line: 653, baseType: !605, size: 64, offset: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !585, file: !345, line: 131, baseType: !926, size: 64, offset: 5184)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !585, file: !345, line: 132, baseType: !937, size: 64, offset: 5248)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DISubroutineType(types: !939)
!939 = !{!396, !376, !333, !333, !333}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !585, file: !345, line: 133, baseType: !872, size: 64, offset: 5312)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !585, file: !345, line: 135, baseType: !942, size: 64, offset: 5376)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{!396, !376, !363, !676}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !585, file: !345, line: 136, baseType: !942, size: 64, offset: 5440)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !585, file: !345, line: 137, baseType: !947, size: 64, offset: 5504)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{!396, !376, !676}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !585, file: !345, line: 138, baseType: !588, size: 64, offset: 5568)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !585, file: !345, line: 139, baseType: !952, size: 64, offset: 5632)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DISubroutineType(types: !954)
!954 = !{!396, !376, !955, !955}
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !585, file: !345, line: 141, baseType: !836, size: 64, offset: 5696)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !585, file: !345, line: 142, baseType: !958, size: 64, offset: 5760)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!396, !376, !376, !363, !376}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !585, file: !345, line: 143, baseType: !962, size: 64, offset: 5824)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!396, !376, !376, !376}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !585, file: !345, line: 144, baseType: !836, size: 64, offset: 5888)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !585, file: !345, line: 145, baseType: !958, size: 64, offset: 5952)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !585, file: !345, line: 147, baseType: !962, size: 64, offset: 6016)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !585, file: !345, line: 148, baseType: !836, size: 64, offset: 6080)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !585, file: !345, line: 149, baseType: !958, size: 64, offset: 6144)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !585, file: !345, line: 150, baseType: !962, size: 64, offset: 6208)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !585, file: !345, line: 151, baseType: !972, size: 64, offset: 6272)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!396, !376, !326}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !585, file: !345, line: 153, baseType: !699, size: 64, offset: 6336)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !585, file: !345, line: 154, baseType: !699, size: 64, offset: 6400)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !585, file: !345, line: 155, baseType: !699, size: 64, offset: 6464)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !585, file: !345, line: 156, baseType: !699, size: 64, offset: 6528)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !585, file: !345, line: 157, baseType: !872, size: 64, offset: 6592)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !585, file: !345, line: 159, baseType: !981, size: 64, offset: 6656)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!396, !376, !328, !593}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !585, file: !345, line: 160, baseType: !699, size: 64, offset: 6720)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !585, file: !345, line: 161, baseType: !699, size: 64, offset: 6784)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !585, file: !345, line: 162, baseType: !699, size: 64, offset: 6848)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !585, file: !345, line: 163, baseType: !699, size: 64, offset: 6912)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !585, file: !345, line: 165, baseType: !962, size: 64, offset: 6976)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !585, file: !345, line: 166, baseType: !962, size: 64, offset: 7040)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !585, file: !345, line: 167, baseType: !762, size: 64, offset: 7104)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !585, file: !345, line: 168, baseType: !992, size: 64, offset: 7168)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!396, !376, !605, !328}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !585, file: !345, line: 169, baseType: !996, size: 64, offset: 7232)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!396, !376, !676, !333}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !585, file: !345, line: 171, baseType: !723, size: 64, offset: 7296)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !585, file: !345, line: 172, baseType: !699, size: 64, offset: 7360)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !585, file: !345, line: 173, baseType: !1002, size: 64, offset: 7424)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!396, !376, !333, !786}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !585, file: !345, line: 174, baseType: !862, size: 64, offset: 7488)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !585, file: !345, line: 175, baseType: !862, size: 64, offset: 7552)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !585, file: !345, line: 177, baseType: !602, size: 64, offset: 7616)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !585, file: !345, line: 178, baseType: !648, size: 64, offset: 7680)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !585, file: !345, line: 179, baseType: !602, size: 64, offset: 7744)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !585, file: !345, line: 180, baseType: !609, size: 64, offset: 7808)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !585, file: !345, line: 181, baseType: !1012, size: 64, offset: 7872)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!396, !376, !400, !651, !652}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !585, file: !345, line: 183, baseType: !922, size: 64, offset: 7936)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !585, file: !345, line: 184, baseType: !683, size: 64, offset: 8000)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !585, file: !345, line: 185, baseType: !1018, size: 64, offset: 8064)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!396, !376, !1021}
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !585, file: !345, line: 186, baseType: !1023, size: 64, offset: 8128)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!396, !376, !328, !591, !366}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !585, file: !345, line: 187, baseType: !742, size: 64, offset: 8192)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !585, file: !345, line: 189, baseType: !1028, size: 64, offset: 8256)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!396, !376, !328, !328, !333, !593}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !585, file: !345, line: 190, baseType: !836, size: 64, offset: 8320)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !585, file: !345, line: 191, baseType: !958, size: 64, offset: 8384)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !585, file: !345, line: 192, baseType: !962, size: 64, offset: 8448)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !585, file: !345, line: 193, baseType: !1035, size: 64, offset: 8512)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!396, !376, !794, !1038}
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1039)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !345, line: 660, size: 5312, elements: !1041)
!1041 = !{!1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1040, file: !345, line: 661, baseType: !381, size: 4480)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1040, file: !345, line: 661, baseType: !803, size: 32, offset: 4480)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1040, file: !345, line: 662, baseType: !328, size: 32, offset: 4512)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1040, file: !345, line: 662, baseType: !328, size: 32, offset: 4544)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1040, file: !345, line: 662, baseType: !328, size: 32, offset: 4576)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1040, file: !345, line: 663, baseType: !328, size: 32, offset: 4608)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1040, file: !345, line: 664, baseType: !328, size: 32, offset: 4640)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1040, file: !345, line: 665, baseType: !333, size: 64, offset: 4672)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1040, file: !345, line: 666, baseType: !333, size: 64, offset: 4736)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1040, file: !345, line: 667, baseType: !328, size: 32, offset: 4800)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1040, file: !345, line: 668, baseType: !844, size: 32, offset: 4832)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1040, file: !345, line: 670, baseType: !333, size: 64, offset: 4864)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1040, file: !345, line: 670, baseType: !333, size: 64, offset: 4928)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1040, file: !345, line: 671, baseType: !333, size: 64, offset: 4992)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1040, file: !345, line: 672, baseType: !333, size: 64, offset: 5056)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1040, file: !345, line: 673, baseType: !333, size: 64, offset: 5120)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1040, file: !345, line: 674, baseType: !328, size: 32, offset: 5184)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1040, file: !345, line: 675, baseType: !333, size: 64, offset: 5248)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !585, file: !345, line: 195, baseType: !1061, size: 64, offset: 8576)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!396, !1038, !376, !376}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !585, file: !345, line: 196, baseType: !1061, size: 64, offset: 8640)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !585, file: !345, line: 197, baseType: !836, size: 64, offset: 8704)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !585, file: !345, line: 198, baseType: !958, size: 64, offset: 8768)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !585, file: !345, line: 199, baseType: !962, size: 64, offset: 8832)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !585, file: !345, line: 201, baseType: !1069, size: 64, offset: 8896)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!396, !376, !328, !328}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !585, file: !345, line: 202, baseType: !737, size: 64, offset: 8960)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !585, file: !345, line: 203, baseType: !609, size: 64, offset: 9024)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !585, file: !345, line: 204, baseType: !791, size: 64, offset: 9088)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !585, file: !345, line: 205, baseType: !922, size: 64, offset: 9152)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !585, file: !345, line: 206, baseType: !1077, size: 64, offset: 9216)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!396, !400, !376, !328, !651, !652}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !585, file: !345, line: 208, baseType: !1081, size: 64, offset: 9280)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!396, !328, !747}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !585, file: !345, line: 209, baseType: !962, size: 64, offset: 9344)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !585, file: !345, line: 210, baseType: !754, size: 64, offset: 9408)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !378, file: !345, line: 438, baseType: !1087, size: 64, offset: 13952)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !369, line: 60, baseType: !1088)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1090)
!1090 = !{!1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1089, file: !114, line: 241, baseType: !400, size: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1089, file: !114, line: 242, baseType: !459, size: 32, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1089, file: !114, line: 243, baseType: !328, size: 32, offset: 96)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1089, file: !114, line: 243, baseType: !328, size: 32, offset: 128)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1089, file: !114, line: 244, baseType: !328, size: 32, offset: 160)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1089, file: !114, line: 244, baseType: !328, size: 32, offset: 192)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1089, file: !114, line: 245, baseType: !333, size: 64, offset: 256)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1089, file: !114, line: 246, baseType: !326, size: 32, offset: 320)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1089, file: !114, line: 247, baseType: !328, size: 32, offset: 352)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1089, file: !114, line: 251, baseType: !328, size: 32, offset: 384)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1089, file: !114, line: 252, baseType: !893, size: 64, offset: 448)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1089, file: !114, line: 253, baseType: !326, size: 32, offset: 512)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1089, file: !114, line: 254, baseType: !328, size: 32, offset: 544)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1089, file: !114, line: 254, baseType: !328, size: 32, offset: 576)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1089, file: !114, line: 255, baseType: !328, size: 32, offset: 608)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !378, file: !345, line: 438, baseType: !1087, size: 64, offset: 14016)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !378, file: !345, line: 439, baseType: !479, size: 64, offset: 14080)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !378, file: !345, line: 440, baseType: !1109, size: 32, offset: 14144)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !378, file: !345, line: 441, baseType: !326, size: 32, offset: 14176)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !378, file: !345, line: 442, baseType: !326, size: 32, offset: 14208)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !378, file: !345, line: 443, baseType: !1113, size: 448, offset: 14272)
!1113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1114, size: 448, elements: !1115)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !421)
!1115 = !{!1116}
!1116 = !DISubrange(count: 7)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !378, file: !345, line: 444, baseType: !326, size: 32, offset: 14720)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !378, file: !345, line: 445, baseType: !326, size: 32, offset: 14752)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !378, file: !345, line: 446, baseType: !328, size: 32, offset: 14784)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !378, file: !345, line: 447, baseType: !481, size: 64, offset: 14848)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !378, file: !345, line: 448, baseType: !481, size: 64, offset: 14912)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !378, file: !345, line: 449, baseType: !659, size: 640, offset: 14976)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !378, file: !345, line: 450, baseType: !595, size: 32, offset: 15616)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !378, file: !345, line: 451, baseType: !1125, size: 2880, offset: 15680)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !345, line: 318, baseType: !1126)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !345, line: 319, size: 2880, elements: !1127)
!1127 = !{!1128, !1129, !1130, !1131, !1132, !1133, !1134, !1147, !1148, !1153, !1158, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1173, !1174, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1206, !1207, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1230, !1231, !1232, !1236, !1237}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1126, file: !345, line: 320, baseType: !328, size: 32)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1126, file: !345, line: 321, baseType: !328, size: 32, offset: 32)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1126, file: !345, line: 322, baseType: !328, size: 32, offset: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1126, file: !345, line: 323, baseType: !328, size: 32, offset: 96)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1126, file: !345, line: 324, baseType: !328, size: 32, offset: 128)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1126, file: !345, line: 325, baseType: !328, size: 32, offset: 160)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1126, file: !345, line: 326, baseType: !1135, size: 64, offset: 192)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !345, line: 293, baseType: !1136)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !345, line: 295, size: 448, elements: !1138)
!1138 = !{!1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1137, file: !345, line: 296, baseType: !1135, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1137, file: !345, line: 297, baseType: !366, size: 64, offset: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1137, file: !345, line: 297, baseType: !366, size: 64, offset: 128)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1137, file: !345, line: 298, baseType: !333, size: 64, offset: 192)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1137, file: !345, line: 298, baseType: !333, size: 64, offset: 256)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1137, file: !345, line: 299, baseType: !328, size: 32, offset: 320)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1137, file: !345, line: 300, baseType: !328, size: 32, offset: 352)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1137, file: !345, line: 301, baseType: !328, size: 32, offset: 384)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1126, file: !345, line: 326, baseType: !1135, size: 64, offset: 256)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1126, file: !345, line: 328, baseType: !1149, size: 64, offset: 320)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!396, !376, !1152, !333}
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1126, file: !345, line: 329, baseType: !1154, size: 64, offset: 384)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!396, !1152, !1157, !489, !489, !504, !333}
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1126, file: !345, line: 330, baseType: !1159, size: 64, offset: 448)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!396, !1152}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1126, file: !345, line: 331, baseType: !1159, size: 64, offset: 512)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1126, file: !345, line: 334, baseType: !400, size: 64, offset: 576)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1126, file: !345, line: 335, baseType: !459, size: 32, offset: 640)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1126, file: !345, line: 335, baseType: !459, size: 32, offset: 672)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1126, file: !345, line: 336, baseType: !459, size: 32, offset: 704)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1126, file: !345, line: 336, baseType: !459, size: 32, offset: 736)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1126, file: !345, line: 337, baseType: !1169, size: 64, offset: 768)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !401, line: 339, baseType: !1171)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !401, line: 339, flags: DIFlagFwdDecl)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1126, file: !345, line: 338, baseType: !1169, size: 64, offset: 832)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1126, file: !345, line: 339, baseType: !1175, size: 64, offset: 896)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !401, line: 341, baseType: !1177)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !401, line: 351, size: 192, elements: !1178)
!1178 = !{!1179, !1180, !1181, !1182, !1183}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1177, file: !401, line: 354, baseType: !72, size: 32)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1177, file: !401, line: 355, baseType: !72, size: 32, offset: 32)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1177, file: !401, line: 356, baseType: !72, size: 32, offset: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1177, file: !401, line: 361, baseType: !72, size: 32, offset: 96)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1177, file: !401, line: 362, baseType: !550, size: 64, offset: 128)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1126, file: !345, line: 340, baseType: !328, size: 32, offset: 960)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1126, file: !345, line: 340, baseType: !328, size: 32, offset: 992)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1126, file: !345, line: 341, baseType: !366, size: 64, offset: 1024)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1126, file: !345, line: 342, baseType: !333, size: 64, offset: 1088)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1126, file: !345, line: 343, baseType: !504, size: 64, offset: 1152)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1126, file: !345, line: 344, baseType: !489, size: 64, offset: 1216)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1126, file: !345, line: 345, baseType: !328, size: 32, offset: 1280)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1126, file: !345, line: 346, baseType: !1157, size: 64, offset: 1344)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1126, file: !345, line: 347, baseType: !326, size: 32, offset: 1408)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1126, file: !345, line: 348, baseType: !328, size: 32, offset: 1440)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1126, file: !345, line: 351, baseType: !326, size: 32, offset: 1472)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1126, file: !345, line: 352, baseType: !326, size: 32, offset: 1504)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1126, file: !345, line: 353, baseType: !459, size: 32, offset: 1536)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1126, file: !345, line: 354, baseType: !459, size: 32, offset: 1568)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1126, file: !345, line: 355, baseType: !1157, size: 64, offset: 1600)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1126, file: !345, line: 356, baseType: !1157, size: 64, offset: 1664)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1126, file: !345, line: 357, baseType: !1201, size: 64, offset: 1728)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !345, line: 310, baseType: !1203)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !345, line: 308, size: 32, elements: !1204)
!1204 = !{!1205}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1203, file: !345, line: 309, baseType: !328, size: 32)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1126, file: !345, line: 357, baseType: !1201, size: 64, offset: 1792)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1126, file: !345, line: 358, baseType: !1208, size: 64, offset: 1856)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !345, line: 316, baseType: !1210)
!1210 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !345, line: 312, size: 128, elements: !1211)
!1211 = !{!1212, !1213, !1214}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1210, file: !345, line: 313, baseType: !479, size: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1210, file: !345, line: 314, baseType: !328, size: 32, offset: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1210, file: !345, line: 315, baseType: !423, size: 8, offset: 96)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1126, file: !345, line: 359, baseType: !1208, size: 64, offset: 1920)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1126, file: !345, line: 360, baseType: !1208, size: 64, offset: 1984)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1126, file: !345, line: 361, baseType: !328, size: 32, offset: 2048)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1126, file: !345, line: 362, baseType: !459, size: 32, offset: 2080)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1126, file: !345, line: 363, baseType: !328, size: 32, offset: 2112)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1126, file: !345, line: 364, baseType: !1157, size: 64, offset: 2176)
