; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/sbaij/mpi/sbaijov.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/sbaij/mpi/sbaijov.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!249 = !DIEnumerator(name: "MATOP_TRANSPOSE_COLORING_CREAT", value: 133, isUnsigned: true)
!250 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_SPT", value: 134, isUnsigned: true)
!251 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_DEN", value: 135, isUnsigned: true)
!252 = !DIEnumerator(name: "MATOP_RART", value: 136, isUnsigned: true)
!253 = !DIEnumerator(name: "MATOP_RART_SYMBOLIC", value: 137, isUnsigned: true)
!254 = !DIEnumerator(name: "MATOP_RART_NUMERIC", value: 138, isUnsigned: true)
!255 = !DIEnumerator(name: "MATOP_SET_BLOCK_SIZES", value: 139, isUnsigned: true)
!256 = !DIEnumerator(name: "MATOP_AYPX", value: 140, isUnsigned: true)
!257 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!258 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!259 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!260 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!261 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!262 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 161, baseType: !5, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272}
!265 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 663, baseType: !5, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !301)
!301 = !{!302, !303, !304}
!302 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!305 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !306, line: 132, baseType: !5, size: 32, elements: !307)
!306 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/impls/sbaij/mpi/sbaijov.c", directory: "/home/users/ndemeye/xSDK")
!307 = !{!308, !309}
!308 = !DIEnumerator(name: "MINE", value: 0, isUnsigned: true)
!309 = !DIEnumerator(name: "OTHER", value: 1, isUnsigned: true)
!310 = !{!311, !503, !349, !429, !409, !346, !1191, !1373, !419, !72, !1376, !370, !5, !372, !394, !1486}
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_MPISBAIJ", file: !313, line: 20, baseType: !314)
!313 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/sbaij/mpi/mpisbaij.h", directory: "/home/users/ndemeye/xSDK")
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !313, line: 8, size: 3008, elements: !315)
!315 = !{!316, !319, !320, !321, !322, !323, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1319, !1320, !1321, !1333, !1334, !1335, !1336, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "rangebs", scope: !314, file: !313, line: 9, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "rstartbs", scope: !314, file: !313, line: 9, baseType: !318, size: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "rendbs", scope: !314, file: !313, line: 9, baseType: !318, size: 32, offset: 96)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "cstartbs", scope: !314, file: !313, line: 9, baseType: !318, size: 32, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "cendbs", scope: !314, file: !313, line: 9, baseType: !318, size: 32, offset: 160)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !314, file: !313, line: 9, baseType: !324, size: 64, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !327, line: 436, size: 23424, elements: !328)
!327 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!328 = !{!329, !537, !1044, !1064, !1065, !1066, !1068, !1069, !1070, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1197, !1198, !1214, !1215, !1216, !1217, !1218, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1253, !1273, !1274, !1276, !1277, !1278, !1279, !1280, !1281, !1299, !1300}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !326, file: !327, line: 437, baseType: !330, size: 4480)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !331, line: 122, baseType: !332)
!331 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !331, line: 73, size: 4480, elements: !333)
!333 = !{!334, !336, !391, !392, !393, !396, !397, !398, !399, !407, !408, !410, !414, !418, !420, !421, !422, !423, !424, !425, !426, !427, !428, !430, !432, !433, !434, !436, !437, !438, !440, !441, !442, !443, !444, !447, !449, !450, !451, !452, !453, !456, !458, !459, !460, !470, !472, !473, !477, !478, !527, !532, !534, !535, !536}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !332, file: !331, line: 74, baseType: !335, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !332, file: !331, line: 75, baseType: !337, size: 448, offset: 64)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 448, elements: !389)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !331, line: 53, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !331, line: 45, size: 448, elements: !340)
!340 = !{!341, !353, !361, !366, !373, !377, !384}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !339, file: !331, line: 46, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!345, !346, !348}
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !350, line: 330, baseType: !351)
!350 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !350, line: 330, flags: DIFlagFwdDecl)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !339, file: !331, line: 47, baseType: !354, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!345, !346, !357}
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !358, line: 16, baseType: !359)
!358 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !358, line: 16, flags: DIFlagFwdDecl)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !339, file: !331, line: 48, baseType: !362, size: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!345, !365}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !339, file: !331, line: 49, baseType: !367, size: 64, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{!345, !346, !370, !346}
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !372)
!372 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !339, file: !331, line: 50, baseType: !374, size: 64, offset: 256)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!345, !346, !370, !365}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !339, file: !331, line: 51, baseType: !378, size: 64, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!345, !346, !370, !381}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{null}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !339, file: !331, line: 52, baseType: !385, size: 64, offset: 384)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!345, !346, !370, !388}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!389 = !{!390}
!390 = !DISubrange(count: 1)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !332, file: !331, line: 76, baseType: !349, size: 64, offset: 512)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !332, file: !331, line: 77, baseType: !318, size: 32, offset: 576)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !332, file: !331, line: 78, baseType: !394, size: 64, offset: 640)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !395)
!395 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !332, file: !331, line: 78, baseType: !394, size: 64, offset: 704)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !332, file: !331, line: 78, baseType: !394, size: 64, offset: 768)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !332, file: !331, line: 78, baseType: !394, size: 64, offset: 832)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !332, file: !331, line: 79, baseType: !400, size: 64, offset: 896)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !401)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !403, line: 27, baseType: !404)
!403 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !405, line: 43, baseType: !406)
!405 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!406 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !332, file: !331, line: 80, baseType: !318, size: 32, offset: 960)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !332, file: !331, line: 81, baseType: !409, size: 32, offset: 992)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !332, file: !331, line: 82, baseType: !411, size: 64, offset: 1024)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !332, file: !331, line: 83, baseType: !415, size: 64, offset: 1088)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !332, file: !331, line: 84, baseType: !419, size: 64, offset: 1152)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !332, file: !331, line: 85, baseType: !419, size: 64, offset: 1216)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !332, file: !331, line: 86, baseType: !419, size: 64, offset: 1280)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !332, file: !331, line: 87, baseType: !419, size: 64, offset: 1344)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !332, file: !331, line: 88, baseType: !346, size: 64, offset: 1408)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !332, file: !331, line: 89, baseType: !400, size: 64, offset: 1472)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !332, file: !331, line: 90, baseType: !419, size: 64, offset: 1536)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !332, file: !331, line: 91, baseType: !419, size: 64, offset: 1600)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !332, file: !331, line: 92, baseType: !318, size: 32, offset: 1664)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !332, file: !331, line: 93, baseType: !429, size: 64, offset: 1728)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !332, file: !331, line: 94, baseType: !431, size: 64, offset: 1792)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !401)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !332, file: !331, line: 95, baseType: !318, size: 32, offset: 1856)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !332, file: !331, line: 95, baseType: !318, size: 32, offset: 1888)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !332, file: !331, line: 96, baseType: !435, size: 64, offset: 1920)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !332, file: !331, line: 96, baseType: !435, size: 64, offset: 1984)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !332, file: !331, line: 97, baseType: !317, size: 64, offset: 2048)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !332, file: !331, line: 97, baseType: !439, size: 64, offset: 2112)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !332, file: !331, line: 98, baseType: !318, size: 32, offset: 2176)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !332, file: !331, line: 98, baseType: !318, size: 32, offset: 2208)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !332, file: !331, line: 99, baseType: !435, size: 64, offset: 2240)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !332, file: !331, line: 99, baseType: !435, size: 64, offset: 2304)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !332, file: !331, line: 100, baseType: !445, size: 64, offset: 2368)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !395)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !332, file: !331, line: 100, baseType: !448, size: 64, offset: 2432)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !332, file: !331, line: 101, baseType: !318, size: 32, offset: 2496)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !332, file: !331, line: 101, baseType: !318, size: 32, offset: 2528)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !332, file: !331, line: 102, baseType: !435, size: 64, offset: 2560)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !332, file: !331, line: 102, baseType: !435, size: 64, offset: 2624)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !332, file: !331, line: 103, baseType: !454, size: 64, offset: 2688)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !446)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !332, file: !331, line: 103, baseType: !457, size: 64, offset: 2752)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !332, file: !331, line: 104, baseType: !388, size: 64, offset: 2816)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !332, file: !331, line: 105, baseType: !318, size: 32, offset: 2880)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !332, file: !331, line: 106, baseType: !461, size: 128, offset: 2944)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !462, size: 128, elements: !468)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !331, line: 64, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !331, line: 61, size: 128, elements: !465)
!465 = !{!466, !467}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !464, file: !331, line: 62, baseType: !381, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !464, file: !331, line: 63, baseType: !429, size: 64, offset: 64)
!468 = !{!469}
!469 = !DISubrange(count: 2)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !332, file: !331, line: 107, baseType: !471, size: 64, offset: 3072)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !318, size: 64, elements: !468)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !332, file: !331, line: 108, baseType: !429, size: 64, offset: 3136)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !332, file: !331, line: 109, baseType: !474, size: 64, offset: 3200)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!345, !429}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !332, file: !331, line: 111, baseType: !318, size: 32, offset: 3264)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !332, file: !331, line: 112, baseType: !479, size: 320, offset: 3328)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 320, elements: !525)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!345, !483, !346, !429}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !486)
!486 = !{!487, !488, !513, !514, !515, !516, !517, !518, !519, !520, !521}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !485, file: !10, line: 100, baseType: !318, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !485, file: !10, line: 101, baseType: !489, size: 64, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !490)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !492)
!492 = !{!493, !494, !495, !496, !497, !500, !501, !502, !506, !508, !510, !511, !512}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !491, file: !10, line: 84, baseType: !419, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !491, file: !10, line: 85, baseType: !419, size: 64, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !491, file: !10, line: 86, baseType: !429, size: 64, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !491, file: !10, line: 87, baseType: !411, size: 64, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !491, file: !10, line: 88, baseType: !498, size: 64, offset: 256)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !370)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !491, file: !10, line: 89, baseType: !372, size: 8, offset: 320)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !491, file: !10, line: 90, baseType: !419, size: 64, offset: 384)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !491, file: !10, line: 91, baseType: !503, size: 64, offset: 448)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !504, line: 46, baseType: !505)
!504 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!505 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !491, file: !10, line: 92, baseType: !507, size: 32, offset: 512)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !491, file: !10, line: 93, baseType: !509, size: 32, offset: 544)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !491, file: !10, line: 94, baseType: !489, size: 64, offset: 576)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !491, file: !10, line: 95, baseType: !419, size: 64, offset: 640)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !491, file: !10, line: 96, baseType: !429, size: 64, offset: 704)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !485, file: !10, line: 102, baseType: !419, size: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !485, file: !10, line: 102, baseType: !419, size: 64, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !485, file: !10, line: 103, baseType: !419, size: 64, offset: 256)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !485, file: !10, line: 104, baseType: !349, size: 64, offset: 320)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !485, file: !10, line: 105, baseType: !507, size: 32, offset: 384)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !485, file: !10, line: 105, baseType: !507, size: 32, offset: 416)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !485, file: !10, line: 105, baseType: !507, size: 32, offset: 448)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !485, file: !10, line: 106, baseType: !346, size: 64, offset: 512)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !485, file: !10, line: 107, baseType: !522, size: 64, offset: 576)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !523)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!525 = !{!526}
!526 = !DISubrange(count: 5)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !332, file: !331, line: 113, baseType: !528, size: 320, offset: 3648)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !529, size: 320, elements: !525)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!345, !346, !429}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !332, file: !331, line: 114, baseType: !533, size: 320, offset: 3968)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !429, size: 320, elements: !525)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !332, file: !331, line: 115, baseType: !507, size: 32, offset: 4288)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !332, file: !331, line: 120, baseType: !522, size: 64, offset: 4352)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !332, file: !331, line: 121, baseType: !507, size: 32, offset: 4416)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !326, file: !327, line: 437, baseType: !538, size: 9472, offset: 4480)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, size: 9472, elements: !389)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !327, line: 32, size: 9472, elements: !540)
!540 = !{!541, !550, !554, !555, !562, !566, !567, !568, !569, !570, !571, !572, !596, !600, !605, !611, !630, !635, !639, !640, !645, !650, !651, !656, !660, !664, !668, !672, !676, !677, !678, !679, !680, !684, !685, !690, !691, !692, !693, !694, !699, !706, !711, !715, !719, !723, !727, !728, !732, !733, !740, !745, !746, !747, !748, !810, !818, !819, !823, !824, !828, !829, !833, !838, !839, !843, !847, !854, !855, !856, !857, !858, !859, !864, !865, !869, !873, !877, !878, !879, !883, !893, !894, !898, !899, !903, !904, !908, !909, !914, !915, !919, !923, !924, !925, !926, !927, !928, !929, !933, !934, !935, !936, !937, !938, !942, !943, !944, !945, !946, !947, !948, !949, !953, !957, !958, !959, !963, !964, !965, !966, !967, !968, !969, !973, !974, !975, !980, !984, !985, !989, !990, !991, !992, !1018, !1022, !1023, !1024, !1025, !1026, !1030, !1031, !1032, !1033, !1034, !1038, !1042, !1043}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !539, file: !327, line: 34, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!345, !324, !318, !545, !318, !545, !547, !549}
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !318)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !455)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !539, file: !327, line: 35, baseType: !551, size: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!345, !324, !318, !317, !439, !457}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !539, file: !327, line: 36, baseType: !551, size: 64, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !539, file: !327, line: 37, baseType: !556, size: 64, offset: 192)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{!345, !324, !559, !559}
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !560)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !539, file: !327, line: 38, baseType: !563, size: 64, offset: 256)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{!345, !324, !559, !559, !559}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !539, file: !327, line: 40, baseType: !556, size: 64, offset: 320)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !539, file: !327, line: 41, baseType: !563, size: 64, offset: 384)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !539, file: !327, line: 42, baseType: !556, size: 64, offset: 448)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !539, file: !327, line: 43, baseType: !563, size: 64, offset: 512)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !539, file: !327, line: 44, baseType: !556, size: 64, offset: 576)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !539, file: !327, line: 46, baseType: !563, size: 64, offset: 640)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !539, file: !327, line: 47, baseType: !573, size: 64, offset: 704)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{!345, !324, !576, !576, !580}
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !577, line: 11, baseType: !578)
!577 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !577, line: 11, flags: DIFlagFwdDecl)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !584)
!584 = !{!585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !583, file: !36, line: 1227, baseType: !446, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !583, file: !36, line: 1228, baseType: !446, size: 64, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !583, file: !36, line: 1229, baseType: !446, size: 64, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !583, file: !36, line: 1230, baseType: !446, size: 64, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !583, file: !36, line: 1231, baseType: !446, size: 64, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !583, file: !36, line: 1232, baseType: !446, size: 64, offset: 320)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !583, file: !36, line: 1233, baseType: !446, size: 64, offset: 384)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !583, file: !36, line: 1234, baseType: !446, size: 64, offset: 448)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !583, file: !36, line: 1236, baseType: !446, size: 64, offset: 512)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !583, file: !36, line: 1237, baseType: !446, size: 64, offset: 576)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !583, file: !36, line: 1238, baseType: !446, size: 64, offset: 640)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !539, file: !327, line: 48, baseType: !597, size: 64, offset: 768)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{!345, !324, !576, !580}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !539, file: !327, line: 49, baseType: !601, size: 64, offset: 832)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!345, !324, !559, !446, !604, !446, !318, !318, !559}
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !539, file: !327, line: 50, baseType: !606, size: 64, offset: 896)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{!345, !324, !609, !610}
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !539, file: !327, line: 52, baseType: !612, size: 64, offset: 960)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{!345, !324, !615, !616}
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !618)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !619)
!619 = !{!620, !621, !622, !623, !624, !625, !626, !627, !628, !629}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !618, file: !36, line: 593, baseType: !394, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !618, file: !36, line: 594, baseType: !394, size: 64, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !618, file: !36, line: 594, baseType: !394, size: 64, offset: 128)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !618, file: !36, line: 594, baseType: !394, size: 64, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !618, file: !36, line: 595, baseType: !394, size: 64, offset: 256)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !618, file: !36, line: 596, baseType: !394, size: 64, offset: 320)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !618, file: !36, line: 597, baseType: !394, size: 64, offset: 384)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !618, file: !36, line: 598, baseType: !394, size: 64, offset: 448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !618, file: !36, line: 598, baseType: !394, size: 64, offset: 512)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !618, file: !36, line: 599, baseType: !394, size: 64, offset: 576)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !539, file: !327, line: 53, baseType: !631, size: 64, offset: 1024)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!345, !324, !324, !634}
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !539, file: !327, line: 54, baseType: !636, size: 64, offset: 1088)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{!345, !324, !559}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !539, file: !327, line: 55, baseType: !556, size: 64, offset: 1152)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !539, file: !327, line: 56, baseType: !641, size: 64, offset: 1216)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!345, !324, !644, !445}
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !539, file: !327, line: 58, baseType: !646, size: 64, offset: 1280)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!345, !324, !649}
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !539, file: !327, line: 59, baseType: !646, size: 64, offset: 1344)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !539, file: !327, line: 60, baseType: !652, size: 64, offset: 1408)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!345, !324, !655, !507}
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !539, file: !327, line: 61, baseType: !657, size: 64, offset: 1472)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!345, !324}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !539, file: !327, line: 63, baseType: !661, size: 64, offset: 1536)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!345, !324, !318, !545, !455, !559, !559}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !539, file: !327, line: 64, baseType: !665, size: 64, offset: 1600)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!345, !324, !324, !576, !576, !580}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !539, file: !327, line: 65, baseType: !669, size: 64, offset: 1664)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{!345, !324, !324, !580}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !539, file: !327, line: 66, baseType: !673, size: 64, offset: 1728)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!345, !324, !324, !576, !580}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !539, file: !327, line: 67, baseType: !669, size: 64, offset: 1792)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !539, file: !327, line: 69, baseType: !657, size: 64, offset: 1856)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !539, file: !327, line: 70, baseType: !665, size: 64, offset: 1920)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !539, file: !327, line: 71, baseType: !673, size: 64, offset: 1984)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !539, file: !327, line: 72, baseType: !681, size: 64, offset: 2048)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!345, !324, !610}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !539, file: !327, line: 73, baseType: !657, size: 64, offset: 2112)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !539, file: !327, line: 75, baseType: !686, size: 64, offset: 2176)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!345, !324, !689, !610}
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !539, file: !327, line: 76, baseType: !556, size: 64, offset: 2240)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !539, file: !327, line: 77, baseType: !556, size: 64, offset: 2304)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !539, file: !327, line: 78, baseType: !573, size: 64, offset: 2368)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !539, file: !327, line: 79, baseType: !597, size: 64, offset: 2432)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !539, file: !327, line: 81, baseType: !695, size: 64, offset: 2496)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{!345, !324, !455, !324, !698}
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !539, file: !327, line: 82, baseType: !700, size: 64, offset: 2560)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!345, !324, !318, !703, !703, !609, !705}
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !576)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !539, file: !327, line: 83, baseType: !707, size: 64, offset: 2624)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{!345, !324, !318, !710, !318}
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !539, file: !327, line: 84, baseType: !712, size: 64, offset: 2688)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!345, !324, !318, !545, !318, !545, !454}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !539, file: !327, line: 85, baseType: !716, size: 64, offset: 2752)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!345, !324, !324, !698}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !539, file: !327, line: 87, baseType: !720, size: 64, offset: 2816)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!345, !324, !559, !317}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !539, file: !327, line: 88, baseType: !724, size: 64, offset: 2880)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!345, !324, !455}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !539, file: !327, line: 89, baseType: !724, size: 64, offset: 2944)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !539, file: !327, line: 90, baseType: !729, size: 64, offset: 3008)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!345, !324, !559, !549}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !539, file: !327, line: 91, baseType: !661, size: 64, offset: 3072)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !539, file: !327, line: 93, baseType: !734, size: 64, offset: 3136)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!345, !324, !737}
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !738)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !539, file: !327, line: 94, baseType: !741, size: 64, offset: 3200)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{!345, !324, !318, !507, !507, !317, !744, !744, !634}
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !539, file: !327, line: 95, baseType: !741, size: 64, offset: 3264)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !539, file: !327, line: 96, baseType: !741, size: 64, offset: 3328)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !539, file: !327, line: 97, baseType: !741, size: 64, offset: 3392)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !539, file: !327, line: 99, baseType: !749, size: 64, offset: 3456)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!345, !324, !752, !755}
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !577, line: 51, baseType: !753)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !577, line: 51, flags: DIFlagFwdDecl)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !756)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !327, line: 609, size: 6208, elements: !758)
!758 = !{!759, !760, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !779, !786, !787, !788, !789, !790, !791, !792, !793, !797, !798, !799, !800, !801, !803, !804, !805, !806, !807, !808, !809}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !757, file: !327, line: 610, baseType: !330, size: 4480)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !757, file: !327, line: 610, baseType: !761, size: 32, offset: 4480)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !389)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !757, file: !327, line: 611, baseType: !318, size: 32, offset: 4512)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !757, file: !327, line: 611, baseType: !318, size: 32, offset: 4544)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !757, file: !327, line: 611, baseType: !318, size: 32, offset: 4576)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !757, file: !327, line: 612, baseType: !318, size: 32, offset: 4608)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !757, file: !327, line: 613, baseType: !318, size: 32, offset: 4640)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !757, file: !327, line: 614, baseType: !317, size: 64, offset: 4672)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !757, file: !327, line: 615, baseType: !439, size: 64, offset: 4736)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !757, file: !327, line: 616, baseType: !710, size: 64, offset: 4800)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !757, file: !327, line: 617, baseType: !317, size: 64, offset: 4864)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !757, file: !327, line: 618, baseType: !772, size: 64, offset: 4928)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !327, line: 602, baseType: !774)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !327, line: 598, size: 128, elements: !775)
!775 = !{!776, !777, !778}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !774, file: !327, line: 599, baseType: !318, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !774, file: !327, line: 600, baseType: !318, size: 32, offset: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !774, file: !327, line: 601, baseType: !454, size: 64, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !757, file: !327, line: 619, baseType: !780, size: 64, offset: 4992)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !327, line: 607, baseType: !782)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !327, line: 604, size: 128, elements: !783)
!783 = !{!784, !785}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !782, file: !327, line: 605, baseType: !318, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !782, file: !327, line: 606, baseType: !454, size: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !757, file: !327, line: 620, baseType: !454, size: 64, offset: 5056)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !757, file: !327, line: 621, baseType: !446, size: 64, offset: 5120)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !757, file: !327, line: 622, baseType: !446, size: 64, offset: 5184)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !757, file: !327, line: 623, baseType: !559, size: 64, offset: 5248)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !757, file: !327, line: 623, baseType: !559, size: 64, offset: 5312)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !757, file: !327, line: 623, baseType: !559, size: 64, offset: 5376)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !757, file: !327, line: 624, baseType: !507, size: 32, offset: 5440)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !757, file: !327, line: 625, baseType: !794, size: 64, offset: 5504)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{!345}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !757, file: !327, line: 626, baseType: !429, size: 64, offset: 5568)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !757, file: !327, line: 627, baseType: !559, size: 64, offset: 5632)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !757, file: !327, line: 628, baseType: !318, size: 32, offset: 5696)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !757, file: !327, line: 629, baseType: !370, size: 64, offset: 5760)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !757, file: !327, line: 630, baseType: !802, size: 32, offset: 5824)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !757, file: !327, line: 631, baseType: !318, size: 32, offset: 5856)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !757, file: !327, line: 631, baseType: !318, size: 32, offset: 5888)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !757, file: !327, line: 632, baseType: !507, size: 32, offset: 5920)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !757, file: !327, line: 633, baseType: !507, size: 32, offset: 5952)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !757, file: !327, line: 634, baseType: !381, size: 64, offset: 6016)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !757, file: !327, line: 634, baseType: !429, size: 64, offset: 6080)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !757, file: !327, line: 635, baseType: !400, size: 64, offset: 6144)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !539, file: !327, line: 100, baseType: !811, size: 64, offset: 3520)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DISubroutineType(types: !813)
!813 = !{!345, !324, !318, !318, !814, !817}
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !816)
!816 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !539, file: !327, line: 101, baseType: !657, size: 64, offset: 3584)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !539, file: !327, line: 102, baseType: !820, size: 64, offset: 3648)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{!345, !324, !576, !576, !610}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !539, file: !327, line: 103, baseType: !542, size: 64, offset: 3712)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !539, file: !327, line: 105, baseType: !825, size: 64, offset: 3776)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{!345, !324, !576, !576, !609, !610}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !539, file: !327, line: 106, baseType: !657, size: 64, offset: 3840)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !539, file: !327, line: 107, baseType: !830, size: 64, offset: 3904)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{!345, !324, !357}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !539, file: !327, line: 108, baseType: !834, size: 64, offset: 3968)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!345, !324, !837, !609, !610}
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !370)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !539, file: !327, line: 109, baseType: !794, size: 64, offset: 4032)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !539, file: !327, line: 111, baseType: !840, size: 64, offset: 4096)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{!345, !324, !324, !324, !446, !324}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !539, file: !327, line: 112, baseType: !844, size: 64, offset: 4160)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DISubroutineType(types: !846)
!846 = !{!345, !324, !324, !324, !324}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !539, file: !327, line: 113, baseType: !848, size: 64, offset: 4224)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DISubroutineType(types: !850)
!850 = !{!345, !324, !851, !851}
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !577, line: 30, baseType: !852)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !577, line: 30, flags: DIFlagFwdDecl)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !539, file: !327, line: 114, baseType: !542, size: 64, offset: 4288)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !539, file: !327, line: 115, baseType: !661, size: 64, offset: 4352)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !539, file: !327, line: 117, baseType: !720, size: 64, offset: 4416)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !539, file: !327, line: 118, baseType: !720, size: 64, offset: 4480)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !539, file: !327, line: 119, baseType: !834, size: 64, offset: 4544)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !539, file: !327, line: 120, baseType: !860, size: 64, offset: 4608)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{!345, !324, !863, !634}
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !539, file: !327, line: 121, baseType: !794, size: 64, offset: 4672)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !539, file: !327, line: 123, baseType: !866, size: 64, offset: 4736)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DISubroutineType(types: !868)
!868 = !{!345, !324, !318, !429}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !539, file: !327, line: 124, baseType: !870, size: 64, offset: 4800)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DISubroutineType(types: !872)
!872 = !{!345, !324, !755, !559, !429}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !539, file: !327, line: 125, baseType: !874, size: 64, offset: 4864)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{!345, !483, !324}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !539, file: !327, line: 126, baseType: !556, size: 64, offset: 4928)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !539, file: !327, line: 127, baseType: !556, size: 64, offset: 4992)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !539, file: !327, line: 129, baseType: !880, size: 64, offset: 5056)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DISubroutineType(types: !882)
!882 = !{!345, !324, !710}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !539, file: !327, line: 130, baseType: !884, size: 64, offset: 5120)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{!345, !324, !887, !887}
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !888)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !890)
!890 = !{!891, !892}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !889, file: !60, line: 653, baseType: !318, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !889, file: !60, line: 653, baseType: !559, size: 64, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !539, file: !327, line: 131, baseType: !884, size: 64, offset: 5184)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !539, file: !327, line: 132, baseType: !895, size: 64, offset: 5248)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!345, !324, !317, !317, !317}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !539, file: !327, line: 133, baseType: !830, size: 64, offset: 5312)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !539, file: !327, line: 135, baseType: !900, size: 64, offset: 5376)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DISubroutineType(types: !902)
!902 = !{!345, !324, !446, !634}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !539, file: !327, line: 136, baseType: !900, size: 64, offset: 5440)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !539, file: !327, line: 137, baseType: !905, size: 64, offset: 5504)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{!345, !324, !634}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !539, file: !327, line: 138, baseType: !542, size: 64, offset: 5568)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !539, file: !327, line: 139, baseType: !910, size: 64, offset: 5632)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!345, !324, !913, !913}
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !539, file: !327, line: 141, baseType: !794, size: 64, offset: 5696)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !539, file: !327, line: 142, baseType: !916, size: 64, offset: 5760)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!345, !324, !324, !446, !324}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !539, file: !327, line: 143, baseType: !920, size: 64, offset: 5824)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{!345, !324, !324, !324}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !539, file: !327, line: 144, baseType: !794, size: 64, offset: 5888)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !539, file: !327, line: 145, baseType: !916, size: 64, offset: 5952)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !539, file: !327, line: 147, baseType: !920, size: 64, offset: 6016)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !539, file: !327, line: 148, baseType: !794, size: 64, offset: 6080)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !539, file: !327, line: 149, baseType: !916, size: 64, offset: 6144)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !539, file: !327, line: 150, baseType: !920, size: 64, offset: 6208)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !539, file: !327, line: 151, baseType: !930, size: 64, offset: 6272)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{!345, !324, !507}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !539, file: !327, line: 153, baseType: !657, size: 64, offset: 6336)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !539, file: !327, line: 154, baseType: !657, size: 64, offset: 6400)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !539, file: !327, line: 155, baseType: !657, size: 64, offset: 6464)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !539, file: !327, line: 156, baseType: !657, size: 64, offset: 6528)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !539, file: !327, line: 157, baseType: !830, size: 64, offset: 6592)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !539, file: !327, line: 159, baseType: !939, size: 64, offset: 6656)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!345, !324, !318, !547}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !539, file: !327, line: 160, baseType: !657, size: 64, offset: 6720)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !539, file: !327, line: 161, baseType: !657, size: 64, offset: 6784)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !539, file: !327, line: 162, baseType: !657, size: 64, offset: 6848)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !539, file: !327, line: 163, baseType: !657, size: 64, offset: 6912)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !539, file: !327, line: 165, baseType: !920, size: 64, offset: 6976)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !539, file: !327, line: 166, baseType: !920, size: 64, offset: 7040)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !539, file: !327, line: 167, baseType: !720, size: 64, offset: 7104)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !539, file: !327, line: 168, baseType: !950, size: 64, offset: 7168)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{!345, !324, !559, !318}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !539, file: !327, line: 169, baseType: !954, size: 64, offset: 7232)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{!345, !324, !634, !317}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !539, file: !327, line: 171, baseType: !681, size: 64, offset: 7296)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !539, file: !327, line: 172, baseType: !657, size: 64, offset: 7360)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !539, file: !327, line: 173, baseType: !960, size: 64, offset: 7424)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!345, !324, !317, !744}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !539, file: !327, line: 174, baseType: !820, size: 64, offset: 7488)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !539, file: !327, line: 175, baseType: !820, size: 64, offset: 7552)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !539, file: !327, line: 177, baseType: !556, size: 64, offset: 7616)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !539, file: !327, line: 178, baseType: !606, size: 64, offset: 7680)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !539, file: !327, line: 179, baseType: !556, size: 64, offset: 7744)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !539, file: !327, line: 180, baseType: !563, size: 64, offset: 7808)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !539, file: !327, line: 181, baseType: !970, size: 64, offset: 7872)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!345, !324, !349, !609, !610}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !539, file: !327, line: 183, baseType: !880, size: 64, offset: 7936)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !539, file: !327, line: 184, baseType: !641, size: 64, offset: 8000)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !539, file: !327, line: 185, baseType: !976, size: 64, offset: 8064)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!345, !324, !979}
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !539, file: !327, line: 186, baseType: !981, size: 64, offset: 8128)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!345, !324, !318, !545, !454}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !539, file: !327, line: 187, baseType: !700, size: 64, offset: 8192)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !539, file: !327, line: 189, baseType: !986, size: 64, offset: 8256)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!345, !324, !318, !318, !317, !547}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !539, file: !327, line: 190, baseType: !794, size: 64, offset: 8320)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !539, file: !327, line: 191, baseType: !916, size: 64, offset: 8384)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !539, file: !327, line: 192, baseType: !920, size: 64, offset: 8448)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !539, file: !327, line: 193, baseType: !993, size: 64, offset: 8512)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!345, !324, !752, !996}
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !997)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !327, line: 660, size: 5312, elements: !999)
!999 = !{!1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !998, file: !327, line: 661, baseType: !330, size: 4480)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !998, file: !327, line: 661, baseType: !761, size: 32, offset: 4480)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !998, file: !327, line: 662, baseType: !318, size: 32, offset: 4512)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !998, file: !327, line: 662, baseType: !318, size: 32, offset: 4544)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !998, file: !327, line: 662, baseType: !318, size: 32, offset: 4576)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !998, file: !327, line: 663, baseType: !318, size: 32, offset: 4608)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !998, file: !327, line: 664, baseType: !318, size: 32, offset: 4640)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !998, file: !327, line: 665, baseType: !317, size: 64, offset: 4672)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !998, file: !327, line: 666, baseType: !317, size: 64, offset: 4736)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !998, file: !327, line: 667, baseType: !318, size: 32, offset: 4800)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !998, file: !327, line: 668, baseType: !802, size: 32, offset: 4832)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !998, file: !327, line: 670, baseType: !317, size: 64, offset: 4864)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !998, file: !327, line: 670, baseType: !317, size: 64, offset: 4928)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !998, file: !327, line: 671, baseType: !317, size: 64, offset: 4992)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !998, file: !327, line: 672, baseType: !317, size: 64, offset: 5056)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !998, file: !327, line: 673, baseType: !317, size: 64, offset: 5120)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !998, file: !327, line: 674, baseType: !318, size: 32, offset: 5184)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !998, file: !327, line: 675, baseType: !317, size: 64, offset: 5248)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !539, file: !327, line: 195, baseType: !1019, size: 64, offset: 8576)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!345, !996, !324, !324}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !539, file: !327, line: 196, baseType: !1019, size: 64, offset: 8640)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !539, file: !327, line: 197, baseType: !794, size: 64, offset: 8704)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !539, file: !327, line: 198, baseType: !916, size: 64, offset: 8768)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !539, file: !327, line: 199, baseType: !920, size: 64, offset: 8832)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !539, file: !327, line: 201, baseType: !1027, size: 64, offset: 8896)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!345, !324, !318, !318}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !539, file: !327, line: 202, baseType: !695, size: 64, offset: 8960)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !539, file: !327, line: 203, baseType: !563, size: 64, offset: 9024)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !539, file: !327, line: 204, baseType: !749, size: 64, offset: 9088)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !539, file: !327, line: 205, baseType: !880, size: 64, offset: 9152)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !539, file: !327, line: 206, baseType: !1035, size: 64, offset: 9216)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!345, !349, !324, !318, !609, !610}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !539, file: !327, line: 208, baseType: !1039, size: 64, offset: 9280)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!345, !318, !705}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !539, file: !327, line: 209, baseType: !920, size: 64, offset: 9344)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !539, file: !327, line: 210, baseType: !712, size: 64, offset: 9408)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !326, file: !327, line: 438, baseType: !1045, size: 64, offset: 13952)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !577, line: 60, baseType: !1046)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1048)
!1048 = !{!1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1047, file: !114, line: 241, baseType: !349, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1047, file: !114, line: 242, baseType: !409, size: 32, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1047, file: !114, line: 243, baseType: !318, size: 32, offset: 96)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1047, file: !114, line: 243, baseType: !318, size: 32, offset: 128)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1047, file: !114, line: 244, baseType: !318, size: 32, offset: 160)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1047, file: !114, line: 244, baseType: !318, size: 32, offset: 192)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1047, file: !114, line: 245, baseType: !317, size: 64, offset: 256)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1047, file: !114, line: 246, baseType: !507, size: 32, offset: 320)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1047, file: !114, line: 247, baseType: !318, size: 32, offset: 352)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1047, file: !114, line: 251, baseType: !318, size: 32, offset: 384)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1047, file: !114, line: 252, baseType: !851, size: 64, offset: 448)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1047, file: !114, line: 253, baseType: !507, size: 32, offset: 512)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1047, file: !114, line: 254, baseType: !318, size: 32, offset: 544)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1047, file: !114, line: 254, baseType: !318, size: 32, offset: 576)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1047, file: !114, line: 255, baseType: !318, size: 32, offset: 608)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !326, file: !327, line: 438, baseType: !1045, size: 64, offset: 14016)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !326, file: !327, line: 439, baseType: !429, size: 64, offset: 14080)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !326, file: !327, line: 440, baseType: !1067, size: 32, offset: 14144)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !326, file: !327, line: 441, baseType: !507, size: 32, offset: 14176)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !326, file: !327, line: 442, baseType: !507, size: 32, offset: 14208)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !326, file: !327, line: 443, baseType: !1071, size: 448, offset: 14272)
!1071 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1072, size: 448, elements: !1073)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !370)
!1073 = !{!1074}
!1074 = !DISubrange(count: 7)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !326, file: !327, line: 444, baseType: !507, size: 32, offset: 14720)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !326, file: !327, line: 445, baseType: !507, size: 32, offset: 14752)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !326, file: !327, line: 446, baseType: !318, size: 32, offset: 14784)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !326, file: !327, line: 447, baseType: !431, size: 64, offset: 14848)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !326, file: !327, line: 448, baseType: !431, size: 64, offset: 14912)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !326, file: !327, line: 449, baseType: !617, size: 640, offset: 14976)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !326, file: !327, line: 450, baseType: !549, size: 32, offset: 15616)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !326, file: !327, line: 451, baseType: !1083, size: 2880, offset: 15680)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !327, line: 318, baseType: !1084)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !327, line: 319, size: 2880, elements: !1085)
!1085 = !{!1086, !1087, !1088, !1089, !1090, !1091, !1092, !1105, !1106, !1111, !1116, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1131, !1132, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1164, !1165, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1188, !1189, !1190, !1194, !1195}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1084, file: !327, line: 320, baseType: !318, size: 32)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1084, file: !327, line: 321, baseType: !318, size: 32, offset: 32)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1084, file: !327, line: 322, baseType: !318, size: 32, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1084, file: !327, line: 323, baseType: !318, size: 32, offset: 96)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1084, file: !327, line: 324, baseType: !318, size: 32, offset: 128)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1084, file: !327, line: 325, baseType: !318, size: 32, offset: 160)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1084, file: !327, line: 326, baseType: !1093, size: 64, offset: 192)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !327, line: 293, baseType: !1094)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !327, line: 295, size: 448, elements: !1096)
!1096 = !{!1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1095, file: !327, line: 296, baseType: !1093, size: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1095, file: !327, line: 297, baseType: !454, size: 64, offset: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1095, file: !327, line: 297, baseType: !454, size: 64, offset: 128)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1095, file: !327, line: 298, baseType: !317, size: 64, offset: 192)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1095, file: !327, line: 298, baseType: !317, size: 64, offset: 256)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1095, file: !327, line: 299, baseType: !318, size: 32, offset: 320)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1095, file: !327, line: 300, baseType: !318, size: 32, offset: 352)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1095, file: !327, line: 301, baseType: !318, size: 32, offset: 384)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1084, file: !327, line: 326, baseType: !1093, size: 64, offset: 256)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1084, file: !327, line: 328, baseType: !1107, size: 64, offset: 320)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{!345, !324, !1110, !317}
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1084, file: !327, line: 329, baseType: !1112, size: 64, offset: 384)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!345, !1110, !1115, !439, !439, !457, !317}
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1084, file: !327, line: 330, baseType: !1117, size: 64, offset: 448)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!345, !1110}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1084, file: !327, line: 331, baseType: !1117, size: 64, offset: 512)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1084, file: !327, line: 334, baseType: !349, size: 64, offset: 576)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1084, file: !327, line: 335, baseType: !409, size: 32, offset: 640)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1084, file: !327, line: 335, baseType: !409, size: 32, offset: 672)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1084, file: !327, line: 336, baseType: !409, size: 32, offset: 704)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1084, file: !327, line: 336, baseType: !409, size: 32, offset: 736)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1084, file: !327, line: 337, baseType: !1127, size: 64, offset: 768)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !350, line: 339, baseType: !1129)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !350, line: 339, flags: DIFlagFwdDecl)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1084, file: !327, line: 338, baseType: !1127, size: 64, offset: 832)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1084, file: !327, line: 339, baseType: !1133, size: 64, offset: 896)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !350, line: 341, baseType: !1135)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !350, line: 351, size: 192, elements: !1136)
!1136 = !{!1137, !1138, !1139, !1140, !1141}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1135, file: !350, line: 354, baseType: !72, size: 32)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1135, file: !350, line: 355, baseType: !72, size: 32, offset: 32)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1135, file: !350, line: 356, baseType: !72, size: 32, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1135, file: !350, line: 361, baseType: !72, size: 32, offset: 96)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1135, file: !350, line: 362, baseType: !503, size: 64, offset: 128)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1084, file: !327, line: 340, baseType: !318, size: 32, offset: 960)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1084, file: !327, line: 340, baseType: !318, size: 32, offset: 992)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1084, file: !327, line: 341, baseType: !454, size: 64, offset: 1024)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1084, file: !327, line: 342, baseType: !317, size: 64, offset: 1088)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1084, file: !327, line: 343, baseType: !457, size: 64, offset: 1152)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1084, file: !327, line: 344, baseType: !439, size: 64, offset: 1216)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1084, file: !327, line: 345, baseType: !318, size: 32, offset: 1280)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1084, file: !327, line: 346, baseType: !1115, size: 64, offset: 1344)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1084, file: !327, line: 347, baseType: !507, size: 32, offset: 1408)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1084, file: !327, line: 348, baseType: !318, size: 32, offset: 1440)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1084, file: !327, line: 351, baseType: !507, size: 32, offset: 1472)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1084, file: !327, line: 352, baseType: !507, size: 32, offset: 1504)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1084, file: !327, line: 353, baseType: !409, size: 32, offset: 1536)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1084, file: !327, line: 354, baseType: !409, size: 32, offset: 1568)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1084, file: !327, line: 355, baseType: !1115, size: 64, offset: 1600)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1084, file: !327, line: 356, baseType: !1115, size: 64, offset: 1664)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1084, file: !327, line: 357, baseType: !1159, size: 64, offset: 1728)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !327, line: 310, baseType: !1161)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !327, line: 308, size: 32, elements: !1162)
!1162 = !{!1163}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1161, file: !327, line: 309, baseType: !318, size: 32)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1084, file: !327, line: 357, baseType: !1159, size: 64, offset: 1792)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1084, file: !327, line: 358, baseType: !1166, size: 64, offset: 1856)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !327, line: 316, baseType: !1168)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !327, line: 312, size: 128, elements: !1169)
!1169 = !{!1170, !1171, !1172}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1168, file: !327, line: 313, baseType: !429, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1168, file: !327, line: 314, baseType: !318, size: 32, offset: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1168, file: !327, line: 315, baseType: !372, size: 8, offset: 96)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1084, file: !327, line: 359, baseType: !1166, size: 64, offset: 1920)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1084, file: !327, line: 360, baseType: !1166, size: 64, offset: 1984)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1084, file: !327, line: 361, baseType: !318, size: 32, offset: 2048)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1084, file: !327, line: 362, baseType: !409, size: 32, offset: 2080)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1084, file: !327, line: 363, baseType: !318, size: 32, offset: 2112)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1084, file: !327, line: 364, baseType: !1115, size: 64, offset: 2176)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1084, file: !327, line: 365, baseType: !1133, size: 64, offset: 2240)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1084, file: !327, line: 366, baseType: !409, size: 32, offset: 2304)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1084, file: !327, line: 367, baseType: !409, size: 32, offset: 2336)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1084, file: !327, line: 368, baseType: !1127, size: 64, offset: 2368)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1084, file: !327, line: 369, baseType: !1127, size: 64, offset: 2432)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1084, file: !327, line: 370, baseType: !1185, size: 64, offset: 2496)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1186)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1084, file: !327, line: 371, baseType: !1185, size: 64, offset: 2560)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1084, file: !327, line: 372, baseType: !1185, size: 64, offset: 2624)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1084, file: !327, line: 373, baseType: !1191, size: 64, offset: 2688)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !350, line: 331, baseType: !1192)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1193 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !350, line: 331, flags: DIFlagFwdDecl)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1084, file: !327, line: 374, baseType: !503, size: 64, offset: 2752)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1084, file: !327, line: 375, baseType: !1196, size: 64, offset: 2816)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !326, file: !327, line: 451, baseType: !1083, size: 2880, offset: 18560)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !326, file: !327, line: 452, baseType: !1199, size: 64, offset: 21440)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1200)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !327, line: 681, size: 4864, elements: !1202)
!1202 = !{!1203, !1204, !1205, !1206, !1207, !1208, !1209, !1213}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1201, file: !327, line: 682, baseType: !330, size: 4480)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1201, file: !327, line: 682, baseType: !761, size: 32, offset: 4480)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1201, file: !327, line: 683, baseType: !507, size: 32, offset: 4512)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1201, file: !327, line: 684, baseType: !318, size: 32, offset: 4544)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1201, file: !327, line: 685, baseType: !913, size: 64, offset: 4608)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1201, file: !327, line: 686, baseType: !454, size: 64, offset: 4672)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1201, file: !327, line: 687, baseType: !1210, size: 64, offset: 4736)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = !DISubroutineType(types: !1212)
!1212 = !{!345, !1199, !559, !429}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1201, file: !327, line: 688, baseType: !429, size: 64, offset: 4800)
