; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/deflation/deflation.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/deflation/deflation.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_PC = type { %struct._p_PetscObject, [1 x %struct._PCOps], %struct._p_DM*, i32, i64, i64, i32, i32, i32, i32, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 (%struct._p_PC*, i32, %struct._p_IS**, %struct._p_IS**, %struct._p_Mat**, i8*)*, i8*, i8*, i32, i8*, i32, i32 }

!83 = !{!84, !85, !86, !87, !88, !89, !90, !91, !92}
!84 = !DIEnumerator(name: "PC_DEFLATION_SPACE_HAAR", value: 0, isUnsigned: true)
!85 = !DIEnumerator(name: "PC_DEFLATION_SPACE_DB2", value: 1, isUnsigned: true)
!86 = !DIEnumerator(name: "PC_DEFLATION_SPACE_DB4", value: 2, isUnsigned: true)
!87 = !DIEnumerator(name: "PC_DEFLATION_SPACE_DB8", value: 3, isUnsigned: true)
!88 = !DIEnumerator(name: "PC_DEFLATION_SPACE_DB16", value: 4, isUnsigned: true)
!89 = !DIEnumerator(name: "PC_DEFLATION_SPACE_BIORTH22", value: 5, isUnsigned: true)
!90 = !DIEnumerator(name: "PC_DEFLATION_SPACE_MEYER", value: 6, isUnsigned: true)
!91 = !DIEnumerator(name: "PC_DEFLATION_SPACE_AGGREGATION", value: 7, isUnsigned: true)
!92 = !DIEnumerator(name: "PC_DEFLATION_SPACE_USER", value: 8, isUnsigned: true)
!93 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 344, baseType: !7, size: 32, elements: !94)
!94 = !{!95, !96}
!95 = !DIEnumerator(name: "MAT_COMPOSITE_ADDITIVE", value: 0, isUnsigned: true)
!96 = !DIEnumerator(name: "MAT_COMPOSITE_MULTIPLICATIVE", value: 1, isUnsigned: true)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 238, baseType: !7, size: 32, elements: !98)
!98 = !{!99, !100, !101, !102}
!99 = !DIEnumerator(name: "MAT_INITIAL_MATRIX", value: 0, isUnsigned: true)
!100 = !DIEnumerator(name: "MAT_REUSE_MATRIX", value: 1, isUnsigned: true)
!101 = !DIEnumerator(name: "MAT_IGNORE_MATRIX", value: 2, isUnsigned: true)
!102 = !DIEnumerator(name: "MAT_INPLACE_MATRIX", value: 3, isUnsigned: true)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 442, baseType: !28, size: 32, elements: !104)
!104 = !{!105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132}
!105 = !DIEnumerator(name: "MAT_OPTION_MIN", value: -3)
!106 = !DIEnumerator(name: "MAT_UNUSED_NONZERO_LOCATION_ERR", value: -2)
!107 = !DIEnumerator(name: "MAT_ROW_ORIENTED", value: -1)
!108 = !DIEnumerator(name: "MAT_SYMMETRIC", value: 1)
!109 = !DIEnumerator(name: "MAT_STRUCTURALLY_SYMMETRIC", value: 2)
!110 = !DIEnumerator(name: "MAT_FORCE_DIAGONAL_ENTRIES", value: 3)
!111 = !DIEnumerator(name: "MAT_IGNORE_OFF_PROC_ENTRIES", value: 4)
!112 = !DIEnumerator(name: "MAT_USE_HASH_TABLE", value: 5)
!113 = !DIEnumerator(name: "MAT_KEEP_NONZERO_PATTERN", value: 6)
!114 = !DIEnumerator(name: "MAT_IGNORE_ZERO_ENTRIES", value: 7)
!115 = !DIEnumerator(name: "MAT_USE_INODES", value: 8)
!116 = !DIEnumerator(name: "MAT_HERMITIAN", value: 9)
!117 = !DIEnumerator(name: "MAT_SYMMETRY_ETERNAL", value: 10)
!118 = !DIEnumerator(name: "MAT_NEW_NONZERO_LOCATION_ERR", value: 11)
!119 = !DIEnumerator(name: "MAT_IGNORE_LOWER_TRIANGULAR", value: 12)
!120 = !DIEnumerator(name: "MAT_ERROR_LOWER_TRIANGULAR", value: 13)
!121 = !DIEnumerator(name: "MAT_GETROW_UPPERTRIANGULAR", value: 14)
!122 = !DIEnumerator(name: "MAT_SPD", value: 15)
!123 = !DIEnumerator(name: "MAT_NO_OFF_PROC_ZERO_ROWS", value: 16)
!124 = !DIEnumerator(name: "MAT_NO_OFF_PROC_ENTRIES", value: 17)
!125 = !DIEnumerator(name: "MAT_NEW_NONZERO_LOCATIONS", value: 18)
!126 = !DIEnumerator(name: "MAT_NEW_NONZERO_ALLOCATION_ERR", value: 19)
!127 = !DIEnumerator(name: "MAT_SUBSET_OFF_PROC_ENTRIES", value: 20)
!128 = !DIEnumerator(name: "MAT_SUBMAT_SINGLEIS", value: 21)
!129 = !DIEnumerator(name: "MAT_STRUCTURE_ONLY", value: 22)
!130 = !DIEnumerator(name: "MAT_SORTED_FULL", value: 23)
!131 = !DIEnumerator(name: "MAT_FORM_EXPLICIT_TRANSPOSE", value: 24)
!132 = !DIEnumerator(name: "MAT_OPTION_MAX", value: 25)
!133 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !134, line: 155, baseType: !7, size: 32, elements: !135)
!134 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!135 = !{!136, !137, !138, !139, !140}
!136 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!137 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!138 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!139 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!140 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!141 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 58, baseType: !7, size: 32, elements: !142)
!142 = !{!143}
!143 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!144 = !{!145, !149, !150, !225, !353, !356, !235, !28, !359, !185, !262, !319, !360, !7, !362, !498, !499, !500, !211}
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !146, line: 330, baseType: !147)
!146 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !146, line: 330, flags: DIFlagFwdDecl)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !153, line: 73, size: 4480, elements: !154)
!153 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!154 = !{!155, !157, !206, !207, !209, !212, !213, !214, !215, !223, !224, !226, !230, !234, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !247, !248, !249, !251, !252, !254, !256, !257, !258, !259, !260, !263, !265, !266, !267, !268, !269, !272, !274, !275, !276, !286, !288, !289, !293, !294, !343, !348, !350, !351, !352}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !152, file: !153, line: 74, baseType: !156, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !152, file: !153, line: 75, baseType: !158, size: 448, offset: 64)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 448, elements: !204)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !153, line: 53, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !153, line: 45, size: 448, elements: !161)
!161 = !{!162, !168, !176, !181, !188, !192, !199}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !160, file: !153, line: 46, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!166, !150, !167}
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !160, file: !153, line: 47, baseType: !169, size: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!166, !150, !172}
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !173, line: 16, baseType: !174)
!173 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !173, line: 16, flags: DIFlagFwdDecl)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !160, file: !153, line: 48, baseType: !177, size: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!166, !180}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !160, file: !153, line: 49, baseType: !182, size: 64, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!166, !150, !185, !150}
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !187)
!187 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !160, file: !153, line: 50, baseType: !189, size: 64, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!166, !150, !185, !180}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !160, file: !153, line: 51, baseType: !193, size: 64, offset: 320)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{!166, !150, !185, !196}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{null}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !160, file: !153, line: 52, baseType: !200, size: 64, offset: 384)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!166, !150, !185, !203}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!204 = !{!205}
!205 = !DISubrange(count: 1)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !152, file: !153, line: 76, baseType: !145, size: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !152, file: !153, line: 77, baseType: !208, size: 32, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !152, file: !153, line: 78, baseType: !210, size: 64, offset: 640)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !211)
!211 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !152, file: !153, line: 78, baseType: !210, size: 64, offset: 704)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !152, file: !153, line: 78, baseType: !210, size: 64, offset: 768)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !152, file: !153, line: 78, baseType: !210, size: 64, offset: 832)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !152, file: !153, line: 79, baseType: !216, size: 64, offset: 896)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !219, line: 27, baseType: !220)
!219 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !221, line: 43, baseType: !222)
!221 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!222 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !152, file: !153, line: 80, baseType: !208, size: 32, offset: 960)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !152, file: !153, line: 81, baseType: !225, size: 32, offset: 992)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !152, file: !153, line: 82, baseType: !227, size: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !152, file: !153, line: 83, baseType: !231, size: 64, offset: 1088)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !152, file: !153, line: 84, baseType: !235, size: 64, offset: 1152)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !152, file: !153, line: 85, baseType: !235, size: 64, offset: 1216)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !152, file: !153, line: 86, baseType: !235, size: 64, offset: 1280)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !152, file: !153, line: 87, baseType: !235, size: 64, offset: 1344)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !152, file: !153, line: 88, baseType: !150, size: 64, offset: 1408)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !152, file: !153, line: 89, baseType: !216, size: 64, offset: 1472)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !152, file: !153, line: 90, baseType: !235, size: 64, offset: 1536)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !152, file: !153, line: 91, baseType: !235, size: 64, offset: 1600)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !152, file: !153, line: 92, baseType: !208, size: 32, offset: 1664)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !152, file: !153, line: 93, baseType: !149, size: 64, offset: 1728)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !152, file: !153, line: 94, baseType: !246, size: 64, offset: 1792)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !217)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !152, file: !153, line: 95, baseType: !208, size: 32, offset: 1856)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !152, file: !153, line: 95, baseType: !208, size: 32, offset: 1888)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !152, file: !153, line: 96, baseType: !250, size: 64, offset: 1920)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !152, file: !153, line: 96, baseType: !250, size: 64, offset: 1984)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !152, file: !153, line: 97, baseType: !253, size: 64, offset: 2048)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !152, file: !153, line: 97, baseType: !255, size: 64, offset: 2112)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !152, file: !153, line: 98, baseType: !208, size: 32, offset: 2176)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !152, file: !153, line: 98, baseType: !208, size: 32, offset: 2208)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !152, file: !153, line: 99, baseType: !250, size: 64, offset: 2240)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !152, file: !153, line: 99, baseType: !250, size: 64, offset: 2304)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !152, file: !153, line: 100, baseType: !261, size: 64, offset: 2368)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !211)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !152, file: !153, line: 100, baseType: !264, size: 64, offset: 2432)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !152, file: !153, line: 101, baseType: !208, size: 32, offset: 2496)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !152, file: !153, line: 101, baseType: !208, size: 32, offset: 2528)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !152, file: !153, line: 102, baseType: !250, size: 64, offset: 2560)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !152, file: !153, line: 102, baseType: !250, size: 64, offset: 2624)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !152, file: !153, line: 103, baseType: !270, size: 64, offset: 2688)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !262)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !152, file: !153, line: 103, baseType: !273, size: 64, offset: 2752)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !152, file: !153, line: 104, baseType: !203, size: 64, offset: 2816)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !152, file: !153, line: 105, baseType: !208, size: 32, offset: 2880)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !152, file: !153, line: 106, baseType: !277, size: 128, offset: 2944)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 128, elements: !284)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !153, line: 64, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !153, line: 61, size: 128, elements: !281)
!281 = !{!282, !283}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !280, file: !153, line: 62, baseType: !196, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !280, file: !153, line: 63, baseType: !149, size: 64, offset: 64)
!284 = !{!285}
!285 = !DISubrange(count: 2)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !152, file: !153, line: 107, baseType: !287, size: 64, offset: 3072)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 64, elements: !284)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !152, file: !153, line: 108, baseType: !149, size: 64, offset: 3136)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !152, file: !153, line: 109, baseType: !290, size: 64, offset: 3200)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!166, !149}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !152, file: !153, line: 111, baseType: !208, size: 32, offset: 3264)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !152, file: !153, line: 112, baseType: !295, size: 320, offset: 3328)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 320, elements: !341)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!166, !299, !150, !149}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !302)
!302 = !{!303, !304, !329, !330, !331, !332, !333, !334, !335, !336, !337}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !301, file: !12, line: 100, baseType: !208, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !301, file: !12, line: 101, baseType: !305, size: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !308)
!308 = !{!309, !310, !311, !312, !313, !316, !317, !318, !322, !324, !326, !327, !328}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !307, file: !12, line: 84, baseType: !235, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !307, file: !12, line: 85, baseType: !235, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !307, file: !12, line: 86, baseType: !149, size: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !307, file: !12, line: 87, baseType: !227, size: 64, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !307, file: !12, line: 88, baseType: !314, size: 64, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !185)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !307, file: !12, line: 89, baseType: !187, size: 8, offset: 320)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !307, file: !12, line: 90, baseType: !235, size: 64, offset: 384)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !307, file: !12, line: 91, baseType: !319, size: 64, offset: 448)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !320, line: 46, baseType: !321)
!320 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!321 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !307, file: !12, line: 92, baseType: !323, size: 32, offset: 512)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !307, file: !12, line: 93, baseType: !325, size: 32, offset: 544)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !307, file: !12, line: 94, baseType: !305, size: 64, offset: 576)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !307, file: !12, line: 95, baseType: !235, size: 64, offset: 640)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !307, file: !12, line: 96, baseType: !149, size: 64, offset: 704)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !301, file: !12, line: 102, baseType: !235, size: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !301, file: !12, line: 102, baseType: !235, size: 64, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !301, file: !12, line: 103, baseType: !235, size: 64, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !301, file: !12, line: 104, baseType: !145, size: 64, offset: 320)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !301, file: !12, line: 105, baseType: !323, size: 32, offset: 384)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !301, file: !12, line: 105, baseType: !323, size: 32, offset: 416)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !301, file: !12, line: 105, baseType: !323, size: 32, offset: 448)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !301, file: !12, line: 106, baseType: !150, size: 64, offset: 512)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !301, file: !12, line: 107, baseType: !338, size: 64, offset: 576)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!341 = !{!342}
!342 = !DISubrange(count: 5)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !152, file: !153, line: 113, baseType: !344, size: 320, offset: 3648)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !345, size: 320, elements: !341)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!166, !150, !149}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !152, file: !153, line: 114, baseType: !349, size: 320, offset: 3968)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 320, elements: !341)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !152, file: !153, line: 115, baseType: !323, size: 32, offset: 4288)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !152, file: !153, line: 120, baseType: !338, size: 64, offset: 4352)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !152, file: !153, line: 121, baseType: !323, size: 32, offset: 4416)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !146, line: 331, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !146, line: 331, flags: DIFlagFwdDecl)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !146, line: 338, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !146, line: 338, flags: DIFlagFwdDecl)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !361, line: 1451, baseType: !196)
!361 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_Deflation", file: !364, line: 25, baseType: !365)
!364 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/pc/impls/deflation/deflation.h", directory: "/home/users/ndemeye/xSDK")
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !364, line: 7, size: 1024, elements: !366)
!366 = !{!367, !368, !369, !370, !371, !375, !376, !377, !378, !383, !385, !488, !489, !491, !492, !494, !495, !496, !497}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !365, file: !364, line: 8, baseType: !323, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "correct", scope: !365, file: !364, line: 9, baseType: !323, size: 32, offset: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "correctfact", scope: !365, file: !364, line: 10, baseType: !271, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "reductionfact", scope: !365, file: !364, line: 11, baseType: !208, size: 32, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "W", scope: !365, file: !364, line: 12, baseType: !372, size: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !41, line: 16, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !41, line: 16, flags: DIFlagFwdDecl)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "Wt", scope: !365, file: !364, line: 12, baseType: !372, size: 64, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "WtA", scope: !365, file: !364, line: 12, baseType: !372, size: 64, offset: 320)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "WtAW", scope: !365, file: !364, line: 12, baseType: !372, size: 64, offset: 384)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "WtAWinv", scope: !365, file: !364, line: 13, baseType: !379, size: 64, offset: 448)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !380, line: 22, baseType: !381)
!380 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !380, line: 22, flags: DIFlagFwdDecl)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ksptype", scope: !365, file: !364, line: 14, baseType: !384, size: 64, offset: 512)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPType", file: !380, line: 31, baseType: !185)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !365, file: !364, line: 15, baseType: !386, size: 64, offset: 576)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !27, line: 11, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !389, line: 37, size: 6720, elements: !390)
!389 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcimpl.h", directory: "/home/users/ndemeye/xSDK")
!390 = !{!391, !393, !452, !457, !458, !459, !460, !461, !463, !464, !465, !466, !467, !468, !469, !470, !471, !481, !482, !483, !484, !485, !487}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !388, file: !389, line: 38, baseType: !392, size: 4480)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !153, line: 122, baseType: !152)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !388, file: !389, line: 38, baseType: !394, size: 1152, offset: 4480)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 1152, elements: !204)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PCOps", file: !389, line: 13, size: 1152, elements: !396)
!396 = !{!397, !401, !408, !412, !418, !423, !424, !428, !432, !436, !437, !442, !443, !444, !445, !446, !450, !451}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !395, file: !389, line: 14, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!166, !386}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !395, file: !389, line: 15, baseType: !402, size: 64, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!166, !386, !405, !405}
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !134, line: 21, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !134, line: 21, flags: DIFlagFwdDecl)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "matapply", scope: !395, file: !389, line: 16, baseType: !409, size: 64, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!166, !386, !372, !372}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "applyrichardson", scope: !395, file: !389, line: 17, baseType: !413, size: 64, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!166, !386, !405, !405, !405, !262, !262, !262, !208, !323, !253, !416}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCRichardsonConvergedReason", file: !27, line: 102, baseType: !26)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "applyBA", scope: !395, file: !389, line: 18, baseType: !419, size: 64, offset: 256)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!166, !386, !422, !405, !405, !405}
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !27, line: 85, baseType: !34)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "applytranspose", scope: !395, file: !389, line: 19, baseType: !402, size: 64, offset: 320)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "applyBAtranspose", scope: !395, file: !389, line: 20, baseType: !425, size: 64, offset: 384)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!166, !386, !208, !405, !405, !405}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !395, file: !389, line: 21, baseType: !429, size: 64, offset: 448)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!166, !299, !386}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !395, file: !389, line: 22, baseType: !433, size: 64, offset: 512)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!166, !386, !379, !405, !405}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !395, file: !389, line: 23, baseType: !433, size: 64, offset: 576)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "getfactoredmatrix", scope: !395, file: !389, line: 24, baseType: !438, size: 64, offset: 640)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!166, !386, !441}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricleft", scope: !395, file: !389, line: 25, baseType: !402, size: 64, offset: 704)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricright", scope: !395, file: !389, line: 26, baseType: !402, size: 64, offset: 768)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "setuponblocks", scope: !395, file: !389, line: 27, baseType: !398, size: 64, offset: 832)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !395, file: !389, line: 28, baseType: !398, size: 64, offset: 896)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !395, file: !389, line: 29, baseType: !447, size: 64, offset: 960)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!166, !386, !172}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !395, file: !389, line: 30, baseType: !398, size: 64, offset: 1024)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !395, file: !389, line: 31, baseType: !447, size: 64, offset: 1088)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !388, file: !389, line: 39, baseType: !453, size: 64, offset: 5632)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !454, line: 14, baseType: !455)
!454 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !454, line: 14, flags: DIFlagFwdDecl)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !388, file: !389, line: 40, baseType: !208, size: 32, offset: 5696)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "matstate", scope: !388, file: !389, line: 41, baseType: !246, size: 64, offset: 5760)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "matnonzerostate", scope: !388, file: !389, line: 41, baseType: !246, size: 64, offset: 5824)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "reusepreconditioner", scope: !388, file: !389, line: 42, baseType: !323, size: 32, offset: 5888)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !388, file: !389, line: 43, baseType: !462, size: 32, offset: 5920)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !41, line: 285, baseType: !40)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !388, file: !389, line: 45, baseType: !208, size: 32, offset: 5952)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "erroriffailure", scope: !388, file: !389, line: 46, baseType: !323, size: 32, offset: 5984)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !388, file: !389, line: 47, baseType: !372, size: 64, offset: 6016)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "pmat", scope: !388, file: !389, line: 47, baseType: !372, size: 64, offset: 6080)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleright", scope: !388, file: !389, line: 48, baseType: !405, size: 64, offset: 6144)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleleft", scope: !388, file: !389, line: 48, baseType: !405, size: 64, offset: 6208)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !388, file: !389, line: 49, baseType: !323, size: 32, offset: 6272)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "useAmat", scope: !388, file: !389, line: 50, baseType: !323, size: 32, offset: 6304)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatrices", scope: !388, file: !389, line: 51, baseType: !472, size: 64, offset: 6336)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!166, !386, !208, !475, !475, !441, !149}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !477)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !478, line: 11, baseType: !479)
!478 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !478, line: 11, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatricesP", scope: !388, file: !389, line: 52, baseType: !149, size: 64, offset: 6400)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !388, file: !389, line: 53, baseType: !149, size: 64, offset: 6464)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "presolvedone", scope: !388, file: !389, line: 54, baseType: !208, size: 32, offset: 6528)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !388, file: !389, line: 55, baseType: !149, size: 64, offset: 6592)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "failedreason", scope: !388, file: !389, line: 56, baseType: !486, size: 32, offset: 6656)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !27, line: 395, baseType: !47)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "failedreasonrank", scope: !388, file: !389, line: 57, baseType: !486, size: 32, offset: 6688)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !365, file: !364, line: 16, baseType: !405, size: 64, offset: 640)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "workcoarse", scope: !365, file: !364, line: 17, baseType: !490, size: 64, offset: 704)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !365, file: !364, line: 18, baseType: !185, size: 64, offset: 768)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !365, file: !364, line: 20, baseType: !493, size: 32, offset: 832)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCDeflationSpaceType", file: !27, line: 372, baseType: !82)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "spacesize", scope: !365, file: !364, line: 21, baseType: !208, size: 32, offset: 864)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "lvl", scope: !365, file: !364, line: 22, baseType: !208, size: 32, offset: 896)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "maxlvl", scope: !365, file: !364, line: 23, baseType: !208, size: 32, offset: 928)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "extendsp", scope: !365, file: !364, line: 24, baseType: !323, size: 32, offset: 960)
!498 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEnum", file: !6, line: 58, baseType: !141)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!501 = !{!0}
!502 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/deflation/deflation.c", directory: "/home/users/ndemeye/xSDK")
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 768, elements: !504)
!504 = !{!505}
!505 = !DISubrange(count: 12)
!506 = !{i32 7, !"Dwarf Version", i32 4}
!507 = !{i32 2, !"Debug Info Version", i32 3}
!508 = !{i32 1, !"wchar_size", i32 4}
!509 = !{i32 7, !"PIC Level", i32 2}
!510 = !{i32 7, !"uwtable", i32 1}
!511 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!512 = distinct !DISubprogram(name: "PCDeflationSetInitOnly", scope: !502, file: !502, line: 45, type: !513, scopeLine: 46, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !515)
!513 = !DISubroutineType(types: !514)
!514 = !{!166, !386, !323}
!515 = !{!516, !517, !518, !519, !521, !522, !524, !525, !527, !531, !532, !534, !540, !541, !543, !546, !547, !549, !552, !553, !556, !557, !559, !563}
!516 = !DILocalVariable(name: "pc", arg: 1, scope: !512, file: !502, line: 45, type: !386)
!517 = !DILocalVariable(name: "flg", arg: 2, scope: !512, file: !502, line: 45, type: !323)
!518 = !DILocalVariable(name: "ierr", scope: !512, file: !502, line: 47, type: !166)
!519 = !DILocalVariable(name: "_7_ierr", scope: !520, file: !502, line: 51, type: !166)
!520 = distinct !DILexicalBlock(scope: !512, file: !502, line: 51, column: 3)
!521 = !DILocalVariable(name: "b0", scope: !520, file: !502, line: 51, type: !225)
!522 = !DILocalVariable(name: "b1", scope: !520, file: !502, line: 51, type: !523)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 64, elements: !284)
!524 = !DILocalVariable(name: "b2", scope: !520, file: !502, line: 51, type: !523)
!525 = !DILocalVariable(name: "_4_ierr", scope: !526, file: !502, line: 51, type: !166)
!526 = distinct !DILexicalBlock(scope: !520, file: !502, line: 51, column: 3)
!527 = !DILocalVariable(name: "a_b1", scope: !526, file: !502, line: 51, type: !528)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 192, elements: !529)
!529 = !{!530}
!530 = !DISubrange(count: 6)
!531 = !DILocalVariable(name: "a_b2", scope: !526, file: !502, line: 51, type: !528)
!532 = !DILocalVariable(name: "_7_errorcode", scope: !533, file: !502, line: 51, type: !166)
!533 = distinct !DILexicalBlock(scope: !526, file: !502, line: 51, column: 3)
!534 = !DILocalVariable(name: "_7_errorstring", scope: !535, file: !502, line: 51, type: !537)
!535 = distinct !DILexicalBlock(scope: !536, file: !502, line: 51, column: 3)
!536 = distinct !DILexicalBlock(scope: !533, file: !502, line: 51, column: 3)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 2048, elements: !538)
!538 = !{!539}
!539 = !DISubrange(count: 256)
!540 = !DILocalVariable(name: "_7_resultlen", scope: !535, file: !502, line: 51, type: !225)
!541 = !DILocalVariable(name: "_7_errorcode", scope: !542, file: !502, line: 51, type: !166)
!542 = distinct !DILexicalBlock(scope: !526, file: !502, line: 51, column: 3)
!543 = !DILocalVariable(name: "_7_errorstring", scope: !544, file: !502, line: 51, type: !537)
!544 = distinct !DILexicalBlock(scope: !545, file: !502, line: 51, column: 3)
!545 = distinct !DILexicalBlock(scope: !542, file: !502, line: 51, column: 3)
!546 = !DILocalVariable(name: "_7_resultlen", scope: !544, file: !502, line: 51, type: !225)
!547 = !DILocalVariable(name: "_7_errorcode", scope: !548, file: !502, line: 51, type: !166)
