; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/logging/xmllogevent.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/logging/xmllogevent.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.PetscNestedEvent = type { i32, i32, i32*, i32*, i32*, i32* }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._n_PetscStageLog = type { i32, i32, %struct._n_PetscIntStack*, i32, %struct._PetscStageInfo*, %struct._n_PetscEventRegLog*, %struct._n_PetscClassRegLog* }
%struct._n_PetscIntStack = type { i32, i32, i32* }
%struct._PetscStageInfo = type { i8*, i32, %struct.PetscEventPerfInfo, %struct._n_PetscEventPerfLog*, %struct._n_PetscClassPerfLog* }
%struct.PetscEventPerfInfo = type { i32, i32, i32, i32, i32, double, double, double, double, double, double, double, [8 x double], [8 x double], double, double, double, double, double, double, double }
%struct._n_PetscEventPerfLog = type { i32, i32, %struct.PetscEventPerfInfo* }
%struct._n_PetscClassPerfLog = type { i32, i32, %struct.PetscClassPerfInfo* }
%struct.PetscClassPerfInfo = type { i32, i32, i32, double, double }
%struct._n_PetscEventRegLog = type { i32, i32, %struct.PetscEventRegInfo* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "nestedEvents", scope: !2, file: !252, line: 96, type: !282, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !32, globals: !270, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/logging/xmllogevent.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!4 = !{!5, !12, !17}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 663, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 170, baseType: !7, size: 32, elements: !14)
!13 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!14 = !{!15, !16}
!15 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !18, line: 81, baseType: !7, size: 32, elements: !19)
!18 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!20 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!24 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!25 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!26 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!27 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!28 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!29 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!30 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!31 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!32 = !{!33, !37, !38, !41, !44, !117, !242, !245, !127, !51, !248, !7, !102, !250, !264, !109}
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !34, line: 330, baseType: !35)
!34 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !34, line: 330, flags: DIFlagFwdDecl)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !39, line: 46, baseType: !40)
!39 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!40 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !13, line: 430, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !47, line: 73, size: 4480, elements: !48)
!47 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!48 = !{!49, !52, !98, !99, !101, !104, !105, !106, !107, !115, !116, !118, !122, !126, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !139, !140, !141, !143, !144, !146, !148, !149, !150, !151, !152, !155, !157, !158, !159, !160, !161, !164, !166, !167, !168, !178, !180, !181, !185, !186, !232, !237, !239, !240, !241}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !46, file: !47, line: 74, baseType: !50, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !13, line: 32, baseType: !51)
!51 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !46, file: !47, line: 75, baseType: !53, size: 448, offset: 64)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 448, elements: !96)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !47, line: 53, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !47, line: 45, size: 448, elements: !56)
!56 = !{!57, !63, !71, !76, !80, !84, !91}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !55, file: !47, line: 46, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!61, !44, !62}
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !13, line: 14, baseType: !51)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !55, file: !47, line: 47, baseType: !64, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!61, !44, !67}
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !68, line: 16, baseType: !69)
!68 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !68, line: 16, flags: DIFlagFwdDecl)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !55, file: !47, line: 48, baseType: !72, size: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{!61, !75}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !55, file: !47, line: 49, baseType: !77, size: 64, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!61, !44, !41, !44}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !55, file: !47, line: 50, baseType: !81, size: 64, offset: 256)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{!61, !44, !41, !75}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !55, file: !47, line: 51, baseType: !85, size: 64, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{!61, !44, !41, !88}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{null}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !55, file: !47, line: 52, baseType: !92, size: 64, offset: 384)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!61, !44, !41, !95}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!96 = !{!97}
!97 = !DISubrange(count: 1)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !46, file: !47, line: 76, baseType: !33, size: 64, offset: 512)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !46, file: !47, line: 77, baseType: !100, size: 32, offset: 576)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !13, line: 102, baseType: !51)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !46, file: !47, line: 78, baseType: !102, size: 64, offset: 640)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !13, line: 360, baseType: !103)
!103 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !46, file: !47, line: 78, baseType: !102, size: 64, offset: 704)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !46, file: !47, line: 78, baseType: !102, size: 64, offset: 768)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !46, file: !47, line: 78, baseType: !102, size: 64, offset: 832)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !46, file: !47, line: 79, baseType: !108, size: 64, offset: 896)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !13, line: 442, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !13, line: 90, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !111, line: 27, baseType: !112)
!111 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !113, line: 43, baseType: !114)
!113 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!114 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !46, file: !47, line: 80, baseType: !100, size: 32, offset: 960)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !46, file: !47, line: 81, baseType: !117, size: 32, offset: 992)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !13, line: 49, baseType: !51)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !46, file: !47, line: 82, baseType: !119, size: 64, offset: 1024)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !13, line: 465, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !13, line: 465, flags: DIFlagFwdDecl)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !46, file: !47, line: 83, baseType: !123, size: 64, offset: 1088)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !13, line: 496, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !13, line: 496, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !46, file: !47, line: 84, baseType: !127, size: 64, offset: 1152)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !46, file: !47, line: 85, baseType: !127, size: 64, offset: 1216)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !46, file: !47, line: 86, baseType: !127, size: 64, offset: 1280)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !46, file: !47, line: 87, baseType: !127, size: 64, offset: 1344)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !46, file: !47, line: 88, baseType: !44, size: 64, offset: 1408)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !46, file: !47, line: 89, baseType: !108, size: 64, offset: 1472)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !46, file: !47, line: 90, baseType: !127, size: 64, offset: 1536)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !46, file: !47, line: 91, baseType: !127, size: 64, offset: 1600)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !46, file: !47, line: 92, baseType: !100, size: 32, offset: 1664)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !46, file: !47, line: 93, baseType: !37, size: 64, offset: 1728)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !46, file: !47, line: 94, baseType: !138, size: 64, offset: 1792)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !13, line: 455, baseType: !109)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !46, file: !47, line: 95, baseType: !100, size: 32, offset: 1856)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !46, file: !47, line: 95, baseType: !100, size: 32, offset: 1888)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !46, file: !47, line: 96, baseType: !142, size: 64, offset: 1920)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !46, file: !47, line: 96, baseType: !142, size: 64, offset: 1984)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !46, file: !47, line: 97, baseType: !145, size: 64, offset: 2048)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !46, file: !47, line: 97, baseType: !147, size: 64, offset: 2112)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !46, file: !47, line: 98, baseType: !100, size: 32, offset: 2176)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !46, file: !47, line: 98, baseType: !100, size: 32, offset: 2208)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !46, file: !47, line: 99, baseType: !142, size: 64, offset: 2240)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !46, file: !47, line: 99, baseType: !142, size: 64, offset: 2304)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !46, file: !47, line: 100, baseType: !153, size: 64, offset: 2368)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !13, line: 189, baseType: !103)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !46, file: !47, line: 100, baseType: !156, size: 64, offset: 2432)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !46, file: !47, line: 101, baseType: !100, size: 32, offset: 2496)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !46, file: !47, line: 101, baseType: !100, size: 32, offset: 2528)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !46, file: !47, line: 102, baseType: !142, size: 64, offset: 2560)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !46, file: !47, line: 102, baseType: !142, size: 64, offset: 2624)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !46, file: !47, line: 103, baseType: !162, size: 64, offset: 2688)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !13, line: 305, baseType: !154)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !46, file: !47, line: 103, baseType: !165, size: 64, offset: 2752)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !46, file: !47, line: 104, baseType: !95, size: 64, offset: 2816)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !46, file: !47, line: 105, baseType: !100, size: 32, offset: 2880)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !46, file: !47, line: 106, baseType: !169, size: 128, offset: 2944)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 128, elements: !176)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !47, line: 64, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !47, line: 61, size: 128, elements: !173)
!173 = !{!174, !175}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !172, file: !47, line: 62, baseType: !88, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !172, file: !47, line: 63, baseType: !37, size: 64, offset: 64)
!176 = !{!177}
!177 = !DISubrange(count: 2)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !46, file: !47, line: 107, baseType: !179, size: 64, offset: 3072)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 64, elements: !176)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !46, file: !47, line: 108, baseType: !37, size: 64, offset: 3136)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !46, file: !47, line: 109, baseType: !182, size: 64, offset: 3200)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!61, !37}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !46, file: !47, line: 111, baseType: !100, size: 32, offset: 3264)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !46, file: !47, line: 112, baseType: !187, size: 320, offset: 3328)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 320, elements: !230)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!61, !191, !44, !37}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !18, line: 108, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !18, line: 99, size: 640, elements: !194)
!194 = !{!195, !196, !218, !219, !220, !221, !222, !223, !224, !225, !226}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !193, file: !18, line: 100, baseType: !100, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !193, file: !18, line: 101, baseType: !197, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !18, line: 82, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !18, line: 83, size: 768, elements: !200)
!200 = !{!201, !202, !203, !204, !205, !208, !209, !210, !211, !213, !215, !216, !217}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !199, file: !18, line: 84, baseType: !127, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !199, file: !18, line: 85, baseType: !127, size: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !199, file: !18, line: 86, baseType: !37, size: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !199, file: !18, line: 87, baseType: !119, size: 64, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !199, file: !18, line: 88, baseType: !206, size: 64, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !199, file: !18, line: 89, baseType: !43, size: 8, offset: 320)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !199, file: !18, line: 90, baseType: !127, size: 64, offset: 384)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !199, file: !18, line: 91, baseType: !38, size: 64, offset: 448)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !199, file: !18, line: 92, baseType: !212, size: 32, offset: 512)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !13, line: 170, baseType: !12)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !199, file: !18, line: 93, baseType: !214, size: 32, offset: 544)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !18, line: 81, baseType: !17)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !199, file: !18, line: 94, baseType: !197, size: 64, offset: 576)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !199, file: !18, line: 95, baseType: !127, size: 64, offset: 640)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !199, file: !18, line: 96, baseType: !37, size: 64, offset: 704)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !193, file: !18, line: 102, baseType: !127, size: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !193, file: !18, line: 102, baseType: !127, size: 64, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !193, file: !18, line: 103, baseType: !127, size: 64, offset: 256)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !193, file: !18, line: 104, baseType: !33, size: 64, offset: 320)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !193, file: !18, line: 105, baseType: !212, size: 32, offset: 384)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !193, file: !18, line: 105, baseType: !212, size: 32, offset: 416)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !193, file: !18, line: 105, baseType: !212, size: 32, offset: 448)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !193, file: !18, line: 106, baseType: !44, size: 64, offset: 512)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !193, file: !18, line: 107, baseType: !227, size: 64, offset: 576)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !18, line: 10, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !18, line: 10, flags: DIFlagFwdDecl)
!230 = !{!231}
!231 = !DISubrange(count: 5)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !46, file: !47, line: 113, baseType: !233, size: 320, offset: 3648)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 320, elements: !230)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!61, !44, !37}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !46, file: !47, line: 114, baseType: !238, size: 320, offset: 3968)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 320, elements: !230)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !46, file: !47, line: 115, baseType: !212, size: 32, offset: 4288)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !46, file: !47, line: 120, baseType: !227, size: 64, offset: 4352)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !46, file: !47, line: 121, baseType: !212, size: 32, offset: 4416)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !34, line: 331, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !34, line: 331, flags: DIFlagFwdDecl)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !34, line: 338, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !34, line: 338, flags: DIFlagFwdDecl)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogEvent", file: !249, line: 80, baseType: !51)
!249 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscNestedEventTree", file: !252, line: 602, baseType: !253)
!252 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/logging/xmllogevent.c", directory: "/home/users/ndemeye/xSDK")
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !252, line: 594, size: 256, elements: !254)
!254 = !{!255, !256, !258, !259, !260, !261, !262}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "dftEvent", scope: !253, file: !252, line: 595, baseType: !248, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "nstEvent", scope: !253, file: !252, line: 596, baseType: !257, size: 32, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "NestedEventId", file: !252, line: 82, baseType: !248)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "dftParent", scope: !253, file: !252, line: 597, baseType: !248, size: 32, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "nstParent", scope: !253, file: !252, line: 598, baseType: !257, size: 32, offset: 96)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "own", scope: !253, file: !252, line: 599, baseType: !212, size: 32, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !253, file: !252, line: 600, baseType: !51, size: 32, offset: 160)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "nstPath", scope: !253, file: !252, line: 601, baseType: !263, size: 64, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSortItem", file: !252, line: 943, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !252, line: 940, size: 128, elements: !267)
!267 = !{!268, !269}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !266, file: !252, line: 941, baseType: !51, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !266, file: !252, line: 942, baseType: !102, size: 64, offset: 64)
!270 = !{!0, !271, !273, !275, !277, !280}
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "nNestedEventsAllocated", scope: !2, file: !252, line: 95, type: !51, isLocal: true, isDefinition: true)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "dftParentActive", scope: !2, file: !252, line: 93, type: !248, isLocal: true, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "nNestedEvents", scope: !2, file: !252, line: 94, type: !51, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "savedStage", scope: !2, file: !252, line: 246, type: !279, isLocal: true, isDefinition: true)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogStage", file: !249, line: 89, baseType: !51)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "thresholdTime", scope: !2, file: !252, line: 97, type: !102, isLocal: true, isDefinition: true)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscNestedEvent", file: !252, line: 91, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !252, line: 83, size: 320, elements: !285)
!285 = !{!286, !287, !288, !290, !291, !292}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "nstEvent", scope: !284, file: !252, line: 84, baseType: !257, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "nParents", scope: !284, file: !252, line: 85, baseType: !51, size: 32, offset: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "dftParentsSorted", scope: !284, file: !252, line: 86, baseType: !289, size: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "dftEvents", scope: !284, file: !252, line: 87, baseType: !289, size: 64, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "dftParents", scope: !284, file: !252, line: 89, baseType: !289, size: 64, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "dftEventsSorted", scope: !284, file: !252, line: 90, baseType: !289, size: 64, offset: 256)
!293 = !{i32 7, !"Dwarf Version", i32 4}
!294 = !{i32 2, !"Debug Info Version", i32 3}
!295 = !{i32 1, !"wchar_size", i32 4}
!296 = !{i32 7, !"PIC Level", i32 2}
!297 = !{i32 7, !"uwtable", i32 1}
!298 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!299 = distinct !DISubprogram(name: "PetscLogNestedBegin", scope: !252, file: !252, line: 128, type: !300, scopeLine: 129, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !302)
!300 = !DISubroutineType(types: !301)
!301 = !{!61}
!302 = !{!303, !304, !306}
!303 = !DILocalVariable(name: "ierr", scope: !299, file: !252, line: 130, type: !61)
!304 = !DILocalVariable(name: "ierr__", scope: !305, file: !252, line: 136, type: !61)
!305 = distinct !DILexicalBlock(scope: !299, file: !252, line: 136, column: 61)
!306 = !DILocalVariable(name: "ierr__", scope: !307, file: !252, line: 148, type: !61)
!307 = distinct !DILexicalBlock(scope: !299, file: !252, line: 148, column: 71)
!308 = !DILocation(line: 132, column: 3, scope: !309)
!309 = distinct !DILexicalBlock(scope: !310, file: !252, line: 132, column: 3)
!310 = distinct !DILexicalBlock(scope: !311, file: !252, line: 132, column: 3)
!311 = distinct !DILexicalBlock(scope: !299, file: !252, line: 132, column: 3)
!312 = !{!313, !313, i64 0}
!313 = !{!"any pointer", !314, i64 0}
!314 = !{!"omnipotent char", !315, i64 0}
!315 = !{!"Simple C/C++ TBAA"}
!316 = !DILocation(line: 132, column: 3, scope: !310)
!317 = !DILocation(line: 132, column: 3, scope: !318)
!318 = distinct !DILexicalBlock(scope: !319, file: !252, line: 132, column: 3)
!319 = distinct !DILexicalBlock(scope: !309, file: !252, line: 132, column: 3)
!320 = !{!321, !322, i64 1536}
!321 = !{!"", !314, i64 0, !314, i64 512, !314, i64 1024, !314, i64 1280, !322, i64 1536, !322, i64 1540, !314, i64 1544}
!322 = !{!"int", !314, i64 0}
!323 = !DILocation(line: 132, column: 3, scope: !319)
!324 = !DILocation(line: 132, column: 3, scope: !325)
!325 = distinct !DILexicalBlock(scope: !318, file: !252, line: 132, column: 3)
!326 = !{!322, !322, i64 0}
!327 = !{!321, !322, i64 1540}
!328 = !DILocation(line: 133, column: 7, scope: !329)
!329 = distinct !DILexicalBlock(scope: !299, file: !252, line: 133, column: 7)
!330 = !DILocation(line: 133, column: 7, scope: !299)
!331 = !DILocation(line: 133, column: 21, scope: !329)
!332 = !DILocation(line: 135, column: 26, scope: !299)
!333 = !DILocation(line: 136, column: 10, scope: !299)
!334 = !DILocation(line: 0, scope: !299)
!335 = !DILocation(line: 0, scope: !305)
!336 = !DILocation(line: 136, column: 61, scope: !337)
!337 = distinct !DILexicalBlock(scope: !305, file: !252, line: 136, column: 61)
!338 = !DILocation(line: 136, column: 61, scope: !305)
!339 = !{!"branch_weights", i32 2000, i32 1}
!340 = !DILocation(line: 137, column: 19, scope: !299)
!341 = !DILocation(line: 138, column: 17, scope: !299)
!342 = !DILocation(line: 141, column: 3, scope: !299)
!343 = !DILocation(line: 142, column: 37, scope: !299)
!344 = !DILocation(line: 148, column: 10, scope: !299)
!345 = !DILocation(line: 0, scope: !307)
!346 = !DILocation(line: 148, column: 71, scope: !347)
!347 = distinct !DILexicalBlock(scope: !307, file: !252, line: 148, column: 71)
!348 = !DILocation(line: 148, column: 71, scope: !307)
!349 = !DILocation(line: 149, column: 3, scope: !350)
!350 = distinct !DILexicalBlock(scope: !351, file: !252, line: 149, column: 3)
!351 = distinct !DILexicalBlock(scope: !352, file: !252, line: 149, column: 3)
!352 = distinct !DILexicalBlock(scope: !299, file: !252, line: 149, column: 3)
!353 = !DILocation(line: 149, column: 3, scope: !351)
!354 = !DILocation(line: 149, column: 3, scope: !355)
!355 = distinct !DILexicalBlock(scope: !356, file: !252, line: 149, column: 3)
!356 = distinct !DILexicalBlock(scope: !350, file: !252, line: 149, column: 3)
!357 = !DILocation(line: 149, column: 3, scope: !356)
!358 = !DILocation(line: 149, column: 3, scope: !359)
!359 = distinct !DILexicalBlock(scope: !360, file: !252, line: 149, column: 3)
!360 = distinct !DILexicalBlock(scope: !355, file: !252, line: 149, column: 3)
!361 = !{!321, !314, i64 1544}
!362 = !DILocation(line: 149, column: 3, scope: !360)
!363 = !DILocation(line: 149, column: 3, scope: !364)
!364 = distinct !DILexicalBlock(scope: !359, file: !252, line: 149, column: 3)
!365 = !DILocation(line: 149, column: 3, scope: !366)
!366 = distinct !DILexicalBlock(scope: !355, file: !252, line: 149, column: 3)
!367 = !DILocation(line: 149, column: 3, scope: !368)
!368 = distinct !DILexicalBlock(scope: !366, file: !252, line: 149, column: 3)
!369 = !DILocation(line: 149, column: 3, scope: !370)
!370 = distinct !DILexicalBlock(scope: !371, file: !252, line: 149, column: 3)
!371 = distinct !DILexicalBlock(scope: !368, file: !252, line: 149, column: 3)
!372 = !DILocation(line: 149, column: 3, scope: !371)
!373 = !DILocation(line: 149, column: 3, scope: !374)
!374 = distinct !DILexicalBlock(scope: !370, file: !252, line: 149, column: 3)
!375 = !DILocation(line: 150, column: 1, scope: !299)
!376 = !DISubprogram(name: "PetscError", scope: !6, file: !6, line: 668, type: !377, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !379)
!377 = !DISubroutineType(types: !378)
!378 = !{!61, !35, !51, !41, !41, !51, !5, !41, null}
!379 = !{}
!380 = !DISubprogram(name: "PetscMallocA", scope: !381, file: !381, line: 1288, type: !382, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !379)
!381 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!382 = !DISubroutineType(types: !383)
!383 = !{!61, !51, !12, !51, !41, !41, !40, !37, null}
!384 = !DISubprogram(name: "PetscLogSet", scope: !249, file: !249, line: 369, type: !385, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !379)
!385 = !DISubroutineType(types: !386)
!386 = !{!51, !387, !387}
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!51, !51, !51, !45, !45, !45, !45}
!390 = distinct !DISubprogram(name: "PetscLogEventBeginNested", scope: !252, file: !252, line: 275, type: !391, scopeLine: 276, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !393)
!391 = !DISubroutineType(types: !392)
!392 = !{!61, !257, !51, !44, !44, !44, !44}
!393 = !{!394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !408, !413, !415, !417, !419, !421, !423, !424, !425, !427, !430, !431, !432, !436, !438, !440, !442, !444, !446, !448, !450, !452, !454, !456}
!394 = !DILocalVariable(name: "nstEvent", arg: 1, scope: !390, file: !252, line: 275, type: !257)
!395 = !DILocalVariable(name: "t", arg: 2, scope: !390, file: !252, line: 275, type: !51)
!396 = !DILocalVariable(name: "o1", arg: 3, scope: !390, file: !252, line: 275, type: !44)
!397 = !DILocalVariable(name: "o2", arg: 4, scope: !390, file: !252, line: 275, type: !44)
!398 = !DILocalVariable(name: "o3", arg: 5, scope: !390, file: !252, line: 275, type: !44)
!399 = !DILocalVariable(name: "o4", arg: 6, scope: !390, file: !252, line: 275, type: !44)
!400 = !DILocalVariable(name: "ierr", scope: !390, file: !252, line: 277, type: !61)
!401 = !DILocalVariable(name: "entry", scope: !390, file: !252, line: 278, type: !51)
!402 = !DILocalVariable(name: "pentry", scope: !390, file: !252, line: 278, type: !51)
!403 = !DILocalVariable(name: "tentry", scope: !390, file: !252, line: 278, type: !51)
!404 = !DILocalVariable(name: "i", scope: !390, file: !252, line: 278, type: !51)
!405 = !DILocalVariable(name: "dftEvent", scope: !390, file: !252, line: 279, type: !248)
!406 = !DILocalVariable(name: "ierr__", scope: !407, file: !252, line: 282, type: !61)
!407 = distinct !DILexicalBlock(scope: !390, file: !252, line: 282, column: 57)
!408 = !DILocalVariable(name: "tmp", scope: !409, file: !252, line: 288, type: !282)
!409 = distinct !DILexicalBlock(scope: !410, file: !252, line: 286, column: 48)
!410 = distinct !DILexicalBlock(scope: !411, file: !252, line: 286, column: 9)
!411 = distinct !DILexicalBlock(scope: !412, file: !252, line: 283, column: 73)
!412 = distinct !DILexicalBlock(scope: !390, file: !252, line: 283, column: 7)
!413 = !DILocalVariable(name: "ierr__", scope: !414, file: !252, line: 289, type: !61)
!414 = distinct !DILexicalBlock(scope: !409, file: !252, line: 289, column: 58)
!415 = !DILocalVariable(name: "ierr__", scope: !416, file: !252, line: 291, type: !61)
!416 = distinct !DILexicalBlock(scope: !409, file: !252, line: 291, column: 62)
!417 = !DILocalVariable(name: "ierr__", scope: !418, file: !252, line: 292, type: !61)
!418 = distinct !DILexicalBlock(scope: !409, file: !252, line: 292, column: 29)
!419 = !DILocalVariable(name: "ierr__", scope: !420, file: !252, line: 304, type: !61)
!420 = distinct !DILexicalBlock(scope: !411, file: !252, line: 304, column: 172)
!421 = !DILocalVariable(name: "dftParentsSorted", scope: !422, file: !252, line: 318, type: !289)
!422 = distinct !DILexicalBlock(scope: !412, file: !252, line: 316, column: 10)
!423 = !DILocalVariable(name: "dftEvents", scope: !422, file: !252, line: 319, type: !289)
!424 = !DILocalVariable(name: "nParents", scope: !422, file: !252, line: 320, type: !51)
!425 = !DILocalVariable(name: "ierr__", scope: !426, file: !252, line: 322, type: !61)
!426 = distinct !DILexicalBlock(scope: !422, file: !252, line: 322, column: 97)
!427 = !DILocalVariable(name: "i", scope: !428, file: !252, line: 326, type: !51)
!428 = distinct !DILexicalBlock(scope: !429, file: !252, line: 324, column: 74)
!429 = distinct !DILexicalBlock(scope: !422, file: !252, line: 324, column: 9)
!430 = !DILocalVariable(name: "dftParents", scope: !428, file: !252, line: 327, type: !289)
!431 = !DILocalVariable(name: "dftEventsSorted", scope: !428, file: !252, line: 328, type: !289)
!432 = !DILocalVariable(name: "name", scope: !428, file: !252, line: 329, type: !433)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !434)
!434 = !{!435}
!435 = !DISubrange(count: 100)
!436 = !DILocalVariable(name: "ierr__", scope: !437, file: !252, line: 333, type: !61)
!437 = distinct !DILexicalBlock(scope: !428, file: !252, line: 333, column: 56)
!438 = !DILocalVariable(name: "ierr__", scope: !439, file: !252, line: 334, type: !61)
!439 = distinct !DILexicalBlock(scope: !428, file: !252, line: 334, column: 91)
!440 = !DILocalVariable(name: "ierr__", scope: !441, file: !252, line: 337, type: !61)
!441 = distinct !DILexicalBlock(scope: !428, file: !252, line: 337, column: 210)
!442 = !DILocalVariable(name: "ierr__", scope: !443, file: !252, line: 338, type: !61)
!443 = distinct !DILexicalBlock(scope: !428, file: !252, line: 338, column: 94)
!444 = !DILocalVariable(name: "ierr__", scope: !445, file: !252, line: 339, type: !61)
!445 = distinct !DILexicalBlock(scope: !428, file: !252, line: 339, column: 94)
!446 = !DILocalVariable(name: "ierr__", scope: !447, file: !252, line: 340, type: !61)
!447 = distinct !DILexicalBlock(scope: !428, file: !252, line: 340, column: 94)
!448 = !DILocalVariable(name: "ierr__", scope: !449, file: !252, line: 341, type: !61)
!449 = distinct !DILexicalBlock(scope: !428, file: !252, line: 341, column: 94)
!450 = !DILocalVariable(name: "ierr__", scope: !451, file: !252, line: 342, type: !61)
!451 = distinct !DILexicalBlock(scope: !428, file: !252, line: 342, column: 80)
!452 = !DILocalVariable(name: "ierr__", scope: !453, file: !252, line: 374, type: !61)
!453 = distinct !DILexicalBlock(scope: !390, file: !252, line: 374, column: 34)
!454 = !DILocalVariable(name: "ierr__", scope: !455, file: !252, line: 375, type: !61)
!455 = distinct !DILexicalBlock(scope: !390, file: !252, line: 375, column: 60)
!456 = !DILocalVariable(name: "ierr__", scope: !457, file: !252, line: 376, type: !61)
!457 = distinct !DILexicalBlock(scope: !390, file: !252, line: 376, column: 33)
!458 = !DILocation(line: 0, scope: !390)
!459 = !DILocation(line: 278, column: 3, scope: !390)
!460 = !DILocation(line: 279, column: 3, scope: !390)
!461 = !DILocation(line: 281, column: 3, scope: !462)
!462 = distinct !DILexicalBlock(scope: !463, file: !252, line: 281, column: 3)
!463 = distinct !DILexicalBlock(scope: !464, file: !252, line: 281, column: 3)
!464 = distinct !DILexicalBlock(scope: !390, file: !252, line: 281, column: 3)
!465 = !DILocation(line: 281, column: 3, scope: !463)
!466 = !DILocation(line: 281, column: 3, scope: !467)
!467 = distinct !DILexicalBlock(scope: !468, file: !252, line: 281, column: 3)
!468 = distinct !DILexicalBlock(scope: !462, file: !252, line: 281, column: 3)
!469 = !DILocation(line: 281, column: 3, scope: !468)
!470 = !DILocation(line: 281, column: 3, scope: !471)
!471 = distinct !DILexicalBlock(scope: !467, file: !252, line: 281, column: 3)
!472 = !DILocation(line: 282, column: 10, scope: !390)
!473 = !DILocation(line: 283, column: 7, scope: !412)
!474 = !DILocation(line: 283, column: 14, scope: !412)
!475 = !DILocation(line: 283, column: 12, scope: !412)
!476 = !DILocation(line: 283, column: 28, scope: !412)
!477 = !DILocation(line: 283, column: 31, scope: !412)
!478 = !DILocation(line: 283, column: 51, scope: !412)
!479 = !{!480, !322, i64 0}
!480 = !{!"", !322, i64 0, !322, i64 4, !313, i64 8, !313, i64 16, !313, i64 24, !313, i64 32}
!481 = !DILocation(line: 283, column: 60, scope: !412)
!482 = !DILocation(line: 283, column: 7, scope: !390)
!483 = !DILocation(line: 286, column: 24, scope: !410)
!484 = !DILocation(line: 286, column: 22, scope: !410)
!485 = !DILocation(line: 286, column: 9, scope: !411)
!486 = !DILocation(line: 288, column: 31, scope: !409)
!487 = !DILocation(line: 0, scope: !409)
!488 = !DILocation(line: 289, column: 14, scope: !409)
!489 = !DILocation(line: 0, scope: !414)
!490 = !DILocation(line: 289, column: 58, scope: !491)
!491 = distinct !DILexicalBlock(scope: !414, file: !252, line: 289, column: 58)
!492 = !DILocation(line: 289, column: 58, scope: !414)
!493 = !DILocation(line: 290, column: 29, scope: !409)
!494 = !DILocation(line: 291, column: 14, scope: !409)
!495 = !DILocation(line: 0, scope: !416)
!496 = !DILocation(line: 291, column: 62, scope: !416)
!497 = !DILocation(line: 291, column: 62, scope: !498)
!498 = distinct !DILexicalBlock(scope: !416, file: !252, line: 291, column: 62)
!499 = !DILocation(line: 292, column: 14, scope: !409)
!500 = !DILocation(line: 0, scope: !418)
!501 = !DILocation(line: 292, column: 29, scope: !418)
!502 = !DILocation(line: 296, column: 18, scope: !411)
!503 = !DILocation(line: 292, column: 29, scope: !504)
!504 = distinct !DILexicalBlock(scope: !418, file: !252, line: 292, column: 29)
!505 = !DILocation(line: 297, column: 32, scope: !506)
!506 = distinct !DILexicalBlock(scope: !507, file: !252, line: 297, column: 5)
!507 = distinct !DILexicalBlock(scope: !411, file: !252, line: 297, column: 5)
!508 = !DILocation(line: 297, column: 5, scope: !507)
!509 = !DILocation(line: 302, column: 5, scope: !411)
!510 = !DILocation(line: 298, column: 7, scope: !511)
!511 = distinct !DILexicalBlock(scope: !506, file: !252, line: 297, column: 45)
!512 = !DILocation(line: 298, column: 39, scope: !511)
!513 = !DILocation(line: 298, column: 25, scope: !511)
!514 = !{i64 0, i64 4, !326, i64 4, i64 4, !326, i64 8, i64 8, !312, i64 16, i64 8, !312, i64 24, i64 8, !312, i64 32, i64 8, !312}
!515 = distinct !{!515, !508, !516, !517}
!516 = !DILocation(line: 299, column: 5, scope: !507)
!517 = !{!"llvm.loop.mustprogress"}
!518 = !DILocation(line: 302, column: 25, scope: !411)
!519 = !DILocation(line: 302, column: 34, scope: !411)
!520 = !DILocation(line: 303, column: 25, scope: !411)
!521 = !DILocation(line: 303, column: 33, scope: !411)
!522 = !{!480, !322, i64 4}
!523 = !DILocation(line: 304, column: 12, scope: !411)
!524 = !DILocation(line: 0, scope: !420)
!525 = !DILocation(line: 304, column: 172, scope: !526)
!526 = distinct !DILexicalBlock(scope: !420, file: !252, line: 304, column: 172)
!527 = !DILocation(line: 304, column: 172, scope: !420)
!528 = !DILocation(line: 307, column: 12, scope: !411)
!529 = !DILocation(line: 308, column: 14, scope: !411)
!530 = !DILocation(line: 310, column: 5, scope: !411)
!531 = !DILocation(line: 310, column: 25, scope: !411)
!532 = !DILocation(line: 310, column: 50, scope: !411)
!533 = !DILocation(line: 311, column: 52, scope: !411)
!534 = !DILocation(line: 311, column: 25, scope: !411)
!535 = !{!480, !313, i64 24}
!536 = !DILocation(line: 311, column: 50, scope: !411)
!537 = !DILocation(line: 312, column: 52, scope: !411)
!538 = !DILocation(line: 312, column: 25, scope: !411)
!539 = !{!480, !313, i64 16}
!540 = !DILocation(line: 312, column: 50, scope: !411)
!541 = !DILocation(line: 313, column: 25, scope: !411)
!542 = !{!480, !313, i64 8}
!543 = !DILocation(line: 313, column: 50, scope: !411)
!544 = !DILocation(line: 314, column: 52, scope: !411)
!545 = !DILocation(line: 314, column: 25, scope: !411)
!546 = !{!480, !313, i64 32}
!547 = !DILocation(line: 314, column: 50, scope: !411)
!548 = !DILocation(line: 316, column: 3, scope: !411)
!549 = !DILocation(line: 318, column: 5, scope: !422)
!550 = !DILocation(line: 318, column: 59, scope: !422)
!551 = !DILocation(line: 0, scope: !422)
!552 = !DILocation(line: 318, column: 20, scope: !422)
!553 = !DILocation(line: 319, column: 5, scope: !422)
!554 = !DILocation(line: 319, column: 59, scope: !422)
!555 = !DILocation(line: 319, column: 20, scope: !422)
!556 = !DILocation(line: 320, column: 59, scope: !422)
!557 = !DILocation(line: 322, column: 43, scope: !422)
!558 = !DILocation(line: 322, column: 12, scope: !422)
!559 = !DILocation(line: 324, column: 9, scope: !429)
!560 = !DILocation(line: 324, column: 15, scope: !429)
!561 = !DILocation(line: 324, column: 26, scope: !429)
!562 = !DILocation(line: 0, scope: !429)
!563 = !DILocation(line: 324, column: 48, scope: !429)
!564 = !DILocation(line: 324, column: 45, scope: !429)
!565 = !DILocation(line: 324, column: 9, scope: !422)
!566 = !DILocation(line: 327, column: 7, scope: !428)
!567 = !DILocation(line: 327, column: 40, scope: !428)
!568 = !DILocation(line: 327, column: 60, scope: !428)
!569 = !DILocation(line: 0, scope: !428)
!570 = !DILocation(line: 327, column: 22, scope: !428)
!571 = !DILocation(line: 328, column: 7, scope: !428)
!572 = !DILocation(line: 328, column: 60, scope: !428)
!573 = !DILocation(line: 328, column: 22, scope: !428)
!574 = !DILocation(line: 329, column: 7, scope: !428)
!575 = !DILocation(line: 329, column: 21, scope: !428)
!576 = !DILocation(line: 332, column: 7, scope: !428)
!577 = !DILocation(line: 333, column: 14, scope: !428)
!578 = !DILocation(line: 0, scope: !437)
!579 = !DILocation(line: 333, column: 56, scope: !580)
!580 = distinct !DILexicalBlock(scope: !437, file: !252, line: 333, column: 56)
!581 = !DILocation(line: 333, column: 56, scope: !437)
!582 = !DILocation(line: 334, column: 45, scope: !428)
!583 = !DILocation(line: 334, column: 14, scope: !428)
!584 = !DILocation(line: 337, column: 14, scope: !428)
!585 = !DILocation(line: 0, scope: !441)
!586 = !DILocation(line: 337, column: 210, scope: !587)
!587 = distinct !DILexicalBlock(scope: !441, file: !252, line: 337, column: 210)
!588 = !DILocation(line: 337, column: 210, scope: !441)
!589 = !DILocation(line: 338, column: 14, scope: !428)
!590 = !DILocation(line: 0, scope: !443)
!591 = !DILocation(line: 338, column: 94, scope: !443)
!592 = !DILocation(line: 338, column: 94, scope: !593)
!593 = distinct !DILexicalBlock(scope: !443, file: !252, line: 338, column: 94)
!594 = !DILocation(line: 339, column: 14, scope: !428)
!595 = !DILocation(line: 0, scope: !445)
!596 = !DILocation(line: 339, column: 94, scope: !445)
!597 = !DILocation(line: 339, column: 94, scope: !598)
!598 = distinct !DILexicalBlock(scope: !445, file: !252, line: 339, column: 94)
!599 = !DILocation(line: 340, column: 14, scope: !428)
!600 = !DILocation(line: 0, scope: !447)
!601 = !DILocation(line: 340, column: 94, scope: !447)
!602 = !DILocation(line: 340, column: 94, scope: !603)
!603 = distinct !DILexicalBlock(scope: !447, file: !252, line: 340, column: 94)
!604 = !DILocation(line: 341, column: 14, scope: !428)
!605 = !DILocation(line: 0, scope: !449)
!606 = !DILocation(line: 341, column: 94, scope: !449)
!607 = !DILocation(line: 341, column: 94, scope: !608)
!608 = distinct !DILexicalBlock(scope: !449, file: !252, line: 341, column: 94)
!609 = !DILocation(line: 342, column: 14, scope: !428)
!610 = !DILocation(line: 0, scope: !451)
!611 = !DILocation(line: 342, column: 80, scope: !612)
!612 = distinct !DILexicalBlock(scope: !451, file: !252, line: 342, column: 80)
!613 = !DILocation(line: 342, column: 80, scope: !451)
!614 = !DILocation(line: 344, column: 26, scope: !428)
!615 = !DILocation(line: 344, column: 46, scope: !428)
!616 = !DILocation(line: 344, column: 24, scope: !428)
!617 = !DILocation(line: 345, column: 46, scope: !428)
!618 = !DILocation(line: 345, column: 24, scope: !428)
!619 = !DILocation(line: 346, column: 46, scope: !428)
!620 = !DILocation(line: 346, column: 24, scope: !428)
!621 = !DILocation(line: 347, column: 46, scope: !428)
!622 = !DILocation(line: 349, column: 27, scope: !428)
!623 = !DILocation(line: 349, column: 35, scope: !428)
!624 = !DILocation(line: 352, column: 7, scope: !625)
!625 = distinct !DILexicalBlock(scope: !428, file: !252, line: 352, column: 7)
!626 = !DILocation(line: 353, column: 49, scope: !627)
!627 = distinct !DILexicalBlock(scope: !628, file: !252, line: 352, column: 43)
!628 = distinct !DILexicalBlock(scope: !625, file: !252, line: 352, column: 7)
!629 = !DILocation(line: 353, column: 31, scope: !627)
!630 = !DILocation(line: 353, column: 9, scope: !627)
!631 = !DILocation(line: 353, column: 29, scope: !627)
!632 = !DILocation(line: 354, column: 31, scope: !627)
!633 = !DILocation(line: 354, column: 9, scope: !627)
!634 = !DILocation(line: 354, column: 29, scope: !627)
!635 = !DILocation(line: 356, column: 29, scope: !636)
!636 = distinct !DILexicalBlock(scope: !637, file: !252, line: 356, column: 7)
!637 = distinct !DILexicalBlock(scope: !428, file: !252, line: 356, column: 7)
!638 = !DILocation(line: 356, column: 7, scope: !637)
!639 = !DILocation(line: 357, column: 42, scope: !640)
!640 = distinct !DILexicalBlock(scope: !636, file: !252, line: 356, column: 43)
!641 = !DILocation(line: 357, column: 30, scope: !640)
!642 = !DILocation(line: 357, column: 9, scope: !640)
!643 = !DILocation(line: 357, column: 28, scope: !640)
!644 = !DILocation(line: 358, column: 30, scope: !640)
!645 = !DILocation(line: 358, column: 9, scope: !640)
!646 = !DILocation(line: 358, column: 28, scope: !640)
!647 = !DILocation(line: 352, column: 29, scope: !628)
!648 = distinct !{!648, !624, !649, !517}
!649 = !DILocation(line: 355, column: 7, scope: !625)
!650 = distinct !{!650, !638, !651, !517}
!651 = !DILocation(line: 359, column: 7, scope: !637)
!652 = !DILocation(line: 362, column: 34, scope: !428)
!653 = !DILocation(line: 362, column: 7, scope: !428)
!654 = !DILocation(line: 362, column: 32, scope: !428)
!655 = !DILocation(line: 363, column: 34, scope: !428)
!656 = !DILocation(line: 363, column: 7, scope: !428)
!657 = !DILocation(line: 363, column: 32, scope: !428)
!658 = !DILocation(line: 364, column: 7, scope: !428)
!659 = !DILocation(line: 364, column: 32, scope: !428)
!660 = !DILocation(line: 365, column: 34, scope: !428)
!661 = !DILocation(line: 365, column: 7, scope: !428)
!662 = !DILocation(line: 365, column: 32, scope: !428)
!663 = !DILocation(line: 367, column: 5, scope: !429)
!664 = !DILocation(line: 369, column: 18, scope: !665)
!665 = distinct !DILexicalBlock(scope: !429, file: !252, line: 367, column: 12)
!666 = !DILocation(line: 369, column: 38, scope: !665)
!667 = !DILocation(line: 369, column: 16, scope: !665)
!668 = !DILocation(line: 371, column: 3, scope: !412)
!669 = !DILocation(line: 374, column: 10, scope: !390)
!670 = !DILocation(line: 0, scope: !453)
!671 = !DILocation(line: 374, column: 34, scope: !672)
!672 = distinct !DILexicalBlock(scope: !453, file: !252, line: 374, column: 34)
!673 = !DILocation(line: 374, column: 34, scope: !453)
!674 = !DILocation(line: 375, column: 36, scope: !390)
!675 = !DILocation(line: 375, column: 10, scope: !390)
!676 = !DILocation(line: 0, scope: !455)
!677 = !DILocation(line: 375, column: 60, scope: !678)
!678 = distinct !DILexicalBlock(scope: !455, file: !252, line: 375, column: 60)
!679 = !DILocation(line: 375, column: 60, scope: !455)
!680 = !DILocation(line: 376, column: 10, scope: !390)
!681 = !DILocation(line: 0, scope: !457)
!682 = !DILocation(line: 376, column: 33, scope: !683)
!683 = distinct !DILexicalBlock(scope: !457, file: !252, line: 376, column: 33)
!684 = !DILocation(line: 376, column: 33, scope: !457)
!685 = !DILocation(line: 377, column: 21, scope: !390)
!686 = !DILocation(line: 377, column: 19, scope: !390)
!687 = !DILocation(line: 378, column: 3, scope: !688)
!688 = distinct !DILexicalBlock(scope: !689, file: !252, line: 378, column: 3)
!689 = distinct !DILexicalBlock(scope: !690, file: !252, line: 378, column: 3)
!690 = distinct !DILexicalBlock(scope: !390, file: !252, line: 378, column: 3)
!691 = !DILocation(line: 378, column: 3, scope: !689)
!692 = !DILocation(line: 378, column: 3, scope: !693)
!693 = distinct !DILexicalBlock(scope: !694, file: !252, line: 378, column: 3)
!694 = distinct !DILexicalBlock(scope: !688, file: !252, line: 378, column: 3)
!695 = !DILocation(line: 378, column: 3, scope: !694)
!696 = !DILocation(line: 378, column: 3, scope: !697)
!697 = distinct !DILexicalBlock(scope: !698, file: !252, line: 378, column: 3)
!698 = distinct !DILexicalBlock(scope: !693, file: !252, line: 378, column: 3)
!699 = !DILocation(line: 378, column: 3, scope: !698)
!700 = !DILocation(line: 378, column: 3, scope: !701)
!701 = distinct !DILexicalBlock(scope: !697, file: !252, line: 378, column: 3)
!702 = !DILocation(line: 378, column: 3, scope: !703)
!703 = distinct !DILexicalBlock(scope: !693, file: !252, line: 378, column: 3)
!704 = !DILocation(line: 378, column: 3, scope: !705)
!705 = distinct !DILexicalBlock(scope: !703, file: !252, line: 378, column: 3)
!706 = !DILocation(line: 378, column: 3, scope: !707)
!707 = distinct !DILexicalBlock(scope: !708, file: !252, line: 378, column: 3)
!708 = distinct !DILexicalBlock(scope: !705, file: !252, line: 378, column: 3)
!709 = !DILocation(line: 378, column: 3, scope: !708)
!710 = !DILocation(line: 378, column: 3, scope: !711)
!711 = distinct !DILexicalBlock(scope: !707, file: !252, line: 378, column: 3)
!712 = !DILocation(line: 379, column: 1, scope: !390)
!713 = distinct !DISubprogram(name: "PetscLogEventEndNested", scope: !252, file: !252, line: 382, type: !391, scopeLine: 383, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !714)
!714 = !{!715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !728, !730, !732, !734}
!715 = !DILocalVariable(name: "nstEvent", arg: 1, scope: !713, file: !252, line: 382, type: !257)
!716 = !DILocalVariable(name: "t", arg: 2, scope: !713, file: !252, line: 382, type: !51)
!717 = !DILocalVariable(name: "o1", arg: 3, scope: !713, file: !252, line: 382, type: !44)
!718 = !DILocalVariable(name: "o2", arg: 4, scope: !713, file: !252, line: 382, type: !44)
!719 = !DILocalVariable(name: "o3", arg: 5, scope: !713, file: !252, line: 382, type: !44)
!720 = !DILocalVariable(name: "o4", arg: 6, scope: !713, file: !252, line: 382, type: !44)
!721 = !DILocalVariable(name: "ierr", scope: !713, file: !252, line: 384, type: !61)
!722 = !DILocalVariable(name: "entry", scope: !713, file: !252, line: 385, type: !51)
!723 = !DILocalVariable(name: "pentry", scope: !713, file: !252, line: 385, type: !51)
!724 = !DILocalVariable(name: "nParents", scope: !713, file: !252, line: 385, type: !51)
!725 = !DILocalVariable(name: "dftEventsSorted", scope: !713, file: !252, line: 386, type: !289)
!726 = !DILocalVariable(name: "ierr__", scope: !727, file: !252, line: 390, type: !61)
!727 = distinct !DILexicalBlock(scope: !713, file: !252, line: 390, column: 57)
!728 = !DILocalVariable(name: "ierr__", scope: !729, file: !252, line: 397, type: !61)
!729 = distinct !DILexicalBlock(scope: !713, file: !252, line: 397, column: 94)
!730 = !DILocalVariable(name: "ierr__", scope: !731, file: !252, line: 403, type: !61)
!731 = distinct !DILexicalBlock(scope: !713, file: !252, line: 403, column: 34)
!732 = !DILocalVariable(name: "ierr__", scope: !733, file: !252, line: 404, type: !61)
!733 = distinct !DILexicalBlock(scope: !713, file: !252, line: 404, column: 65)
!734 = !DILocalVariable(name: "ierr__", scope: !735, file: !252, line: 405, type: !61)
!735 = distinct !DILexicalBlock(scope: !713, file: !252, line: 405, column: 33)
!736 = !DILocation(line: 0, scope: !713)
!737 = !DILocation(line: 385, column: 3, scope: !713)
!738 = !DILocation(line: 388, column: 3, scope: !739)
!739 = distinct !DILexicalBlock(scope: !740, file: !252, line: 388, column: 3)
!740 = distinct !DILexicalBlock(scope: !741, file: !252, line: 388, column: 3)
!741 = distinct !DILexicalBlock(scope: !713, file: !252, line: 388, column: 3)
!742 = !DILocation(line: 388, column: 3, scope: !740)
!743 = !DILocation(line: 388, column: 3, scope: !744)
!744 = distinct !DILexicalBlock(scope: !745, file: !252, line: 388, column: 3)
!745 = distinct !DILexicalBlock(scope: !739, file: !252, line: 388, column: 3)
!746 = !DILocation(line: 388, column: 3, scope: !745)
!747 = !DILocation(line: 388, column: 3, scope: !748)
!748 = distinct !DILexicalBlock(scope: !744, file: !252, line: 388, column: 3)
!749 = !DILocation(line: 390, column: 10, scope: !713)
!750 = !DILocation(line: 391, column: 7, scope: !751)
!751 = distinct !DILexicalBlock(scope: !713, file: !252, line: 391, column: 7)
!752 = !DILocation(line: 391, column: 14, scope: !751)
!753 = !DILocation(line: 391, column: 12, scope: !751)
!754 = !DILocation(line: 391, column: 7, scope: !713)
!755 = !DILocation(line: 391, column: 29, scope: !751)
!756 = !DILocation(line: 392, column: 7, scope: !757)
!757 = distinct !DILexicalBlock(scope: !713, file: !252, line: 392, column: 7)
!758 = !DILocation(line: 392, column: 27, scope: !757)
!759 = !DILocation(line: 392, column: 36, scope: !757)
!760 = !DILocation(line: 392, column: 7, scope: !713)
!761 = !DILocation(line: 392, column: 49, scope: !757)
!762 = !DILocation(line: 393, column: 41, scope: !713)
!763 = !DILocation(line: 394, column: 41, scope: !713)
!764 = !DILocation(line: 397, column: 41, scope: !713)
!765 = !DILocation(line: 397, column: 10, scope: !713)
!766 = !DILocation(line: 399, column: 7, scope: !767)
!767 = distinct !DILexicalBlock(scope: !713, file: !252, line: 399, column: 7)
!768 = !DILocation(line: 399, column: 13, scope: !767)
!769 = !DILocation(line: 399, column: 7, scope: !713)
!770 = !DILocation(line: 399, column: 25, scope: !767)
!771 = !DILocation(line: 400, column: 7, scope: !772)
!772 = distinct !DILexicalBlock(scope: !713, file: !252, line: 400, column: 7)
!773 = !DILocation(line: 400, column: 34, scope: !772)
!774 = !DILocation(line: 400, column: 31, scope: !772)
!775 = !DILocation(line: 400, column: 7, scope: !713)
!776 = !DILocation(line: 400, column: 51, scope: !772)
!777 = !DILocation(line: 403, column: 10, scope: !713)
!778 = !DILocation(line: 0, scope: !731)
!779 = !DILocation(line: 403, column: 34, scope: !780)
!780 = distinct !DILexicalBlock(scope: !731, file: !252, line: 403, column: 34)
!781 = !DILocation(line: 403, column: 34, scope: !731)
!782 = !DILocation(line: 404, column: 34, scope: !713)
!783 = !DILocation(line: 404, column: 10, scope: !713)
!784 = !DILocation(line: 0, scope: !733)
!785 = !DILocation(line: 404, column: 65, scope: !786)
!786 = distinct !DILexicalBlock(scope: !733, file: !252, line: 404, column: 65)
!787 = !DILocation(line: 404, column: 65, scope: !733)
!788 = !DILocation(line: 405, column: 10, scope: !713)
!789 = !DILocation(line: 0, scope: !735)
!790 = !DILocation(line: 405, column: 33, scope: !791)
!791 = distinct !DILexicalBlock(scope: !735, file: !252, line: 405, column: 33)
!792 = !DILocation(line: 405, column: 33, scope: !735)
!793 = !DILocation(line: 406, column: 21, scope: !713)
!794 = !DILocation(line: 406, column: 41, scope: !713)
!795 = !DILocation(line: 406, column: 19, scope: !713)
!796 = !DILocation(line: 407, column: 3, scope: !797)
!797 = distinct !DILexicalBlock(scope: !798, file: !252, line: 407, column: 3)
!798 = distinct !DILexicalBlock(scope: !799, file: !252, line: 407, column: 3)
!799 = distinct !DILexicalBlock(scope: !713, file: !252, line: 407, column: 3)
!800 = !DILocation(line: 407, column: 3, scope: !798)
!801 = !DILocation(line: 407, column: 3, scope: !802)
!802 = distinct !DILexicalBlock(scope: !803, file: !252, line: 407, column: 3)
!803 = distinct !DILexicalBlock(scope: !797, file: !252, line: 407, column: 3)
!804 = !DILocation(line: 407, column: 3, scope: !803)
!805 = !DILocation(line: 407, column: 3, scope: !806)
!806 = distinct !DILexicalBlock(scope: !807, file: !252, line: 407, column: 3)
!807 = distinct !DILexicalBlock(scope: !802, file: !252, line: 407, column: 3)
!808 = !DILocation(line: 407, column: 3, scope: !807)
!809 = !DILocation(line: 407, column: 3, scope: !810)
!810 = distinct !DILexicalBlock(scope: !806, file: !252, line: 407, column: 3)
!811 = !DILocation(line: 407, column: 3, scope: !812)
!812 = distinct !DILexicalBlock(scope: !802, file: !252, line: 407, column: 3)
!813 = !DILocation(line: 407, column: 3, scope: !814)
!814 = distinct !DILexicalBlock(scope: !812, file: !252, line: 407, column: 3)
!815 = !DILocation(line: 407, column: 3, scope: !816)
!816 = distinct !DILexicalBlock(scope: !817, file: !252, line: 407, column: 3)
!817 = distinct !DILexicalBlock(scope: !814, file: !252, line: 407, column: 3)
!818 = !DILocation(line: 407, column: 3, scope: !817)
!819 = !DILocation(line: 407, column: 3, scope: !820)
!820 = distinct !DILexicalBlock(scope: !816, file: !252, line: 407, column: 3)
!821 = !DILocation(line: 408, column: 1, scope: !713)
!822 = distinct !DISubprogram(name: "PetscLogNestedEnd", scope: !252, file: !252, line: 153, type: !300, scopeLine: 154, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !823)
!823 = !{!824, !825, !826, !831}
!824 = !DILocalVariable(name: "ierr", scope: !822, file: !252, line: 155, type: !61)
!825 = !DILocalVariable(name: "i", scope: !822, file: !252, line: 156, type: !51)
!826 = !DILocalVariable(name: "ierr__", scope: !827, file: !252, line: 161, type: !61)
!827 = distinct !DILexicalBlock(scope: !828, file: !252, line: 161, column: 142)
!828 = distinct !DILexicalBlock(scope: !829, file: !252, line: 160, column: 35)
!829 = distinct !DILexicalBlock(scope: !830, file: !252, line: 160, column: 3)
!830 = distinct !DILexicalBlock(scope: !822, file: !252, line: 160, column: 3)
!831 = !DILocalVariable(name: "ierr__", scope: !832, file: !252, line: 163, type: !61)
!832 = distinct !DILexicalBlock(scope: !822, file: !252, line: 163, column: 34)
!833 = !DILocation(line: 158, column: 3, scope: !834)
!834 = distinct !DILexicalBlock(scope: !835, file: !252, line: 158, column: 3)
!835 = distinct !DILexicalBlock(scope: !836, file: !252, line: 158, column: 3)
!836 = distinct !DILexicalBlock(scope: !822, file: !252, line: 158, column: 3)
!837 = !DILocation(line: 158, column: 3, scope: !835)
!838 = !DILocation(line: 158, column: 3, scope: !839)
!839 = distinct !DILexicalBlock(scope: !840, file: !252, line: 158, column: 3)
!840 = distinct !DILexicalBlock(scope: !834, file: !252, line: 158, column: 3)
!841 = !DILocation(line: 158, column: 3, scope: !840)
!842 = !DILocation(line: 158, column: 3, scope: !843)
!843 = distinct !DILexicalBlock(scope: !839, file: !252, line: 158, column: 3)
!844 = !DILocation(line: 159, column: 8, scope: !845)
!845 = distinct !DILexicalBlock(scope: !822, file: !252, line: 159, column: 7)
!846 = !DILocation(line: 159, column: 7, scope: !822)
!847 = !DILocation(line: 0, scope: !822)
!848 = !DILocation(line: 160, column: 15, scope: !829)
!849 = !DILocation(line: 160, column: 14, scope: !829)
!850 = !DILocation(line: 160, column: 3, scope: !830)
!851 = !DILocation(line: 161, column: 12, scope: !828)
!852 = !DILocation(line: 0, scope: !827)
!853 = !DILocation(line: 161, column: 142, scope: !854)
!854 = distinct !DILexicalBlock(scope: !827, file: !252, line: 161, column: 142)
!855 = !DILocation(line: 161, column: 142, scope: !827)
!856 = !DILocation(line: 159, column: 22, scope: !857)
!857 = distinct !DILexicalBlock(scope: !858, file: !252, line: 159, column: 22)
!858 = distinct !DILexicalBlock(scope: !859, file: !252, line: 159, column: 22)
!859 = distinct !DILexicalBlock(scope: !860, file: !252, line: 159, column: 22)
!860 = distinct !DILexicalBlock(scope: !861, file: !252, line: 159, column: 22)
!861 = distinct !DILexicalBlock(scope: !845, file: !252, line: 159, column: 22)
!862 = !DILocation(line: 159, column: 22, scope: !858)
!863 = !DILocation(line: 159, column: 22, scope: !864)
!864 = distinct !DILexicalBlock(scope: !865, file: !252, line: 159, column: 22)
!865 = distinct !DILexicalBlock(scope: !857, file: !252, line: 159, column: 22)
!866 = !DILocation(line: 159, column: 22, scope: !865)
!867 = !DILocation(line: 159, column: 22, scope: !868)
!868 = distinct !DILexicalBlock(scope: !864, file: !252, line: 159, column: 22)
!869 = !DILocation(line: 159, column: 22, scope: !870)
!870 = distinct !DILexicalBlock(scope: !857, file: !252, line: 159, column: 22)
!871 = !DILocation(line: 159, column: 22, scope: !872)
!872 = distinct !DILexicalBlock(scope: !870, file: !252, line: 159, column: 22)
!873 = !DILocation(line: 159, column: 22, scope: !874)
!874 = distinct !DILexicalBlock(scope: !875, file: !252, line: 159, column: 22)
!875 = distinct !DILexicalBlock(scope: !872, file: !252, line: 159, column: 22)
!876 = !DILocation(line: 159, column: 22, scope: !875)
!877 = !DILocation(line: 159, column: 22, scope: !878)
!878 = distinct !DILexicalBlock(scope: !874, file: !252, line: 159, column: 22)
!879 = distinct !{!879, !850, !880, !517}
!880 = !DILocation(line: 162, column: 3, scope: !830)
!881 = !DILocation(line: 160, column: 31, scope: !829)
!882 = !DILocation(line: 163, column: 10, scope: !822)
!883 = !DILocation(line: 0, scope: !832)
!884 = !DILocation(line: 163, column: 34, scope: !885)
!885 = distinct !DILexicalBlock(scope: !832, file: !252, line: 163, column: 34)
!886 = !DILocation(line: 164, column: 26, scope: !822)
!887 = !DILocation(line: 165, column: 26, scope: !822)
!888 = !DILocation(line: 166, column: 26, scope: !822)
!889 = !DILocation(line: 167, column: 3, scope: !890)
!890 = distinct !DILexicalBlock(scope: !891, file: !252, line: 167, column: 3)
!891 = distinct !DILexicalBlock(scope: !892, file: !252, line: 167, column: 3)
!892 = distinct !DILexicalBlock(scope: !822, file: !252, line: 167, column: 3)
!893 = !DILocation(line: 167, column: 3, scope: !891)
!894 = !DILocation(line: 167, column: 3, scope: !895)
!895 = distinct !DILexicalBlock(scope: !896, file: !252, line: 167, column: 3)
!896 = distinct !DILexicalBlock(scope: !890, file: !252, line: 167, column: 3)
!897 = !DILocation(line: 167, column: 3, scope: !896)
!898 = !DILocation(line: 167, column: 3, scope: !899)
!899 = distinct !DILexicalBlock(scope: !900, file: !252, line: 167, column: 3)
!900 = distinct !DILexicalBlock(scope: !895, file: !252, line: 167, column: 3)
!901 = !DILocation(line: 167, column: 3, scope: !900)
!902 = !DILocation(line: 167, column: 3, scope: !903)
!903 = distinct !DILexicalBlock(scope: !899, file: !252, line: 167, column: 3)
!904 = !DILocation(line: 167, column: 3, scope: !905)
!905 = distinct !DILexicalBlock(scope: !895, file: !252, line: 167, column: 3)
!906 = !DILocation(line: 167, column: 3, scope: !907)
!907 = distinct !DILexicalBlock(scope: !905, file: !252, line: 167, column: 3)
!908 = !DILocation(line: 167, column: 3, scope: !909)
!909 = distinct !DILexicalBlock(scope: !910, file: !252, line: 167, column: 3)
!910 = distinct !DILexicalBlock(scope: !907, file: !252, line: 167, column: 3)
!911 = !DILocation(line: 167, column: 3, scope: !910)
!912 = !DILocation(line: 167, column: 3, scope: !913)
!913 = distinct !DILexicalBlock(scope: !909, file: !252, line: 167, column: 3)
!914 = !DILocation(line: 168, column: 1, scope: !822)
!915 = !DISubprogram(name: "PetscFreeA", scope: !381, file: !381, line: 1289, type: !916, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !379)
!916 = !DISubroutineType(types: !917)
!917 = !{!61, !51, !51, !41, !41, !37, null}
!918 = distinct !DISubprogram(name: "PetscLogSetThreshold", scope: !252, file: !252, line: 440, type: !919, scopeLine: 441, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !922)
!919 = !DISubroutineType(types: !920)
!920 = !{!61, !102, !921}
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!922 = !{!923, !924}
!923 = !DILocalVariable(name: "newThresh", arg: 1, scope: !918, file: !252, line: 440, type: !102)
!924 = !DILocalVariable(name: "oldThresh", arg: 2, scope: !918, file: !252, line: 440, type: !921)
!925 = !DILocation(line: 0, scope: !918)
!926 = !DILocation(line: 442, column: 3, scope: !927)
!927 = distinct !DILexicalBlock(scope: !928, file: !252, line: 442, column: 3)
!928 = distinct !DILexicalBlock(scope: !929, file: !252, line: 442, column: 3)
!929 = distinct !DILexicalBlock(scope: !918, file: !252, line: 442, column: 3)
!930 = !DILocation(line: 442, column: 3, scope: !928)
!931 = !DILocation(line: 442, column: 3, scope: !932)
!932 = distinct !DILexicalBlock(scope: !933, file: !252, line: 442, column: 3)
!933 = distinct !DILexicalBlock(scope: !927, file: !252, line: 442, column: 3)
!934 = !DILocation(line: 442, column: 3, scope: !933)
!935 = !DILocation(line: 442, column: 3, scope: !936)
!936 = distinct !DILexicalBlock(scope: !932, file: !252, line: 442, column: 3)
!937 = !DILocation(line: 443, column: 7, scope: !938)
!938 = distinct !DILexicalBlock(scope: !918, file: !252, line: 443, column: 7)
!939 = !DILocation(line: 443, column: 7, scope: !918)
!940 = !DILocation(line: 443, column: 31, scope: !938)
!941 = !{!942, !942, i64 0}
!942 = !{!"double", !314, i64 0}
!943 = !DILocation(line: 443, column: 29, scope: !938)
!944 = !DILocation(line: 443, column: 18, scope: !938)
!945 = !DILocation(line: 444, column: 17, scope: !946)
!946 = distinct !DILexicalBlock(scope: !918, file: !252, line: 444, column: 7)
!947 = !DILocation(line: 444, column: 7, scope: !918)
!948 = !DILocation(line: 445, column: 17, scope: !949)
!949 = distinct !DILexicalBlock(scope: !918, file: !252, line: 445, column: 7)
!950 = !DILocation(line: 445, column: 7, scope: !918)
!951 = !DILocation(line: 446, column: 19, scope: !918)
!952 = !DILocation(line: 446, column: 17, scope: !918)
!953 = !DILocation(line: 447, column: 3, scope: !954)
!954 = distinct !DILexicalBlock(scope: !955, file: !252, line: 447, column: 3)
!955 = distinct !DILexicalBlock(scope: !956, file: !252, line: 447, column: 3)
!956 = distinct !DILexicalBlock(scope: !918, file: !252, line: 447, column: 3)
!957 = !DILocation(line: 447, column: 3, scope: !955)
!958 = !DILocation(line: 447, column: 3, scope: !959)
!959 = distinct !DILexicalBlock(scope: !960, file: !252, line: 447, column: 3)
!960 = distinct !DILexicalBlock(scope: !954, file: !252, line: 447, column: 3)
!961 = !DILocation(line: 447, column: 3, scope: !960)
!962 = !DILocation(line: 447, column: 3, scope: !963)
!963 = distinct !DILexicalBlock(scope: !964, file: !252, line: 447, column: 3)
!964 = distinct !DILexicalBlock(scope: !959, file: !252, line: 447, column: 3)
!965 = !DILocation(line: 447, column: 3, scope: !964)
!966 = !DILocation(line: 447, column: 3, scope: !967)
!967 = distinct !DILexicalBlock(scope: !963, file: !252, line: 447, column: 3)
!968 = !DILocation(line: 447, column: 3, scope: !969)
!969 = distinct !DILexicalBlock(scope: !959, file: !252, line: 447, column: 3)
!970 = !DILocation(line: 447, column: 3, scope: !971)
!971 = distinct !DILexicalBlock(scope: !969, file: !252, line: 447, column: 3)
!972 = !DILocation(line: 447, column: 3, scope: !973)
!973 = distinct !DILexicalBlock(scope: !974, file: !252, line: 447, column: 3)
!974 = distinct !DILexicalBlock(scope: !971, file: !252, line: 447, column: 3)
!975 = !DILocation(line: 447, column: 3, scope: !974)
!976 = !DILocation(line: 447, column: 3, scope: !977)
!977 = distinct !DILexicalBlock(scope: !973, file: !252, line: 447, column: 3)
!978 = !DILocation(line: 447, column: 3, scope: !956)
!979 = distinct !DISubprogram(name: "PetscLogView_Nested", scope: !252, file: !252, line: 1381, type: !980, scopeLine: 1382, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !982)
!980 = !DISubroutineType(types: !981)
!981 = !{!61, !67}
!982 = !{!983, !984, !985, !986, !987, !988, !999, !1000, !1001, !1002, !1004, !1006, !1008, !1010, !1012, !1014, !1018, !1019, !1021, !1027, !1028, !1030, !1033, !1034, !1036, !1039, !1040, !1042, !1044, !1046, !1048, !1050, !1052, !1054, !1056, !1058}
!983 = !DILocalVariable(name: "viewer", arg: 1, scope: !979, file: !252, line: 1381, type: !67)
!984 = !DILocalVariable(name: "ierr", scope: !979, file: !252, line: 1383, type: !61)
!985 = !DILocalVariable(name: "locTotalTime", scope: !979, file: !252, line: 1384, type: !102)
!986 = !DILocalVariable(name: "globTotalTime", scope: !979, file: !252, line: 1384, type: !102)
!987 = !DILocalVariable(name: "tree", scope: !979, file: !252, line: 1385, type: !250)
!988 = !DILocalVariable(name: "selftimers", scope: !979, file: !252, line: 1386, type: !989)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSelfTimer", file: !252, line: 1218, baseType: !991)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !252, line: 1211, size: 384, elements: !992)
!992 = !{!993, !994, !995, !996, !997, !998}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !991, file: !252, line: 1212, baseType: !127, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !991, file: !252, line: 1213, baseType: !102, size: 64, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !991, file: !252, line: 1214, baseType: !102, size: 64, offset: 128)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "numMessages", scope: !991, file: !252, line: 1215, baseType: !102, size: 64, offset: 192)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "messageLength", scope: !991, file: !252, line: 1216, baseType: !102, size: 64, offset: 256)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "numReductions", scope: !991, file: !252, line: 1217, baseType: !102, size: 64, offset: 320)
!999 = !DILocalVariable(name: "nTimers", scope: !979, file: !252, line: 1387, type: !51)
!1000 = !DILocalVariable(name: "nstMax", scope: !979, file: !252, line: 1387, type: !51)
!1001 = !DILocalVariable(name: "comm", scope: !979, file: !252, line: 1388, type: !33)
!1002 = !DILocalVariable(name: "ierr__", scope: !1003, file: !252, line: 1391, type: !61)
!1003 = distinct !DILexicalBlock(scope: !979, file: !252, line: 1391, column: 56)
!1004 = !DILocalVariable(name: "ierr__", scope: !1005, file: !252, line: 1392, type: !61)
!1005 = distinct !DILexicalBlock(scope: !979, file: !252, line: 1392, column: 43)
!1006 = !DILocalVariable(name: "ierr__", scope: !1007, file: !252, line: 1393, type: !61)
!1007 = distinct !DILexicalBlock(scope: !979, file: !252, line: 1393, column: 82)
!1008 = !DILocalVariable(name: "ierr__", scope: !1009, file: !252, line: 1394, type: !61)
!1009 = distinct !DILexicalBlock(scope: !979, file: !252, line: 1394, column: 64)
!1010 = !DILocalVariable(name: "ierr__", scope: !1011, file: !252, line: 1397, type: !61)
!1011 = distinct !DILexicalBlock(scope: !979, file: !252, line: 1397, column: 35)
!1012 = !DILocalVariable(name: "_4_ierr", scope: !1013, file: !252, line: 1398, type: !61)
!1013 = distinct !DILexicalBlock(scope: !979, file: !252, line: 1398, column: 10)
!1014 = !DILocalVariable(name: "a_b1", scope: !1013, file: !252, line: 1398, type: !1015)
!1015 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 192, elements: !1016)
!1016 = !{!1017}
!1017 = !DISubrange(count: 6)
!1018 = !DILocalVariable(name: "a_b2", scope: !1013, file: !252, line: 1398, type: !1015)
!1019 = !DILocalVariable(name: "_7_errorcode", scope: !1020, file: !252, line: 1398, type: !61)
!1020 = distinct !DILexicalBlock(scope: !1013, file: !252, line: 1398, column: 10)
!1021 = !DILocalVariable(name: "_7_errorstring", scope: !1022, file: !252, line: 1398, type: !1024)
!1022 = distinct !DILexicalBlock(scope: !1023, file: !252, line: 1398, column: 10)
!1023 = distinct !DILexicalBlock(scope: !1020, file: !252, line: 1398, column: 10)
!1024 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 2048, elements: !1025)
!1025 = !{!1026}
!1026 = !DISubrange(count: 256)
!1027 = !DILocalVariable(name: "_7_resultlen", scope: !1022, file: !252, line: 1398, type: !117)
!1028 = !DILocalVariable(name: "_7_errorcode", scope: !1029, file: !252, line: 1398, type: !61)
!1029 = distinct !DILexicalBlock(scope: !1013, file: !252, line: 1398, column: 10)
!1030 = !DILocalVariable(name: "_7_errorstring", scope: !1031, file: !252, line: 1398, type: !1024)
!1031 = distinct !DILexicalBlock(scope: !1032, file: !252, line: 1398, column: 10)
!1032 = distinct !DILexicalBlock(scope: !1029, file: !252, line: 1398, column: 10)
!1033 = !DILocalVariable(name: "_7_resultlen", scope: !1031, file: !252, line: 1398, type: !117)
!1034 = !DILocalVariable(name: "_7_errorcode", scope: !1035, file: !252, line: 1398, type: !61)
!1035 = distinct !DILexicalBlock(scope: !979, file: !252, line: 1398, column: 95)
!1036 = !DILocalVariable(name: "_7_errorstring", scope: !1037, file: !252, line: 1398, type: !1024)
!1037 = distinct !DILexicalBlock(scope: !1038, file: !252, line: 1398, column: 95)
!1038 = distinct !DILexicalBlock(scope: !1035, file: !252, line: 1398, column: 95)
!1039 = !DILocalVariable(name: "_7_resultlen", scope: !1037, file: !252, line: 1398, type: !117)
!1040 = !DILocalVariable(name: "ierr__", scope: !1041, file: !252, line: 1401, type: !61)
!1041 = distinct !DILexicalBlock(scope: !979, file: !252, line: 1401, column: 37)
!1042 = !DILocalVariable(name: "ierr__", scope: !1043, file: !252, line: 1402, type: !61)
!1043 = distinct !DILexicalBlock(scope: !979, file: !252, line: 1402, column: 60)
!1044 = !DILocalVariable(name: "ierr__", scope: !1045, file: !252, line: 1404, type: !61)
!1045 = distinct !DILexicalBlock(scope: !979, file: !252, line: 1404, column: 60)
!1046 = !DILocalVariable(name: "ierr__", scope: !1047, file: !252, line: 1405, type: !61)
!1047 = distinct !DILexicalBlock(scope: !979, file: !252, line: 1405, column: 75)
!1048 = !DILocalVariable(name: "ierr__", scope: !1049, file: !252, line: 1406, type: !61)
!1049 = distinct !DILexicalBlock(scope: !979, file: !252, line: 1406, column: 51)
!1050 = !DILocalVariable(name: "ierr__", scope: !1051, file: !252, line: 1409, type: !61)
!1051 = distinct !DILexicalBlock(scope: !979, file: !252, line: 1409, column: 58)
!1052 = !DILocalVariable(name: "ierr__", scope: !1053, file: !252, line: 1410, type: !61)
!1053 = distinct !DILexicalBlock(scope: !979, file: !252, line: 1410, column: 72)
!1054 = !DILocalVariable(name: "ierr__", scope: !1055, file: !252, line: 1411, type: !61)
!1055 = distinct !DILexicalBlock(scope: !979, file: !252, line: 1411, column: 32)
!1056 = !DILocalVariable(name: "ierr__", scope: !1057, file: !252, line: 1413, type: !61)
!1057 = distinct !DILexicalBlock(scope: !979, file: !252, line: 1413, column: 56)
!1058 = !DILocalVariable(name: "ierr__", scope: !1059, file: !252, line: 1414, type: !61)
!1059 = distinct !DILexicalBlock(scope: !979, file: !252, line: 1414, column: 44)
!1060 = !DILocation(line: 0, scope: !979)
!1061 = !DILocation(line: 1384, column: 3, scope: !979)
!1062 = !DILocation(line: 1385, column: 3, scope: !979)
!1063 = !DILocation(line: 1385, column: 25, scope: !979)
!1064 = !DILocation(line: 1386, column: 3, scope: !979)
!1065 = !DILocation(line: 1386, column: 25, scope: !979)
!1066 = !DILocation(line: 1387, column: 3, scope: !979)
!1067 = !DILocation(line: 1387, column: 24, scope: !979)
!1068 = !DILocation(line: 1387, column: 37, scope: !979)
!1069 = !DILocation(line: 1388, column: 3, scope: !979)
!1070 = !DILocation(line: 1390, column: 3, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1072, file: !252, line: 1390, column: 3)
!1072 = distinct !DILexicalBlock(scope: !1073, file: !252, line: 1390, column: 3)
!1073 = distinct !DILexicalBlock(scope: !979, file: !252, line: 1390, column: 3)
!1074 = !DILocation(line: 1390, column: 3, scope: !1072)
!1075 = !DILocation(line: 1390, column: 3, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !1077, file: !252, line: 1390, column: 3)
!1077 = distinct !DILexicalBlock(scope: !1071, file: !252, line: 1390, column: 3)
!1078 = !DILocation(line: 1390, column: 3, scope: !1077)
!1079 = !DILocation(line: 1390, column: 3, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1076, file: !252, line: 1390, column: 3)
!1081 = !DILocation(line: 1391, column: 29, scope: !979)
!1082 = !DILocation(line: 1391, column: 10, scope: !979)
!1083 = !DILocation(line: 0, scope: !1003)
!1084 = !DILocation(line: 1391, column: 56, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1003, file: !252, line: 1391, column: 56)
!1086 = !DILocation(line: 1391, column: 56, scope: !1003)
!1087 = !DILocation(line: 1392, column: 10, scope: !979)
!1088 = !DILocation(line: 0, scope: !1005)
!1089 = !DILocation(line: 1392, column: 43, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !1005, file: !252, line: 1392, column: 43)
!1091 = !DILocation(line: 1392, column: 43, scope: !1005)
!1092 = !DILocation(line: 1393, column: 10, scope: !979)
!1093 = !DILocation(line: 0, scope: !1007)
!1094 = !DILocation(line: 1393, column: 82, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !1007, file: !252, line: 1393, column: 82)
!1096 = !DILocation(line: 1393, column: 82, scope: !1007)
!1097 = !DILocation(line: 1394, column: 10, scope: !979)
!1098 = !DILocation(line: 0, scope: !1009)
!1099 = !DILocation(line: 1394, column: 64, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1009, file: !252, line: 1394, column: 64)
!1101 = !DILocation(line: 1394, column: 64, scope: !1009)
!1102 = !DILocalVariable(name: "v", arg: 1, scope: !1103, file: !1104, line: 102, type: !921)
!1103 = distinct !DISubprogram(name: "PetscTime", scope: !1104, file: !1104, line: 102, type: !1105, scopeLine: 103, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1107)
!1104 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctime.h", directory: "/home/users/ndemeye/xSDK")
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!61, !921}
!1107 = !{!1102}
!1108 = !DILocation(line: 0, scope: !1103, inlinedAt: !1109)
!1109 = distinct !DILocation(line: 1397, column: 10, scope: !979)
!1110 = !DILocation(line: 104, column: 8, scope: !1103, inlinedAt: !1109)
!1111 = !DILocation(line: 1397, column: 67, scope: !979)
!1112 = !DILocation(line: 1397, column: 64, scope: !979)
!1113 = !DILocation(line: 1398, column: 10, scope: !1013)
!1114 = !DILocalVariable(name: "comm", arg: 1, scope: !1115, file: !249, line: 498, type: !33)
!1115 = distinct !DISubprogram(name: "PetscMPIParallelComm", scope: !249, file: !249, line: 498, type: !1116, scopeLine: 499, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1118)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!51, !33}
!1118 = !{!1114, !1119}
!1119 = !DILocalVariable(name: "size", scope: !1115, file: !249, line: 500, type: !117)
!1120 = !DILocation(line: 0, scope: !1115, inlinedAt: !1121)
!1121 = distinct !DILocation(line: 1398, column: 10, scope: !1013)
!1122 = !DILocation(line: 500, column: 3, scope: !1115, inlinedAt: !1121)
!1123 = !DILocation(line: 500, column: 21, scope: !1115, inlinedAt: !1121)
!1124 = !DILocation(line: 500, column: 55, scope: !1115, inlinedAt: !1121)
!1125 = !DILocation(line: 500, column: 60, scope: !1115, inlinedAt: !1121)
!1126 = !DILocation(line: 501, column: 1, scope: !1115, inlinedAt: !1121)
!1127 = !DILocation(line: 0, scope: !1013)
!1128 = !DILocation(line: 0, scope: !1020)
!1129 = !DILocation(line: 1398, column: 10, scope: !1023)
!1130 = !DILocation(line: 1398, column: 10, scope: !1020)
!1131 = !DILocation(line: 1398, column: 10, scope: !1022)
!1132 = !DILocation(line: 0, scope: !1022)
!1133 = !DILocation(line: 1398, column: 10, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1013, file: !252, line: 1398, column: 10)
!1135 = !DILocation(line: 1398, column: 10, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1013, file: !252, line: 1398, column: 10)
!1137 = !DILocation(line: 1398, column: 10, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !1013, file: !252, line: 1398, column: 10)
!1139 = !DILocation(line: 0, scope: !1115, inlinedAt: !1140)
!1140 = distinct !DILocation(line: 1398, column: 10, scope: !1013)
!1141 = !DILocation(line: 500, column: 3, scope: !1115, inlinedAt: !1140)
!1142 = !DILocation(line: 500, column: 21, scope: !1115, inlinedAt: !1140)
!1143 = !DILocation(line: 500, column: 55, scope: !1115, inlinedAt: !1140)
!1144 = !DILocation(line: 500, column: 60, scope: !1115, inlinedAt: !1140)
!1145 = !DILocation(line: 501, column: 1, scope: !1115, inlinedAt: !1140)
!1146 = !DILocation(line: 0, scope: !1029)
!1147 = !DILocation(line: 1398, column: 10, scope: !1032)
!1148 = !DILocation(line: 1398, column: 10, scope: !1029)
!1149 = !DILocation(line: 1398, column: 10, scope: !1031)
!1150 = !DILocation(line: 0, scope: !1031)
!1151 = !DILocation(line: 1398, column: 10, scope: !979)
!1152 = !DILocation(line: 1401, column: 10, scope: !979)
!1153 = !DILocation(line: 0, scope: !1041)
!1154 = !DILocation(line: 1401, column: 37, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1041, file: !252, line: 1401, column: 37)
!1156 = !DILocation(line: 1401, column: 37, scope: !1041)
!1157 = !DILocation(line: 1402, column: 46, scope: !979)
!1158 = !DILocation(line: 1402, column: 10, scope: !979)
!1159 = !DILocation(line: 0, scope: !1043)
!1160 = !DILocation(line: 1402, column: 60, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !1043, file: !252, line: 1402, column: 60)
!1162 = !DILocation(line: 1402, column: 60, scope: !1043)
!1163 = !DILocation(line: 1404, column: 10, scope: !979)
!1164 = !DILocation(line: 0, scope: !1045)
!1165 = !DILocation(line: 1404, column: 60, scope: !1166)
!1166 = distinct !DILexicalBlock(scope: !1045, file: !252, line: 1404, column: 60)
!1167 = !DILocation(line: 1404, column: 60, scope: !1045)
!1168 = !DILocation(line: 1405, column: 45, scope: !979)
!1169 = !DILocation(line: 1405, column: 51, scope: !979)
!1170 = !DILocation(line: 1405, column: 60, scope: !979)
!1171 = !DILocation(line: 1405, column: 10, scope: !979)
!1172 = !DILocation(line: 0, scope: !1047)
!1173 = !DILocation(line: 1405, column: 75, scope: !1174)
!1174 = distinct !DILexicalBlock(scope: !1047, file: !252, line: 1405, column: 75)
!1175 = !DILocation(line: 1405, column: 75, scope: !1047)
!1176 = !DILocation(line: 1406, column: 10, scope: !979)
!1177 = !DILocation(line: 0, scope: !1049)
!1178 = !DILocation(line: 1406, column: 51, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1049, file: !252, line: 1406, column: 51)
!1180 = !DILocation(line: 1406, column: 51, scope: !1049)
!1181 = !DILocation(line: 1409, column: 10, scope: !979)
!1182 = !DILocation(line: 0, scope: !1051)
!1183 = !DILocation(line: 1409, column: 58, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !1051, file: !252, line: 1409, column: 58)
!1185 = !DILocation(line: 1409, column: 58, scope: !1051)
!1186 = !DILocation(line: 1410, column: 37, scope: !979)
!1187 = !DILocation(line: 1410, column: 49, scope: !979)
!1188 = !DILocation(line: 1410, column: 57, scope: !979)
!1189 = !DILocation(line: 1410, column: 10, scope: !979)
!1190 = !DILocation(line: 0, scope: !1053)
!1191 = !DILocation(line: 1410, column: 72, scope: !1192)
!1192 = distinct !DILexicalBlock(scope: !1053, file: !252, line: 1410, column: 72)
!1193 = !DILocation(line: 1410, column: 72, scope: !1053)
!1194 = !DILocation(line: 1411, column: 10, scope: !979)
!1195 = !DILocation(line: 0, scope: !1055)
!1196 = !DILocation(line: 1411, column: 32, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1055, file: !252, line: 1411, column: 32)
!1198 = !DILocation(line: 1413, column: 10, scope: !979)
!1199 = !DILocation(line: 0, scope: !1057)
!1200 = !DILocation(line: 1413, column: 56, scope: !1201)
!1201 = distinct !DILexicalBlock(scope: !1057, file: !252, line: 1413, column: 56)
!1202 = !DILocation(line: 1413, column: 56, scope: !1057)
!1203 = !DILocation(line: 1414, column: 10, scope: !979)
!1204 = !DILocation(line: 0, scope: !1059)
!1205 = !DILocation(line: 1414, column: 44, scope: !1206)
!1206 = distinct !DILexicalBlock(scope: !1059, file: !252, line: 1414, column: 44)
!1207 = !DILocation(line: 1414, column: 44, scope: !1059)
!1208 = !DILocation(line: 1415, column: 3, scope: !1209)
!1209 = distinct !DILexicalBlock(scope: !1210, file: !252, line: 1415, column: 3)
!1210 = distinct !DILexicalBlock(scope: !1211, file: !252, line: 1415, column: 3)
!1211 = distinct !DILexicalBlock(scope: !979, file: !252, line: 1415, column: 3)
!1212 = !DILocation(line: 1415, column: 3, scope: !1210)
!1213 = !DILocation(line: 1415, column: 3, scope: !1214)
!1214 = distinct !DILexicalBlock(scope: !1215, file: !252, line: 1415, column: 3)
!1215 = distinct !DILexicalBlock(scope: !1209, file: !252, line: 1415, column: 3)
!1216 = !DILocation(line: 1415, column: 3, scope: !1215)
!1217 = !DILocation(line: 1415, column: 3, scope: !1218)
!1218 = distinct !DILexicalBlock(scope: !1219, file: !252, line: 1415, column: 3)
!1219 = distinct !DILexicalBlock(scope: !1214, file: !252, line: 1415, column: 3)
!1220 = !DILocation(line: 1415, column: 3, scope: !1219)
!1221 = !DILocation(line: 1415, column: 3, scope: !1222)
!1222 = distinct !DILexicalBlock(scope: !1218, file: !252, line: 1415, column: 3)
!1223 = !DILocation(line: 1415, column: 3, scope: !1224)
!1224 = distinct !DILexicalBlock(scope: !1214, file: !252, line: 1415, column: 3)
!1225 = !DILocation(line: 1415, column: 3, scope: !1226)
!1226 = distinct !DILexicalBlock(scope: !1224, file: !252, line: 1415, column: 3)
!1227 = !DILocation(line: 1415, column: 3, scope: !1228)
!1228 = distinct !DILexicalBlock(scope: !1229, file: !252, line: 1415, column: 3)
!1229 = distinct !DILexicalBlock(scope: !1226, file: !252, line: 1415, column: 3)
!1230 = !DILocation(line: 1415, column: 3, scope: !1229)
!1231 = !DILocation(line: 1415, column: 3, scope: !1232)
!1232 = distinct !DILexicalBlock(scope: !1228, file: !252, line: 1415, column: 3)
!1233 = !DILocation(line: 1416, column: 1, scope: !979)
!1234 = !DISubprogram(name: "PetscObjectGetComm", scope: !381, file: !381, line: 1458, type: !1235, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !379)
!1235 = !DISubroutineType(types: !1236)
!1236 = !{!51, !45, !1237}
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!1238 = !DISubprogram(name: "PetscViewerInitASCII_XML", scope: !1239, file: !1239, line: 4, type: !1240, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !379)
!1239 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/sys/logging/xmlviewer.h", directory: "/home/users/ndemeye/xSDK")
!1240 = !DISubroutineType(types: !1241)
!1241 = !{!51, !69}
!1242 = !DISubprogram(name: "PetscViewerASCIIPrintf", scope: !1243, file: !1243, line: 190, type: !1244, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !379)
!1243 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewer.h", directory: "/home/users/ndemeye/xSDK")
!1244 = !DISubroutineType(types: !1245)
!1245 = !{!61, !69, !41, null}
!1246 = !DISubprogram(name: "PetscViewerXMLStartSection", scope: !1239, file: !1239, line: 6, type: !1247, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !379)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{!51, !69, !41, !41}
!1249 = !DISubprogram(name: "MPI_Allreduce", scope: !34, file: !34, line: 1218, type: !1250, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !379)
!1250 = !DISubroutineType(types: !1251)
!1251 = !{!51, !1252, !37, !51, !243, !246, !35}
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64)
!1253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1254 = !DISubprogram(name: "MPI_Error_string", scope: !34, file: !34, line: 1357, type: !1255, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !379)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!51, !51, !127, !1257}
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!1258 = distinct !DISubprogram(name: "PetscPrintExeSpecs", scope: !252, file: !252, line: 450, type: !980, scopeLine: 451, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1259)
!1259 = !{!1260, !1261, !1262, !1266, !1267, !1268, !1272, !1273, !1274, !1275, !1276, !1277, !1279, !1282, !1283, !1285, !1287, !1289, !1291, !1293, !1295, !1297, !1299, !1301, !1303, !1305, !1307, !1309, !1311, !1315, !1317, !1321}
!1260 = !DILocalVariable(name: "viewer", arg: 1, scope: !1258, file: !252, line: 450, type: !67)
!1261 = !DILocalVariable(name: "ierr", scope: !1258, file: !252, line: 452, type: !61)
!1262 = !DILocalVariable(name: "arch", scope: !1258, file: !252, line: 453, type: !1263)
!1263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 1024, elements: !1264)
!1264 = !{!1265}
!1265 = !DISubrange(count: 128)
!1266 = !DILocalVariable(name: "hostname", scope: !1258, file: !252, line: 453, type: !1263)
!1267 = !DILocalVariable(name: "username", scope: !1258, file: !252, line: 453, type: !1263)
!1268 = !DILocalVariable(name: "pname", scope: !1258, file: !252, line: 453, type: !1269)
!1269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 32768, elements: !1270)
!1270 = !{!1271}
!1271 = !DISubrange(count: 4096)
!1272 = !DILocalVariable(name: "date", scope: !1258, file: !252, line: 453, type: !1263)
!1273 = !DILocalVariable(name: "version", scope: !1258, file: !252, line: 454, type: !1024)
!1274 = !DILocalVariable(name: "buildoptions", scope: !1258, file: !252, line: 454, type: !1263)
!1275 = !DILocalVariable(name: "size", scope: !1258, file: !252, line: 455, type: !117)
!1276 = !DILocalVariable(name: "len", scope: !1258, file: !252, line: 456, type: !38)
!1277 = !DILocalVariable(name: "_7_errorcode", scope: !1278, file: !252, line: 459, type: !61)
!1278 = distinct !DILexicalBlock(scope: !1258, file: !252, line: 459, column: 68)
!1279 = !DILocalVariable(name: "_7_errorstring", scope: !1280, file: !252, line: 459, type: !1024)
!1280 = distinct !DILexicalBlock(scope: !1281, file: !252, line: 459, column: 68)
!1281 = distinct !DILexicalBlock(scope: !1278, file: !252, line: 459, column: 68)
!1282 = !DILocalVariable(name: "_7_resultlen", scope: !1280, file: !252, line: 459, type: !117)
!1283 = !DILocalVariable(name: "ierr__", scope: !1284, file: !252, line: 460, type: !61)
!1284 = distinct !DILexicalBlock(scope: !1258, file: !252, line: 460, column: 46)
!1285 = !DILocalVariable(name: "ierr__", scope: !1286, file: !252, line: 461, type: !61)
!1286 = distinct !DILexicalBlock(scope: !1258, file: !252, line: 461, column: 54)
!1287 = !DILocalVariable(name: "ierr__", scope: !1288, file: !252, line: 462, type: !61)
!1288 = distinct !DILexicalBlock(scope: !1258, file: !252, line: 462, column: 54)
!1289 = !DILocalVariable(name: "ierr__", scope: !1290, file: !252, line: 463, type: !61)
!1290 = distinct !DILexicalBlock(scope: !1258, file: !252, line: 463, column: 51)
!1291 = !DILocalVariable(name: "ierr__", scope: !1292, file: !252, line: 464, type: !61)
!1292 = distinct !DILexicalBlock(scope: !1258, file: !252, line: 464, column: 42)
!1293 = !DILocalVariable(name: "ierr__", scope: !1294, file: !252, line: 465, type: !61)
!1294 = distinct !DILexicalBlock(scope: !1258, file: !252, line: 465, column: 51)
!1295 = !DILocalVariable(name: "ierr__", scope: !1296, file: !252, line: 467, type: !61)
!1296 = distinct !DILexicalBlock(scope: !1258, file: !252, line: 467, column: 86)
!1297 = !DILocalVariable(name: "ierr__", scope: !1298, file: !252, line: 468, type: !61)
!1298 = distinct !DILexicalBlock(scope: !1258, file: !252, line: 468, column: 85)
