; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/interface/itcreate.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/interface/itcreate.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._n_PetscFunctionList = type opaque
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!90 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !104, line: 70, baseType: !7, size: 32, elements: !105)
!104 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!105 = !{!106, !107, !108}
!106 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!107 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!108 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 451, baseType: !28, size: 32, elements: !110)
!110 = !{!111, !112, !113, !114, !115}
!111 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!112 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!113 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!114 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!115 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!116 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !117, line: 663, baseType: !7, size: 32, elements: !118)
!117 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!118 = !{!119, !120, !121}
!119 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!120 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!121 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!122 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !123)
!123 = !{!124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141}
!124 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!125 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!126 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!127 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!128 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!129 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!130 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!131 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!132 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!133 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!134 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!135 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!136 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!137 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!138 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!139 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!140 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!141 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!142 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !143, line: 624, baseType: !7, size: 32, elements: !144)
!143 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!144 = !{!145, !146, !147, !148}
!145 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!146 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!147 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!148 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!149 = !{!150, !153, !154, !189, !239, !28, !215, !229, !357, !360, !363, !364, !323, !365, !366, !367, !368, !7}
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !143, line: 330, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !143, line: 330, flags: DIFlagFwdDecl)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !157, line: 73, size: 4480, elements: !158)
!157 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!158 = !{!159, !161, !210, !211, !213, !216, !217, !218, !219, !227, !228, !230, !234, !238, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !251, !252, !253, !255, !256, !258, !260, !261, !262, !263, !264, !267, !269, !270, !271, !272, !273, !276, !278, !279, !280, !290, !292, !293, !297, !298, !347, !352, !354, !355, !356}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !156, file: !157, line: 74, baseType: !160, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !156, file: !157, line: 75, baseType: !162, size: 448, offset: 64)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 448, elements: !208)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !157, line: 53, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !157, line: 45, size: 448, elements: !165)
!165 = !{!166, !172, !180, !185, !192, !196, !203}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !164, file: !157, line: 46, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!170, !154, !171}
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !164, file: !157, line: 47, baseType: !173, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!170, !154, !176}
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !177, line: 16, baseType: !178)
!177 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !177, line: 16, flags: DIFlagFwdDecl)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !164, file: !157, line: 48, baseType: !181, size: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!170, !184}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !164, file: !157, line: 49, baseType: !186, size: 64, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!170, !154, !189, !154}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !191)
!191 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !164, file: !157, line: 50, baseType: !193, size: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{!170, !154, !189, !184}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !164, file: !157, line: 51, baseType: !197, size: 64, offset: 320)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!170, !154, !189, !200}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{null}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !164, file: !157, line: 52, baseType: !204, size: 64, offset: 384)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!170, !154, !189, !207}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!208 = !{!209}
!209 = !DISubrange(count: 1)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !156, file: !157, line: 76, baseType: !150, size: 64, offset: 512)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !156, file: !157, line: 77, baseType: !212, size: 32, offset: 576)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !156, file: !157, line: 78, baseType: !214, size: 64, offset: 640)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !215)
!215 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !156, file: !157, line: 78, baseType: !214, size: 64, offset: 704)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !156, file: !157, line: 78, baseType: !214, size: 64, offset: 768)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !156, file: !157, line: 78, baseType: !214, size: 64, offset: 832)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !156, file: !157, line: 79, baseType: !220, size: 64, offset: 896)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !223, line: 27, baseType: !224)
!223 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !225, line: 43, baseType: !226)
!225 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!226 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !156, file: !157, line: 80, baseType: !212, size: 32, offset: 960)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !156, file: !157, line: 81, baseType: !229, size: 32, offset: 992)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !156, file: !157, line: 82, baseType: !231, size: 64, offset: 1024)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !156, file: !157, line: 83, baseType: !235, size: 64, offset: 1088)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !156, file: !157, line: 84, baseType: !239, size: 64, offset: 1152)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !156, file: !157, line: 85, baseType: !239, size: 64, offset: 1216)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !156, file: !157, line: 86, baseType: !239, size: 64, offset: 1280)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !156, file: !157, line: 87, baseType: !239, size: 64, offset: 1344)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !156, file: !157, line: 88, baseType: !154, size: 64, offset: 1408)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !156, file: !157, line: 89, baseType: !220, size: 64, offset: 1472)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !156, file: !157, line: 90, baseType: !239, size: 64, offset: 1536)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !156, file: !157, line: 91, baseType: !239, size: 64, offset: 1600)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !156, file: !157, line: 92, baseType: !212, size: 32, offset: 1664)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !156, file: !157, line: 93, baseType: !153, size: 64, offset: 1728)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !156, file: !157, line: 94, baseType: !250, size: 64, offset: 1792)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !221)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !156, file: !157, line: 95, baseType: !212, size: 32, offset: 1856)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !156, file: !157, line: 95, baseType: !212, size: 32, offset: 1888)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !156, file: !157, line: 96, baseType: !254, size: 64, offset: 1920)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !156, file: !157, line: 96, baseType: !254, size: 64, offset: 1984)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !156, file: !157, line: 97, baseType: !257, size: 64, offset: 2048)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !156, file: !157, line: 97, baseType: !259, size: 64, offset: 2112)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !156, file: !157, line: 98, baseType: !212, size: 32, offset: 2176)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !156, file: !157, line: 98, baseType: !212, size: 32, offset: 2208)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !156, file: !157, line: 99, baseType: !254, size: 64, offset: 2240)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !156, file: !157, line: 99, baseType: !254, size: 64, offset: 2304)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !156, file: !157, line: 100, baseType: !265, size: 64, offset: 2368)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !215)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !156, file: !157, line: 100, baseType: !268, size: 64, offset: 2432)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !156, file: !157, line: 101, baseType: !212, size: 32, offset: 2496)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !156, file: !157, line: 101, baseType: !212, size: 32, offset: 2528)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !156, file: !157, line: 102, baseType: !254, size: 64, offset: 2560)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !156, file: !157, line: 102, baseType: !254, size: 64, offset: 2624)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !156, file: !157, line: 103, baseType: !274, size: 64, offset: 2688)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !266)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !156, file: !157, line: 103, baseType: !277, size: 64, offset: 2752)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !156, file: !157, line: 104, baseType: !207, size: 64, offset: 2816)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !156, file: !157, line: 105, baseType: !212, size: 32, offset: 2880)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !156, file: !157, line: 106, baseType: !281, size: 128, offset: 2944)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 128, elements: !288)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !157, line: 64, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !157, line: 61, size: 128, elements: !285)
!285 = !{!286, !287}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !284, file: !157, line: 62, baseType: !200, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !284, file: !157, line: 63, baseType: !153, size: 64, offset: 64)
!288 = !{!289}
!289 = !DISubrange(count: 2)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !156, file: !157, line: 107, baseType: !291, size: 64, offset: 3072)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 64, elements: !288)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !156, file: !157, line: 108, baseType: !153, size: 64, offset: 3136)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !156, file: !157, line: 109, baseType: !294, size: 64, offset: 3200)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!170, !153}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !156, file: !157, line: 111, baseType: !212, size: 32, offset: 3264)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !156, file: !157, line: 112, baseType: !299, size: 320, offset: 3328)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 320, elements: !345)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!170, !303, !154, !153}
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !306)
!306 = !{!307, !308, !333, !334, !335, !336, !337, !338, !339, !340, !341}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !305, file: !12, line: 100, baseType: !212, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !305, file: !12, line: 101, baseType: !309, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !312)
!312 = !{!313, !314, !315, !316, !317, !320, !321, !322, !326, !328, !330, !331, !332}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !311, file: !12, line: 84, baseType: !239, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !311, file: !12, line: 85, baseType: !239, size: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !311, file: !12, line: 86, baseType: !153, size: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !311, file: !12, line: 87, baseType: !231, size: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !311, file: !12, line: 88, baseType: !318, size: 64, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !189)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !311, file: !12, line: 89, baseType: !191, size: 8, offset: 320)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !311, file: !12, line: 90, baseType: !239, size: 64, offset: 384)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !311, file: !12, line: 91, baseType: !323, size: 64, offset: 448)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !324, line: 46, baseType: !325)
!324 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!325 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !311, file: !12, line: 92, baseType: !327, size: 32, offset: 512)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !311, file: !12, line: 93, baseType: !329, size: 32, offset: 544)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !311, file: !12, line: 94, baseType: !309, size: 64, offset: 576)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !311, file: !12, line: 95, baseType: !239, size: 64, offset: 640)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !311, file: !12, line: 96, baseType: !153, size: 64, offset: 704)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !305, file: !12, line: 102, baseType: !239, size: 64, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !305, file: !12, line: 102, baseType: !239, size: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !305, file: !12, line: 103, baseType: !239, size: 64, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !305, file: !12, line: 104, baseType: !150, size: 64, offset: 320)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !305, file: !12, line: 105, baseType: !327, size: 32, offset: 384)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !305, file: !12, line: 105, baseType: !327, size: 32, offset: 416)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !305, file: !12, line: 105, baseType: !327, size: 32, offset: 448)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !305, file: !12, line: 106, baseType: !154, size: 64, offset: 512)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !305, file: !12, line: 107, baseType: !342, size: 64, offset: 576)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!345 = !{!346}
!346 = !DISubrange(count: 5)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !156, file: !157, line: 113, baseType: !348, size: 320, offset: 3648)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 320, elements: !345)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{!170, !154, !153}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !156, file: !157, line: 114, baseType: !353, size: 320, offset: 3968)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 320, elements: !345)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !156, file: !157, line: 115, baseType: !327, size: 32, offset: 4288)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !156, file: !157, line: 120, baseType: !342, size: 64, offset: 4352)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !156, file: !157, line: 121, baseType: !327, size: 32, offset: 4416)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !143, line: 331, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !143, line: 331, flags: DIFlagFwdDecl)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !143, line: 338, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !143, line: 338, flags: DIFlagFwdDecl)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !35, line: 451, baseType: !109)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !27, line: 85, baseType: !26)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectDestroyFunction", file: !157, line: 130, baseType: !181)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectViewFunction", file: !157, line: 131, baseType: !173)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !369, line: 1451, baseType: !200)
!369 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!370 = !{!0, !371, !374, !376, !378, !380, !382, !384, !386, !388, !392, !394, !396, !398}
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "KSPRegisterAllCalled", scope: !2, file: !373, line: 16, type: !327, isLocal: false, isDefinition: true)
!373 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/interface/itcreate.c", directory: "/home/users/ndemeye/xSDK")
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "KSPMonitorList", scope: !2, file: !373, line: 21, type: !231, isLocal: false, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "KSPMonitorCreateList", scope: !2, file: !373, line: 22, type: !231, isLocal: false, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "KSPMonitorDestroyList", scope: !2, file: !373, line: 23, type: !231, isLocal: false, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "KSPMonitorRegisterAllCalled", scope: !2, file: !373, line: 24, type: !327, isLocal: false, isDefinition: true)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "KSP_CLASSID", scope: !2, file: !373, line: 7, type: !160, isLocal: false, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "DMKSP_CLASSID", scope: !2, file: !373, line: 8, type: !160, isLocal: false, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "KSPGUESS_CLASSID", scope: !2, file: !373, line: 9, type: !160, isLocal: false, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "KSP_GMRESOrthogonalization", scope: !2, file: !373, line: 10, type: !390, isLocal: false, isDefinition: true)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogEvent", file: !391, line: 80, baseType: !28)
!391 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "KSP_SetUp", scope: !2, file: !373, line: 10, type: !390, isLocal: false, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "KSP_Solve", scope: !2, file: !373, line: 10, type: !390, isLocal: false, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "KSP_SolveTranspose", scope: !2, file: !373, line: 10, type: !390, isLocal: false, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "KSP_MatSolve", scope: !2, file: !373, line: 10, type: !390, isLocal: false, isDefinition: true)
!400 = !{i32 7, !"Dwarf Version", i32 4}
!401 = !{i32 2, !"Debug Info Version", i32 3}
!402 = !{i32 1, !"wchar_size", i32 4}
!403 = !{i32 7, !"PIC Level", i32 2}
!404 = !{i32 7, !"uwtable", i32 1}
!405 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!406 = distinct !DISubprogram(name: "KSPLoad", scope: !373, file: !373, line: 52, type: !407, scopeLine: 53, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !650)
!407 = !DISubroutineType(types: !408)
!408 = !{!170, !409, !176}
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !35, line: 22, baseType: !410)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !104, line: 75, size: 12800, elements: !412)
!412 = !{!413, !415, !467, !472, !473, !474, !475, !505, !506, !507, !508, !509, !510, !515, !516, !517, !518, !519, !520, !521, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !544, !550, !551, !552, !553, !558, !559, !560, !561, !566, !567, !568, !569, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !621, !622, !623, !624, !625, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !647, !648, !649}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !411, file: !104, line: 76, baseType: !414, size: 4480)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !157, line: 122, baseType: !156)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !411, file: !104, line: 76, baseType: !416, size: 896, offset: 4480)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 896, elements: !208)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !104, line: 18, size: 896, elements: !418)
!418 = !{!419, !428, !432, !436, !444, !445, !449, !450, !454, !458, !462, !463, !465, !466}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !417, file: !104, line: 19, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!170, !409, !423, !427}
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !424, line: 21, baseType: !425)
!424 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !424, line: 21, flags: DIFlagFwdDecl)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !417, file: !104, line: 22, baseType: !429, size: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!170, !409, !423, !423, !427}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !417, file: !104, line: 25, baseType: !433, size: 64, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!170, !409}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !417, file: !104, line: 26, baseType: !437, size: 64, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!170, !409, !440, !440}
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !441, line: 16, baseType: !442)
!441 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !441, line: 16, flags: DIFlagFwdDecl)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !417, file: !104, line: 27, baseType: !433, size: 64, offset: 256)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !417, file: !104, line: 28, baseType: !446, size: 64, offset: 320)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!170, !303, !409}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !417, file: !104, line: 29, baseType: !433, size: 64, offset: 384)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !417, file: !104, line: 30, baseType: !451, size: 64, offset: 448)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!170, !409, !265, !265}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !417, file: !104, line: 31, baseType: !455, size: 64, offset: 512)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!170, !409, !212, !265, !265, !257}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !417, file: !104, line: 32, baseType: !459, size: 64, offset: 576)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!170, !409, !327, !327, !257, !427, !265, !265}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !417, file: !104, line: 33, baseType: !433, size: 64, offset: 640)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !417, file: !104, line: 34, baseType: !464, size: 64, offset: 704)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !417, file: !104, line: 35, baseType: !433, size: 64, offset: 768)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !417, file: !104, line: 36, baseType: !464, size: 64, offset: 832)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !411, file: !104, line: 77, baseType: !468, size: 64, offset: 5376)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !469, line: 14, baseType: !470)
!469 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !469, line: 14, flags: DIFlagFwdDecl)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !411, file: !104, line: 78, baseType: !327, size: 32, offset: 5440)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !411, file: !104, line: 79, baseType: !327, size: 32, offset: 5472)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !411, file: !104, line: 81, baseType: !212, size: 32, offset: 5504)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !411, file: !104, line: 82, baseType: !476, size: 64, offset: 5568)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !35, line: 752, baseType: !477)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !104, line: 54, size: 5184, elements: !479)
!479 = !{!480, !481, !501, !502, !503, !504}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !478, file: !104, line: 55, baseType: !414, size: 4480)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !478, file: !104, line: 55, baseType: !482, size: 448, offset: 4480)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !483, size: 448, elements: !208)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !104, line: 41, size: 448, elements: !484)
!484 = !{!485, !489, !490, !494, !495, !496, !500}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !483, file: !104, line: 42, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!170, !476, !423, !423}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !483, file: !104, line: 43, baseType: !486, size: 64, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !483, file: !104, line: 44, baseType: !491, size: 64, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!170, !476}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !483, file: !104, line: 45, baseType: !491, size: 64, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !483, file: !104, line: 46, baseType: !491, size: 64, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !483, file: !104, line: 47, baseType: !497, size: 64, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{!170, !476, !176}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !483, file: !104, line: 48, baseType: !491, size: 64, offset: 384)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !478, file: !104, line: 56, baseType: !409, size: 64, offset: 4928)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !478, file: !104, line: 57, baseType: !440, size: 64, offset: 4992)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !478, file: !104, line: 58, baseType: !250, size: 64, offset: 5056)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !478, file: !104, line: 59, baseType: !153, size: 64, offset: 5120)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !411, file: !104, line: 83, baseType: !327, size: 32, offset: 5632)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !411, file: !104, line: 84, baseType: !327, size: 32, offset: 5664)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !411, file: !104, line: 85, baseType: !327, size: 32, offset: 5696)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !411, file: !104, line: 86, baseType: !327, size: 32, offset: 5728)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !411, file: !104, line: 87, baseType: !364, size: 32, offset: 5760)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !411, file: !104, line: 88, baseType: !511, size: 384, offset: 5792)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 384, elements: !512)
!512 = !{!513, !514}
!513 = !DISubrange(count: 4)
!514 = !DISubrange(count: 3)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !411, file: !104, line: 89, baseType: !266, size: 64, offset: 6208)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !411, file: !104, line: 90, baseType: !266, size: 64, offset: 6272)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !411, file: !104, line: 91, baseType: !266, size: 64, offset: 6336)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !411, file: !104, line: 92, baseType: !266, size: 64, offset: 6400)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !411, file: !104, line: 93, baseType: !266, size: 64, offset: 6464)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !411, file: !104, line: 94, baseType: !266, size: 64, offset: 6528)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !411, file: !104, line: 95, baseType: !522, size: 32, offset: 6592)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !35, line: 540, baseType: !34)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !411, file: !104, line: 96, baseType: !327, size: 32, offset: 6624)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !411, file: !104, line: 98, baseType: !423, size: 64, offset: 6656)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !411, file: !104, line: 98, baseType: !423, size: 64, offset: 6720)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !411, file: !104, line: 102, baseType: !265, size: 64, offset: 6784)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !411, file: !104, line: 103, baseType: !265, size: 64, offset: 6848)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !411, file: !104, line: 104, baseType: !212, size: 32, offset: 6912)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !411, file: !104, line: 105, baseType: !212, size: 32, offset: 6944)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !411, file: !104, line: 106, baseType: !327, size: 32, offset: 6976)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !411, file: !104, line: 107, baseType: !265, size: 64, offset: 7040)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !411, file: !104, line: 108, baseType: !265, size: 64, offset: 7104)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !411, file: !104, line: 109, baseType: !212, size: 32, offset: 7168)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !411, file: !104, line: 110, baseType: !212, size: 32, offset: 7200)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !411, file: !104, line: 111, baseType: !327, size: 32, offset: 7232)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !411, file: !104, line: 113, baseType: !212, size: 32, offset: 7264)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !411, file: !104, line: 114, baseType: !327, size: 32, offset: 7296)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !411, file: !104, line: 117, baseType: !212, size: 32, offset: 7328)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !411, file: !104, line: 120, baseType: !540, size: 320, offset: 7360)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !541, size: 320, elements: !345)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!170, !409, !212, !266, !153}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !411, file: !104, line: 121, baseType: !545, size: 320, offset: 7680)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 320, elements: !345)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{!170, !549}
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !411, file: !104, line: 122, baseType: !353, size: 320, offset: 8000)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !411, file: !104, line: 123, baseType: !212, size: 32, offset: 8320)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !411, file: !104, line: 124, baseType: !327, size: 32, offset: 8352)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !411, file: !104, line: 126, baseType: !554, size: 320, offset: 8384)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 320, elements: !345)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!170, !409, !153}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !411, file: !104, line: 127, baseType: !545, size: 320, offset: 8704)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !411, file: !104, line: 128, baseType: !353, size: 320, offset: 9024)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !411, file: !104, line: 129, baseType: !212, size: 32, offset: 9344)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !411, file: !104, line: 131, baseType: !562, size: 64, offset: 9408)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!170, !409, !212, !266, !565, !153}
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !411, file: !104, line: 132, baseType: !294, size: 64, offset: 9472)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !411, file: !104, line: 133, baseType: !153, size: 64, offset: 9536)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !411, file: !104, line: 135, baseType: !153, size: 64, offset: 9600)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !411, file: !104, line: 137, baseType: !570, size: 64, offset: 9664)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !27, line: 11, baseType: !571)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !27, line: 11, flags: DIFlagFwdDecl)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !411, file: !104, line: 139, baseType: !153, size: 64, offset: 9728)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !411, file: !104, line: 142, baseType: !327, size: 32, offset: 9792)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !411, file: !104, line: 142, baseType: !327, size: 32, offset: 9824)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !411, file: !104, line: 142, baseType: !327, size: 32, offset: 9856)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !411, file: !104, line: 142, baseType: !327, size: 32, offset: 9888)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !411, file: !104, line: 142, baseType: !327, size: 32, offset: 9920)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !411, file: !104, line: 142, baseType: !327, size: 32, offset: 9952)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !411, file: !104, line: 142, baseType: !327, size: 32, offset: 9984)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !411, file: !104, line: 142, baseType: !327, size: 32, offset: 10016)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !411, file: !104, line: 142, baseType: !327, size: 32, offset: 10048)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !411, file: !104, line: 142, baseType: !327, size: 32, offset: 10080)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !411, file: !104, line: 142, baseType: !327, size: 32, offset: 10112)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !411, file: !104, line: 142, baseType: !327, size: 32, offset: 10144)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !411, file: !104, line: 142, baseType: !327, size: 32, offset: 10176)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !411, file: !104, line: 142, baseType: !327, size: 32, offset: 10208)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !411, file: !104, line: 143, baseType: !176, size: 64, offset: 10240)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !411, file: !104, line: 143, baseType: !176, size: 64, offset: 10304)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !411, file: !104, line: 143, baseType: !176, size: 64, offset: 10368)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !411, file: !104, line: 143, baseType: !176, size: 64, offset: 10432)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !411, file: !104, line: 143, baseType: !176, size: 64, offset: 10496)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !411, file: !104, line: 143, baseType: !176, size: 64, offset: 10560)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !411, file: !104, line: 143, baseType: !176, size: 64, offset: 10624)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !411, file: !104, line: 143, baseType: !176, size: 64, offset: 10688)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !411, file: !104, line: 143, baseType: !176, size: 64, offset: 10752)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !411, file: !104, line: 143, baseType: !176, size: 64, offset: 10816)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !411, file: !104, line: 143, baseType: !176, size: 64, offset: 10880)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !411, file: !104, line: 143, baseType: !176, size: 64, offset: 10944)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !411, file: !104, line: 143, baseType: !176, size: 64, offset: 11008)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !411, file: !104, line: 143, baseType: !176, size: 64, offset: 11072)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !411, file: !104, line: 144, baseType: !603, size: 32, offset: 11136)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !59, line: 162, baseType: !58)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !411, file: !104, line: 144, baseType: !603, size: 32, offset: 11168)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !411, file: !104, line: 144, baseType: !603, size: 32, offset: 11200)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !411, file: !104, line: 144, baseType: !603, size: 32, offset: 11232)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !411, file: !104, line: 144, baseType: !603, size: 32, offset: 11264)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !411, file: !104, line: 144, baseType: !603, size: 32, offset: 11296)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !411, file: !104, line: 144, baseType: !603, size: 32, offset: 11328)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !411, file: !104, line: 144, baseType: !603, size: 32, offset: 11360)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !411, file: !104, line: 144, baseType: !603, size: 32, offset: 11392)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !411, file: !104, line: 144, baseType: !603, size: 32, offset: 11424)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !411, file: !104, line: 144, baseType: !603, size: 32, offset: 11456)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !411, file: !104, line: 144, baseType: !603, size: 32, offset: 11488)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !411, file: !104, line: 144, baseType: !603, size: 32, offset: 11520)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !411, file: !104, line: 144, baseType: !603, size: 32, offset: 11552)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !411, file: !104, line: 147, baseType: !212, size: 32, offset: 11584)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !411, file: !104, line: 148, baseType: !427, size: 64, offset: 11648)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !411, file: !104, line: 150, baseType: !620, size: 32, offset: 11712)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !104, line: 70, baseType: !103)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !411, file: !104, line: 151, baseType: !327, size: 32, offset: 11744)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !411, file: !104, line: 153, baseType: !212, size: 32, offset: 11776)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !411, file: !104, line: 154, baseType: !212, size: 32, offset: 11808)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !411, file: !104, line: 156, baseType: !327, size: 32, offset: 11840)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !411, file: !104, line: 161, baseType: !626, size: 192, offset: 11904)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !411, file: !104, line: 157, size: 192, elements: !627)
!627 = !{!628, !629, !630, !631}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !626, file: !104, line: 158, baseType: !440, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !626, file: !104, line: 158, baseType: !440, size: 64, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !626, file: !104, line: 159, baseType: !327, size: 32, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !626, file: !104, line: 160, baseType: !327, size: 32, offset: 160)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !411, file: !104, line: 163, baseType: !363, size: 32, offset: 12096)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !411, file: !104, line: 165, baseType: !364, size: 32, offset: 12128)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !411, file: !104, line: 166, baseType: !363, size: 32, offset: 12160)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !411, file: !104, line: 171, baseType: !327, size: 32, offset: 12192)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !411, file: !104, line: 172, baseType: !327, size: 32, offset: 12224)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !411, file: !104, line: 173, baseType: !327, size: 32, offset: 12256)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !411, file: !104, line: 174, baseType: !423, size: 64, offset: 12288)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !411, file: !104, line: 175, baseType: !423, size: 64, offset: 12352)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !411, file: !104, line: 177, baseType: !212, size: 32, offset: 12416)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !411, file: !104, line: 178, baseType: !327, size: 32, offset: 12448)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !411, file: !104, line: 180, baseType: !176, size: 64, offset: 12480)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !411, file: !104, line: 182, baseType: !644, size: 64, offset: 12544)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!170, !409, !423, !423, !153}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !411, file: !104, line: 183, baseType: !644, size: 64, offset: 12608)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !411, file: !104, line: 184, baseType: !153, size: 64, offset: 12672)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !411, file: !104, line: 184, baseType: !153, size: 64, offset: 12736)
!650 = !{!651, !652, !653, !654, !655, !656, !660, !661, !663, !665, !667, !669, !673, !675}
!651 = !DILocalVariable(name: "newdm", arg: 1, scope: !406, file: !373, line: 52, type: !409)
!652 = !DILocalVariable(name: "viewer", arg: 2, scope: !406, file: !373, line: 52, type: !176)
!653 = !DILocalVariable(name: "ierr", scope: !406, file: !373, line: 54, type: !170)
!654 = !DILocalVariable(name: "isbinary", scope: !406, file: !373, line: 55, type: !327)
!655 = !DILocalVariable(name: "classid", scope: !406, file: !373, line: 56, type: !212)
!656 = !DILocalVariable(name: "type", scope: !406, file: !373, line: 57, type: !657)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 2048, elements: !658)
!658 = !{!659}
!659 = !DISubrange(count: 256)
!660 = !DILocalVariable(name: "pc", scope: !406, file: !373, line: 58, type: !570)
!661 = !DILocalVariable(name: "ierr__", scope: !662, file: !373, line: 63, type: !170)
!662 = distinct !DILexicalBlock(scope: !406, file: !373, line: 63, column: 82)
!663 = !DILocalVariable(name: "ierr__", scope: !664, file: !373, line: 66, type: !170)
!664 = distinct !DILexicalBlock(scope: !406, file: !373, line: 66, column: 66)
!665 = !DILocalVariable(name: "ierr__", scope: !666, file: !373, line: 68, type: !170)
!666 = distinct !DILexicalBlock(scope: !406, file: !373, line: 68, column: 65)
!667 = !DILocalVariable(name: "ierr__", scope: !668, file: !373, line: 69, type: !170)
!668 = distinct !DILexicalBlock(scope: !406, file: !373, line: 69, column: 34)
!669 = !DILocalVariable(name: "ierr__", scope: !670, file: !373, line: 71, type: !170)
!670 = distinct !DILexicalBlock(scope: !671, file: !373, line: 71, column: 46)
!671 = distinct !DILexicalBlock(scope: !672, file: !373, line: 70, column: 25)
!672 = distinct !DILexicalBlock(scope: !406, file: !373, line: 70, column: 7)
!673 = !DILocalVariable(name: "ierr__", scope: !674, file: !373, line: 73, type: !170)
!674 = distinct !DILexicalBlock(scope: !406, file: !373, line: 73, column: 30)
!675 = !DILocalVariable(name: "ierr__", scope: !676, file: !373, line: 74, type: !170)
!676 = distinct !DILexicalBlock(scope: !406, file: !373, line: 74, column: 28)
!677 = !DILocation(line: 0, scope: !406)
!678 = !DILocation(line: 55, column: 3, scope: !406)
!679 = !DILocation(line: 56, column: 3, scope: !406)
!680 = !DILocation(line: 57, column: 3, scope: !406)
!681 = !DILocation(line: 57, column: 18, scope: !406)
!682 = !DILocation(line: 58, column: 3, scope: !406)
!683 = !DILocation(line: 60, column: 3, scope: !684)
!684 = distinct !DILexicalBlock(scope: !685, file: !373, line: 60, column: 3)
!685 = distinct !DILexicalBlock(scope: !686, file: !373, line: 60, column: 3)
!686 = distinct !DILexicalBlock(scope: !406, file: !373, line: 60, column: 3)
!687 = !{!688, !688, i64 0}
!688 = !{!"any pointer", !689, i64 0}
!689 = !{!"omnipotent char", !690, i64 0}
!690 = !{!"Simple C/C++ TBAA"}
!691 = !DILocation(line: 60, column: 3, scope: !685)
!692 = !DILocation(line: 60, column: 3, scope: !693)
!693 = distinct !DILexicalBlock(scope: !694, file: !373, line: 60, column: 3)
!694 = distinct !DILexicalBlock(scope: !684, file: !373, line: 60, column: 3)
!695 = !{!696, !697, i64 1536}
!696 = !{!"", !689, i64 0, !689, i64 512, !689, i64 1024, !689, i64 1280, !697, i64 1536, !697, i64 1540, !689, i64 1544}
!697 = !{!"int", !689, i64 0}
!698 = !DILocation(line: 60, column: 3, scope: !694)
!699 = !DILocation(line: 60, column: 3, scope: !700)
!700 = distinct !DILexicalBlock(scope: !693, file: !373, line: 60, column: 3)
!701 = !{!697, !697, i64 0}
!702 = !{!696, !697, i64 1540}
!703 = !DILocation(line: 61, column: 3, scope: !704)
!704 = distinct !DILexicalBlock(scope: !705, file: !373, line: 61, column: 3)
!705 = distinct !DILexicalBlock(scope: !406, file: !373, line: 61, column: 3)
!706 = !DILocation(line: 61, column: 3, scope: !705)
!707 = !DILocation(line: 61, column: 3, scope: !708)
!708 = distinct !DILexicalBlock(scope: !705, file: !373, line: 61, column: 3)
!709 = !DILocation(line: 61, column: 3, scope: !710)
!710 = distinct !DILexicalBlock(scope: !705, file: !373, line: 61, column: 3)
!711 = !{!712, !697, i64 0}
!712 = !{!"_p_PetscObject", !697, i64 0, !689, i64 8, !688, i64 64, !697, i64 72, !713, i64 80, !713, i64 88, !713, i64 96, !713, i64 104, !714, i64 112, !697, i64 120, !697, i64 124, !688, i64 128, !688, i64 136, !688, i64 144, !688, i64 152, !688, i64 160, !688, i64 168, !688, i64 176, !714, i64 184, !688, i64 192, !688, i64 200, !697, i64 208, !688, i64 216, !714, i64 224, !697, i64 232, !697, i64 236, !688, i64 240, !688, i64 248, !688, i64 256, !688, i64 264, !697, i64 272, !697, i64 276, !688, i64 280, !688, i64 288, !688, i64 296, !688, i64 304, !697, i64 312, !697, i64 316, !688, i64 320, !688, i64 328, !688, i64 336, !688, i64 344, !688, i64 352, !697, i64 360, !689, i64 368, !689, i64 384, !688, i64 392, !688, i64 400, !697, i64 408, !689, i64 416, !689, i64 456, !689, i64 496, !689, i64 536, !688, i64 544, !689, i64 552}
!713 = !{!"double", !689, i64 0}
!714 = !{!"long", !689, i64 0}
!715 = !DILocation(line: 61, column: 3, scope: !716)
!716 = distinct !DILexicalBlock(scope: !717, file: !373, line: 61, column: 3)
!717 = distinct !DILexicalBlock(scope: !710, file: !373, line: 61, column: 3)
!718 = !DILocation(line: 61, column: 3, scope: !717)
!719 = !DILocation(line: 62, column: 3, scope: !720)
!720 = distinct !DILexicalBlock(scope: !721, file: !373, line: 62, column: 3)
!721 = distinct !DILexicalBlock(scope: !406, file: !373, line: 62, column: 3)
!722 = !DILocation(line: 62, column: 3, scope: !721)
!723 = !DILocation(line: 62, column: 3, scope: !724)
!724 = distinct !DILexicalBlock(scope: !721, file: !373, line: 62, column: 3)
!725 = !DILocation(line: 62, column: 3, scope: !726)
!726 = distinct !DILexicalBlock(scope: !721, file: !373, line: 62, column: 3)
!727 = !DILocation(line: 62, column: 3, scope: !728)
!728 = distinct !DILexicalBlock(scope: !729, file: !373, line: 62, column: 3)
!729 = distinct !DILexicalBlock(scope: !726, file: !373, line: 62, column: 3)
!730 = !DILocation(line: 62, column: 3, scope: !729)
!731 = !DILocation(line: 63, column: 10, scope: !406)
!732 = !DILocation(line: 0, scope: !662)
!733 = !DILocation(line: 63, column: 82, scope: !734)
!734 = distinct !DILexicalBlock(scope: !662, file: !373, line: 63, column: 82)
!735 = !DILocation(line: 63, column: 82, scope: !662)
!736 = !{!"branch_weights", i32 2000, i32 1}
!737 = !DILocation(line: 64, column: 8, scope: !738)
!738 = distinct !DILexicalBlock(scope: !406, file: !373, line: 64, column: 7)
!739 = !{!689, !689, i64 0}
!740 = !DILocation(line: 64, column: 7, scope: !406)
!741 = !DILocation(line: 64, column: 18, scope: !738)
!742 = !DILocation(line: 66, column: 10, scope: !406)
!743 = !DILocation(line: 0, scope: !664)
!744 = !DILocation(line: 66, column: 66, scope: !745)
!745 = distinct !DILexicalBlock(scope: !664, file: !373, line: 66, column: 66)
!746 = !DILocation(line: 66, column: 66, scope: !664)
!747 = !DILocation(line: 67, column: 7, scope: !748)
!748 = distinct !DILexicalBlock(scope: !406, file: !373, line: 67, column: 7)
!749 = !DILocation(line: 67, column: 15, scope: !748)
!750 = !DILocation(line: 67, column: 7, scope: !406)
!751 = !DILocation(line: 67, column: 36, scope: !748)
!752 = !DILocation(line: 68, column: 10, scope: !406)
!753 = !DILocation(line: 0, scope: !666)
!754 = !DILocation(line: 68, column: 65, scope: !755)
!755 = distinct !DILexicalBlock(scope: !666, file: !373, line: 68, column: 65)
!756 = !DILocation(line: 68, column: 65, scope: !666)
!757 = !DILocation(line: 69, column: 10, scope: !406)
!758 = !DILocation(line: 0, scope: !668)
!759 = !DILocation(line: 69, column: 34, scope: !760)
!760 = distinct !DILexicalBlock(scope: !668, file: !373, line: 69, column: 34)
!761 = !DILocation(line: 69, column: 34, scope: !668)
!762 = !DILocation(line: 70, column: 19, scope: !672)
!763 = !{!764, !688, i64 104}
!764 = !{!"_KSPOps", !688, i64 0, !688, i64 8, !688, i64 16, !688, i64 24, !688, i64 32, !688, i64 40, !688, i64 48, !688, i64 56, !688, i64 64, !688, i64 72, !688, i64 80, !688, i64 88, !688, i64 96, !688, i64 104}
!765 = !DILocation(line: 70, column: 7, scope: !672)
!766 = !DILocation(line: 70, column: 7, scope: !406)
!767 = !DILocation(line: 71, column: 12, scope: !671)
!768 = !DILocation(line: 0, scope: !670)
!769 = !DILocation(line: 71, column: 46, scope: !770)
!770 = distinct !DILexicalBlock(scope: !670, file: !373, line: 71, column: 46)
!771 = !DILocation(line: 71, column: 46, scope: !670)
!772 = !DILocation(line: 73, column: 10, scope: !406)
!773 = !DILocation(line: 0, scope: !674)
!774 = !DILocation(line: 73, column: 30, scope: !775)
!775 = distinct !DILexicalBlock(scope: !674, file: !373, line: 73, column: 30)
!776 = !DILocation(line: 73, column: 30, scope: !674)
!777 = !DILocation(line: 74, column: 17, scope: !406)
!778 = !DILocation(line: 74, column: 10, scope: !406)
!779 = !DILocation(line: 0, scope: !676)
!780 = !DILocation(line: 74, column: 28, scope: !781)
!781 = distinct !DILexicalBlock(scope: !676, file: !373, line: 74, column: 28)
!782 = !DILocation(line: 74, column: 28, scope: !676)
!783 = !DILocation(line: 75, column: 3, scope: !784)
!784 = distinct !DILexicalBlock(scope: !785, file: !373, line: 75, column: 3)
!785 = distinct !DILexicalBlock(scope: !786, file: !373, line: 75, column: 3)
!786 = distinct !DILexicalBlock(scope: !406, file: !373, line: 75, column: 3)
!787 = !DILocation(line: 75, column: 3, scope: !785)
!788 = !DILocation(line: 75, column: 3, scope: !789)
!789 = distinct !DILexicalBlock(scope: !790, file: !373, line: 75, column: 3)
!790 = distinct !DILexicalBlock(scope: !784, file: !373, line: 75, column: 3)
!791 = !DILocation(line: 75, column: 3, scope: !790)
!792 = !DILocation(line: 75, column: 3, scope: !793)
!793 = distinct !DILexicalBlock(scope: !794, file: !373, line: 75, column: 3)
!794 = distinct !DILexicalBlock(scope: !789, file: !373, line: 75, column: 3)
!795 = !{!696, !689, i64 1544}
!796 = !DILocation(line: 75, column: 3, scope: !794)
!797 = !DILocation(line: 75, column: 3, scope: !798)
!798 = distinct !DILexicalBlock(scope: !793, file: !373, line: 75, column: 3)
!799 = !DILocation(line: 75, column: 3, scope: !800)
!800 = distinct !DILexicalBlock(scope: !789, file: !373, line: 75, column: 3)
!801 = !DILocation(line: 75, column: 3, scope: !802)
!802 = distinct !DILexicalBlock(scope: !800, file: !373, line: 75, column: 3)
!803 = !DILocation(line: 75, column: 3, scope: !804)
!804 = distinct !DILexicalBlock(scope: !805, file: !373, line: 75, column: 3)
!805 = distinct !DILexicalBlock(scope: !802, file: !373, line: 75, column: 3)
!806 = !DILocation(line: 75, column: 3, scope: !805)
!807 = !DILocation(line: 75, column: 3, scope: !808)
!808 = distinct !DILexicalBlock(scope: !804, file: !373, line: 75, column: 3)
!809 = !DILocation(line: 76, column: 1, scope: !406)
!810 = !DISubprogram(name: "PetscError", scope: !117, file: !117, line: 668, type: !811, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !813)
!811 = !DISubroutineType(types: !812)
!812 = !{!170, !151, !28, !189, !189, !28, !116, !189, null}
!813 = !{}
!814 = !DISubprogram(name: "PetscCheckPointer", scope: !157, file: !157, line: 183, type: !815, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !813)
!815 = !DISubroutineType(types: !816)
!816 = !{!5, !817, !122}
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!819 = !DISubprogram(name: "PetscObjectTypeCompare", scope: !369, file: !369, line: 1505, type: !820, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !813)
!820 = !DISubroutineType(types: !821)
!821 = !{!28, !155, !189, !822}
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!823 = !DISubprogram(name: "PetscViewerBinaryRead", scope: !59, file: !59, line: 204, type: !824, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !813)
!824 = !DISubroutineType(types: !825)
!825 = !{!28, !178, !153, !28, !826, !122}
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!827 = !DISubprogram(name: "PetscObjectComm", scope: !369, file: !369, line: 2649, type: !828, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !813)
!828 = !DISubroutineType(types: !829)
!829 = !{!151, !155}
!830 = distinct !DISubprogram(name: "KSPSetType", scope: !373, file: !373, line: 787, type: !831, scopeLine: 788, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !834)
!831 = !DISubroutineType(types: !832)
!832 = !{!170, !409, !833}
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPType", file: !35, line: 31, baseType: !189)
!834 = !{!835, !836, !837, !838, !839, !840, !842, !844, !848, !850, !852, !854}
!835 = !DILocalVariable(name: "ksp", arg: 1, scope: !830, file: !373, line: 787, type: !409)
!836 = !DILocalVariable(name: "type", arg: 2, scope: !830, file: !373, line: 787, type: !833)
!837 = !DILocalVariable(name: "ierr", scope: !830, file: !373, line: 789, type: !170)
!838 = !DILocalVariable(name: "r", scope: !830, file: !373, line: 789, type: !433)
!839 = !DILocalVariable(name: "match", scope: !830, file: !373, line: 790, type: !327)
!840 = !DILocalVariable(name: "ierr__", scope: !841, file: !373, line: 796, type: !170)
!841 = distinct !DILexicalBlock(scope: !830, file: !373, line: 796, column: 63)
!842 = !DILocalVariable(name: "ierr__", scope: !843, file: !373, line: 799, type: !170)
!843 = distinct !DILexicalBlock(scope: !830, file: !373, line: 799, column: 49)
!844 = !DILocalVariable(name: "ierr__", scope: !845, file: !373, line: 803, type: !170)
!845 = distinct !DILexicalBlock(scope: !846, file: !373, line: 803, column: 51)
!846 = distinct !DILexicalBlock(scope: !847, file: !373, line: 802, column: 26)
!847 = distinct !DILexicalBlock(scope: !830, file: !373, line: 802, column: 7)
!848 = !DILocalVariable(name: "ierr__", scope: !849, file: !373, line: 807, type: !170)
!849 = distinct !DILexicalBlock(scope: !830, file: !373, line: 807, column: 75)
!850 = !DILocalVariable(name: "ierr__", scope: !851, file: !373, line: 810, type: !170)
!851 = distinct !DILexicalBlock(scope: !830, file: !373, line: 810, column: 67)
!852 = !DILocalVariable(name: "ierr__", scope: !853, file: !373, line: 814, type: !170)
!853 = distinct !DILexicalBlock(scope: !830, file: !373, line: 814, column: 31)
!854 = !DILocalVariable(name: "ierr__", scope: !855, file: !373, line: 815, type: !170)
!855 = distinct !DILexicalBlock(scope: !830, file: !373, line: 815, column: 70)
!856 = !DILocation(line: 0, scope: !830)
!857 = !DILocation(line: 789, column: 3, scope: !830)
!858 = !DILocation(line: 790, column: 3, scope: !830)
!859 = !DILocation(line: 792, column: 3, scope: !860)
!860 = distinct !DILexicalBlock(scope: !861, file: !373, line: 792, column: 3)
!861 = distinct !DILexicalBlock(scope: !862, file: !373, line: 792, column: 3)
!862 = distinct !DILexicalBlock(scope: !830, file: !373, line: 792, column: 3)
!863 = !DILocation(line: 792, column: 3, scope: !861)
!864 = !DILocation(line: 792, column: 3, scope: !865)
!865 = distinct !DILexicalBlock(scope: !866, file: !373, line: 792, column: 3)
!866 = distinct !DILexicalBlock(scope: !860, file: !373, line: 792, column: 3)
!867 = !DILocation(line: 792, column: 3, scope: !866)
!868 = !DILocation(line: 792, column: 3, scope: !869)
!869 = distinct !DILexicalBlock(scope: !865, file: !373, line: 792, column: 3)
!870 = !DILocation(line: 793, column: 3, scope: !871)
!871 = distinct !DILexicalBlock(scope: !872, file: !373, line: 793, column: 3)
!872 = distinct !DILexicalBlock(scope: !830, file: !373, line: 793, column: 3)
!873 = !DILocation(line: 793, column: 3, scope: !872)
!874 = !DILocation(line: 793, column: 3, scope: !875)
!875 = distinct !DILexicalBlock(scope: !872, file: !373, line: 793, column: 3)
!876 = !DILocation(line: 793, column: 3, scope: !877)
!877 = distinct !DILexicalBlock(scope: !872, file: !373, line: 793, column: 3)
!878 = !DILocation(line: 793, column: 3, scope: !879)
!879 = distinct !DILexicalBlock(scope: !880, file: !373, line: 793, column: 3)
!880 = distinct !DILexicalBlock(scope: !877, file: !373, line: 793, column: 3)
!881 = !DILocation(line: 793, column: 3, scope: !880)
!882 = !DILocation(line: 794, column: 3, scope: !883)
!883 = distinct !DILexicalBlock(scope: !884, file: !373, line: 794, column: 3)
!884 = distinct !DILexicalBlock(scope: !830, file: !373, line: 794, column: 3)
!885 = !DILocation(line: 794, column: 3, scope: !884)
!886 = !DILocation(line: 794, column: 3, scope: !887)
!887 = distinct !DILexicalBlock(scope: !884, file: !373, line: 794, column: 3)
!888 = !DILocation(line: 796, column: 10, scope: !830)
!889 = !DILocation(line: 0, scope: !841)
!890 = !DILocation(line: 796, column: 63, scope: !891)
!891 = distinct !DILexicalBlock(scope: !841, file: !373, line: 796, column: 63)
!892 = !DILocation(line: 796, column: 63, scope: !841)
!893 = !DILocation(line: 797, column: 7, scope: !894)
!894 = distinct !DILexicalBlock(scope: !830, file: !373, line: 797, column: 7)
!895 = !DILocation(line: 797, column: 7, scope: !830)
!896 = !DILocation(line: 797, column: 14, scope: !897)
!897 = distinct !DILexicalBlock(scope: !898, file: !373, line: 797, column: 14)
!898 = distinct !DILexicalBlock(scope: !899, file: !373, line: 797, column: 14)
!899 = distinct !DILexicalBlock(scope: !894, file: !373, line: 797, column: 14)
!900 = !DILocation(line: 797, column: 14, scope: !898)
!901 = !DILocation(line: 797, column: 14, scope: !902)
!902 = distinct !DILexicalBlock(scope: !903, file: !373, line: 797, column: 14)
!903 = distinct !DILexicalBlock(scope: !897, file: !373, line: 797, column: 14)
!904 = !DILocation(line: 797, column: 14, scope: !903)
!905 = !DILocation(line: 797, column: 14, scope: !906)
!906 = distinct !DILexicalBlock(scope: !907, file: !373, line: 797, column: 14)
!907 = distinct !DILexicalBlock(scope: !902, file: !373, line: 797, column: 14)
!908 = !DILocation(line: 797, column: 14, scope: !907)
!909 = !DILocation(line: 797, column: 14, scope: !910)
!910 = distinct !DILexicalBlock(scope: !906, file: !373, line: 797, column: 14)
!911 = !DILocation(line: 797, column: 14, scope: !912)
!912 = distinct !DILexicalBlock(scope: !902, file: !373, line: 797, column: 14)
!913 = !DILocation(line: 797, column: 14, scope: !914)
!914 = distinct !DILexicalBlock(scope: !912, file: !373, line: 797, column: 14)
!915 = !DILocation(line: 797, column: 14, scope: !916)
!916 = distinct !DILexicalBlock(scope: !917, file: !373, line: 797, column: 14)
!917 = distinct !DILexicalBlock(scope: !914, file: !373, line: 797, column: 14)
!918 = !DILocation(line: 797, column: 14, scope: !917)
!919 = !DILocation(line: 797, column: 14, scope: !920)
!920 = distinct !DILexicalBlock(scope: !916, file: !373, line: 797, column: 14)
!921 = !DILocation(line: 799, column: 10, scope: !830)
!922 = !DILocation(line: 0, scope: !843)
!923 = !DILocation(line: 799, column: 49, scope: !924)
!924 = distinct !DILexicalBlock(scope: !843, file: !373, line: 799, column: 49)
!925 = !DILocation(line: 799, column: 49, scope: !843)
!926 = !DILocation(line: 800, column: 8, scope: !927)
!927 = distinct !DILexicalBlock(scope: !830, file: !373, line: 800, column: 7)
!928 = !DILocation(line: 800, column: 7, scope: !830)
!929 = !DILocation(line: 800, column: 11, scope: !927)
!930 = !DILocation(line: 802, column: 17, scope: !847)
!931 = !{!764, !688, i64 80}
!932 = !DILocation(line: 802, column: 7, scope: !847)
!933 = !DILocation(line: 802, column: 7, scope: !830)
!934 = !DILocation(line: 803, column: 25, scope: !846)
!935 = !DILocation(line: 0, scope: !845)
!936 = !DILocation(line: 803, column: 51, scope: !937)
!937 = distinct !DILexicalBlock(scope: !845, file: !373, line: 803, column: 51)
!938 = !DILocation(line: 803, column: 51, scope: !845)
!939 = !DILocalVariable(name: "a", arg: 1, scope: !940, file: !369, line: 1856, type: !153)
!940 = distinct !DISubprogram(name: "PetscMemzero", scope: !369, file: !369, line: 1856, type: !941, scopeLine: 1857, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !943)
!941 = !DISubroutineType(types: !942)
!942 = !{!170, !153, !323}
!943 = !{!939, !944}
!944 = !DILocalVariable(name: "n", arg: 2, scope: !940, file: !369, line: 1856, type: !323)
!945 = !DILocation(line: 0, scope: !940, inlinedAt: !946)
!946 = distinct !DILocation(line: 807, column: 29, scope: !830)
!947 = !DILocation(line: 1877, column: 7, scope: !948, inlinedAt: !946)
!948 = distinct !DILexicalBlock(scope: !949, file: !369, line: 1858, column: 14)
!949 = distinct !DILexicalBlock(scope: !940, file: !369, line: 1858, column: 7)
!950 = !DILocation(line: 808, column: 13, scope: !830)
!951 = !DILocation(line: 808, column: 27, scope: !830)
!952 = !{!764, !688, i64 0}
!953 = !DILocation(line: 809, column: 13, scope: !830)
!954 = !DILocation(line: 809, column: 27, scope: !830)
!955 = !{!764, !688, i64 8}
!956 = !DILocation(line: 810, column: 29, scope: !830)
!957 = !DILocation(line: 0, scope: !851)
!958 = !DILocation(line: 810, column: 67, scope: !959)
!959 = distinct !DILexicalBlock(scope: !851, file: !373, line: 810, column: 67)
!960 = !DILocation(line: 810, column: 67, scope: !851)
!961 = !DILocation(line: 811, column: 8, scope: !830)
!962 = !DILocation(line: 811, column: 27, scope: !830)
!963 = !{!964, !689, i64 1468}
!964 = !{!"_p_KSP", !712, i64 0, !689, i64 560, !688, i64 672, !689, i64 680, !689, i64 684, !697, i64 688, !688, i64 696, !689, i64 704, !689, i64 708, !689, i64 712, !689, i64 716, !689, i64 720, !689, i64 724, !713, i64 776, !713, i64 784, !713, i64 792, !713, i64 800, !713, i64 808, !713, i64 816, !689, i64 824, !689, i64 828, !688, i64 832, !688, i64 840, !688, i64 848, !688, i64 856, !697, i64 864, !697, i64 868, !689, i64 872, !688, i64 880, !688, i64 888, !697, i64 896, !697, i64 900, !689, i64 904, !697, i64 908, !689, i64 912, !697, i64 916, !689, i64 920, !689, i64 960, !689, i64 1000, !697, i64 1040, !689, i64 1044, !689, i64 1048, !689, i64 1088, !689, i64 1128, !697, i64 1168, !688, i64 1176, !688, i64 1184, !688, i64 1192, !688, i64 1200, !688, i64 1208, !688, i64 1216, !689, i64 1224, !689, i64 1228, !689, i64 1232, !689, i64 1236, !689, i64 1240, !689, i64 1244, !689, i64 1248, !689, i64 1252, !689, i64 1256, !689, i64 1260, !689, i64 1264, !689, i64 1268, !689, i64 1272, !689, i64 1276, !688, i64 1280, !688, i64 1288, !688, i64 1296, !688, i64 1304, !688, i64 1312, !688, i64 1320, !688, i64 1328, !688, i64 1336, !688, i64 1344, !688, i64 1352, !688, i64 1360, !688, i64 1368, !688, i64 1376, !688, i64 1384, !689, i64 1392, !689, i64 1396, !689, i64 1400, !689, i64 1404, !689, i64 1408, !689, i64 1412, !689, i64 1416, !689, i64 1420, !689, i64 1424, !689, i64 1428, !689, i64 1432, !689, i64 1436, !689, i64 1440, !689, i64 1444, !697, i64 1448, !688, i64 1456, !689, i64 1464, !689, i64 1468, !697, i64 1472, !697, i64 1476, !689, i64 1480, !965, i64 1488, !689, i64 1512, !689, i64 1516, !689, i64 1520, !689, i64 1524, !689, i64 1528, !689, i64 1532, !688, i64 1536, !688, i64 1544, !697, i64 1552, !689, i64 1556, !688, i64 1560, !688, i64 1568, !688, i64 1576, !688, i64 1584, !688, i64 1592}
!965 = !{!"", !688, i64 0, !688, i64 8, !689, i64 16, !689, i64 20}
!966 = !DILocation(line: 813, column: 8, scope: !830)
!967 = !DILocation(line: 813, column: 19, scope: !830)
!968 = !{!964, !689, i64 1464}
!969 = !DILocation(line: 814, column: 23, scope: !830)
!970 = !DILocation(line: 814, column: 21, scope: !830)
!971 = !DILocation(line: 0, scope: !853)
!972 = !DILocation(line: 814, column: 31, scope: !973)
!973 = distinct !DILexicalBlock(scope: !853, file: !373, line: 814, column: 31)
!974 = !DILocation(line: 814, column: 31, scope: !853)
!975 = !DILocation(line: 815, column: 21, scope: !830)
!976 = !DILocation(line: 0, scope: !855)
!977 = !DILocation(line: 815, column: 70, scope: !978)
!978 = distinct !DILexicalBlock(scope: !855, file: !373, line: 815, column: 70)
!979 = !DILocation(line: 815, column: 70, scope: !855)
!980 = !DILocation(line: 816, column: 3, scope: !981)
!981 = distinct !DILexicalBlock(scope: !982, file: !373, line: 816, column: 3)
!982 = distinct !DILexicalBlock(scope: !983, file: !373, line: 816, column: 3)
!983 = distinct !DILexicalBlock(scope: !830, file: !373, line: 816, column: 3)
!984 = !DILocation(line: 816, column: 3, scope: !982)
!985 = !DILocation(line: 816, column: 3, scope: !986)
!986 = distinct !DILexicalBlock(scope: !987, file: !373, line: 816, column: 3)
!987 = distinct !DILexicalBlock(scope: !981, file: !373, line: 816, column: 3)
!988 = !DILocation(line: 816, column: 3, scope: !987)
!989 = !DILocation(line: 816, column: 3, scope: !990)
!990 = distinct !DILexicalBlock(scope: !991, file: !373, line: 816, column: 3)
!991 = distinct !DILexicalBlock(scope: !986, file: !373, line: 816, column: 3)
!992 = !DILocation(line: 816, column: 3, scope: !991)
!993 = !DILocation(line: 816, column: 3, scope: !994)
!994 = distinct !DILexicalBlock(scope: !990, file: !373, line: 816, column: 3)
!995 = !DILocation(line: 816, column: 3, scope: !996)
!996 = distinct !DILexicalBlock(scope: !986, file: !373, line: 816, column: 3)
!997 = !DILocation(line: 816, column: 3, scope: !998)
!998 = distinct !DILexicalBlock(scope: !996, file: !373, line: 816, column: 3)
!999 = !DILocation(line: 816, column: 3, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !1001, file: !373, line: 816, column: 3)
!1001 = distinct !DILexicalBlock(scope: !998, file: !373, line: 816, column: 3)
!1002 = !DILocation(line: 816, column: 3, scope: !1001)
!1003 = !DILocation(line: 816, column: 3, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !1000, file: !373, line: 816, column: 3)
!1005 = !DILocation(line: 817, column: 1, scope: !830)
!1006 = !DISubprogram(name: "KSPGetPC", scope: !35, file: !35, line: 141, type: !1007, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !813)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!28, !410, !1009}
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!1010 = !DISubprogram(name: "PCLoad", scope: !1011, file: !1011, line: 85, type: !1012, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !813)
!1011 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpc.h", directory: "/home/users/ndemeye/xSDK")
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!28, !571, !178}
!1014 = distinct !DISubprogram(name: "KSPView", scope: !373, file: !373, line: 115, type: !407, scopeLine: 116, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1015)
!1015 = !{!1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1027, !1029, !1030, !1032, !1035, !1036, !1038, !1040, !1042, !1044, !1048, !1052, !1054, !1056, !1060, !1063, !1067, !1069, !1073, !1077, !1080, !1084, !1086, !1088, !1092, !1094, !1097, !1098, !1099, !1100, !1102, !1104, !1107, !1108, !1112, !1114, !1116, !1120, !1123, !1125, !1127, !1131, !1138, !1142, !1143, !1144, !1145, !1146, !1147, !1149, !1151, !1153, !1157, !1159, !1161, !1163, !1167, !1171, !1174, !1176}
!1016 = !DILocalVariable(name: "ksp", arg: 1, scope: !1014, file: !373, line: 115, type: !409)
!1017 = !DILocalVariable(name: "viewer", arg: 2, scope: !1014, file: !373, line: 115, type: !176)
!1018 = !DILocalVariable(name: "ierr", scope: !1014, file: !373, line: 117, type: !170)
!1019 = !DILocalVariable(name: "iascii", scope: !1014, file: !373, line: 118, type: !327)
!1020 = !DILocalVariable(name: "isbinary", scope: !1014, file: !373, line: 118, type: !327)
!1021 = !DILocalVariable(name: "isdraw", scope: !1014, file: !373, line: 118, type: !327)
!1022 = !DILocalVariable(name: "isstring", scope: !1014, file: !373, line: 118, type: !327)
!1023 = !DILocalVariable(name: "ierr__", scope: !1024, file: !373, line: 126, type: !170)
!1024 = distinct !DILexicalBlock(scope: !1025, file: !373, line: 126, column: 81)
!1025 = distinct !DILexicalBlock(scope: !1026, file: !373, line: 125, column: 16)
!1026 = distinct !DILexicalBlock(scope: !1014, file: !373, line: 125, column: 7)
!1027 = !DILocalVariable(name: "_7_ierr", scope: !1028, file: !373, line: 129, type: !170)
!1028 = distinct !DILexicalBlock(scope: !1014, file: !373, line: 129, column: 3)
!1029 = !DILocalVariable(name: "_7_flag", scope: !1028, file: !373, line: 129, type: !229)
!1030 = !DILocalVariable(name: "_7_errorcode", scope: !1031, file: !373, line: 129, type: !170)
!1031 = distinct !DILexicalBlock(scope: !1028, file: !373, line: 129, column: 3)
!1032 = !DILocalVariable(name: "_7_errorstring", scope: !1033, file: !373, line: 129, type: !657)
!1033 = distinct !DILexicalBlock(scope: !1034, file: !373, line: 129, column: 3)
!1034 = distinct !DILexicalBlock(scope: !1031, file: !373, line: 129, column: 3)
!1035 = !DILocalVariable(name: "_7_resultlen", scope: !1033, file: !373, line: 129, type: !229)
!1036 = !DILocalVariable(name: "ierr__", scope: !1037, file: !373, line: 131, type: !170)
!1037 = distinct !DILexicalBlock(scope: !1014, file: !373, line: 131, column: 79)
!1038 = !DILocalVariable(name: "ierr__", scope: !1039, file: !373, line: 132, type: !170)
!1039 = distinct !DILexicalBlock(scope: !1014, file: !373, line: 132, column: 82)
!1040 = !DILocalVariable(name: "ierr__", scope: !1041, file: !373, line: 133, type: !170)
!1041 = distinct !DILexicalBlock(scope: !1014, file: !373, line: 133, column: 78)
!1042 = !DILocalVariable(name: "ierr__", scope: !1043, file: !373, line: 134, type: !170)
!1043 = distinct !DILexicalBlock(scope: !1014, file: !373, line: 134, column: 82)
!1044 = !DILocalVariable(name: "ierr__", scope: !1045, file: !373, line: 139, type: !170)
!1045 = distinct !DILexicalBlock(scope: !1046, file: !373, line: 139, column: 73)
!1046 = distinct !DILexicalBlock(scope: !1047, file: !373, line: 138, column: 15)
!1047 = distinct !DILexicalBlock(scope: !1014, file: !373, line: 138, column: 7)
!1048 = !DILocalVariable(name: "ierr__", scope: !1049, file: !373, line: 141, type: !170)
!1049 = distinct !DILexicalBlock(scope: !1050, file: !373, line: 141, column: 46)
!1050 = distinct !DILexicalBlock(scope: !1051, file: !373, line: 140, column: 25)
!1051 = distinct !DILexicalBlock(scope: !1046, file: !373, line: 140, column: 9)
!1052 = !DILocalVariable(name: "ierr__", scope: !1053, file: !373, line: 142, type: !170)
!1053 = distinct !DILexicalBlock(scope: !1050, file: !373, line: 142, column: 44)
!1054 = !DILocalVariable(name: "ierr__", scope: !1055, file: !373, line: 143, type: !170)
!1055 = distinct !DILexicalBlock(scope: !1050, file: !373, line: 143, column: 45)
!1056 = !DILocalVariable(name: "ierr__", scope: !1057, file: !373, line: 146, type: !170)
!1057 = distinct !DILexicalBlock(scope: !1058, file: !373, line: 146, column: 108)
!1058 = distinct !DILexicalBlock(scope: !1059, file: !373, line: 145, column: 26)
!1059 = distinct !DILexicalBlock(scope: !1046, file: !373, line: 145, column: 9)
!1060 = !DILocalVariable(name: "ierr__", scope: !1061, file: !373, line: 148, type: !170)
!1061 = distinct !DILexicalBlock(scope: !1062, file: !373, line: 148, column: 109)
!1062 = distinct !DILexicalBlock(scope: !1059, file: !373, line: 147, column: 12)
!1063 = !DILocalVariable(name: "ierr__", scope: !1064, file: !373, line: 150, type: !170)
!1064 = distinct !DILexicalBlock(scope: !1065, file: !373, line: 150, column: 138)
!1065 = distinct !DILexicalBlock(scope: !1066, file: !373, line: 150, column: 27)
!1066 = distinct !DILexicalBlock(scope: !1046, file: !373, line: 150, column: 9)
!1067 = !DILocalVariable(name: "ierr__", scope: !1068, file: !373, line: 151, type: !170)
!1068 = distinct !DILexicalBlock(scope: !1046, file: !373, line: 151, column: 160)
!1069 = !DILocalVariable(name: "ierr__", scope: !1070, file: !373, line: 153, type: !170)
!1070 = distinct !DILexicalBlock(scope: !1071, file: !373, line: 153, column: 73)
!1071 = distinct !DILexicalBlock(scope: !1072, file: !373, line: 152, column: 35)
!1072 = distinct !DILexicalBlock(scope: !1046, file: !373, line: 152, column: 9)
!1073 = !DILocalVariable(name: "ierr__", scope: !1074, file: !373, line: 155, type: !170)
!1074 = distinct !DILexicalBlock(scope: !1075, file: !373, line: 155, column: 77)
!1075 = distinct !DILexicalBlock(scope: !1076, file: !373, line: 154, column: 46)
!1076 = distinct !DILexicalBlock(scope: !1072, file: !373, line: 154, column: 16)
!1077 = !DILocalVariable(name: "ierr__", scope: !1078, file: !373, line: 157, type: !170)
!1078 = distinct !DILexicalBlock(scope: !1079, file: !373, line: 157, column: 72)
!1079 = distinct !DILexicalBlock(scope: !1076, file: !373, line: 156, column: 12)
!1080 = !DILocalVariable(name: "ierr__", scope: !1081, file: !373, line: 160, type: !170)
!1081 = distinct !DILexicalBlock(scope: !1082, file: !373, line: 160, column: 46)
!1082 = distinct !DILexicalBlock(scope: !1083, file: !373, line: 159, column: 21)
!1083 = distinct !DILexicalBlock(scope: !1046, file: !373, line: 159, column: 9)
!1084 = !DILocalVariable(name: "ierr__", scope: !1085, file: !373, line: 161, type: !170)
!1085 = distinct !DILexicalBlock(scope: !1082, file: !373, line: 161, column: 46)
!1086 = !DILocalVariable(name: "ierr__", scope: !1087, file: !373, line: 162, type: !170)
!1087 = distinct !DILexicalBlock(scope: !1082, file: !373, line: 162, column: 45)
!1088 = !DILocalVariable(name: "ierr__", scope: !1089, file: !373, line: 164, type: !170)
!1089 = distinct !DILexicalBlock(scope: !1090, file: !373, line: 164, column: 92)
!1090 = distinct !DILexicalBlock(scope: !1091, file: !373, line: 164, column: 22)
!1091 = distinct !DILexicalBlock(scope: !1046, file: !373, line: 164, column: 9)
!1092 = !DILocalVariable(name: "ierr__", scope: !1093, file: !373, line: 165, type: !170)
!1093 = distinct !DILexicalBlock(scope: !1046, file: !373, line: 165, column: 117)
!1094 = !DILocalVariable(name: "classid", scope: !1095, file: !373, line: 167, type: !212)
!1095 = distinct !DILexicalBlock(scope: !1096, file: !373, line: 166, column: 24)
!1096 = distinct !DILexicalBlock(scope: !1047, file: !373, line: 166, column: 14)
!1097 = !DILocalVariable(name: "comm", scope: !1095, file: !373, line: 168, type: !150)
!1098 = !DILocalVariable(name: "rank", scope: !1095, file: !373, line: 169, type: !229)
!1099 = !DILocalVariable(name: "type", scope: !1095, file: !373, line: 170, type: !657)
!1100 = !DILocalVariable(name: "ierr__", scope: !1101, file: !373, line: 172, type: !170)
!1101 = distinct !DILexicalBlock(scope: !1095, file: !373, line: 172, column: 55)
!1102 = !DILocalVariable(name: "_7_errorcode", scope: !1103, file: !373, line: 173, type: !170)
!1103 = distinct !DILexicalBlock(scope: !1095, file: !373, line: 173, column: 38)
!1104 = !DILocalVariable(name: "_7_errorstring", scope: !1105, file: !373, line: 173, type: !657)
!1105 = distinct !DILexicalBlock(scope: !1106, file: !373, line: 173, column: 38)
!1106 = distinct !DILexicalBlock(scope: !1103, file: !373, line: 173, column: 38)
!1107 = !DILocalVariable(name: "_7_resultlen", scope: !1105, file: !373, line: 173, type: !229)
!1108 = !DILocalVariable(name: "ierr__", scope: !1109, file: !373, line: 175, type: !170)
!1109 = distinct !DILexicalBlock(scope: !1110, file: !373, line: 175, column: 66)
!1110 = distinct !DILexicalBlock(scope: !1111, file: !373, line: 174, column: 16)
!1111 = distinct !DILexicalBlock(scope: !1095, file: !373, line: 174, column: 9)
!1112 = !DILocalVariable(name: "ierr__", scope: !1113, file: !373, line: 176, type: !170)
!1113 = distinct !DILexicalBlock(scope: !1110, file: !373, line: 176, column: 67)
!1114 = !DILocalVariable(name: "ierr__", scope: !1115, file: !373, line: 177, type: !170)
!1115 = distinct !DILexicalBlock(scope: !1110, file: !373, line: 177, column: 65)
!1116 = !DILocalVariable(name: "ierr__", scope: !1117, file: !373, line: 180, type: !170)
!1117 = distinct !DILexicalBlock(scope: !1118, file: !373, line: 180, column: 44)
!1118 = distinct !DILexicalBlock(scope: !1119, file: !373, line: 179, column: 25)
!1119 = distinct !DILexicalBlock(scope: !1095, file: !373, line: 179, column: 9)
!1120 = !DILocalVariable(name: "type", scope: !1121, file: !373, line: 183, type: !189)
!1121 = distinct !DILexicalBlock(scope: !1122, file: !373, line: 182, column: 24)
!1122 = distinct !DILexicalBlock(scope: !1096, file: !373, line: 182, column: 14)
!1123 = !DILocalVariable(name: "ierr__", scope: !1124, file: !373, line: 184, type: !170)
!1124 = distinct !DILexicalBlock(scope: !1121, file: !373, line: 184, column: 34)
!1125 = !DILocalVariable(name: "ierr__", scope: !1126, file: !373, line: 185, type: !170)
!1126 = distinct !DILexicalBlock(scope: !1121, file: !373, line: 185, column: 69)
!1127 = !DILocalVariable(name: "ierr__", scope: !1128, file: !373, line: 186, type: !170)
!1128 = distinct !DILexicalBlock(scope: !1129, file: !373, line: 186, column: 63)
!1129 = distinct !DILexicalBlock(scope: !1130, file: !373, line: 186, column: 25)
!1130 = distinct !DILexicalBlock(scope: !1121, file: !373, line: 186, column: 9)
!1131 = !DILocalVariable(name: "draw", scope: !1132, file: !373, line: 188, type: !1134)
!1132 = distinct !DILexicalBlock(scope: !1133, file: !373, line: 187, column: 22)
!1133 = distinct !DILexicalBlock(scope: !1122, file: !373, line: 187, column: 14)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDraw", file: !1135, line: 25, baseType: !1136)
!1135 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdrawtypes.h", directory: "/home/users/ndemeye/xSDK")
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDraw", file: !1135, line: 25, flags: DIFlagFwdDecl)
!1138 = !DILocalVariable(name: "str", scope: !1132, file: !373, line: 189, type: !1139)
!1139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 288, elements: !1140)
!1140 = !{!1141}
!1141 = !DISubrange(count: 36)
!1142 = !DILocalVariable(name: "x", scope: !1132, file: !373, line: 190, type: !266)
!1143 = !DILocalVariable(name: "y", scope: !1132, file: !373, line: 190, type: !266)
!1144 = !DILocalVariable(name: "bottom", scope: !1132, file: !373, line: 190, type: !266)
!1145 = !DILocalVariable(name: "h", scope: !1132, file: !373, line: 190, type: !266)
!1146 = !DILocalVariable(name: "flg", scope: !1132, file: !373, line: 191, type: !327)
!1147 = !DILocalVariable(name: "ierr__", scope: !1148, file: !373, line: 193, type: !170)
!1148 = distinct !DILexicalBlock(scope: !1132, file: !373, line: 193, column: 51)
!1149 = !DILocalVariable(name: "ierr__", scope: !1150, file: !373, line: 194, type: !170)
!1150 = distinct !DILexicalBlock(scope: !1132, file: !373, line: 194, column: 49)
!1151 = !DILocalVariable(name: "ierr__", scope: !1152, file: !373, line: 195, type: !170)
!1152 = distinct !DILexicalBlock(scope: !1132, file: !373, line: 195, column: 69)
!1153 = !DILocalVariable(name: "ierr__", scope: !1154, file: !373, line: 197, type: !170)
!1154 = distinct !DILexicalBlock(scope: !1155, file: !373, line: 197, column: 54)
!1155 = distinct !DILexicalBlock(scope: !1156, file: !373, line: 196, column: 15)
!1156 = distinct !DILexicalBlock(scope: !1132, file: !373, line: 196, column: 9)
!1157 = !DILocalVariable(name: "ierr__", scope: !1158, file: !373, line: 198, type: !170)
!1158 = distinct !DILexicalBlock(scope: !1155, file: !373, line: 198, column: 76)
!1159 = !DILocalVariable(name: "ierr__", scope: !1160, file: !373, line: 199, type: !170)
!1160 = distinct !DILexicalBlock(scope: !1155, file: !373, line: 199, column: 91)
!1161 = !DILocalVariable(name: "ierr__", scope: !1162, file: !373, line: 204, type: !170)
!1162 = distinct !DILexicalBlock(scope: !1132, file: !373, line: 204, column: 53)
!1163 = !DILocalVariable(name: "ierr__", scope: !1164, file: !373, line: 226, type: !170)
!1164 = distinct !DILexicalBlock(scope: !1165, file: !373, line: 226, column: 42)
!1165 = distinct !DILexicalBlock(scope: !1166, file: !373, line: 225, column: 30)
!1166 = distinct !DILexicalBlock(scope: !1133, file: !373, line: 225, column: 14)
!1167 = !DILocalVariable(name: "ierr__", scope: !1168, file: !373, line: 229, type: !170)
!1168 = distinct !DILexicalBlock(scope: !1169, file: !373, line: 229, column: 35)
!1169 = distinct !DILexicalBlock(scope: !1170, file: !373, line: 228, column: 16)
!1170 = distinct !DILexicalBlock(scope: !1014, file: !373, line: 228, column: 7)
!1171 = !DILocalVariable(name: "draw", scope: !1172, file: !373, line: 232, type: !1134)
