; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/interface/ftn-auto/dmf.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/interface/ftn-auto/dmf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._p_DM = type opaque
%struct.ompi_communicator_t = type opaque
%struct._p_Vec = type opaque
%struct._p_Mat = type opaque
%struct._p_ISLocalToGlobalMapping = type opaque
%struct._n_ISColoring = type opaque
%struct._p_IS = type opaque
%struct._p_PetscSF = type opaque
%struct._p_PetscSection = type opaque
%struct._p_DMLabel = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 81, baseType: !5, size: 32, elements: !27)
!26 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39}
!28 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!29 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!30 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!31 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!32 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!33 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!34 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!35 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!36 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!37 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!38 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!39 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 74, baseType: !5, size: 32, elements: !42)
!41 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!42 = !{!43, !44, !45}
!43 = !DIEnumerator(name: "DM_POINTLOCATION_NONE", value: 0, isUnsigned: true)
!44 = !DIEnumerator(name: "DM_POINTLOCATION_NEAREST", value: 1, isUnsigned: true)
!45 = !DIEnumerator(name: "DM_POINTLOCATION_REMOVE", value: 2, isUnsigned: true)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 327, baseType: !5, size: 32, elements: !47)
!47 = !{!48, !49, !50}
!48 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!49 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!50 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!51 = !{!52, !55, !61, !65, !69, !74, !71, !78, !82, !290, !294, !298, !302}
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !41, line: 14, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !41, line: 14, flags: DIFlagFwdDecl)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranAddr", file: !57, line: 135, baseType: !58)
!57 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/fortranimpl.h", directory: "/home/users/ndemeye/xSDK")
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !59, line: 100, baseType: !60)
!59 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!60 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !62, line: 21, baseType: !63)
!62 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !62, line: 21, flags: DIFlagFwdDecl)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !66, line: 16, baseType: !67)
!66 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !66, line: 16, flags: DIFlagFwdDecl)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !70, line: 59, baseType: !71)
!70 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !70, line: 15, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !70, line: 15, flags: DIFlagFwdDecl)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !75, line: 18, baseType: !76)
!75 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !75, line: 18, flags: DIFlagFwdDecl)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabel", file: !79, line: 12, baseType: !80)
!79 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmlabel.h", directory: "/home/users/ndemeye/xSDK")
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMLabel", file: !79, line: 12, flags: DIFlagFwdDecl)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !10, line: 430, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !85, line: 73, size: 4480, elements: !86)
!85 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!86 = !{!87, !90, !143, !144, !146, !149, !150, !151, !152, !160, !161, !163, !167, !171, !173, !174, !175, !176, !177, !178, !179, !180, !181, !183, !185, !186, !187, !189, !190, !192, !194, !195, !196, !197, !198, !201, !203, !204, !205, !206, !207, !210, !212, !213, !214, !224, !226, !227, !231, !232, !280, !285, !287, !288, !289}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !84, file: !85, line: 74, baseType: !88, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !10, line: 32, baseType: !89)
!89 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !84, file: !85, line: 75, baseType: !91, size: 448, offset: 64)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 448, elements: !141)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !85, line: 53, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !85, line: 45, size: 448, elements: !94)
!94 = !{!95, !105, !113, !118, !125, !129, !136}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !93, file: !85, line: 46, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!99, !82, !100}
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !10, line: 14, baseType: !89)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !102, line: 330, baseType: !103)
!102 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !102, line: 330, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !93, file: !85, line: 47, baseType: !106, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!99, !82, !109}
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !110, line: 16, baseType: !111)
!110 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !110, line: 16, flags: DIFlagFwdDecl)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !93, file: !85, line: 48, baseType: !114, size: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!99, !117}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !93, file: !85, line: 49, baseType: !119, size: 64, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!99, !82, !122, !82}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !124)
!124 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !93, file: !85, line: 50, baseType: !126, size: 64, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!99, !82, !122, !117}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !93, file: !85, line: 51, baseType: !130, size: 64, offset: 320)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!99, !82, !122, !133}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{null}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !93, file: !85, line: 52, baseType: !137, size: 64, offset: 384)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!99, !82, !122, !140}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!141 = !{!142}
!142 = !DISubrange(count: 1)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !84, file: !85, line: 76, baseType: !101, size: 64, offset: 512)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !84, file: !85, line: 77, baseType: !145, size: 32, offset: 576)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !10, line: 102, baseType: !89)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !84, file: !85, line: 78, baseType: !147, size: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !10, line: 360, baseType: !148)
!148 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !84, file: !85, line: 78, baseType: !147, size: 64, offset: 704)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !84, file: !85, line: 78, baseType: !147, size: 64, offset: 768)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !84, file: !85, line: 78, baseType: !147, size: 64, offset: 832)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !84, file: !85, line: 79, baseType: !153, size: 64, offset: 896)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !10, line: 442, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !10, line: 90, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !156, line: 27, baseType: !157)
!156 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !158, line: 43, baseType: !159)
!158 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!159 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !84, file: !85, line: 80, baseType: !145, size: 32, offset: 960)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !84, file: !85, line: 81, baseType: !162, size: 32, offset: 992)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !10, line: 49, baseType: !89)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !84, file: !85, line: 82, baseType: !164, size: 64, offset: 1024)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !10, line: 465, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !10, line: 465, flags: DIFlagFwdDecl)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !84, file: !85, line: 83, baseType: !168, size: 64, offset: 1088)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !10, line: 496, baseType: !169)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !10, line: 496, flags: DIFlagFwdDecl)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !84, file: !85, line: 84, baseType: !172, size: 64, offset: 1152)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !84, file: !85, line: 85, baseType: !172, size: 64, offset: 1216)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !84, file: !85, line: 86, baseType: !172, size: 64, offset: 1280)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !84, file: !85, line: 87, baseType: !172, size: 64, offset: 1344)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !84, file: !85, line: 88, baseType: !82, size: 64, offset: 1408)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !84, file: !85, line: 89, baseType: !153, size: 64, offset: 1472)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !84, file: !85, line: 90, baseType: !172, size: 64, offset: 1536)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !84, file: !85, line: 91, baseType: !172, size: 64, offset: 1600)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !84, file: !85, line: 92, baseType: !145, size: 32, offset: 1664)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !84, file: !85, line: 93, baseType: !182, size: 64, offset: 1728)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !84, file: !85, line: 94, baseType: !184, size: 64, offset: 1792)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !10, line: 455, baseType: !154)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !84, file: !85, line: 95, baseType: !145, size: 32, offset: 1856)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !84, file: !85, line: 95, baseType: !145, size: 32, offset: 1888)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !84, file: !85, line: 96, baseType: !188, size: 64, offset: 1920)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !84, file: !85, line: 96, baseType: !188, size: 64, offset: 1984)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !84, file: !85, line: 97, baseType: !191, size: 64, offset: 2048)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !84, file: !85, line: 97, baseType: !193, size: 64, offset: 2112)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !84, file: !85, line: 98, baseType: !145, size: 32, offset: 2176)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !84, file: !85, line: 98, baseType: !145, size: 32, offset: 2208)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !84, file: !85, line: 99, baseType: !188, size: 64, offset: 2240)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !84, file: !85, line: 99, baseType: !188, size: 64, offset: 2304)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !84, file: !85, line: 100, baseType: !199, size: 64, offset: 2368)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !10, line: 189, baseType: !148)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !84, file: !85, line: 100, baseType: !202, size: 64, offset: 2432)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !84, file: !85, line: 101, baseType: !145, size: 32, offset: 2496)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !84, file: !85, line: 101, baseType: !145, size: 32, offset: 2528)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !84, file: !85, line: 102, baseType: !188, size: 64, offset: 2560)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !84, file: !85, line: 102, baseType: !188, size: 64, offset: 2624)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !84, file: !85, line: 103, baseType: !208, size: 64, offset: 2688)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !10, line: 305, baseType: !200)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !84, file: !85, line: 103, baseType: !211, size: 64, offset: 2752)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !84, file: !85, line: 104, baseType: !140, size: 64, offset: 2816)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !84, file: !85, line: 105, baseType: !145, size: 32, offset: 2880)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !84, file: !85, line: 106, baseType: !215, size: 128, offset: 2944)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 128, elements: !222)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !85, line: 64, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !85, line: 61, size: 128, elements: !219)
!219 = !{!220, !221}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !218, file: !85, line: 62, baseType: !133, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !218, file: !85, line: 63, baseType: !182, size: 64, offset: 64)
!222 = !{!223}
!223 = !DISubrange(count: 2)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !84, file: !85, line: 107, baseType: !225, size: 64, offset: 3072)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 64, elements: !222)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !84, file: !85, line: 108, baseType: !182, size: 64, offset: 3136)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !84, file: !85, line: 109, baseType: !228, size: 64, offset: 3200)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!99, !182}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !84, file: !85, line: 111, baseType: !145, size: 32, offset: 3264)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !84, file: !85, line: 112, baseType: !233, size: 320, offset: 3328)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 320, elements: !278)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!99, !237, !82, !182}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !26, line: 108, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !26, line: 99, size: 640, elements: !240)
!240 = !{!241, !242, !266, !267, !268, !269, !270, !271, !272, !273, !274}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !239, file: !26, line: 100, baseType: !145, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !239, file: !26, line: 101, baseType: !243, size: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !26, line: 82, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !26, line: 83, size: 768, elements: !246)
!246 = !{!247, !248, !249, !250, !251, !254, !255, !256, !259, !261, !263, !264, !265}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !245, file: !26, line: 84, baseType: !172, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !245, file: !26, line: 85, baseType: !172, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !245, file: !26, line: 86, baseType: !182, size: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !245, file: !26, line: 87, baseType: !164, size: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !245, file: !26, line: 88, baseType: !252, size: 64, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !245, file: !26, line: 89, baseType: !124, size: 8, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !245, file: !26, line: 90, baseType: !172, size: 64, offset: 384)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !245, file: !26, line: 91, baseType: !257, size: 64, offset: 448)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !258, line: 46, baseType: !60)
!258 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!259 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !245, file: !26, line: 92, baseType: !260, size: 32, offset: 512)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !10, line: 170, baseType: !9)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !245, file: !26, line: 93, baseType: !262, size: 32, offset: 544)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !26, line: 81, baseType: !25)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !245, file: !26, line: 94, baseType: !243, size: 64, offset: 576)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !245, file: !26, line: 95, baseType: !172, size: 64, offset: 640)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !245, file: !26, line: 96, baseType: !182, size: 64, offset: 704)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !239, file: !26, line: 102, baseType: !172, size: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !239, file: !26, line: 102, baseType: !172, size: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !239, file: !26, line: 103, baseType: !172, size: 64, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !239, file: !26, line: 104, baseType: !101, size: 64, offset: 320)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !239, file: !26, line: 105, baseType: !260, size: 32, offset: 384)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !239, file: !26, line: 105, baseType: !260, size: 32, offset: 416)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !239, file: !26, line: 105, baseType: !260, size: 32, offset: 448)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !239, file: !26, line: 106, baseType: !82, size: 64, offset: 512)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !239, file: !26, line: 107, baseType: !275, size: 64, offset: 576)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !26, line: 10, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !26, line: 10, flags: DIFlagFwdDecl)
!278 = !{!279}
!279 = !DISubrange(count: 5)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !84, file: !85, line: 113, baseType: !281, size: 320, offset: 3648)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 320, elements: !278)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!99, !82, !182}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !84, file: !85, line: 114, baseType: !286, size: 320, offset: 3968)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 320, elements: !278)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !84, file: !85, line: 115, baseType: !260, size: 32, offset: 4288)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !84, file: !85, line: 120, baseType: !275, size: 64, offset: 4352)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !84, file: !85, line: 121, baseType: !260, size: 32, offset: 4416)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !291, line: 11, baseType: !292)
!291 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !291, line: 11, flags: DIFlagFwdDecl)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDS", file: !295, line: 13, baseType: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdstypes.h", directory: "/home/users/ndemeye/xSDK")
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDS", file: !295, line: 13, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFE", file: !299, line: 76, baseType: !300)
!299 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscfetypes.h", directory: "/home/users/ndemeye/xSDK")
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscFE", file: !299, line: 76, flags: DIFlagFwdDecl)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !66, line: 1378, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !66, line: 1378, flags: DIFlagFwdDecl)
!305 = !{i32 7, !"Dwarf Version", i32 4}
!306 = !{i32 2, !"Debug Info Version", i32 3}
!307 = !{i32 1, !"wchar_size", i32 4}
!308 = !{i32 7, !"PIC Level", i32 2}
!309 = !{i32 7, !"uwtable", i32 1}
!310 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!311 = distinct !DISubprogram(name: "dmcreate_", scope: !312, file: !312, line: 684, type: !313, scopeLine: 685, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !317)
!312 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/dm/interface/ftn-auto/dmf.c", directory: "/home/users/ndemeye/xSDK")
!313 = !DISubroutineType(types: !314)
!314 = !{null, !315, !316, !315}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!317 = !{!318, !319, !320}
!318 = !DILocalVariable(name: "comm", arg: 1, scope: !311, file: !312, line: 684, type: !315)
!319 = !DILocalVariable(name: "dm", arg: 2, scope: !311, file: !312, line: 684, type: !316)
!320 = !DILocalVariable(name: "__ierr", arg: 3, scope: !311, file: !312, line: 684, type: !315)
!321 = !DILocation(line: 0, scope: !311)
!322 = !DILocation(line: 687, column: 15, scope: !311)
!323 = !{!324, !324, i64 0}
!324 = !{!"int", !325, i64 0}
!325 = !{!"omnipotent char", !326, i64 0}
!326 = !{!"Simple C/C++ TBAA"}
!327 = !DILocation(line: 687, column: 2, scope: !311)
!328 = !DILocation(line: 686, column: 11, scope: !311)
!329 = !DILocation(line: 686, column: 9, scope: !311)
!330 = !DILocation(line: 688, column: 1, scope: !311)
!331 = !DISubprogram(name: "DMCreate", scope: !332, file: !332, line: 46, type: !333, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !336)
!332 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdm.h", directory: "/home/users/ndemeye/xSDK")
!333 = !DISubroutineType(types: !334)
!334 = !{!89, !103, !335}
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!336 = !{}
!337 = !DISubprogram(name: "MPI_Comm_f2c", scope: !102, file: !102, line: 1292, type: !338, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !336)
!338 = !DISubroutineType(types: !339)
!339 = !{!103, !89}
