; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/sell/mpi/mpisell.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/sell/mpi/mpisell.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_datatype_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!367 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!368 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!369 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!370 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!371 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!372 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!373 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!374 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!375 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!376 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!377 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!378 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!379 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!380 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!381 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!382 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!383 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!384 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!385 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!386 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!387 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!388 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !389)
!389 = !{!390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407}
!390 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!391 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!392 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!393 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!394 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!395 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!396 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!397 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!398 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!399 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!400 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!401 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!402 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!403 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!404 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!405 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!406 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!407 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!408 = !{!409, !440, !521, !461, !1795, !596, !1820, !600, !437, !501, !1648, !1841, !511, !109, !1844, !484, !1846, !1847, !598, !7}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_MPISELL", file: !411, line: 39, baseType: !412)
!411 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/sell/mpi/mpisell.h", directory: "/home/users/ndemeye/xSDK")
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !411, line: 7, size: 1280, elements: !413)
!413 = !{!414, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1781, !1782, !1783, !1784, !1790, !1791, !1792, !1793, !1794}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !412, file: !411, line: 8, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !81, line: 16, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !418, line: 436, size: 23424, elements: !419)
!418 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!419 = !{!420, !630, !1533, !1534, !1535, !1536, !1538, !1539, !1540, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1654, !1655, !1671, !1672, !1673, !1674, !1675, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1710, !1730, !1731, !1733, !1734, !1735, !1736, !1737, !1738, !1756, !1757}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !417, file: !418, line: 437, baseType: !421, size: 4480)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !422, line: 122, baseType: !423)
!422 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !422, line: 73, size: 4480, elements: !424)
!424 = !{!425, !427, !482, !483, !485, !488, !489, !490, !491, !499, !500, !502, !506, !510, !512, !513, !514, !515, !516, !517, !518, !519, !520, !522, !524, !525, !526, !528, !529, !531, !533, !534, !535, !536, !537, !540, !542, !543, !544, !545, !546, !549, !551, !552, !553, !563, !565, !566, !570, !571, !620, !625, !627, !628, !629}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !423, file: !422, line: 74, baseType: !426, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !109)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !423, file: !422, line: 75, baseType: !428, size: 448, offset: 64)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !429, size: 448, elements: !480)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !422, line: 53, baseType: !430)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !422, line: 45, size: 448, elements: !431)
!431 = !{!432, !444, !452, !457, !464, !468, !475}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !430, file: !422, line: 46, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!436, !437, !439}
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !109)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !438)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !441, line: 330, baseType: !442)
!441 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !441, line: 330, flags: DIFlagFwdDecl)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !430, file: !422, line: 47, baseType: !445, size: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!436, !437, !448}
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !449, line: 16, baseType: !450)
!449 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !449, line: 16, flags: DIFlagFwdDecl)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !430, file: !422, line: 48, baseType: !453, size: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!436, !456}
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !430, file: !422, line: 49, baseType: !458, size: 64, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!436, !437, !461, !437}
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !463)
!463 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !430, file: !422, line: 50, baseType: !465, size: 64, offset: 256)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!436, !437, !461, !456}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !430, file: !422, line: 51, baseType: !469, size: 64, offset: 320)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DISubroutineType(types: !471)
!471 = !{!436, !437, !461, !472}
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{null}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !430, file: !422, line: 52, baseType: !476, size: 64, offset: 384)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!436, !437, !461, !479}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!480 = !{!481}
!481 = !DISubrange(count: 1)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !423, file: !422, line: 76, baseType: !440, size: 64, offset: 512)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !423, file: !422, line: 77, baseType: !484, size: 32, offset: 576)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !109)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !423, file: !422, line: 78, baseType: !486, size: 64, offset: 640)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !487)
!487 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !423, file: !422, line: 78, baseType: !486, size: 64, offset: 704)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !423, file: !422, line: 78, baseType: !486, size: 64, offset: 768)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !423, file: !422, line: 78, baseType: !486, size: 64, offset: 832)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !423, file: !422, line: 79, baseType: !492, size: 64, offset: 896)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !494)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !495, line: 27, baseType: !496)
!495 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !497, line: 43, baseType: !498)
!497 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!498 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !423, file: !422, line: 80, baseType: !484, size: 32, offset: 960)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !423, file: !422, line: 81, baseType: !501, size: 32, offset: 992)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !109)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !423, file: !422, line: 82, baseType: !503, size: 64, offset: 1024)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !504)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !423, file: !422, line: 83, baseType: !507, size: 64, offset: 1088)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !508)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !423, file: !422, line: 84, baseType: !511, size: 64, offset: 1152)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !423, file: !422, line: 85, baseType: !511, size: 64, offset: 1216)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !423, file: !422, line: 86, baseType: !511, size: 64, offset: 1280)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !423, file: !422, line: 87, baseType: !511, size: 64, offset: 1344)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !423, file: !422, line: 88, baseType: !437, size: 64, offset: 1408)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !423, file: !422, line: 89, baseType: !492, size: 64, offset: 1472)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !423, file: !422, line: 90, baseType: !511, size: 64, offset: 1536)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !423, file: !422, line: 91, baseType: !511, size: 64, offset: 1600)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !423, file: !422, line: 92, baseType: !484, size: 32, offset: 1664)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !423, file: !422, line: 93, baseType: !521, size: 64, offset: 1728)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !423, file: !422, line: 94, baseType: !523, size: 64, offset: 1792)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !493)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !423, file: !422, line: 95, baseType: !484, size: 32, offset: 1856)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !423, file: !422, line: 95, baseType: !484, size: 32, offset: 1888)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !423, file: !422, line: 96, baseType: !527, size: 64, offset: 1920)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !423, file: !422, line: 96, baseType: !527, size: 64, offset: 1984)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !423, file: !422, line: 97, baseType: !530, size: 64, offset: 2048)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !423, file: !422, line: 97, baseType: !532, size: 64, offset: 2112)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !423, file: !422, line: 98, baseType: !484, size: 32, offset: 2176)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !423, file: !422, line: 98, baseType: !484, size: 32, offset: 2208)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !423, file: !422, line: 99, baseType: !527, size: 64, offset: 2240)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !423, file: !422, line: 99, baseType: !527, size: 64, offset: 2304)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !423, file: !422, line: 100, baseType: !538, size: 64, offset: 2368)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !487)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !423, file: !422, line: 100, baseType: !541, size: 64, offset: 2432)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !423, file: !422, line: 101, baseType: !484, size: 32, offset: 2496)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !423, file: !422, line: 101, baseType: !484, size: 32, offset: 2528)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !423, file: !422, line: 102, baseType: !527, size: 64, offset: 2560)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !423, file: !422, line: 102, baseType: !527, size: 64, offset: 2624)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !423, file: !422, line: 103, baseType: !547, size: 64, offset: 2688)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !539)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !423, file: !422, line: 103, baseType: !550, size: 64, offset: 2752)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !423, file: !422, line: 104, baseType: !479, size: 64, offset: 2816)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !423, file: !422, line: 105, baseType: !484, size: 32, offset: 2880)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !423, file: !422, line: 106, baseType: !554, size: 128, offset: 2944)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 128, elements: !561)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !422, line: 64, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !422, line: 61, size: 128, elements: !558)
!558 = !{!559, !560}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !557, file: !422, line: 62, baseType: !472, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !557, file: !422, line: 63, baseType: !521, size: 64, offset: 64)
!561 = !{!562}
!562 = !DISubrange(count: 2)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !423, file: !422, line: 107, baseType: !564, size: 64, offset: 3072)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 64, elements: !561)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !423, file: !422, line: 108, baseType: !521, size: 64, offset: 3136)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !423, file: !422, line: 109, baseType: !567, size: 64, offset: 3200)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!436, !521}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !423, file: !422, line: 111, baseType: !484, size: 32, offset: 3264)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !423, file: !422, line: 112, baseType: !572, size: 320, offset: 3328)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !573, size: 320, elements: !618)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{!436, !576, !437, !521}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !579)
!579 = !{!580, !581, !606, !607, !608, !609, !610, !611, !612, !613, !614}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !578, file: !12, line: 100, baseType: !484, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !578, file: !12, line: 101, baseType: !582, size: 64, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !585)
!585 = !{!586, !587, !588, !589, !590, !593, !594, !595, !599, !601, !603, !604, !605}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !584, file: !12, line: 84, baseType: !511, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !584, file: !12, line: 85, baseType: !511, size: 64, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !584, file: !12, line: 86, baseType: !521, size: 64, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !584, file: !12, line: 87, baseType: !503, size: 64, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !584, file: !12, line: 88, baseType: !591, size: 64, offset: 256)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !461)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !584, file: !12, line: 89, baseType: !463, size: 8, offset: 320)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !584, file: !12, line: 90, baseType: !511, size: 64, offset: 384)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !584, file: !12, line: 91, baseType: !596, size: 64, offset: 448)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !597, line: 46, baseType: !598)
!597 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!598 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !584, file: !12, line: 92, baseType: !600, size: 32, offset: 512)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !584, file: !12, line: 93, baseType: !602, size: 32, offset: 544)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !584, file: !12, line: 94, baseType: !582, size: 64, offset: 576)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !584, file: !12, line: 95, baseType: !511, size: 64, offset: 640)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !584, file: !12, line: 96, baseType: !521, size: 64, offset: 704)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !578, file: !12, line: 102, baseType: !511, size: 64, offset: 128)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !578, file: !12, line: 102, baseType: !511, size: 64, offset: 192)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !578, file: !12, line: 103, baseType: !511, size: 64, offset: 256)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !578, file: !12, line: 104, baseType: !440, size: 64, offset: 320)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !578, file: !12, line: 105, baseType: !600, size: 32, offset: 384)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !578, file: !12, line: 105, baseType: !600, size: 32, offset: 416)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !578, file: !12, line: 105, baseType: !600, size: 32, offset: 448)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !578, file: !12, line: 106, baseType: !437, size: 64, offset: 512)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !578, file: !12, line: 107, baseType: !615, size: 64, offset: 576)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !616)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!618 = !{!619}
!619 = !DISubrange(count: 5)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !423, file: !422, line: 113, baseType: !621, size: 320, offset: 3648)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 320, elements: !618)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!436, !437, !521}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !423, file: !422, line: 114, baseType: !626, size: 320, offset: 3968)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !521, size: 320, elements: !618)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !423, file: !422, line: 115, baseType: !600, size: 32, offset: 4288)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !423, file: !422, line: 120, baseType: !615, size: 64, offset: 4352)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !423, file: !422, line: 121, baseType: !600, size: 32, offset: 4416)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !417, file: !418, line: 437, baseType: !631, size: 9472, offset: 4480)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !632, size: 9472, elements: !480)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !418, line: 32, size: 9472, elements: !633)
!633 = !{!634, !643, !647, !648, !1058, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1088, !1092, !1097, !1103, !1122, !1126, !1130, !1131, !1135, !1140, !1141, !1146, !1150, !1154, !1158, !1162, !1166, !1167, !1168, !1169, !1170, !1174, !1175, !1180, !1181, !1182, !1183, !1184, !1189, !1196, !1200, !1204, !1208, !1212, !1216, !1217, !1221, !1222, !1226, !1230, !1231, !1232, !1233, !1307, !1312, !1313, !1317, !1318, !1322, !1323, !1327, !1332, !1333, !1337, !1341, !1345, !1346, !1347, !1348, !1349, !1350, !1355, !1356, !1360, !1364, !1368, !1369, !1370, !1374, !1384, !1385, !1389, !1390, !1394, !1395, !1399, !1400, !1404, !1405, !1409, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1423, !1424, !1425, !1426, !1427, !1428, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1443, !1447, !1448, !1449, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1463, !1464, !1465, !1469, !1473, !1474, !1478, !1479, !1480, !1481, !1507, !1511, !1512, !1513, !1514, !1515, !1519, !1520, !1521, !1522, !1523, !1527, !1531, !1532}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !632, file: !418, line: 34, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!436, !415, !484, !638, !484, !638, !640, !642}
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !484)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !548)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !26)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !632, file: !418, line: 35, baseType: !644, size: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!436, !415, !484, !530, !532, !550}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !632, file: !418, line: 36, baseType: !644, size: 64, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !632, file: !418, line: 37, baseType: !649, size: 64, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{!436, !415, !652, !652}
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !38, line: 21, baseType: !653)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !655, line: 142, size: 12800, elements: !656)
!655 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!656 = !{!657, !658, !1003, !1004, !1005, !1006, !1052, !1053, !1054, !1055, !1057}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !654, file: !655, line: 143, baseType: !421, size: 4480)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !654, file: !655, line: 143, baseType: !659, size: 5248, offset: 4480)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !660, size: 5248, elements: !480)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !655, line: 23, size: 5248, elements: !661)
!661 = !{!662, !667, !672, !676, !680, !686, !691, !692, !693, !697, !701, !702, !703, !707, !711, !715, !716, !720, !724, !728, !729, !733, !737, !738, !742, !746, !747, !748, !752, !753, !760, !765, !766, !767, !771, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !823, !824, !825, !829, !833, !834, !835, !836, !840, !841, !842, !843, !844, !845, !846, !850, !851, !855, !962, !963, !968, !969, !973, !974, !975, !976, !977, !978, !979, !980, !984, !985, !986, !992, !996, !997, !998}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !660, file: !655, line: 24, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!436, !652, !666}
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !660, file: !655, line: 25, baseType: !668, size: 64, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!436, !652, !484, !671}
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !660, file: !655, line: 26, baseType: !673, size: 64, offset: 128)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!436, !484, !666}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !660, file: !655, line: 27, baseType: !677, size: 64, offset: 192)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!436, !652, !652, !547}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !660, file: !655, line: 28, baseType: !681, size: 64, offset: 256)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!436, !652, !484, !684, !547}
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !652)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !660, file: !655, line: 29, baseType: !687, size: 64, offset: 320)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{!436, !652, !690, !538}
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !38, line: 155, baseType: !37)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !660, file: !655, line: 30, baseType: !677, size: 64, offset: 384)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !660, file: !655, line: 31, baseType: !681, size: 64, offset: 448)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !660, file: !655, line: 32, baseType: !694, size: 64, offset: 512)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!436, !652, !548}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !660, file: !655, line: 33, baseType: !698, size: 64, offset: 576)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!436, !652, !652}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !660, file: !655, line: 34, baseType: !694, size: 64, offset: 640)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !660, file: !655, line: 35, baseType: !698, size: 64, offset: 704)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !660, file: !655, line: 36, baseType: !704, size: 64, offset: 768)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{!436, !652, !548, !652}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !660, file: !655, line: 37, baseType: !708, size: 64, offset: 832)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!436, !652, !548, !548, !652}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !660, file: !655, line: 38, baseType: !712, size: 64, offset: 896)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!436, !652, !484, !640, !666}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !660, file: !655, line: 39, baseType: !704, size: 64, offset: 960)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !660, file: !655, line: 40, baseType: !717, size: 64, offset: 1024)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{!436, !652, !548, !652, !652}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !660, file: !655, line: 41, baseType: !721, size: 64, offset: 1088)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{!436, !652, !548, !548, !548, !652, !652}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !660, file: !655, line: 42, baseType: !725, size: 64, offset: 1152)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{!436, !652, !652, !652}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !660, file: !655, line: 43, baseType: !725, size: 64, offset: 1216)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !660, file: !655, line: 44, baseType: !730, size: 64, offset: 1280)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!436, !652, !484, !638, !640, !642}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !660, file: !655, line: 45, baseType: !734, size: 64, offset: 1344)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!436, !652}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !660, file: !655, line: 46, baseType: !734, size: 64, offset: 1408)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !660, file: !655, line: 47, baseType: !739, size: 64, offset: 1472)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!436, !652, !550}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !660, file: !655, line: 48, baseType: !743, size: 64, offset: 1536)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!436, !652, !530}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !660, file: !655, line: 49, baseType: !743, size: 64, offset: 1600)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !660, file: !655, line: 50, baseType: !739, size: 64, offset: 1664)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !660, file: !655, line: 51, baseType: !749, size: 64, offset: 1728)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!436, !652, !530, !538}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !660, file: !655, line: 52, baseType: !749, size: 64, offset: 1792)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !660, file: !655, line: 53, baseType: !754, size: 64, offset: 1856)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{!436, !652, !757}
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !758)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !660, file: !655, line: 54, baseType: !761, size: 64, offset: 1920)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!436, !652, !764, !600}
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !38, line: 475, baseType: !45)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !660, file: !655, line: 55, baseType: !730, size: 64, offset: 1984)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !660, file: !655, line: 56, baseType: !734, size: 64, offset: 2048)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !660, file: !655, line: 57, baseType: !768, size: 64, offset: 2112)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!436, !652, !448}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !660, file: !655, line: 58, baseType: !772, size: 64, offset: 2176)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!436, !652, !640}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !660, file: !655, line: 59, baseType: !772, size: 64, offset: 2240)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !660, file: !655, line: 60, baseType: !677, size: 64, offset: 2304)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !660, file: !655, line: 61, baseType: !677, size: 64, offset: 2368)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !660, file: !655, line: 62, baseType: !687, size: 64, offset: 2432)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !660, file: !655, line: 63, baseType: !681, size: 64, offset: 2496)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !660, file: !655, line: 64, baseType: !681, size: 64, offset: 2560)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !660, file: !655, line: 65, baseType: !768, size: 64, offset: 2624)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !660, file: !655, line: 66, baseType: !734, size: 64, offset: 2688)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !660, file: !655, line: 67, baseType: !734, size: 64, offset: 2752)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !660, file: !655, line: 68, baseType: !785, size: 64, offset: 2816)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{!436, !652, !788}
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !789, line: 30, baseType: !790)
!789 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !61, line: 73, size: 5440, elements: !792)
!792 = !{!793, !794, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !791, file: !61, line: 74, baseType: !421, size: 4480)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !791, file: !61, line: 74, baseType: !795, size: 256, offset: 4480)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !796, size: 256, elements: !480)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ISLocalToGlobalMappingOps", file: !61, line: 66, size: 256, elements: !797)
!797 = !{!798, !802, !807, !808}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingsetup", scope: !796, file: !61, line: 67, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!436, !788}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingapply", scope: !796, file: !61, line: 68, baseType: !803, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DISubroutineType(types: !805)
!805 = !{!436, !788, !806, !484, !638, !530, !530}
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISGlobalToLocalMappingMode", file: !51, line: 149, baseType: !50)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingapplyblock", scope: !796, file: !61, line: 69, baseType: !803, size: 64, offset: 128)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !796, file: !61, line: 70, baseType: !799, size: 64, offset: 192)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !791, file: !61, line: 75, baseType: !484, size: 32, offset: 4736)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !791, file: !61, line: 76, baseType: !484, size: 32, offset: 4768)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "indices", scope: !791, file: !61, line: 77, baseType: !530, size: 64, offset: 4800)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "globalstart", scope: !791, file: !61, line: 78, baseType: !484, size: 32, offset: 4864)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "globalend", scope: !791, file: !61, line: 79, baseType: !484, size: 32, offset: 4896)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "info_cached", scope: !791, file: !61, line: 80, baseType: !600, size: 32, offset: 4928)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "info_free", scope: !791, file: !61, line: 81, baseType: !600, size: 32, offset: 4960)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "info_nproc", scope: !791, file: !61, line: 82, baseType: !484, size: 32, offset: 4992)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "info_procs", scope: !791, file: !61, line: 83, baseType: !530, size: 64, offset: 5056)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "info_numprocs", scope: !791, file: !61, line: 84, baseType: !530, size: 64, offset: 5120)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "info_indices", scope: !791, file: !61, line: 85, baseType: !532, size: 64, offset: 5184)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "info_nodec", scope: !791, file: !61, line: 86, baseType: !530, size: 64, offset: 5248)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "info_nodei", scope: !791, file: !61, line: 87, baseType: !532, size: 64, offset: 5312)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !791, file: !61, line: 88, baseType: !521, size: 64, offset: 5376)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !660, file: !655, line: 69, baseType: !730, size: 64, offset: 2880)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !660, file: !655, line: 70, baseType: !734, size: 64, offset: 2944)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !660, file: !655, line: 71, baseType: !826, size: 64, offset: 3008)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{!436, !576, !652}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !660, file: !655, line: 72, baseType: !830, size: 64, offset: 3072)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{!436, !652, !652, !538}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !660, file: !655, line: 73, baseType: !725, size: 64, offset: 3136)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !660, file: !655, line: 74, baseType: !725, size: 64, offset: 3200)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !660, file: !655, line: 75, baseType: !725, size: 64, offset: 3264)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !660, file: !655, line: 76, baseType: !837, size: 64, offset: 3328)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{!436, !652, !484, !638, !547}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !660, file: !655, line: 77, baseType: !734, size: 64, offset: 3392)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !660, file: !655, line: 78, baseType: !734, size: 64, offset: 3456)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !660, file: !655, line: 79, baseType: !734, size: 64, offset: 3520)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !660, file: !655, line: 80, baseType: !734, size: 64, offset: 3584)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !660, file: !655, line: 81, baseType: !694, size: 64, offset: 3648)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !660, file: !655, line: 82, baseType: !734, size: 64, offset: 3712)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !660, file: !655, line: 83, baseType: !847, size: 64, offset: 3776)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{!436, !652, !484, !652, !642}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !660, file: !655, line: 84, baseType: !847, size: 64, offset: 3840)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !660, file: !655, line: 85, baseType: !852, size: 64, offset: 3904)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{!436, !652, !652, !547, !547}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !660, file: !655, line: 86, baseType: !856, size: 64, offset: 3968)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{!436, !652, !859, !666}
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !789, line: 11, baseType: !860)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !61, line: 50, size: 7104, elements: !862)
!862 = !{!863, !864, !929, !949, !950, !951, !952, !953, !954, !955, !956, !959}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !861, file: !61, line: 51, baseType: !421, size: 4480)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !861, file: !61, line: 51, baseType: !865, size: 1536, offset: 4480)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !866, size: 1536, elements: !480)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ISOps", file: !61, line: 21, size: 1536, elements: !867)
!867 = !{!868, !873, !874, !879, !883, !884, !889, !893, !894, !898, !899, !903, !904, !909, !913, !917, !921, !922, !923, !924, !925, !926, !927, !928}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "getindices", scope: !866, file: !61, line: 22, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{!436, !859, !872}
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "restoreindices", scope: !866, file: !61, line: 23, baseType: !869, size: 64, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "invertpermutation", scope: !866, file: !61, line: 24, baseType: !875, size: 64, offset: 128)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!436, !859, !484, !878}
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "sort", scope: !866, file: !61, line: 25, baseType: !880, size: 64, offset: 192)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DISubroutineType(types: !882)
!882 = !{!436, !859}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "sortremovedups", scope: !866, file: !61, line: 26, baseType: !880, size: 64, offset: 256)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "sorted", scope: !866, file: !61, line: 27, baseType: !885, size: 64, offset: 320)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{!436, !859, !888}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !866, file: !61, line: 28, baseType: !890, size: 64, offset: 384)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{!436, !859, !878}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !866, file: !61, line: 29, baseType: !880, size: 64, offset: 448)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !866, file: !61, line: 30, baseType: !895, size: 64, offset: 512)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!436, !859, !448}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !866, file: !61, line: 31, baseType: !895, size: 64, offset: 576)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !866, file: !61, line: 32, baseType: !900, size: 64, offset: 640)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DISubroutineType(types: !902)
!902 = !{!436, !859, !859}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "togeneral", scope: !866, file: !61, line: 33, baseType: !880, size: 64, offset: 704)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "oncomm", scope: !866, file: !61, line: 34, baseType: !905, size: 64, offset: 768)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{!436, !859, !440, !908, !878}
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscCopyMode", file: !6, line: 327, baseType: !55)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksize", scope: !866, file: !61, line: 35, baseType: !910, size: 64, offset: 832)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!436, !859, !484}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "contiguous", scope: !866, file: !61, line: 36, baseType: !914, size: 64, offset: 896)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{!436, !859, !484, !484, !530, !888}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "locate", scope: !866, file: !61, line: 37, baseType: !918, size: 64, offset: 960)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{!436, !859, !484, !530}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "sortedlocal", scope: !866, file: !61, line: 38, baseType: !885, size: 64, offset: 1024)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "sortedglobal", scope: !866, file: !61, line: 39, baseType: !885, size: 64, offset: 1088)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "uniquelocal", scope: !866, file: !61, line: 40, baseType: !885, size: 64, offset: 1152)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "uniqueglobal", scope: !866, file: !61, line: 41, baseType: !885, size: 64, offset: 1216)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "permlocal", scope: !866, file: !61, line: 42, baseType: !885, size: 64, offset: 1280)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "permglobal", scope: !866, file: !61, line: 43, baseType: !885, size: 64, offset: 1344)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "intervallocal", scope: !866, file: !61, line: 44, baseType: !885, size: 64, offset: 1408)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "intervalglobal", scope: !866, file: !61, line: 45, baseType: !885, size: 64, offset: 1472)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !861, file: !61, line: 52, baseType: !930, size: 64, offset: 6016)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !789, line: 60, baseType: !931)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !51, line: 240, size: 640, elements: !933)
!933 = !{!934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !932, file: !51, line: 241, baseType: !440, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !932, file: !51, line: 242, baseType: !501, size: 32, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !932, file: !51, line: 243, baseType: !484, size: 32, offset: 96)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !932, file: !51, line: 243, baseType: !484, size: 32, offset: 128)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !932, file: !51, line: 244, baseType: !484, size: 32, offset: 160)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !932, file: !51, line: 244, baseType: !484, size: 32, offset: 192)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !932, file: !51, line: 245, baseType: !530, size: 64, offset: 256)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !932, file: !51, line: 246, baseType: !600, size: 32, offset: 320)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !932, file: !51, line: 247, baseType: !484, size: 32, offset: 352)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !932, file: !51, line: 251, baseType: !484, size: 32, offset: 384)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !932, file: !51, line: 252, baseType: !788, size: 64, offset: 448)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !932, file: !51, line: 253, baseType: !600, size: 32, offset: 512)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !932, file: !51, line: 254, baseType: !484, size: 32, offset: 544)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !932, file: !51, line: 254, baseType: !484, size: 32, offset: 576)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !932, file: !51, line: 255, baseType: !484, size: 32, offset: 608)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !861, file: !61, line: 53, baseType: !484, size: 32, offset: 6080)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !861, file: !61, line: 53, baseType: !484, size: 32, offset: 6112)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !861, file: !61, line: 54, baseType: !521, size: 64, offset: 6144)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !861, file: !61, line: 55, baseType: !530, size: 64, offset: 6208)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !861, file: !61, line: 55, baseType: !530, size: 64, offset: 6272)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "local_offset", scope: !861, file: !61, line: 56, baseType: !484, size: 32, offset: 6336)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "complement", scope: !861, file: !61, line: 57, baseType: !859, size: 64, offset: 6400)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "info_permanent", scope: !861, file: !61, line: 58, baseType: !957, size: 320, offset: 6464)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 320, elements: !958)
!958 = !{!562, !619}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !861, file: !61, line: 59, baseType: !960, size: 320, offset: 6784)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 320, elements: !958)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISInfoBool", file: !61, line: 48, baseType: !60)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !660, file: !655, line: 87, baseType: !856, size: 64, offset: 4032)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !660, file: !655, line: 88, baseType: !964, size: 64, offset: 4096)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{!436, !652, !967}
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !660, file: !655, line: 89, baseType: !964, size: 64, offset: 4160)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !660, file: !655, line: 90, baseType: !970, size: 64, offset: 4224)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!436, !652, !484, !638, !638, !652, !642}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !660, file: !655, line: 91, baseType: !970, size: 64, offset: 4288)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !660, file: !655, line: 92, baseType: !768, size: 64, offset: 4352)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !660, file: !655, line: 93, baseType: !768, size: 64, offset: 4416)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !660, file: !655, line: 94, baseType: !698, size: 64, offset: 4480)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !660, file: !655, line: 95, baseType: !698, size: 64, offset: 4544)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !660, file: !655, line: 96, baseType: !698, size: 64, offset: 4608)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !660, file: !655, line: 97, baseType: !698, size: 64, offset: 4672)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !660, file: !655, line: 98, baseType: !981, size: 64, offset: 4736)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!436, !652, !600}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !660, file: !655, line: 99, baseType: !739, size: 64, offset: 4800)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !660, file: !655, line: 100, baseType: !739, size: 64, offset: 4864)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !660, file: !655, line: 101, baseType: !987, size: 64, offset: 4928)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!436, !652, !550, !990}
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !6, line: 701, baseType: !66)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !660, file: !655, line: 102, baseType: !993, size: 64, offset: 4992)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!436, !652, !967, !990}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !660, file: !655, line: 103, baseType: !739, size: 64, offset: 5056)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !660, file: !655, line: 104, baseType: !964, size: 64, offset: 5120)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !660, file: !655, line: 105, baseType: !999, size: 64, offset: 5184)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!436, !484, !684, !666, !1002}
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !654, file: !655, line: 144, baseType: !930, size: 64, offset: 9728)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !654, file: !655, line: 145, baseType: !521, size: 64, offset: 9792)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !654, file: !655, line: 146, baseType: !600, size: 32, offset: 9856)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !654, file: !655, line: 147, baseType: !1007, size: 1344, offset: 9920)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !655, line: 140, baseType: !1008)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !655, line: 114, size: 1344, elements: !1009)
!1009 = !{!1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1028, !1029, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1008, file: !655, line: 115, baseType: !484, size: 32)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1008, file: !655, line: 116, baseType: !484, size: 32, offset: 32)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1008, file: !655, line: 117, baseType: !484, size: 32, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1008, file: !655, line: 118, baseType: !484, size: 32, offset: 96)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1008, file: !655, line: 119, baseType: !484, size: 32, offset: 128)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1008, file: !655, line: 120, baseType: !484, size: 32, offset: 160)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1008, file: !655, line: 121, baseType: !530, size: 64, offset: 192)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !1008, file: !655, line: 122, baseType: !547, size: 64, offset: 256)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1008, file: !655, line: 124, baseType: !440, size: 64, offset: 320)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1008, file: !655, line: 125, baseType: !501, size: 32, offset: 384)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1008, file: !655, line: 125, baseType: !501, size: 32, offset: 416)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1008, file: !655, line: 126, baseType: !501, size: 32, offset: 448)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1008, file: !655, line: 126, baseType: !501, size: 32, offset: 480)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1008, file: !655, line: 127, baseType: !1024, size: 64, offset: 512)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !441, line: 339, baseType: !1026)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !441, line: 339, flags: DIFlagFwdDecl)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1008, file: !655, line: 128, baseType: !1024, size: 64, offset: 576)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1008, file: !655, line: 129, baseType: !1030, size: 64, offset: 640)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !441, line: 341, baseType: !1032)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !441, line: 351, size: 192, elements: !1033)
!1033 = !{!1034, !1035, !1036, !1037, !1038}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1032, file: !441, line: 354, baseType: !109, size: 32)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1032, file: !441, line: 355, baseType: !109, size: 32, offset: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1032, file: !441, line: 356, baseType: !109, size: 32, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1032, file: !441, line: 361, baseType: !109, size: 32, offset: 96)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1032, file: !441, line: 362, baseType: !596, size: 64, offset: 128)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1008, file: !655, line: 130, baseType: !484, size: 32, offset: 704)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1008, file: !655, line: 130, baseType: !484, size: 32, offset: 736)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1008, file: !655, line: 131, baseType: !547, size: 64, offset: 768)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1008, file: !655, line: 131, baseType: !547, size: 64, offset: 832)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1008, file: !655, line: 132, baseType: !530, size: 64, offset: 896)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1008, file: !655, line: 132, baseType: !530, size: 64, offset: 960)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !1008, file: !655, line: 133, baseType: !484, size: 32, offset: 1024)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !1008, file: !655, line: 134, baseType: !530, size: 64, offset: 1088)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1008, file: !655, line: 135, baseType: !484, size: 32, offset: 1152)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !1008, file: !655, line: 136, baseType: !600, size: 32, offset: 1184)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !1008, file: !655, line: 137, baseType: !600, size: 32, offset: 1216)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1008, file: !655, line: 138, baseType: !642, size: 32, offset: 1248)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !1008, file: !655, line: 139, baseType: !530, size: 64, offset: 1280)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !654, file: !655, line: 147, baseType: !1007, size: 1344, offset: 11264)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !654, file: !655, line: 148, baseType: !600, size: 32, offset: 12608)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !654, file: !655, line: 149, baseType: !484, size: 32, offset: 12640)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !654, file: !655, line: 150, baseType: !1056, size: 32, offset: 12672)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !38, line: 472, baseType: !73)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !654, file: !655, line: 157, baseType: !511, size: 64, offset: 12736)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !632, file: !418, line: 38, baseType: !1059, size: 64, offset: 256)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!436, !415, !652, !652, !652}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !632, file: !418, line: 40, baseType: !649, size: 64, offset: 320)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !632, file: !418, line: 41, baseType: !1059, size: 64, offset: 384)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !632, file: !418, line: 42, baseType: !649, size: 64, offset: 448)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !632, file: !418, line: 43, baseType: !1059, size: 64, offset: 512)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !632, file: !418, line: 44, baseType: !649, size: 64, offset: 576)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !632, file: !418, line: 46, baseType: !1059, size: 64, offset: 640)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !632, file: !418, line: 47, baseType: !1069, size: 64, offset: 704)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!436, !415, !859, !859, !1072}
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1074)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !81, line: 1239, baseType: !1075)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !81, line: 1226, size: 704, elements: !1076)
!1076 = !{!1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !1075, file: !81, line: 1227, baseType: !539, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !1075, file: !81, line: 1228, baseType: !539, size: 64, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !1075, file: !81, line: 1229, baseType: !539, size: 64, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !1075, file: !81, line: 1230, baseType: !539, size: 64, offset: 192)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !1075, file: !81, line: 1231, baseType: !539, size: 64, offset: 256)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !1075, file: !81, line: 1232, baseType: !539, size: 64, offset: 320)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !1075, file: !81, line: 1233, baseType: !539, size: 64, offset: 384)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !1075, file: !81, line: 1234, baseType: !539, size: 64, offset: 448)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !1075, file: !81, line: 1236, baseType: !539, size: 64, offset: 512)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !1075, file: !81, line: 1237, baseType: !539, size: 64, offset: 576)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !1075, file: !81, line: 1238, baseType: !539, size: 64, offset: 640)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !632, file: !418, line: 48, baseType: !1089, size: 64, offset: 768)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!436, !415, !859, !1072}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !632, file: !418, line: 49, baseType: !1093, size: 64, offset: 832)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!436, !415, !652, !539, !1096, !539, !484, !484, !652}
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !81, line: 1291, baseType: !80)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !632, file: !418, line: 50, baseType: !1098, size: 64, offset: 896)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!436, !415, !1101, !1102}
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !81, line: 238, baseType: !93)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !632, file: !418, line: 52, baseType: !1104, size: 64, offset: 960)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!436, !415, !1107, !1108}
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !81, line: 612, baseType: !99)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !81, line: 600, baseType: !1110)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !81, line: 592, size: 640, elements: !1111)
!1111 = !{!1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !1110, file: !81, line: 593, baseType: !486, size: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !1110, file: !81, line: 594, baseType: !486, size: 64, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !1110, file: !81, line: 594, baseType: !486, size: 64, offset: 128)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !1110, file: !81, line: 594, baseType: !486, size: 64, offset: 192)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !1110, file: !81, line: 595, baseType: !486, size: 64, offset: 256)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !1110, file: !81, line: 596, baseType: !486, size: 64, offset: 320)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !1110, file: !81, line: 597, baseType: !486, size: 64, offset: 384)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !1110, file: !81, line: 598, baseType: !486, size: 64, offset: 448)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !1110, file: !81, line: 598, baseType: !486, size: 64, offset: 512)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !1110, file: !81, line: 599, baseType: !486, size: 64, offset: 576)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !632, file: !418, line: 53, baseType: !1123, size: 64, offset: 1024)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{!436, !415, !415, !888}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !632, file: !418, line: 54, baseType: !1127, size: 64, offset: 1088)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!436, !415, !652}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !632, file: !418, line: 55, baseType: !649, size: 64, offset: 1152)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !632, file: !418, line: 56, baseType: !1132, size: 64, offset: 1216)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!436, !415, !690, !538}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !632, file: !418, line: 58, baseType: !1136, size: 64, offset: 1280)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!436, !415, !1139}
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !81, line: 424, baseType: !104)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !632, file: !418, line: 59, baseType: !1136, size: 64, offset: 1344)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !632, file: !418, line: 60, baseType: !1142, size: 64, offset: 1408)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{!436, !415, !1145, !600}
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !81, line: 469, baseType: !108)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !632, file: !418, line: 61, baseType: !1147, size: 64, offset: 1472)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{!436, !415}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !632, file: !418, line: 63, baseType: !1151, size: 64, offset: 1536)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{!436, !415, !484, !638, !548, !652, !652}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !632, file: !418, line: 64, baseType: !1155, size: 64, offset: 1600)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{!436, !415, !415, !859, !859, !1072}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !632, file: !418, line: 65, baseType: !1159, size: 64, offset: 1664)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!436, !415, !415, !1072}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !632, file: !418, line: 66, baseType: !1163, size: 64, offset: 1728)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = !DISubroutineType(types: !1165)
!1165 = !{!436, !415, !415, !859, !1072}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !632, file: !418, line: 67, baseType: !1159, size: 64, offset: 1792)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !632, file: !418, line: 69, baseType: !1147, size: 64, offset: 1856)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !632, file: !418, line: 70, baseType: !1155, size: 64, offset: 1920)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !632, file: !418, line: 71, baseType: !1163, size: 64, offset: 1984)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !632, file: !418, line: 72, baseType: !1171, size: 64, offset: 2048)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{!436, !415, !1102}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !632, file: !418, line: 73, baseType: !1147, size: 64, offset: 2112)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !632, file: !418, line: 75, baseType: !1176, size: 64, offset: 2176)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = !DISubroutineType(types: !1178)
!1178 = !{!436, !415, !1179, !1102}
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !81, line: 563, baseType: !139)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !632, file: !418, line: 76, baseType: !649, size: 64, offset: 2240)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !632, file: !418, line: 77, baseType: !649, size: 64, offset: 2304)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !632, file: !418, line: 78, baseType: !1069, size: 64, offset: 2368)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !632, file: !418, line: 79, baseType: !1089, size: 64, offset: 2432)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !632, file: !418, line: 81, baseType: !1185, size: 64, offset: 2496)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = !DISubroutineType(types: !1187)
!1187 = !{!436, !415, !548, !415, !1188}
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !81, line: 285, baseType: !144)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !632, file: !418, line: 82, baseType: !1190, size: 64, offset: 2560)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1191 = !DISubroutineType(types: !1192)
!1192 = !{!436, !415, !484, !1193, !1193, !1101, !1195}
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !859)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !632, file: !418, line: 83, baseType: !1197, size: 64, offset: 2624)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = !DISubroutineType(types: !1199)
!1199 = !{!436, !415, !484, !878, !484}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !632, file: !418, line: 84, baseType: !1201, size: 64, offset: 2688)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = !DISubroutineType(types: !1203)
!1203 = !{!436, !415, !484, !638, !484, !638, !547}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !632, file: !418, line: 85, baseType: !1205, size: 64, offset: 2752)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{!436, !415, !415, !1188}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !632, file: !418, line: 87, baseType: !1209, size: 64, offset: 2816)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64)
!1210 = !DISubroutineType(types: !1211)
!1211 = !{!436, !415, !652, !530}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !632, file: !418, line: 88, baseType: !1213, size: 64, offset: 2880)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1214 = !DISubroutineType(types: !1215)
!1215 = !{!436, !415, !548}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !632, file: !418, line: 89, baseType: !1213, size: 64, offset: 2944)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !632, file: !418, line: 90, baseType: !1218, size: 64, offset: 3008)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64)
!1219 = !DISubroutineType(types: !1220)
!1220 = !{!436, !415, !652, !642}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !632, file: !418, line: 91, baseType: !1151, size: 64, offset: 3072)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !632, file: !418, line: 93, baseType: !1223, size: 64, offset: 3136)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = !DISubroutineType(types: !1225)
!1225 = !{!436, !415, !757}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !632, file: !418, line: 94, baseType: !1227, size: 64, offset: 3200)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{!436, !415, !484, !600, !600, !530, !872, !872, !888}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !632, file: !418, line: 95, baseType: !1227, size: 64, offset: 3264)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !632, file: !418, line: 96, baseType: !1227, size: 64, offset: 3328)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !632, file: !418, line: 97, baseType: !1227, size: 64, offset: 3392)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !632, file: !418, line: 99, baseType: !1234, size: 64, offset: 3456)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64)
!1235 = !DISubroutineType(types: !1236)
!1236 = !{!436, !415, !1237, !1253}
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !789, line: 51, baseType: !1238)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !61, line: 91, size: 384, elements: !1240)
!1240 = !{!1241, !1242, !1243, !1244, !1245, !1249, !1250, !1252}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !1239, file: !61, line: 92, baseType: !484, size: 32)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1239, file: !61, line: 93, baseType: !484, size: 32, offset: 32)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "is", scope: !1239, file: !61, line: 94, baseType: !878, size: 64, offset: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1239, file: !61, line: 95, baseType: !440, size: 64, offset: 128)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !1239, file: !61, line: 96, baseType: !1246, size: 64, offset: 192)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !51, line: 215, baseType: !1248)
!1248 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1239, file: !61, line: 97, baseType: !484, size: 32, offset: 256)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1239, file: !61, line: 98, baseType: !1251, size: 32, offset: 288)
!1251 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !51, line: 213, baseType: !150)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !1239, file: !61, line: 99, baseType: !600, size: 32, offset: 320)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !81, line: 1378, baseType: !1254)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !418, line: 609, size: 6208, elements: !1256)
!1256 = !{!1257, !1258, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1277, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1255, file: !418, line: 610, baseType: !421, size: 4480)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1255, file: !418, line: 610, baseType: !1259, size: 32, offset: 4480)
!1259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 32, elements: !480)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1255, file: !418, line: 611, baseType: !484, size: 32, offset: 4512)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1255, file: !418, line: 611, baseType: !484, size: 32, offset: 4544)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1255, file: !418, line: 611, baseType: !484, size: 32, offset: 4576)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1255, file: !418, line: 612, baseType: !484, size: 32, offset: 4608)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1255, file: !418, line: 613, baseType: !484, size: 32, offset: 4640)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1255, file: !418, line: 614, baseType: !530, size: 64, offset: 4672)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1255, file: !418, line: 615, baseType: !532, size: 64, offset: 4736)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !1255, file: !418, line: 616, baseType: !878, size: 64, offset: 4800)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1255, file: !418, line: 617, baseType: !530, size: 64, offset: 4864)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !1255, file: !418, line: 618, baseType: !1270, size: 64, offset: 4928)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64)
!1271 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !418, line: 602, baseType: !1272)
!1272 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !418, line: 598, size: 128, elements: !1273)
!1273 = !{!1274, !1275, !1276}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1272, file: !418, line: 599, baseType: !484, size: 32)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1272, file: !418, line: 600, baseType: !484, size: 32, offset: 32)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1272, file: !418, line: 601, baseType: !547, size: 64, offset: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !1255, file: !418, line: 619, baseType: !1278, size: 64, offset: 4992)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64)
!1279 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !418, line: 607, baseType: !1280)
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !418, line: 604, size: 128, elements: !1281)
!1281 = !{!1282, !1283}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1280, file: !418, line: 605, baseType: !484, size: 32)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1280, file: !418, line: 606, baseType: !547, size: 64, offset: 64)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !1255, file: !418, line: 620, baseType: !547, size: 64, offset: 5056)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !1255, file: !418, line: 621, baseType: !539, size: 64, offset: 5120)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !1255, file: !418, line: 622, baseType: !539, size: 64, offset: 5184)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !1255, file: !418, line: 623, baseType: !652, size: 64, offset: 5248)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !1255, file: !418, line: 623, baseType: !652, size: 64, offset: 5312)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !1255, file: !418, line: 623, baseType: !652, size: 64, offset: 5376)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !1255, file: !418, line: 624, baseType: !600, size: 32, offset: 5440)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1255, file: !418, line: 625, baseType: !1292, size: 64, offset: 5504)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64)
!1293 = !DISubroutineType(types: !1294)
!1294 = !{!436}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !1255, file: !418, line: 626, baseType: !521, size: 64, offset: 5568)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !1255, file: !418, line: 627, baseType: !652, size: 64, offset: 5632)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1255, file: !418, line: 628, baseType: !484, size: 32, offset: 5696)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !1255, file: !418, line: 629, baseType: !461, size: 64, offset: 5760)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1255, file: !418, line: 630, baseType: !1251, size: 32, offset: 5824)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1255, file: !418, line: 631, baseType: !484, size: 32, offset: 5856)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !1255, file: !418, line: 631, baseType: !484, size: 32, offset: 5888)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1255, file: !418, line: 632, baseType: !600, size: 32, offset: 5920)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !1255, file: !418, line: 633, baseType: !600, size: 32, offset: 5952)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !1255, file: !418, line: 634, baseType: !472, size: 64, offset: 6016)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !1255, file: !418, line: 634, baseType: !521, size: 64, offset: 6080)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !1255, file: !418, line: 635, baseType: !492, size: 64, offset: 6144)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !632, file: !418, line: 100, baseType: !1308, size: 64, offset: 3520)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64)
!1309 = !DISubroutineType(types: !1310)
!1310 = !{!436, !415, !484, !484, !1246, !1311}
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !632, file: !418, line: 101, baseType: !1147, size: 64, offset: 3584)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !632, file: !418, line: 102, baseType: !1314, size: 64, offset: 3648)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64)
!1315 = !DISubroutineType(types: !1316)
!1316 = !{!436, !415, !859, !859, !1102}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !632, file: !418, line: 103, baseType: !635, size: 64, offset: 3712)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !632, file: !418, line: 105, baseType: !1319, size: 64, offset: 3776)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64)
!1320 = !DISubroutineType(types: !1321)
!1321 = !{!436, !415, !859, !859, !1101, !1102}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !632, file: !418, line: 106, baseType: !1147, size: 64, offset: 3840)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !632, file: !418, line: 107, baseType: !1324, size: 64, offset: 3904)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64)
!1325 = !DISubroutineType(types: !1326)
!1326 = !{!436, !415, !448}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !632, file: !418, line: 108, baseType: !1328, size: 64, offset: 3968)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1329, size: 64)
!1329 = !DISubroutineType(types: !1330)
!1330 = !{!436, !415, !1331, !1101, !1102}
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !81, line: 25, baseType: !461)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !632, file: !418, line: 109, baseType: !1292, size: 64, offset: 4032)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !632, file: !418, line: 111, baseType: !1334, size: 64, offset: 4096)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64)
!1335 = !DISubroutineType(types: !1336)
!1336 = !{!436, !415, !415, !415, !539, !415}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !632, file: !418, line: 112, baseType: !1338, size: 64, offset: 4160)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64)
!1339 = !DISubroutineType(types: !1340)
!1340 = !{!436, !415, !415, !415, !415}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !632, file: !418, line: 113, baseType: !1342, size: 64, offset: 4224)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64)
!1343 = !DISubroutineType(types: !1344)
!1344 = !{!436, !415, !788, !788}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !632, file: !418, line: 114, baseType: !635, size: 64, offset: 4288)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !632, file: !418, line: 115, baseType: !1151, size: 64, offset: 4352)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !632, file: !418, line: 117, baseType: !1209, size: 64, offset: 4416)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !632, file: !418, line: 118, baseType: !1209, size: 64, offset: 4480)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !632, file: !418, line: 119, baseType: !1328, size: 64, offset: 4544)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !632, file: !418, line: 120, baseType: !1351, size: 64, offset: 4608)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64)
!1352 = !DISubroutineType(types: !1353)
!1353 = !{!436, !415, !1354, !888}
!1354 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !81, line: 1675, baseType: !154)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !632, file: !418, line: 121, baseType: !1292, size: 64, offset: 4672)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !632, file: !418, line: 123, baseType: !1357, size: 64, offset: 4736)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64)
!1358 = !DISubroutineType(types: !1359)
!1359 = !{!436, !415, !484, !521}
