; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/gs/gssecant.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/gs/gssecant.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 238, baseType: !26, size: 32, elements: !27)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsnes.h", directory: "/home/users/ndemeye/xSDK")
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44}
!28 = !DIEnumerator(name: "SNES_CONVERGED_FNORM_ABS", value: 2)
!29 = !DIEnumerator(name: "SNES_CONVERGED_FNORM_RELATIVE", value: 3)
!30 = !DIEnumerator(name: "SNES_CONVERGED_SNORM_RELATIVE", value: 4)
!31 = !DIEnumerator(name: "SNES_CONVERGED_ITS", value: 5)
!32 = !DIEnumerator(name: "SNES_DIVERGED_FUNCTION_DOMAIN", value: -1)
!33 = !DIEnumerator(name: "SNES_DIVERGED_FUNCTION_COUNT", value: -2)
!34 = !DIEnumerator(name: "SNES_DIVERGED_LINEAR_SOLVE", value: -3)
!35 = !DIEnumerator(name: "SNES_DIVERGED_FNORM_NAN", value: -4)
!36 = !DIEnumerator(name: "SNES_DIVERGED_MAX_IT", value: -5)
!37 = !DIEnumerator(name: "SNES_DIVERGED_LINE_SEARCH", value: -6)
!38 = !DIEnumerator(name: "SNES_DIVERGED_INNER", value: -7)
!39 = !DIEnumerator(name: "SNES_DIVERGED_LOCAL_MIN", value: -8)
!40 = !DIEnumerator(name: "SNES_DIVERGED_DTOL", value: -9)
!41 = !DIEnumerator(name: "SNES_DIVERGED_JACOBIAN_DOMAIN", value: -10)
!42 = !DIEnumerator(name: "SNES_DIVERGED_TR_DELTA", value: -11)
!43 = !DIEnumerator(name: "SNES_CONVERGED_TR_DELTA", value: -11)
!44 = !DIEnumerator(name: "SNES_CONVERGED_ITERATING", value: 0)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !46, line: 85, baseType: !26, size: 32, elements: !47)
!46 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpctypes.h", directory: "/home/users/ndemeye/xSDK")
!47 = !{!48, !49, !50, !51}
!48 = !DIEnumerator(name: "PC_SIDE_DEFAULT", value: -1)
!49 = !DIEnumerator(name: "PC_LEFT", value: 0)
!50 = !DIEnumerator(name: "PC_RIGHT", value: 1)
!51 = !DIEnumerator(name: "PC_SYMMETRIC", value: 2)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !53, line: 285, baseType: !5, size: 32, elements: !54)
!53 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!54 = !{!55, !56, !57, !58}
!55 = !DIEnumerator(name: "DIFFERENT_NONZERO_PATTERN", value: 0, isUnsigned: true)
!56 = !DIEnumerator(name: "SUBSET_NONZERO_PATTERN", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 406, baseType: !26, size: 32, elements: !60)
!60 = !{!61, !62, !63, !64, !65, !66}
!61 = !DIEnumerator(name: "SNES_NORM_DEFAULT", value: -1)
!62 = !DIEnumerator(name: "SNES_NORM_NONE", value: 0)
!63 = !DIEnumerator(name: "SNES_NORM_ALWAYS", value: 1)
!64 = !DIEnumerator(name: "SNES_NORM_INITIAL_ONLY", value: 2)
!65 = !DIEnumerator(name: "SNES_NORM_FINAL_ONLY", value: 3)
!66 = !DIEnumerator(name: "SNES_NORM_INITIAL_FINAL_ONLY", value: 4)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 493, baseType: !26, size: 32, elements: !68)
!68 = !{!69, !70, !71}
!69 = !DIEnumerator(name: "SNES_FUNCTION_DEFAULT", value: -1)
!70 = !DIEnumerator(name: "SNES_FUNCTION_UNPRECONDITIONED", value: 0)
!71 = !DIEnumerator(name: "SNES_FUNCTION_PRECONDITIONED", value: 1)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !73, line: 663, baseType: !5, size: 32, elements: !74)
!73 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!74 = !{!75, !76, !77}
!75 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !79, line: 213, baseType: !5, size: 32, elements: !80)
!79 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscis.h", directory: "/home/users/ndemeye/xSDK")
!80 = !{!81, !82}
!81 = !DIEnumerator(name: "IS_COLORING_GLOBAL", value: 0, isUnsigned: true)
!82 = !DIEnumerator(name: "IS_COLORING_LOCAL", value: 1, isUnsigned: true)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 327, baseType: !5, size: 32, elements: !84)
!84 = !{!85, !86, !87}
!85 = !DIEnumerator(name: "PETSC_COPY_VALUES", value: 0, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_OWN_POINTER", value: 1, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_USE_POINTER", value: 2, isUnsigned: true)
!88 = !{!89, !110, !114, !115, !188, !314, !317, !198, !26, !150, !5}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES_NGS", file: !91, line: 16, baseType: !92)
!91 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/snes/impls/gs/gsimpl.h", directory: "/home/users/ndemeye/xSDK")
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 7, size: 448, elements: !93)
!93 = !{!94, !96, !97, !100, !101, !102, !103, !105}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "sweeps", scope: !92, file: !91, line: 8, baseType: !95, size: 32)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !92, file: !91, line: 9, baseType: !95, size: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !92, file: !91, line: 10, baseType: !98, size: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !99)
!99 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !92, file: !91, line: 11, baseType: !98, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "stol", scope: !92, file: !91, line: 12, baseType: !98, size: 64, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !92, file: !91, line: 13, baseType: !98, size: 64, offset: 256)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "secant_mat", scope: !92, file: !91, line: 14, baseType: !104, size: 32, offset: 320)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "coloring", scope: !92, file: !91, line: 15, baseType: !106, size: 64, offset: 384)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !107, line: 51, baseType: !108)
!107 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !107, line: 51, flags: DIFlagFwdDecl)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !111, line: 330, baseType: !112)
!111 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !111, line: 330, flags: DIFlagFwdDecl)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !118, line: 73, size: 4480, elements: !119)
!118 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!119 = !{!120, !122, !171, !172, !173, !175, !176, !177, !178, !186, !187, !189, !193, !197, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !210, !211, !212, !214, !215, !217, !219, !220, !221, !222, !223, !225, !227, !228, !229, !230, !231, !234, !236, !237, !238, !248, !250, !251, !255, !256, !304, !309, !311, !312, !313}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !117, file: !118, line: 74, baseType: !121, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !117, file: !118, line: 75, baseType: !123, size: 448, offset: 64)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 448, elements: !169)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !118, line: 53, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !118, line: 45, size: 448, elements: !126)
!126 = !{!127, !133, !141, !146, !153, !157, !164}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !125, file: !118, line: 46, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!131, !115, !132}
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !125, file: !118, line: 47, baseType: !134, size: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!131, !115, !137}
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !138, line: 16, baseType: !139)
!138 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !138, line: 16, flags: DIFlagFwdDecl)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !125, file: !118, line: 48, baseType: !142, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!131, !145}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !125, file: !118, line: 49, baseType: !147, size: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!131, !115, !150, !115}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!152 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !125, file: !118, line: 50, baseType: !154, size: 64, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!131, !115, !150, !145}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !125, file: !118, line: 51, baseType: !158, size: 64, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!131, !115, !150, !161}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{null}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !125, file: !118, line: 52, baseType: !165, size: 64, offset: 384)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!131, !115, !150, !168}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!169 = !{!170}
!170 = !DISubrange(count: 1)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !117, file: !118, line: 76, baseType: !110, size: 64, offset: 512)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !117, file: !118, line: 77, baseType: !95, size: 32, offset: 576)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !117, file: !118, line: 78, baseType: !174, size: 64, offset: 640)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !99)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !117, file: !118, line: 78, baseType: !174, size: 64, offset: 704)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !117, file: !118, line: 78, baseType: !174, size: 64, offset: 768)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !117, file: !118, line: 78, baseType: !174, size: 64, offset: 832)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !117, file: !118, line: 79, baseType: !179, size: 64, offset: 896)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !181)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !182, line: 27, baseType: !183)
!182 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !184, line: 43, baseType: !185)
!184 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!185 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !117, file: !118, line: 80, baseType: !95, size: 32, offset: 960)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !117, file: !118, line: 81, baseType: !188, size: 32, offset: 992)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !117, file: !118, line: 82, baseType: !190, size: 64, offset: 1024)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !117, file: !118, line: 83, baseType: !194, size: 64, offset: 1088)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !117, file: !118, line: 84, baseType: !198, size: 64, offset: 1152)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !117, file: !118, line: 85, baseType: !198, size: 64, offset: 1216)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !117, file: !118, line: 86, baseType: !198, size: 64, offset: 1280)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !117, file: !118, line: 87, baseType: !198, size: 64, offset: 1344)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !117, file: !118, line: 88, baseType: !115, size: 64, offset: 1408)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !117, file: !118, line: 89, baseType: !179, size: 64, offset: 1472)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !117, file: !118, line: 90, baseType: !198, size: 64, offset: 1536)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !117, file: !118, line: 91, baseType: !198, size: 64, offset: 1600)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !117, file: !118, line: 92, baseType: !95, size: 32, offset: 1664)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !117, file: !118, line: 93, baseType: !114, size: 64, offset: 1728)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !117, file: !118, line: 94, baseType: !209, size: 64, offset: 1792)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !180)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !117, file: !118, line: 95, baseType: !95, size: 32, offset: 1856)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !117, file: !118, line: 95, baseType: !95, size: 32, offset: 1888)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !117, file: !118, line: 96, baseType: !213, size: 64, offset: 1920)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !117, file: !118, line: 96, baseType: !213, size: 64, offset: 1984)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !117, file: !118, line: 97, baseType: !216, size: 64, offset: 2048)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !117, file: !118, line: 97, baseType: !218, size: 64, offset: 2112)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !117, file: !118, line: 98, baseType: !95, size: 32, offset: 2176)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !117, file: !118, line: 98, baseType: !95, size: 32, offset: 2208)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !117, file: !118, line: 99, baseType: !213, size: 64, offset: 2240)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !117, file: !118, line: 99, baseType: !213, size: 64, offset: 2304)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !117, file: !118, line: 100, baseType: !224, size: 64, offset: 2368)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !117, file: !118, line: 100, baseType: !226, size: 64, offset: 2432)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !117, file: !118, line: 101, baseType: !95, size: 32, offset: 2496)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !117, file: !118, line: 101, baseType: !95, size: 32, offset: 2528)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !117, file: !118, line: 102, baseType: !213, size: 64, offset: 2560)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !117, file: !118, line: 102, baseType: !213, size: 64, offset: 2624)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !117, file: !118, line: 103, baseType: !232, size: 64, offset: 2688)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !98)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !117, file: !118, line: 103, baseType: !235, size: 64, offset: 2752)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !117, file: !118, line: 104, baseType: !168, size: 64, offset: 2816)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !117, file: !118, line: 105, baseType: !95, size: 32, offset: 2880)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !117, file: !118, line: 106, baseType: !239, size: 128, offset: 2944)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 128, elements: !246)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !118, line: 64, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !118, line: 61, size: 128, elements: !243)
!243 = !{!244, !245}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !242, file: !118, line: 62, baseType: !161, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !242, file: !118, line: 63, baseType: !114, size: 64, offset: 64)
!246 = !{!247}
!247 = !DISubrange(count: 2)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !117, file: !118, line: 107, baseType: !249, size: 64, offset: 3072)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 64, elements: !246)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !117, file: !118, line: 108, baseType: !114, size: 64, offset: 3136)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !117, file: !118, line: 109, baseType: !252, size: 64, offset: 3200)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!131, !114}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !117, file: !118, line: 111, baseType: !95, size: 32, offset: 3264)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !117, file: !118, line: 112, baseType: !257, size: 320, offset: 3328)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, size: 320, elements: !302)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{!131, !261, !115, !114}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !264)
!264 = !{!265, !266, !290, !291, !292, !293, !294, !295, !296, !297, !298}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !263, file: !10, line: 100, baseType: !95, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !263, file: !10, line: 101, baseType: !267, size: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !270)
!270 = !{!271, !272, !273, !274, !275, !278, !279, !280, !284, !285, !287, !288, !289}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !269, file: !10, line: 84, baseType: !198, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !269, file: !10, line: 85, baseType: !198, size: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !269, file: !10, line: 86, baseType: !114, size: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !269, file: !10, line: 87, baseType: !190, size: 64, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !269, file: !10, line: 88, baseType: !276, size: 64, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !269, file: !10, line: 89, baseType: !152, size: 8, offset: 320)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !269, file: !10, line: 90, baseType: !198, size: 64, offset: 384)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !269, file: !10, line: 91, baseType: !281, size: 64, offset: 448)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !282, line: 46, baseType: !283)
!282 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!283 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !269, file: !10, line: 92, baseType: !104, size: 32, offset: 512)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !269, file: !10, line: 93, baseType: !286, size: 32, offset: 544)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !269, file: !10, line: 94, baseType: !267, size: 64, offset: 576)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !269, file: !10, line: 95, baseType: !198, size: 64, offset: 640)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !269, file: !10, line: 96, baseType: !114, size: 64, offset: 704)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !263, file: !10, line: 102, baseType: !198, size: 64, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !263, file: !10, line: 102, baseType: !198, size: 64, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !263, file: !10, line: 103, baseType: !198, size: 64, offset: 256)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !263, file: !10, line: 104, baseType: !110, size: 64, offset: 320)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !263, file: !10, line: 105, baseType: !104, size: 32, offset: 384)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !263, file: !10, line: 105, baseType: !104, size: 32, offset: 416)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !263, file: !10, line: 105, baseType: !104, size: 32, offset: 448)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !263, file: !10, line: 106, baseType: !115, size: 64, offset: 512)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !263, file: !10, line: 107, baseType: !299, size: 64, offset: 576)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!302 = !{!303}
!303 = !DISubrange(count: 5)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !117, file: !118, line: 113, baseType: !305, size: 320, offset: 3648)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !306, size: 320, elements: !302)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!131, !115, !114}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !117, file: !118, line: 114, baseType: !310, size: 320, offset: 3968)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 320, elements: !302)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !117, file: !118, line: 115, baseType: !104, size: 32, offset: 4288)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !117, file: !118, line: 120, baseType: !299, size: 64, offset: 4352)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !117, file: !118, line: 121, baseType: !104, size: 32, offset: 4416)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !111, line: 331, baseType: !315)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !111, line: 331, flags: DIFlagFwdDecl)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !111, line: 338, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !111, line: 338, flags: DIFlagFwdDecl)
!320 = !{i32 7, !"Dwarf Version", i32 4}
!321 = !{i32 2, !"Debug Info Version", i32 3}
!322 = !{i32 1, !"wchar_size", i32 4}
!323 = !{i32 7, !"PIC Level", i32 2}
!324 = !{i32 7, !"uwtable", i32 1}
!325 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!326 = distinct !DISubprogram(name: "SNESComputeNGSDefaultSecant", scope: !327, file: !327, line: 3, type: !328, scopeLine: 4, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !518)
!327 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/snes/impls/gs/gssecant.c", directory: "/home/users/ndemeye/xSDK")
!328 = !DISubroutineType(types: !329)
!329 = !{!131, !330, !345, !345, !114}
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !25, line: 18, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !333, line: 38, size: 11648, elements: !334)
!333 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/snesimpl.h", directory: "/home/users/ndemeye/xSDK")
!334 = !{!335, !337, !402, !407, !408, !409, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !425, !429, !430, !432, !433, !434, !435, !436, !441, !443, !444, !445, !446, !447, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !483, !485, !486, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !332, file: !333, line: 39, baseType: !336, size: 4480)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !118, line: 122, baseType: !117)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !332, file: !333, line: 39, baseType: !338, size: 1088, offset: 4480)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 1088, elements: !169)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SNESOps", file: !333, line: 12, size: 1088, elements: !340)
!340 = !{!341, !349, !353, !357, !363, !364, !368, !369, !373, !377, !378, !379, !384, !388, !392, !394, !401}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "computeinitialguess", scope: !339, file: !333, line: 13, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!131, !330, !345, !114}
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !346, line: 21, baseType: !347)
!346 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !346, line: 21, flags: DIFlagFwdDecl)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "computescaling", scope: !339, file: !333, line: 14, baseType: !350, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!131, !345, !345, !114}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !339, file: !333, line: 15, baseType: !354, size: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!131, !330, !95}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !339, file: !333, line: 16, baseType: !358, size: 64, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!131, !330, !95, !98, !98, !98, !361, !114}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESConvergedReason", file: !25, line: 257, baseType: !24)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !339, file: !333, line: 17, baseType: !252, size: 64, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !339, file: !333, line: 18, baseType: !365, size: 64, offset: 320)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!131, !330}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !339, file: !333, line: 19, baseType: !365, size: 64, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !339, file: !333, line: 20, baseType: !370, size: 64, offset: 448)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!131, !330, !137}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !339, file: !333, line: 21, baseType: !374, size: 64, offset: 512)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!131, !261, !330}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !339, file: !333, line: 22, baseType: !365, size: 64, offset: 576)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !339, file: !333, line: 23, baseType: !365, size: 64, offset: 640)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "usercompute", scope: !339, file: !333, line: 24, baseType: !380, size: 64, offset: 704)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!131, !330, !383}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "userdestroy", scope: !339, file: !333, line: 25, baseType: !385, size: 64, offset: 768)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!131, !383}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !339, file: !333, line: 26, baseType: !389, size: 64, offset: 832)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!131, !330, !345, !345}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "computepfunction", scope: !339, file: !333, line: 27, baseType: !393, size: 64, offset: 896)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "computepjacobian", scope: !339, file: !333, line: 28, baseType: !395, size: 64, offset: 960)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!131, !330, !345, !398, !398, !114}
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !53, line: 16, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !53, line: 16, flags: DIFlagFwdDecl)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !339, file: !333, line: 29, baseType: !370, size: 64, offset: 1024)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !332, file: !333, line: 40, baseType: !403, size: 64, offset: 5568)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !404, line: 14, baseType: !405)
!404 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !404, line: 14, flags: DIFlagFwdDecl)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !332, file: !333, line: 41, baseType: !104, size: 32, offset: 5632)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "npc", scope: !332, file: !333, line: 42, baseType: !330, size: 64, offset: 5696)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "npcside", scope: !332, file: !333, line: 43, baseType: !410, size: 32, offset: 5760)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !46, line: 85, baseType: !45)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "usesnpc", scope: !332, file: !333, line: 44, baseType: !104, size: 32, offset: 5792)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !332, file: !333, line: 47, baseType: !114, size: 64, offset: 5824)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !332, file: !333, line: 49, baseType: !345, size: 64, offset: 5888)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !332, file: !333, line: 50, baseType: !345, size: 64, offset: 5952)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !332, file: !333, line: 52, baseType: !345, size: 64, offset: 6016)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !332, file: !333, line: 54, baseType: !398, size: 64, offset: 6080)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !332, file: !333, line: 55, baseType: !398, size: 64, offset: 6144)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "picard", scope: !332, file: !333, line: 56, baseType: !398, size: 64, offset: 6208)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "initialguessP", scope: !332, file: !333, line: 57, baseType: !114, size: 64, offset: 6272)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !332, file: !333, line: 58, baseType: !421, size: 64, offset: 6336)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !422, line: 22, baseType: !423)
!422 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !422, line: 22, flags: DIFlagFwdDecl)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !332, file: !333, line: 59, baseType: !426, size: 64, offset: 6400)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearch", file: !25, line: 526, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_LineSearch", file: !25, line: 526, flags: DIFlagFwdDecl)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "usesksp", scope: !332, file: !333, line: 60, baseType: !104, size: 32, offset: 6464)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "matstruct", scope: !332, file: !333, line: 61, baseType: !431, size: 32, offset: 6496)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !53, line: 285, baseType: !52)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_update", scope: !332, file: !333, line: 63, baseType: !345, size: 64, offset: 6528)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "scaling", scope: !332, file: !333, line: 65, baseType: !345, size: 64, offset: 6592)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "scaP", scope: !332, file: !333, line: 66, baseType: !114, size: 64, offset: 6656)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !332, file: !333, line: 68, baseType: !98, size: 64, offset: 6720)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !332, file: !333, line: 74, baseType: !437, size: 320, offset: 6784)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !438, size: 320, elements: !302)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!131, !330, !95, !98, !114}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !332, file: !333, line: 75, baseType: !442, size: 320, offset: 7104)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 320, elements: !302)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !332, file: !333, line: 76, baseType: !310, size: 320, offset: 7424)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !332, file: !333, line: 77, baseType: !95, size: 32, offset: 7744)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !332, file: !333, line: 78, baseType: !114, size: 64, offset: 7808)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !332, file: !333, line: 79, baseType: !362, size: 32, offset: 7872)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !332, file: !333, line: 80, baseType: !448, size: 320, offset: 7936)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !449, size: 320, elements: !302)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!131, !330, !114}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !332, file: !333, line: 81, baseType: !442, size: 320, offset: 8256)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !332, file: !333, line: 82, baseType: !310, size: 320, offset: 8576)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !332, file: !333, line: 83, baseType: !95, size: 32, offset: 8896)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !332, file: !333, line: 84, baseType: !104, size: 32, offset: 8928)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !332, file: !333, line: 88, baseType: !104, size: 32, offset: 8960)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !332, file: !333, line: 89, baseType: !114, size: 64, offset: 9024)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !332, file: !333, line: 93, baseType: !95, size: 32, offset: 9088)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !332, file: !333, line: 94, baseType: !95, size: 32, offset: 9120)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !332, file: !333, line: 95, baseType: !95, size: 32, offset: 9152)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !332, file: !333, line: 96, baseType: !95, size: 32, offset: 9184)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "linear_its", scope: !332, file: !333, line: 97, baseType: !95, size: 32, offset: 9216)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !332, file: !333, line: 98, baseType: !98, size: 64, offset: 9280)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !332, file: !333, line: 99, baseType: !98, size: 64, offset: 9344)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !332, file: !333, line: 100, baseType: !98, size: 64, offset: 9408)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !332, file: !333, line: 101, baseType: !98, size: 64, offset: 9472)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !332, file: !333, line: 102, baseType: !98, size: 64, offset: 9536)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !332, file: !333, line: 103, baseType: !98, size: 64, offset: 9600)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "stol", scope: !332, file: !333, line: 104, baseType: !98, size: 64, offset: 9664)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "deltatol", scope: !332, file: !333, line: 105, baseType: !98, size: 64, offset: 9728)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "forceiteration", scope: !332, file: !333, line: 106, baseType: !104, size: 32, offset: 9792)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "lagpreconditioner", scope: !332, file: !333, line: 107, baseType: !95, size: 32, offset: 9824)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "lagjacobian", scope: !332, file: !333, line: 108, baseType: !95, size: 32, offset: 9856)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "jac_iter", scope: !332, file: !333, line: 109, baseType: !95, size: 32, offset: 9888)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "lagjac_persist", scope: !332, file: !333, line: 110, baseType: !104, size: 32, offset: 9920)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "pre_iter", scope: !332, file: !333, line: 111, baseType: !95, size: 32, offset: 9952)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "lagpre_persist", scope: !332, file: !333, line: 112, baseType: !104, size: 32, offset: 9984)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "gridsequence", scope: !332, file: !333, line: 113, baseType: !95, size: 32, offset: 10016)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "tolerancesset", scope: !332, file: !333, line: 115, baseType: !104, size: 32, offset: 10048)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_init_set", scope: !332, file: !333, line: 117, baseType: !104, size: 32, offset: 10080)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "normschedule", scope: !332, file: !333, line: 119, baseType: !482, size: 32, offset: 10112)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESNormSchedule", file: !25, line: 411, baseType: !59)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !332, file: !333, line: 120, baseType: !484, size: 32, offset: 10144)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESFunctionType", file: !25, line: 495, baseType: !67)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !332, file: !333, line: 124, baseType: !95, size: 32, offset: 10176)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !332, file: !333, line: 125, baseType: !487, size: 64, offset: 10240)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !332, file: !333, line: 129, baseType: !95, size: 32, offset: 10304)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist", scope: !332, file: !333, line: 130, baseType: !224, size: 64, offset: 10368)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_its", scope: !332, file: !333, line: 132, baseType: !216, size: 64, offset: 10432)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_len", scope: !332, file: !333, line: 133, baseType: !95, size: 32, offset: 10496)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_max", scope: !332, file: !333, line: 134, baseType: !95, size: 32, offset: 10528)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_reset", scope: !332, file: !333, line: 135, baseType: !104, size: 32, offset: 10560)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_alloc", scope: !332, file: !333, line: 136, baseType: !104, size: 32, offset: 10592)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "counters_reset", scope: !332, file: !333, line: 137, baseType: !104, size: 32, offset: 10624)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "numFailures", scope: !332, file: !333, line: 140, baseType: !95, size: 32, offset: 10656)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "maxFailures", scope: !332, file: !333, line: 141, baseType: !95, size: 32, offset: 10688)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "numLinearSolveFailures", scope: !332, file: !333, line: 143, baseType: !95, size: 32, offset: 10720)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "maxLinearSolveFailures", scope: !332, file: !333, line: 144, baseType: !95, size: 32, offset: 10752)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "domainerror", scope: !332, file: !333, line: 146, baseType: !104, size: 32, offset: 10784)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "jacobiandomainerror", scope: !332, file: !333, line: 147, baseType: !104, size: 32, offset: 10816)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "checkjacdomainerror", scope: !332, file: !333, line: 148, baseType: !104, size: 32, offset: 10848)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_ewconv", scope: !332, file: !333, line: 150, baseType: !104, size: 32, offset: 10880)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "kspconvctx", scope: !332, file: !333, line: 151, baseType: !114, size: 64, offset: 10944)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !332, file: !333, line: 154, baseType: !98, size: 64, offset: 11008)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !332, file: !333, line: 155, baseType: !98, size: 64, offset: 11072)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "vwork", scope: !332, file: !333, line: 157, baseType: !487, size: 64, offset: 11136)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "nvwork", scope: !332, file: !333, line: 158, baseType: !95, size: 32, offset: 11200)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !332, file: !333, line: 160, baseType: !104, size: 32, offset: 11232)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "mf_operator", scope: !332, file: !333, line: 161, baseType: !104, size: 32, offset: 11264)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "mf_version", scope: !332, file: !333, line: 162, baseType: !95, size: 32, offset: 11296)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "vizerotolerance", scope: !332, file: !333, line: 164, baseType: !98, size: 64, offset: 11328)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "xl", scope: !332, file: !333, line: 165, baseType: !345, size: 64, offset: 11392)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "xu", scope: !332, file: !333, line: 165, baseType: !345, size: 64, offset: 11456)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ntruebounds", scope: !332, file: !333, line: 166, baseType: !95, size: 32, offset: 11520)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "usersetbounds", scope: !332, file: !333, line: 167, baseType: !104, size: 32, offset: 11552)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "alwayscomputesfinalresidual", scope: !332, file: !333, line: 169, baseType: !104, size: 32, offset: 11584)
!518 = !{!519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !536, !537, !538, !539, !540, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !574, !575, !579, !581, !583, !585, !587, !591, !595, !600, !602, !604, !606, !608, !610, !612, !614, !618, !621, !623, !625, !629, !634, !636, !638, !640, !642, !644, !646, !648, !652, !657, !659, !661, !663, !665, !667, !669, !671, !675, !679, !680, !682, !688, !689, !691, !694, !695, !697, !700, !701, !705, !707, !709, !713, !717, !719}
!519 = !DILocalVariable(name: "snes", arg: 1, scope: !326, file: !327, line: 3, type: !330)
!520 = !DILocalVariable(name: "X", arg: 2, scope: !326, file: !327, line: 3, type: !345)
!521 = !DILocalVariable(name: "B", arg: 3, scope: !326, file: !327, line: 3, type: !345)
!522 = !DILocalVariable(name: "ctx", arg: 4, scope: !326, file: !327, line: 3, type: !114)
!523 = !DILocalVariable(name: "ierr", scope: !326, file: !327, line: 5, type: !131)
!524 = !DILocalVariable(name: "gs", scope: !326, file: !327, line: 6, type: !89)
!525 = !DILocalVariable(name: "i", scope: !326, file: !327, line: 7, type: !95)
!526 = !DILocalVariable(name: "j", scope: !326, file: !327, line: 7, type: !95)
!527 = !DILocalVariable(name: "k", scope: !326, file: !327, line: 7, type: !95)
!528 = !DILocalVariable(name: "ncolors", scope: !326, file: !327, line: 7, type: !95)
!529 = !DILocalVariable(name: "dm", scope: !326, file: !327, line: 8, type: !403)
!530 = !DILocalVariable(name: "flg", scope: !326, file: !327, line: 9, type: !104)
!531 = !DILocalVariable(name: "coloring", scope: !326, file: !327, line: 10, type: !106)
!532 = !DILocalVariable(name: "mc", scope: !326, file: !327, line: 11, type: !533)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatColoring", file: !53, line: 1312, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatColoring", file: !53, line: 1312, flags: DIFlagFwdDecl)
!536 = !DILocalVariable(name: "W", scope: !326, file: !327, line: 12, type: !345)
!537 = !DILocalVariable(name: "G", scope: !326, file: !327, line: 12, type: !345)
!538 = !DILocalVariable(name: "F", scope: !326, file: !327, line: 12, type: !345)
!539 = !DILocalVariable(name: "h", scope: !326, file: !327, line: 13, type: !233)
!540 = !DILocalVariable(name: "coloris", scope: !326, file: !327, line: 14, type: !541)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !107, line: 11, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !107, line: 11, flags: DIFlagFwdDecl)
!545 = !DILocalVariable(name: "f", scope: !326, file: !327, line: 15, type: !233)
!546 = !DILocalVariable(name: "g", scope: !326, file: !327, line: 15, type: !233)
!547 = !DILocalVariable(name: "x", scope: !326, file: !327, line: 15, type: !233)
!548 = !DILocalVariable(name: "w", scope: !326, file: !327, line: 15, type: !233)
!549 = !DILocalVariable(name: "d", scope: !326, file: !327, line: 15, type: !233)
!550 = !DILocalVariable(name: "dxt", scope: !326, file: !327, line: 16, type: !98)
!551 = !DILocalVariable(name: "xt", scope: !326, file: !327, line: 16, type: !98)
!552 = !DILocalVariable(name: "ft", scope: !326, file: !327, line: 16, type: !98)
!553 = !DILocalVariable(name: "ft1", scope: !326, file: !327, line: 16, type: !98)
!554 = !DILocalVariable(name: "idx", scope: !326, file: !327, line: 17, type: !555)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
