; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/fileio/ftn-custom/zmprintf.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/fileio/ftn-custom/zmprintf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque

@PETSC_STDOUT = external local_unnamed_addr global %struct._IO_FILE*, align 8
@PETSC_NULL_CHARACTER_Fortran = external local_unnamed_addr global i8*, align 8
@__func__.petscfprintf_ = private unnamed_addr constant [14 x i8] c"petscfprintf_\00", align 1
@.str = private unnamed_addr constant [90 x i8] c"/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/fileio/ftn-custom/zmprintf.c\00", align 1
@PetscTrFree = external local_unnamed_addr global i32 (i8*, i32, i8*, i8*)*, align 8
@__func__.petscprintf_ = private unnamed_addr constant [13 x i8] c"petscprintf_\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !15, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/sys/fileio/ftn-custom/zmprintf.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 170, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 663, baseType: !5, size: 32, elements: !11)
!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!15 = !{!16, !19, !20, !22, !21, !26}
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !17, line: 46, baseType: !18)
!17 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!18 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !23, line: 330, baseType: !24)
!23 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !23, line: 330, flags: DIFlagFwdDecl)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!28 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!29 = !{i32 7, !"Dwarf Version", i32 4}
!30 = !{i32 2, !"Debug Info Version", i32 3}
!31 = !{i32 1, !"wchar_size", i32 4}
!32 = !{i32 7, !"PIC Level", i32 2}
!33 = !{i32 7, !"uwtable", i32 1}
!34 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!35 = distinct !DISubprogram(name: "petscsynchronizedflush_", scope: !36, file: !36, line: 21, type: !37, scopeLine: 22, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !97)
!36 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/sys/fileio/ftn-custom/zmprintf.c", directory: "/home/users/ndemeye/xSDK")
!37 = !DISubroutineType(types: !38)
!38 = !{null, !20, !39, !20}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !42, line: 7, baseType: !43)
!42 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !44, line: 245, size: 1728, elements: !45)
!44 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/libio.h", directory: "")
!45 = !{!46, !47, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !67, !68, !69, !70, !74, !76, !78, !82, !85, !87, !88, !89, !90, !91, !92, !93}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !43, file: !44, line: 246, baseType: !21, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !43, file: !44, line: 251, baseType: !48, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !43, file: !44, line: 252, baseType: !48, size: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !43, file: !44, line: 253, baseType: !48, size: 64, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !43, file: !44, line: 254, baseType: !48, size: 64, offset: 256)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !43, file: !44, line: 255, baseType: !48, size: 64, offset: 320)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !43, file: !44, line: 256, baseType: !48, size: 64, offset: 384)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !43, file: !44, line: 257, baseType: !48, size: 64, offset: 448)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !43, file: !44, line: 258, baseType: !48, size: 64, offset: 512)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !43, file: !44, line: 260, baseType: !48, size: 64, offset: 576)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !43, file: !44, line: 261, baseType: !48, size: 64, offset: 640)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !43, file: !44, line: 262, baseType: !48, size: 64, offset: 704)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !43, file: !44, line: 264, baseType: !60, size: 64, offset: 768)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !44, line: 160, size: 192, elements: !62)
!62 = !{!63, !64, !66}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !61, file: !44, line: 161, baseType: !60, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !61, file: !44, line: 162, baseType: !65, size: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !61, file: !44, line: 166, baseType: !21, size: 32, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !43, file: !44, line: 266, baseType: !65, size: 64, offset: 832)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !43, file: !44, line: 268, baseType: !21, size: 32, offset: 896)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !43, file: !44, line: 272, baseType: !21, size: 32, offset: 928)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !43, file: !44, line: 274, baseType: !71, size: 64, offset: 960)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !72, line: 140, baseType: !73)
!72 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!73 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !43, file: !44, line: 278, baseType: !75, size: 16, offset: 1024)
!75 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !43, file: !44, line: 279, baseType: !77, size: 8, offset: 1040)
!77 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !43, file: !44, line: 280, baseType: !79, size: 8, offset: 1048)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 8, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 1)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !43, file: !44, line: 284, baseType: !83, size: 64, offset: 1088)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !44, line: 154, baseType: null)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !43, file: !44, line: 293, baseType: !86, size: 64, offset: 1152)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !72, line: 141, baseType: !73)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !43, file: !44, line: 301, baseType: !19, size: 64, offset: 1216)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !43, file: !44, line: 302, baseType: !19, size: 64, offset: 1280)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !43, file: !44, line: 303, baseType: !19, size: 64, offset: 1344)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !43, file: !44, line: 304, baseType: !19, size: 64, offset: 1408)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !43, file: !44, line: 306, baseType: !16, size: 64, offset: 1472)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !43, file: !44, line: 307, baseType: !21, size: 32, offset: 1536)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !43, file: !44, line: 309, baseType: !94, size: 160, offset: 1568)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 160, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 20)
!97 = !{!98, !99, !100, !101}
!98 = !DILocalVariable(name: "comm", arg: 1, scope: !35, file: !36, line: 21, type: !20)
!99 = !DILocalVariable(name: "file", arg: 2, scope: !35, file: !36, line: 21, type: !39)
!100 = !DILocalVariable(name: "ierr", arg: 3, scope: !35, file: !36, line: 21, type: !20)
!101 = !DILocalVariable(name: "f", scope: !35, file: !36, line: 23, type: !40)
!102 = !DILocation(line: 0, scope: !35)
!103 = !DILocation(line: 23, column: 13, scope: !35)
!104 = !{!105, !105, i64 0}
!105 = !{!"any pointer", !106, i64 0}
!106 = !{!"omnipotent char", !107, i64 0}
!107 = !{!"Simple C/C++ TBAA"}
!108 = !DILocation(line: 24, column: 8, scope: !109)
!109 = distinct !DILexicalBlock(scope: !35, file: !36, line: 24, column: 7)
!110 = !DILocation(line: 24, column: 7, scope: !35)
!111 = !DILocation(line: 25, column: 48, scope: !35)
!112 = !{!113, !113, i64 0}
!113 = !{!"int", !106, i64 0}
!114 = !DILocation(line: 25, column: 34, scope: !35)
!115 = !DILocation(line: 25, column: 11, scope: !35)
!116 = !DILocation(line: 25, column: 9, scope: !35)
!117 = !DILocation(line: 26, column: 1, scope: !35)
!118 = !DISubprogram(name: "PetscSynchronizedFlush", scope: !119, file: !119, line: 1679, type: !120, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !122)
!119 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!120 = !DISubroutineType(types: !121)
!121 = !{!21, !24, !65}
!122 = !{}
!123 = !DISubprogram(name: "MPI_Comm_f2c", scope: !23, file: !23, line: 1292, type: !124, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !122)
!124 = !DISubroutineType(types: !125)
!125 = !{!24, !21}
!126 = distinct !DISubprogram(name: "petscfprintf_", scope: !36, file: !36, line: 43, type: !127, scopeLine: 44, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !132)
!127 = !DISubroutineType(types: !128)
!128 = !{null, !129, !39, !48, !130, !16}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !21)
!132 = !{!133, !134, !135, !136, !137, !138, !139}
!133 = !DILocalVariable(name: "comm", arg: 1, scope: !126, file: !36, line: 43, type: !129)
!134 = !DILocalVariable(name: "file", arg: 2, scope: !126, file: !36, line: 43, type: !39)
!135 = !DILocalVariable(name: "fname", arg: 3, scope: !126, file: !36, line: 43, type: !48)
!136 = !DILocalVariable(name: "ierr", arg: 4, scope: !126, file: !36, line: 43, type: !130)
!137 = !DILocalVariable(name: "len1", arg: 5, scope: !126, file: !36, line: 43, type: !16)
!138 = !DILocalVariable(name: "c1", scope: !126, file: !36, line: 45, type: !48)
!139 = !DILocalVariable(name: "tmp", scope: !126, file: !36, line: 45, type: !48)
!140 = !DILocation(line: 0, scope: !126)
!141 = !DILocation(line: 45, column: 3, scope: !126)
!142 = !DILocation(line: 47, column: 3, scope: !143)
!143 = distinct !DILexicalBlock(scope: !144, file: !36, line: 47, column: 3)
!144 = distinct !DILexicalBlock(scope: !126, file: !36, line: 47, column: 3)
!145 = !DILocation(line: 47, column: 3, scope: !144)
!146 = !DILocation(line: 47, column: 3, scope: !147)
!147 = distinct !DILexicalBlock(scope: !143, file: !36, line: 47, column: 3)
!148 = !DILocation(line: 47, column: 3, scope: !149)
!149 = distinct !DILexicalBlock(scope: !143, file: !36, line: 47, column: 3)
!150 = !{!106, !106, i64 0}
!151 = distinct !{!151, !148, !148, !152}
!152 = !{!"llvm.loop.mustprogress"}
!153 = !DILocation(line: 47, column: 3, scope: !154)
