; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/coarsen/scoarsen.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/coarsen/scoarsen.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct._p_MatCoarsen = type { %struct._p_PetscObject, [1 x %struct._MatCoarsenOps], %struct._p_Mat*, i8*, i32, %struct._p_IS*, %struct._PetscCoarsenData* }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!349 = !DILocation(line: 33, column: 7, scope: !315)
!350 = !DILocation(line: 33, column: 36, scope: !351)
!351 = distinct !DILexicalBlock(scope: !352, file: !316, line: 33, column: 36)
!352 = distinct !DILexicalBlock(scope: !353, file: !316, line: 33, column: 36)
!353 = distinct !DILexicalBlock(scope: !354, file: !316, line: 33, column: 36)
!354 = distinct !DILexicalBlock(scope: !355, file: !316, line: 33, column: 36)
!355 = distinct !DILexicalBlock(scope: !347, file: !316, line: 33, column: 36)
!356 = !DILocation(line: 33, column: 36, scope: !352)
!357 = !DILocation(line: 33, column: 36, scope: !358)
!358 = distinct !DILexicalBlock(scope: !359, file: !316, line: 33, column: 36)
!359 = distinct !DILexicalBlock(scope: !351, file: !316, line: 33, column: 36)
!360 = !{!339, !332, i64 1544}
!361 = !DILocation(line: 33, column: 36, scope: !359)
!362 = !DILocation(line: 33, column: 36, scope: !363)
!363 = distinct !DILexicalBlock(scope: !358, file: !316, line: 33, column: 36)
!364 = !DILocation(line: 33, column: 36, scope: !365)
!365 = distinct !DILexicalBlock(scope: !351, file: !316, line: 33, column: 36)
!366 = !DILocation(line: 33, column: 36, scope: !367)
!367 = distinct !DILexicalBlock(scope: !365, file: !316, line: 33, column: 36)
!368 = !DILocation(line: 33, column: 36, scope: !369)
!369 = distinct !DILexicalBlock(scope: !370, file: !316, line: 33, column: 36)
!370 = distinct !DILexicalBlock(scope: !367, file: !316, line: 33, column: 36)
!371 = !DILocation(line: 33, column: 36, scope: !370)
!372 = !DILocation(line: 33, column: 36, scope: !373)
!373 = distinct !DILexicalBlock(scope: !369, file: !316, line: 33, column: 36)
!374 = !DILocation(line: 34, column: 31, scope: !315)
!375 = !DILocation(line: 36, column: 10, scope: !315)
!376 = !DILocation(line: 0, scope: !315)
!377 = !DILocation(line: 0, scope: !323)
!378 = !DILocation(line: 36, column: 65, scope: !379)
!379 = distinct !DILexicalBlock(scope: !323, file: !316, line: 36, column: 65)
!380 = !DILocation(line: 36, column: 65, scope: !323)
!381 = !{!"branch_weights", i32 2000, i32 1}
!382 = !DILocation(line: 37, column: 10, scope: !315)
!383 = !DILocation(line: 0, scope: !325)
!384 = !DILocation(line: 37, column: 65, scope: !385)
!385 = distinct !DILexicalBlock(scope: !325, file: !316, line: 37, column: 65)
!386 = !DILocation(line: 37, column: 65, scope: !325)
!387 = !DILocation(line: 38, column: 3, scope: !388)
!388 = distinct !DILexicalBlock(scope: !389, file: !316, line: 38, column: 3)
!389 = distinct !DILexicalBlock(scope: !390, file: !316, line: 38, column: 3)
!390 = distinct !DILexicalBlock(scope: !315, file: !316, line: 38, column: 3)
!391 = !DILocation(line: 38, column: 3, scope: !389)
!392 = !DILocation(line: 38, column: 3, scope: !393)
!393 = distinct !DILexicalBlock(scope: !394, file: !316, line: 38, column: 3)
!394 = distinct !DILexicalBlock(scope: !388, file: !316, line: 38, column: 3)
!395 = !DILocation(line: 38, column: 3, scope: !394)
!396 = !DILocation(line: 38, column: 3, scope: !397)
!397 = distinct !DILexicalBlock(scope: !398, file: !316, line: 38, column: 3)
!398 = distinct !DILexicalBlock(scope: !393, file: !316, line: 38, column: 3)
!399 = !DILocation(line: 38, column: 3, scope: !398)
!400 = !DILocation(line: 38, column: 3, scope: !401)
!401 = distinct !DILexicalBlock(scope: !397, file: !316, line: 38, column: 3)
!402 = !DILocation(line: 38, column: 3, scope: !403)
!403 = distinct !DILexicalBlock(scope: !393, file: !316, line: 38, column: 3)
!404 = !DILocation(line: 38, column: 3, scope: !405)
!405 = distinct !DILexicalBlock(scope: !403, file: !316, line: 38, column: 3)
!406 = !DILocation(line: 38, column: 3, scope: !407)
!407 = distinct !DILexicalBlock(scope: !408, file: !316, line: 38, column: 3)
!408 = distinct !DILexicalBlock(scope: !405, file: !316, line: 38, column: 3)
!409 = !DILocation(line: 38, column: 3, scope: !408)
!410 = !DILocation(line: 38, column: 3, scope: !411)
!411 = distinct !DILexicalBlock(scope: !407, file: !316, line: 38, column: 3)
!412 = !DILocation(line: 39, column: 1, scope: !315)
!413 = !DISubprogram(name: "MatCoarsenRegister", scope: !414, file: !414, line: 62, type: !415, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1441)
!414 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmatcoarsen.h", directory: "/home/users/ndemeye/xSDK")
!415 = !DISubroutineType(types: !416)
!416 = !{!72, !301, !417}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!72, !420}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatCoarsen", file: !422, line: 552, size: 5056, elements: !423)
!422 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!423 = !{!424, !625, !643, !1411, !1412, !1413, !1414}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !421, file: !422, line: 553, baseType: !425, size: 4480)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !426, line: 122, baseType: !427)
!426 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !426, line: 73, size: 4480, elements: !428)
!428 = !{!429, !431, !478, !479, !481, !484, !485, !486, !487, !495, !496, !498, !502, !506, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !519, !520, !521, !523, !524, !526, !528, !529, !530, !531, !532, !535, !537, !538, !539, !540, !541, !544, !546, !547, !548, !558, !560, !561, !565, !566, !615, !620, !622, !623, !624}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !427, file: !426, line: 74, baseType: !430, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !427, file: !426, line: 75, baseType: !432, size: 448, offset: 64)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 448, elements: !476)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !426, line: 53, baseType: !434)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !426, line: 45, size: 448, elements: !435)
!435 = !{!436, !443, !451, !456, !460, !464, !471}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !434, file: !426, line: 46, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!319, !440, !442}
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !441)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !434, file: !426, line: 47, baseType: !444, size: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!319, !440, !447}
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !448, line: 16, baseType: !449)
!448 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !448, line: 16, flags: DIFlagFwdDecl)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !434, file: !426, line: 48, baseType: !452, size: 64, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{!319, !455}
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !434, file: !426, line: 49, baseType: !457, size: 64, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!319, !440, !301, !440}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !434, file: !426, line: 50, baseType: !461, size: 64, offset: 256)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!319, !440, !301, !455}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !434, file: !426, line: 51, baseType: !465, size: 64, offset: 320)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!319, !440, !301, !468}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{null}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !434, file: !426, line: 52, baseType: !472, size: 64, offset: 384)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!319, !440, !301, !475}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!476 = !{!477}
!477 = !DISubrange(count: 1)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !427, file: !426, line: 76, baseType: !304, size: 64, offset: 512)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !427, file: !426, line: 77, baseType: !480, size: 32, offset: 576)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !427, file: !426, line: 78, baseType: !482, size: 64, offset: 640)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !483)
!483 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !427, file: !426, line: 78, baseType: !482, size: 64, offset: 704)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !427, file: !426, line: 78, baseType: !482, size: 64, offset: 768)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !427, file: !426, line: 78, baseType: !482, size: 64, offset: 832)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !427, file: !426, line: 79, baseType: !488, size: 64, offset: 896)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !490)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !491, line: 27, baseType: !492)
!491 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !493, line: 43, baseType: !494)
!493 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!494 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !427, file: !426, line: 80, baseType: !480, size: 32, offset: 960)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !427, file: !426, line: 81, baseType: !497, size: 32, offset: 992)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !427, file: !426, line: 82, baseType: !499, size: 64, offset: 1024)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !500)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !427, file: !426, line: 83, baseType: !503, size: 64, offset: 1088)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !504)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !427, file: !426, line: 84, baseType: !507, size: 64, offset: 1152)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !427, file: !426, line: 85, baseType: !507, size: 64, offset: 1216)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !427, file: !426, line: 86, baseType: !507, size: 64, offset: 1280)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !427, file: !426, line: 87, baseType: !507, size: 64, offset: 1344)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !427, file: !426, line: 88, baseType: !440, size: 64, offset: 1408)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !427, file: !426, line: 89, baseType: !488, size: 64, offset: 1472)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !427, file: !426, line: 90, baseType: !507, size: 64, offset: 1536)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !427, file: !426, line: 91, baseType: !507, size: 64, offset: 1600)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !427, file: !426, line: 92, baseType: !480, size: 32, offset: 1664)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !427, file: !426, line: 93, baseType: !308, size: 64, offset: 1728)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !427, file: !426, line: 94, baseType: !518, size: 64, offset: 1792)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !489)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !427, file: !426, line: 95, baseType: !480, size: 32, offset: 1856)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !427, file: !426, line: 95, baseType: !480, size: 32, offset: 1888)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !427, file: !426, line: 96, baseType: !522, size: 64, offset: 1920)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !427, file: !426, line: 96, baseType: !522, size: 64, offset: 1984)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !427, file: !426, line: 97, baseType: !525, size: 64, offset: 2048)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !427, file: !426, line: 97, baseType: !527, size: 64, offset: 2112)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !427, file: !426, line: 98, baseType: !480, size: 32, offset: 2176)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !427, file: !426, line: 98, baseType: !480, size: 32, offset: 2208)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !427, file: !426, line: 99, baseType: !522, size: 64, offset: 2240)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !427, file: !426, line: 99, baseType: !522, size: 64, offset: 2304)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !427, file: !426, line: 100, baseType: !533, size: 64, offset: 2368)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !483)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !427, file: !426, line: 100, baseType: !536, size: 64, offset: 2432)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !427, file: !426, line: 101, baseType: !480, size: 32, offset: 2496)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !427, file: !426, line: 101, baseType: !480, size: 32, offset: 2528)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !427, file: !426, line: 102, baseType: !522, size: 64, offset: 2560)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !427, file: !426, line: 102, baseType: !522, size: 64, offset: 2624)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !427, file: !426, line: 103, baseType: !542, size: 64, offset: 2688)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !534)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !427, file: !426, line: 103, baseType: !545, size: 64, offset: 2752)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !427, file: !426, line: 104, baseType: !475, size: 64, offset: 2816)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !427, file: !426, line: 105, baseType: !480, size: 32, offset: 2880)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !427, file: !426, line: 106, baseType: !549, size: 128, offset: 2944)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 128, elements: !556)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !426, line: 64, baseType: !552)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !426, line: 61, size: 128, elements: !553)
!553 = !{!554, !555}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !552, file: !426, line: 62, baseType: !468, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !552, file: !426, line: 63, baseType: !308, size: 64, offset: 64)
!556 = !{!557}
!557 = !DISubrange(count: 2)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !427, file: !426, line: 107, baseType: !559, size: 64, offset: 3072)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 64, elements: !556)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !427, file: !426, line: 108, baseType: !308, size: 64, offset: 3136)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !427, file: !426, line: 109, baseType: !562, size: 64, offset: 3200)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!319, !308}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !427, file: !426, line: 111, baseType: !480, size: 32, offset: 3264)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !427, file: !426, line: 112, baseType: !567, size: 320, offset: 3328)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 320, elements: !613)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!319, !571, !440, !308}
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !573)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !574)
!574 = !{!575, !576, !601, !602, !603, !604, !605, !606, !607, !608, !609}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !573, file: !10, line: 100, baseType: !480, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !573, file: !10, line: 101, baseType: !577, size: 64, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !578)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !580)
!580 = !{!581, !582, !583, !584, !585, !588, !589, !590, !594, !596, !598, !599, !600}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !579, file: !10, line: 84, baseType: !507, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !579, file: !10, line: 85, baseType: !507, size: 64, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !579, file: !10, line: 86, baseType: !308, size: 64, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !579, file: !10, line: 87, baseType: !499, size: 64, offset: 192)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !579, file: !10, line: 88, baseType: !586, size: 64, offset: 256)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !301)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !579, file: !10, line: 89, baseType: !303, size: 8, offset: 320)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !579, file: !10, line: 90, baseType: !507, size: 64, offset: 384)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !579, file: !10, line: 91, baseType: !591, size: 64, offset: 448)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !592, line: 46, baseType: !593)
!592 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!593 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !579, file: !10, line: 92, baseType: !595, size: 32, offset: 512)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !579, file: !10, line: 93, baseType: !597, size: 32, offset: 544)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !579, file: !10, line: 94, baseType: !577, size: 64, offset: 576)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !579, file: !10, line: 95, baseType: !507, size: 64, offset: 640)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !579, file: !10, line: 96, baseType: !308, size: 64, offset: 704)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !573, file: !10, line: 102, baseType: !507, size: 64, offset: 128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !573, file: !10, line: 102, baseType: !507, size: 64, offset: 192)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !573, file: !10, line: 103, baseType: !507, size: 64, offset: 256)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !573, file: !10, line: 104, baseType: !304, size: 64, offset: 320)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !573, file: !10, line: 105, baseType: !595, size: 32, offset: 384)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !573, file: !10, line: 105, baseType: !595, size: 32, offset: 416)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !573, file: !10, line: 105, baseType: !595, size: 32, offset: 448)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !573, file: !10, line: 106, baseType: !440, size: 64, offset: 512)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !573, file: !10, line: 107, baseType: !610, size: 64, offset: 576)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!613 = !{!614}
!614 = !DISubrange(count: 5)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !427, file: !426, line: 113, baseType: !616, size: 320, offset: 3648)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !617, size: 320, elements: !613)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{!319, !440, !308}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !427, file: !426, line: 114, baseType: !621, size: 320, offset: 3968)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 320, elements: !613)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !427, file: !426, line: 115, baseType: !595, size: 32, offset: 4288)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !427, file: !426, line: 120, baseType: !610, size: 64, offset: 4352)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !427, file: !426, line: 121, baseType: !595, size: 32, offset: 4416)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !421, file: !422, line: 553, baseType: !626, size: 256, offset: 4480)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !627, size: 256, elements: !476)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatCoarsenOps", file: !422, line: 545, size: 256, elements: !628)
!628 = !{!629, !634, !638, !639}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !627, file: !422, line: 546, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!319, !633}
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatCoarsen", file: !414, line: 18, baseType: !420)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !627, file: !422, line: 547, baseType: !635, size: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!319, !571, !633}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !627, file: !422, line: 548, baseType: !630, size: 64, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !627, file: !422, line: 549, baseType: !640, size: 64, offset: 192)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!319, !633, !447}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !421, file: !422, line: 554, baseType: !644, size: 64, offset: 4736)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !645)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !422, line: 436, size: 23424, elements: !647)
!647 = !{!648, !649, !1154, !1174, !1175, !1176, !1178, !1179, !1180, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1307, !1308, !1324, !1325, !1326, !1327, !1328, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1363, !1383, !1384, !1386, !1387, !1388, !1389, !1390, !1391, !1409, !1410}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !646, file: !422, line: 437, baseType: !425, size: 4480)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !646, file: !422, line: 437, baseType: !650, size: 9472, offset: 4480)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 9472, elements: !476)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !422, line: 32, size: 9472, elements: !652)
!652 = !{!653, !662, !666, !667, !674, !678, !679, !680, !681, !682, !683, !684, !708, !712, !717, !723, !742, !747, !751, !752, !757, !762, !763, !768, !772, !776, !780, !784, !788, !789, !790, !791, !792, !796, !797, !802, !803, !804, !805, !806, !811, !818, !823, !827, !831, !835, !839, !840, !844, !845, !852, !857, !858, !859, !860, !920, !928, !929, !933, !934, !938, !939, !943, !948, !949, !953, !957, !964, !965, !966, !967, !968, !969, !974, !975, !979, !983, !987, !988, !989, !993, !1003, !1004, !1008, !1009, !1013, !1014, !1018, !1019, !1024, !1025, !1029, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1043, !1044, !1045, !1046, !1047, !1048, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1063, !1067, !1068, !1069, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1083, !1084, !1085, !1090, !1094, !1095, !1099, !1100, !1101, !1102, !1128, !1132, !1133, !1134, !1135, !1136, !1140, !1141, !1142, !1143, !1144, !1148, !1152, !1153}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !651, file: !422, line: 34, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!319, !644, !480, !657, !480, !657, !659, !661}
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !480)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !543)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !651, file: !422, line: 35, baseType: !663, size: 64, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!319, !644, !480, !525, !527, !545}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !651, file: !422, line: 36, baseType: !663, size: 64, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !651, file: !422, line: 37, baseType: !668, size: 64, offset: 192)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!319, !644, !671, !671}
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !672)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !651, file: !422, line: 38, baseType: !675, size: 64, offset: 256)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!319, !644, !671, !671, !671}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !651, file: !422, line: 40, baseType: !668, size: 64, offset: 320)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !651, file: !422, line: 41, baseType: !675, size: 64, offset: 384)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !651, file: !422, line: 42, baseType: !668, size: 64, offset: 448)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !651, file: !422, line: 43, baseType: !675, size: 64, offset: 512)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !651, file: !422, line: 44, baseType: !668, size: 64, offset: 576)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !651, file: !422, line: 46, baseType: !675, size: 64, offset: 640)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !651, file: !422, line: 47, baseType: !685, size: 64, offset: 704)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DISubroutineType(types: !687)
!687 = !{!319, !644, !688, !688, !692}
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !689, line: 11, baseType: !690)
!689 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !689, line: 11, flags: DIFlagFwdDecl)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !696)
!696 = !{!697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !695, file: !36, line: 1227, baseType: !534, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !695, file: !36, line: 1228, baseType: !534, size: 64, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !695, file: !36, line: 1229, baseType: !534, size: 64, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !695, file: !36, line: 1230, baseType: !534, size: 64, offset: 192)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !695, file: !36, line: 1231, baseType: !534, size: 64, offset: 256)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !695, file: !36, line: 1232, baseType: !534, size: 64, offset: 320)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !695, file: !36, line: 1233, baseType: !534, size: 64, offset: 384)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !695, file: !36, line: 1234, baseType: !534, size: 64, offset: 448)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !695, file: !36, line: 1236, baseType: !534, size: 64, offset: 512)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !695, file: !36, line: 1237, baseType: !534, size: 64, offset: 576)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !695, file: !36, line: 1238, baseType: !534, size: 64, offset: 640)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !651, file: !422, line: 48, baseType: !709, size: 64, offset: 768)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!319, !644, !688, !692}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !651, file: !422, line: 49, baseType: !713, size: 64, offset: 832)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!319, !644, !671, !534, !716, !534, !480, !480, !671}
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !651, file: !422, line: 50, baseType: !718, size: 64, offset: 896)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!319, !644, !721, !722}
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !651, file: !422, line: 52, baseType: !724, size: 64, offset: 960)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!319, !644, !727, !728}
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !730)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !731)
!731 = !{!732, !733, !734, !735, !736, !737, !738, !739, !740, !741}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !730, file: !36, line: 593, baseType: !482, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !730, file: !36, line: 594, baseType: !482, size: 64, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !730, file: !36, line: 594, baseType: !482, size: 64, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !730, file: !36, line: 594, baseType: !482, size: 64, offset: 192)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !730, file: !36, line: 595, baseType: !482, size: 64, offset: 256)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !730, file: !36, line: 596, baseType: !482, size: 64, offset: 320)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !730, file: !36, line: 597, baseType: !482, size: 64, offset: 384)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !730, file: !36, line: 598, baseType: !482, size: 64, offset: 448)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !730, file: !36, line: 598, baseType: !482, size: 64, offset: 512)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !730, file: !36, line: 599, baseType: !482, size: 64, offset: 576)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !651, file: !422, line: 53, baseType: !743, size: 64, offset: 1024)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!319, !644, !644, !746}
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !651, file: !422, line: 54, baseType: !748, size: 64, offset: 1088)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{!319, !644, !671}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !651, file: !422, line: 55, baseType: !668, size: 64, offset: 1152)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !651, file: !422, line: 56, baseType: !753, size: 64, offset: 1216)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!319, !644, !756, !533}
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !651, file: !422, line: 58, baseType: !758, size: 64, offset: 1280)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!319, !644, !761}
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !651, file: !422, line: 59, baseType: !758, size: 64, offset: 1344)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !651, file: !422, line: 60, baseType: !764, size: 64, offset: 1408)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{!319, !644, !767, !595}
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !651, file: !422, line: 61, baseType: !769, size: 64, offset: 1472)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{!319, !644}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !651, file: !422, line: 63, baseType: !773, size: 64, offset: 1536)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{!319, !644, !480, !657, !543, !671, !671}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !651, file: !422, line: 64, baseType: !777, size: 64, offset: 1600)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!319, !644, !644, !688, !688, !692}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !651, file: !422, line: 65, baseType: !781, size: 64, offset: 1664)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DISubroutineType(types: !783)
!783 = !{!319, !644, !644, !692}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !651, file: !422, line: 66, baseType: !785, size: 64, offset: 1728)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{!319, !644, !644, !688, !692}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !651, file: !422, line: 67, baseType: !781, size: 64, offset: 1792)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !651, file: !422, line: 69, baseType: !769, size: 64, offset: 1856)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !651, file: !422, line: 70, baseType: !777, size: 64, offset: 1920)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !651, file: !422, line: 71, baseType: !785, size: 64, offset: 1984)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !651, file: !422, line: 72, baseType: !793, size: 64, offset: 2048)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DISubroutineType(types: !795)
!795 = !{!319, !644, !722}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !651, file: !422, line: 73, baseType: !769, size: 64, offset: 2112)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !651, file: !422, line: 75, baseType: !798, size: 64, offset: 2176)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{!319, !644, !801, !722}
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !651, file: !422, line: 76, baseType: !668, size: 64, offset: 2240)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !651, file: !422, line: 77, baseType: !668, size: 64, offset: 2304)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !651, file: !422, line: 78, baseType: !685, size: 64, offset: 2368)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !651, file: !422, line: 79, baseType: !709, size: 64, offset: 2432)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !651, file: !422, line: 81, baseType: !807, size: 64, offset: 2496)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DISubroutineType(types: !809)
!809 = !{!319, !644, !543, !644, !810}
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !651, file: !422, line: 82, baseType: !812, size: 64, offset: 2560)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DISubroutineType(types: !814)
!814 = !{!319, !644, !480, !815, !815, !721, !817}
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !688)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !651, file: !422, line: 83, baseType: !819, size: 64, offset: 2624)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{!319, !644, !480, !822, !480}
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !651, file: !422, line: 84, baseType: !824, size: 64, offset: 2688)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DISubroutineType(types: !826)
!826 = !{!319, !644, !480, !657, !480, !657, !542}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !651, file: !422, line: 85, baseType: !828, size: 64, offset: 2752)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DISubroutineType(types: !830)
!830 = !{!319, !644, !644, !810}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !651, file: !422, line: 87, baseType: !832, size: 64, offset: 2816)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DISubroutineType(types: !834)
!834 = !{!319, !644, !671, !525}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !651, file: !422, line: 88, baseType: !836, size: 64, offset: 2880)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{!319, !644, !543}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !651, file: !422, line: 89, baseType: !836, size: 64, offset: 2944)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !651, file: !422, line: 90, baseType: !841, size: 64, offset: 3008)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DISubroutineType(types: !843)
!843 = !{!319, !644, !671, !661}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !651, file: !422, line: 91, baseType: !773, size: 64, offset: 3072)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !651, file: !422, line: 93, baseType: !846, size: 64, offset: 3136)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!319, !644, !849}
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !850)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !651, file: !422, line: 94, baseType: !853, size: 64, offset: 3200)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{!319, !644, !480, !595, !595, !525, !856, !856, !746}
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !651, file: !422, line: 95, baseType: !853, size: 64, offset: 3264)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !651, file: !422, line: 96, baseType: !853, size: 64, offset: 3328)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !651, file: !422, line: 97, baseType: !853, size: 64, offset: 3392)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !651, file: !422, line: 99, baseType: !861, size: 64, offset: 3456)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!319, !644, !864, !867}
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !689, line: 51, baseType: !865)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !689, line: 51, flags: DIFlagFwdDecl)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !868)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !422, line: 609, size: 6208, elements: !870)
!870 = !{!871, !872, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !891, !898, !899, !900, !901, !902, !903, !904, !905, !907, !908, !909, !910, !911, !913, !914, !915, !916, !917, !918, !919}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !869, file: !422, line: 610, baseType: !425, size: 4480)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !869, file: !422, line: 610, baseType: !873, size: 32, offset: 4480)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !476)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !869, file: !422, line: 611, baseType: !480, size: 32, offset: 4512)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !869, file: !422, line: 611, baseType: !480, size: 32, offset: 4544)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !869, file: !422, line: 611, baseType: !480, size: 32, offset: 4576)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !869, file: !422, line: 612, baseType: !480, size: 32, offset: 4608)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !869, file: !422, line: 613, baseType: !480, size: 32, offset: 4640)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !869, file: !422, line: 614, baseType: !525, size: 64, offset: 4672)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !869, file: !422, line: 615, baseType: !527, size: 64, offset: 4736)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !869, file: !422, line: 616, baseType: !822, size: 64, offset: 4800)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !869, file: !422, line: 617, baseType: !525, size: 64, offset: 4864)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !869, file: !422, line: 618, baseType: !884, size: 64, offset: 4928)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !422, line: 602, baseType: !886)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !422, line: 598, size: 128, elements: !887)
!887 = !{!888, !889, !890}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !886, file: !422, line: 599, baseType: !480, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !886, file: !422, line: 600, baseType: !480, size: 32, offset: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !886, file: !422, line: 601, baseType: !542, size: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !869, file: !422, line: 619, baseType: !892, size: 64, offset: 4992)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !422, line: 607, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !422, line: 604, size: 128, elements: !895)
!895 = !{!896, !897}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !894, file: !422, line: 605, baseType: !480, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !894, file: !422, line: 606, baseType: !542, size: 64, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !869, file: !422, line: 620, baseType: !542, size: 64, offset: 5056)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !869, file: !422, line: 621, baseType: !534, size: 64, offset: 5120)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !869, file: !422, line: 622, baseType: !534, size: 64, offset: 5184)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !869, file: !422, line: 623, baseType: !671, size: 64, offset: 5248)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !869, file: !422, line: 623, baseType: !671, size: 64, offset: 5312)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !869, file: !422, line: 623, baseType: !671, size: 64, offset: 5376)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !869, file: !422, line: 624, baseType: !595, size: 32, offset: 5440)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !869, file: !422, line: 625, baseType: !906, size: 64, offset: 5504)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !869, file: !422, line: 626, baseType: !308, size: 64, offset: 5568)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !869, file: !422, line: 627, baseType: !671, size: 64, offset: 5632)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !869, file: !422, line: 628, baseType: !480, size: 32, offset: 5696)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !869, file: !422, line: 629, baseType: !301, size: 64, offset: 5760)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !869, file: !422, line: 630, baseType: !912, size: 32, offset: 5824)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !869, file: !422, line: 631, baseType: !480, size: 32, offset: 5856)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !869, file: !422, line: 631, baseType: !480, size: 32, offset: 5888)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !869, file: !422, line: 632, baseType: !595, size: 32, offset: 5920)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !869, file: !422, line: 633, baseType: !595, size: 32, offset: 5952)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !869, file: !422, line: 634, baseType: !468, size: 64, offset: 6016)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !869, file: !422, line: 634, baseType: !308, size: 64, offset: 6080)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !869, file: !422, line: 635, baseType: !488, size: 64, offset: 6144)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !651, file: !422, line: 100, baseType: !921, size: 64, offset: 3520)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{!319, !644, !480, !480, !924, !927}
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !926)
!926 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !651, file: !422, line: 101, baseType: !769, size: 64, offset: 3584)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !651, file: !422, line: 102, baseType: !930, size: 64, offset: 3648)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{!319, !644, !688, !688, !722}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !651, file: !422, line: 103, baseType: !654, size: 64, offset: 3712)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !651, file: !422, line: 105, baseType: !935, size: 64, offset: 3776)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{!319, !644, !688, !688, !721, !722}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !651, file: !422, line: 106, baseType: !769, size: 64, offset: 3840)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !651, file: !422, line: 107, baseType: !940, size: 64, offset: 3904)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{!319, !644, !447}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !651, file: !422, line: 108, baseType: !944, size: 64, offset: 3968)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{!319, !644, !947, !721, !722}
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !301)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !651, file: !422, line: 109, baseType: !906, size: 64, offset: 4032)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !651, file: !422, line: 111, baseType: !950, size: 64, offset: 4096)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{!319, !644, !644, !644, !534, !644}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !651, file: !422, line: 112, baseType: !954, size: 64, offset: 4160)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{!319, !644, !644, !644, !644}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !651, file: !422, line: 113, baseType: !958, size: 64, offset: 4224)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!319, !644, !961, !961}
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !689, line: 30, baseType: !962)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !689, line: 30, flags: DIFlagFwdDecl)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !651, file: !422, line: 114, baseType: !654, size: 64, offset: 4288)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !651, file: !422, line: 115, baseType: !773, size: 64, offset: 4352)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !651, file: !422, line: 117, baseType: !832, size: 64, offset: 4416)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !651, file: !422, line: 118, baseType: !832, size: 64, offset: 4480)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !651, file: !422, line: 119, baseType: !944, size: 64, offset: 4544)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !651, file: !422, line: 120, baseType: !970, size: 64, offset: 4608)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!319, !644, !973, !746}
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !651, file: !422, line: 121, baseType: !906, size: 64, offset: 4672)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !651, file: !422, line: 123, baseType: !976, size: 64, offset: 4736)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!319, !644, !480, !308}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !651, file: !422, line: 124, baseType: !980, size: 64, offset: 4800)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!319, !644, !867, !671, !308}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !651, file: !422, line: 125, baseType: !984, size: 64, offset: 4864)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!319, !571, !644}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !651, file: !422, line: 126, baseType: !668, size: 64, offset: 4928)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !651, file: !422, line: 127, baseType: !668, size: 64, offset: 4992)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !651, file: !422, line: 129, baseType: !990, size: 64, offset: 5056)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!319, !644, !822}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !651, file: !422, line: 130, baseType: !994, size: 64, offset: 5120)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!319, !644, !997, !997}
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !998)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !1000)
!1000 = !{!1001, !1002}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !999, file: !60, line: 653, baseType: !480, size: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !999, file: !60, line: 653, baseType: !671, size: 64, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !651, file: !422, line: 131, baseType: !994, size: 64, offset: 5184)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !651, file: !422, line: 132, baseType: !1005, size: 64, offset: 5248)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!319, !644, !525, !525, !525}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !651, file: !422, line: 133, baseType: !940, size: 64, offset: 5312)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !651, file: !422, line: 135, baseType: !1010, size: 64, offset: 5376)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!319, !644, !534, !746}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !651, file: !422, line: 136, baseType: !1010, size: 64, offset: 5440)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !651, file: !422, line: 137, baseType: !1015, size: 64, offset: 5504)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!319, !644, !746}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !651, file: !422, line: 138, baseType: !654, size: 64, offset: 5568)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !651, file: !422, line: 139, baseType: !1020, size: 64, offset: 5632)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!319, !644, !1023, !1023}
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !651, file: !422, line: 141, baseType: !906, size: 64, offset: 5696)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !651, file: !422, line: 142, baseType: !1026, size: 64, offset: 5760)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!319, !644, !644, !534, !644}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !651, file: !422, line: 143, baseType: !1030, size: 64, offset: 5824)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!319, !644, !644, !644}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !651, file: !422, line: 144, baseType: !906, size: 64, offset: 5888)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !651, file: !422, line: 145, baseType: !1026, size: 64, offset: 5952)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !651, file: !422, line: 147, baseType: !1030, size: 64, offset: 6016)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !651, file: !422, line: 148, baseType: !906, size: 64, offset: 6080)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !651, file: !422, line: 149, baseType: !1026, size: 64, offset: 6144)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !651, file: !422, line: 150, baseType: !1030, size: 64, offset: 6208)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !651, file: !422, line: 151, baseType: !1040, size: 64, offset: 6272)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!319, !644, !595}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !651, file: !422, line: 153, baseType: !769, size: 64, offset: 6336)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !651, file: !422, line: 154, baseType: !769, size: 64, offset: 6400)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !651, file: !422, line: 155, baseType: !769, size: 64, offset: 6464)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !651, file: !422, line: 156, baseType: !769, size: 64, offset: 6528)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !651, file: !422, line: 157, baseType: !940, size: 64, offset: 6592)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !651, file: !422, line: 159, baseType: !1049, size: 64, offset: 6656)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!319, !644, !480, !659}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !651, file: !422, line: 160, baseType: !769, size: 64, offset: 6720)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !651, file: !422, line: 161, baseType: !769, size: 64, offset: 6784)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !651, file: !422, line: 162, baseType: !769, size: 64, offset: 6848)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !651, file: !422, line: 163, baseType: !769, size: 64, offset: 6912)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !651, file: !422, line: 165, baseType: !1030, size: 64, offset: 6976)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !651, file: !422, line: 166, baseType: !1030, size: 64, offset: 7040)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !651, file: !422, line: 167, baseType: !832, size: 64, offset: 7104)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !651, file: !422, line: 168, baseType: !1060, size: 64, offset: 7168)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!319, !644, !671, !480}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !651, file: !422, line: 169, baseType: !1064, size: 64, offset: 7232)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!319, !644, !746, !525}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !651, file: !422, line: 171, baseType: !793, size: 64, offset: 7296)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !651, file: !422, line: 172, baseType: !769, size: 64, offset: 7360)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !651, file: !422, line: 173, baseType: !1070, size: 64, offset: 7424)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!319, !644, !525, !856}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !651, file: !422, line: 174, baseType: !930, size: 64, offset: 7488)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !651, file: !422, line: 175, baseType: !930, size: 64, offset: 7552)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !651, file: !422, line: 177, baseType: !668, size: 64, offset: 7616)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !651, file: !422, line: 178, baseType: !718, size: 64, offset: 7680)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !651, file: !422, line: 179, baseType: !668, size: 64, offset: 7744)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !651, file: !422, line: 180, baseType: !675, size: 64, offset: 7808)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !651, file: !422, line: 181, baseType: !1080, size: 64, offset: 7872)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!319, !644, !304, !721, !722}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !651, file: !422, line: 183, baseType: !990, size: 64, offset: 7936)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !651, file: !422, line: 184, baseType: !753, size: 64, offset: 8000)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !651, file: !422, line: 185, baseType: !1086, size: 64, offset: 8064)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!319, !644, !1089}
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !651, file: !422, line: 186, baseType: !1091, size: 64, offset: 8128)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!319, !644, !480, !657, !542}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !651, file: !422, line: 187, baseType: !812, size: 64, offset: 8192)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !651, file: !422, line: 189, baseType: !1096, size: 64, offset: 8256)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!319, !644, !480, !480, !525, !659}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !651, file: !422, line: 190, baseType: !906, size: 64, offset: 8320)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !651, file: !422, line: 191, baseType: !1026, size: 64, offset: 8384)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !651, file: !422, line: 192, baseType: !1030, size: 64, offset: 8448)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !651, file: !422, line: 193, baseType: !1103, size: 64, offset: 8512)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!319, !644, !864, !1106}
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1107)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !422, line: 660, size: 5312, elements: !1109)
!1109 = !{!1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1108, file: !422, line: 661, baseType: !425, size: 4480)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1108, file: !422, line: 661, baseType: !873, size: 32, offset: 4480)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1108, file: !422, line: 662, baseType: !480, size: 32, offset: 4512)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1108, file: !422, line: 662, baseType: !480, size: 32, offset: 4544)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1108, file: !422, line: 662, baseType: !480, size: 32, offset: 4576)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1108, file: !422, line: 663, baseType: !480, size: 32, offset: 4608)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1108, file: !422, line: 664, baseType: !480, size: 32, offset: 4640)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1108, file: !422, line: 665, baseType: !525, size: 64, offset: 4672)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1108, file: !422, line: 666, baseType: !525, size: 64, offset: 4736)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1108, file: !422, line: 667, baseType: !480, size: 32, offset: 4800)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1108, file: !422, line: 668, baseType: !912, size: 32, offset: 4832)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1108, file: !422, line: 670, baseType: !525, size: 64, offset: 4864)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1108, file: !422, line: 670, baseType: !525, size: 64, offset: 4928)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1108, file: !422, line: 671, baseType: !525, size: 64, offset: 4992)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1108, file: !422, line: 672, baseType: !525, size: 64, offset: 5056)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1108, file: !422, line: 673, baseType: !525, size: 64, offset: 5120)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1108, file: !422, line: 674, baseType: !480, size: 32, offset: 5184)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1108, file: !422, line: 675, baseType: !525, size: 64, offset: 5248)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !651, file: !422, line: 195, baseType: !1129, size: 64, offset: 8576)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!319, !1106, !644, !644}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !651, file: !422, line: 196, baseType: !1129, size: 64, offset: 8640)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !651, file: !422, line: 197, baseType: !906, size: 64, offset: 8704)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !651, file: !422, line: 198, baseType: !1026, size: 64, offset: 8768)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !651, file: !422, line: 199, baseType: !1030, size: 64, offset: 8832)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !651, file: !422, line: 201, baseType: !1137, size: 64, offset: 8896)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!319, !644, !480, !480}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !651, file: !422, line: 202, baseType: !807, size: 64, offset: 8960)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !651, file: !422, line: 203, baseType: !675, size: 64, offset: 9024)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !651, file: !422, line: 204, baseType: !861, size: 64, offset: 9088)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !651, file: !422, line: 205, baseType: !990, size: 64, offset: 9152)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !651, file: !422, line: 206, baseType: !1145, size: 64, offset: 9216)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!319, !304, !644, !480, !721, !722}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !651, file: !422, line: 208, baseType: !1149, size: 64, offset: 9280)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!319, !480, !817}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !651, file: !422, line: 209, baseType: !1030, size: 64, offset: 9344)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !651, file: !422, line: 210, baseType: !824, size: 64, offset: 9408)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !646, file: !422, line: 438, baseType: !1155, size: 64, offset: 13952)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !689, line: 60, baseType: !1156)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1158)
!1158 = !{!1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1157, file: !114, line: 241, baseType: !304, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1157, file: !114, line: 242, baseType: !497, size: 32, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1157, file: !114, line: 243, baseType: !480, size: 32, offset: 96)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1157, file: !114, line: 243, baseType: !480, size: 32, offset: 128)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1157, file: !114, line: 244, baseType: !480, size: 32, offset: 160)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1157, file: !114, line: 244, baseType: !480, size: 32, offset: 192)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1157, file: !114, line: 245, baseType: !525, size: 64, offset: 256)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1157, file: !114, line: 246, baseType: !595, size: 32, offset: 320)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1157, file: !114, line: 247, baseType: !480, size: 32, offset: 352)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1157, file: !114, line: 251, baseType: !480, size: 32, offset: 384)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1157, file: !114, line: 252, baseType: !961, size: 64, offset: 448)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1157, file: !114, line: 253, baseType: !595, size: 32, offset: 512)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1157, file: !114, line: 254, baseType: !480, size: 32, offset: 544)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1157, file: !114, line: 254, baseType: !480, size: 32, offset: 576)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1157, file: !114, line: 255, baseType: !480, size: 32, offset: 608)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !646, file: !422, line: 438, baseType: !1155, size: 64, offset: 14016)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !646, file: !422, line: 439, baseType: !308, size: 64, offset: 14080)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !646, file: !422, line: 440, baseType: !1177, size: 32, offset: 14144)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !646, file: !422, line: 441, baseType: !595, size: 32, offset: 14176)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !646, file: !422, line: 442, baseType: !595, size: 32, offset: 14208)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !646, file: !422, line: 443, baseType: !1181, size: 448, offset: 14272)
!1181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1182, size: 448, elements: !1183)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !301)
!1183 = !{!1184}
!1184 = !DISubrange(count: 7)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !646, file: !422, line: 444, baseType: !595, size: 32, offset: 14720)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !646, file: !422, line: 445, baseType: !595, size: 32, offset: 14752)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !646, file: !422, line: 446, baseType: !480, size: 32, offset: 14784)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !646, file: !422, line: 447, baseType: !518, size: 64, offset: 14848)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !646, file: !422, line: 448, baseType: !518, size: 64, offset: 14912)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !646, file: !422, line: 449, baseType: !729, size: 640, offset: 14976)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !646, file: !422, line: 450, baseType: !661, size: 32, offset: 15616)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !646, file: !422, line: 451, baseType: !1193, size: 2880, offset: 15680)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !422, line: 318, baseType: !1194)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !422, line: 319, size: 2880, elements: !1195)
!1195 = !{!1196, !1197, !1198, !1199, !1200, !1201, !1202, !1215, !1216, !1221, !1226, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1241, !1242, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1274, !1275, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1298, !1299, !1300, !1304, !1305}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1194, file: !422, line: 320, baseType: !480, size: 32)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1194, file: !422, line: 321, baseType: !480, size: 32, offset: 32)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1194, file: !422, line: 322, baseType: !480, size: 32, offset: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1194, file: !422, line: 323, baseType: !480, size: 32, offset: 96)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1194, file: !422, line: 324, baseType: !480, size: 32, offset: 128)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1194, file: !422, line: 325, baseType: !480, size: 32, offset: 160)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1194, file: !422, line: 326, baseType: !1203, size: 64, offset: 192)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !422, line: 293, baseType: !1204)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !422, line: 295, size: 448, elements: !1206)
!1206 = !{!1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1205, file: !422, line: 296, baseType: !1203, size: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1205, file: !422, line: 297, baseType: !542, size: 64, offset: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1205, file: !422, line: 297, baseType: !542, size: 64, offset: 128)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1205, file: !422, line: 298, baseType: !525, size: 64, offset: 192)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1205, file: !422, line: 298, baseType: !525, size: 64, offset: 256)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1205, file: !422, line: 299, baseType: !480, size: 32, offset: 320)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1205, file: !422, line: 300, baseType: !480, size: 32, offset: 352)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1205, file: !422, line: 301, baseType: !480, size: 32, offset: 384)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1194, file: !422, line: 326, baseType: !1203, size: 64, offset: 256)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1194, file: !422, line: 328, baseType: !1217, size: 64, offset: 320)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64)
!1218 = !DISubroutineType(types: !1219)
!1219 = !{!319, !644, !1220, !525}
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1194, file: !422, line: 329, baseType: !1222, size: 64, offset: 384)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{!319, !1220, !1225, !527, !527, !545, !525}
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1194, file: !422, line: 330, baseType: !1227, size: 64, offset: 448)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{!319, !1220}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1194, file: !422, line: 331, baseType: !1227, size: 64, offset: 512)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1194, file: !422, line: 334, baseType: !304, size: 64, offset: 576)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1194, file: !422, line: 335, baseType: !497, size: 32, offset: 640)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1194, file: !422, line: 335, baseType: !497, size: 32, offset: 672)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1194, file: !422, line: 336, baseType: !497, size: 32, offset: 704)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1194, file: !422, line: 336, baseType: !497, size: 32, offset: 736)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1194, file: !422, line: 337, baseType: !1237, size: 64, offset: 768)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !305, line: 339, baseType: !1239)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64)
!1240 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !305, line: 339, flags: DIFlagFwdDecl)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1194, file: !422, line: 338, baseType: !1237, size: 64, offset: 832)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1194, file: !422, line: 339, baseType: !1243, size: 64, offset: 896)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !305, line: 341, baseType: !1245)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !305, line: 351, size: 192, elements: !1246)
!1246 = !{!1247, !1248, !1249, !1250, !1251}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1245, file: !305, line: 354, baseType: !72, size: 32)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1245, file: !305, line: 355, baseType: !72, size: 32, offset: 32)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1245, file: !305, line: 356, baseType: !72, size: 32, offset: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1245, file: !305, line: 361, baseType: !72, size: 32, offset: 96)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1245, file: !305, line: 362, baseType: !591, size: 64, offset: 128)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1194, file: !422, line: 340, baseType: !480, size: 32, offset: 960)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1194, file: !422, line: 340, baseType: !480, size: 32, offset: 992)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1194, file: !422, line: 341, baseType: !542, size: 64, offset: 1024)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1194, file: !422, line: 342, baseType: !525, size: 64, offset: 1088)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1194, file: !422, line: 343, baseType: !545, size: 64, offset: 1152)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1194, file: !422, line: 344, baseType: !527, size: 64, offset: 1216)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1194, file: !422, line: 345, baseType: !480, size: 32, offset: 1280)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1194, file: !422, line: 346, baseType: !1225, size: 64, offset: 1344)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1194, file: !422, line: 347, baseType: !595, size: 32, offset: 1408)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1194, file: !422, line: 348, baseType: !480, size: 32, offset: 1440)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1194, file: !422, line: 351, baseType: !595, size: 32, offset: 1472)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1194, file: !422, line: 352, baseType: !595, size: 32, offset: 1504)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1194, file: !422, line: 353, baseType: !497, size: 32, offset: 1536)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1194, file: !422, line: 354, baseType: !497, size: 32, offset: 1568)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1194, file: !422, line: 355, baseType: !1225, size: 64, offset: 1600)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1194, file: !422, line: 356, baseType: !1225, size: 64, offset: 1664)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1194, file: !422, line: 357, baseType: !1269, size: 64, offset: 1728)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !422, line: 310, baseType: !1271)
!1271 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !422, line: 308, size: 32, elements: !1272)
!1272 = !{!1273}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1271, file: !422, line: 309, baseType: !480, size: 32)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1194, file: !422, line: 357, baseType: !1269, size: 64, offset: 1792)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1194, file: !422, line: 358, baseType: !1276, size: 64, offset: 1856)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64)
!1277 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !422, line: 316, baseType: !1278)
!1278 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !422, line: 312, size: 128, elements: !1279)
!1279 = !{!1280, !1281, !1282}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1278, file: !422, line: 313, baseType: !308, size: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1278, file: !422, line: 314, baseType: !480, size: 32, offset: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1278, file: !422, line: 315, baseType: !303, size: 8, offset: 96)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1194, file: !422, line: 359, baseType: !1276, size: 64, offset: 1920)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1194, file: !422, line: 360, baseType: !1276, size: 64, offset: 1984)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1194, file: !422, line: 361, baseType: !480, size: 32, offset: 2048)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1194, file: !422, line: 362, baseType: !497, size: 32, offset: 2080)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1194, file: !422, line: 363, baseType: !480, size: 32, offset: 2112)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1194, file: !422, line: 364, baseType: !1225, size: 64, offset: 2176)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1194, file: !422, line: 365, baseType: !1243, size: 64, offset: 2240)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1194, file: !422, line: 366, baseType: !497, size: 32, offset: 2304)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1194, file: !422, line: 367, baseType: !497, size: 32, offset: 2336)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1194, file: !422, line: 368, baseType: !1237, size: 64, offset: 2368)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1194, file: !422, line: 369, baseType: !1237, size: 64, offset: 2432)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1194, file: !422, line: 370, baseType: !1295, size: 64, offset: 2496)
!1295 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1296)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64)
!1297 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1194, file: !422, line: 371, baseType: !1295, size: 64, offset: 2560)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1194, file: !422, line: 372, baseType: !1295, size: 64, offset: 2624)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1194, file: !422, line: 373, baseType: !1301, size: 64, offset: 2688)
!1301 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !305, line: 331, baseType: !1302)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64)
!1303 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !305, line: 331, flags: DIFlagFwdDecl)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1194, file: !422, line: 374, baseType: !591, size: 64, offset: 2752)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1194, file: !422, line: 375, baseType: !1306, size: 64, offset: 2816)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !646, file: !422, line: 451, baseType: !1193, size: 2880, offset: 18560)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !646, file: !422, line: 452, baseType: !1309, size: 64, offset: 21440)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1310)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64)
!1311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !422, line: 681, size: 4864, elements: !1312)
!1312 = !{!1313, !1314, !1315, !1316, !1317, !1318, !1319, !1323}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1311, file: !422, line: 682, baseType: !425, size: 4480)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1311, file: !422, line: 682, baseType: !873, size: 32, offset: 4480)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1311, file: !422, line: 683, baseType: !595, size: 32, offset: 4512)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1311, file: !422, line: 684, baseType: !480, size: 32, offset: 4544)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1311, file: !422, line: 685, baseType: !1023, size: 64, offset: 4608)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1311, file: !422, line: 686, baseType: !542, size: 64, offset: 4672)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1311, file: !422, line: 687, baseType: !1320, size: 64, offset: 4736)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64)
!1321 = !DISubroutineType(types: !1322)
!1322 = !{!319, !1309, !671, !308}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1311, file: !422, line: 688, baseType: !308, size: 64, offset: 4800)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "transnullsp", scope: !646, file: !422, line: 453, baseType: !1309, size: 64, offset: 21504)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullsp", scope: !646, file: !422, line: 454, baseType: !1309, size: 64, offset: 21568)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "congruentlayouts", scope: !646, file: !422, line: 455, baseType: !480, size: 32, offset: 21632)
