; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/ngmres/snesngmres.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/ngmres/snesngmres.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_datatype_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!62 = !{!63, !64, !65, !66, !67, !68}
!63 = !DIEnumerator(name: "SNES_NORM_DEFAULT", value: -1)
!64 = !DIEnumerator(name: "SNES_NORM_NONE", value: 0)
!65 = !DIEnumerator(name: "SNES_NORM_ALWAYS", value: 1)
!66 = !DIEnumerator(name: "SNES_NORM_INITIAL_ONLY", value: 2)
!67 = !DIEnumerator(name: "SNES_NORM_FINAL_ONLY", value: 3)
!68 = !DIEnumerator(name: "SNES_NORM_INITIAL_FINAL_ONLY", value: 4)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 493, baseType: !28, size: 32, elements: !70)
!70 = !{!71, !72, !73}
!71 = !DIEnumerator(name: "SNES_FUNCTION_DEFAULT", value: -1)
!72 = !DIEnumerator(name: "SNES_FUNCTION_UNPRECONDITIONED", value: 0)
!73 = !DIEnumerator(name: "SNES_FUNCTION_PRECONDITIONED", value: 1)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 753, baseType: !7, size: 32, elements: !75)
!75 = !{!76, !77, !78}
!76 = !DIEnumerator(name: "SNES_NGMRES_RESTART_NONE", value: 0, isUnsigned: true)
!77 = !DIEnumerator(name: "SNES_NGMRES_RESTART_PERIODIC", value: 1, isUnsigned: true)
!78 = !DIEnumerator(name: "SNES_NGMRES_RESTART_DIFFERENCE", value: 2, isUnsigned: true)
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 759, baseType: !7, size: 32, elements: !80)
!80 = !{!81, !82, !83}
!81 = !DIEnumerator(name: "SNES_NGMRES_SELECT_NONE", value: 0, isUnsigned: true)
!82 = !DIEnumerator(name: "SNES_NGMRES_SELECT_DIFFERENCE", value: 1, isUnsigned: true)
!83 = !DIEnumerator(name: "SNES_NGMRES_SELECT_LINESEARCH", value: 2, isUnsigned: true)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !85, line: 663, baseType: !7, size: 32, elements: !86)
!85 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!86 = !{!87, !88, !89}
!87 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!90 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 58, baseType: !7, size: 32, elements: !91)
!91 = !{!92}
!92 = !DIEnumerator(name: "ENUM_DUMMY", value: 0, isUnsigned: true)
!93 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 616, baseType: !7, size: 32, elements: !94)
!94 = !{!95, !96, !97, !98, !99, !100}
!95 = !DIEnumerator(name: "SNES_LINESEARCH_SUCCEEDED", value: 0, isUnsigned: true)
!96 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_NANORINF", value: 1, isUnsigned: true)
!97 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_DOMAIN", value: 2, isUnsigned: true)
!98 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_REDUCT", value: 3, isUnsigned: true)
!99 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_USER", value: 4, isUnsigned: true)
!100 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_FUNCTION", value: 5, isUnsigned: true)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 155, baseType: !7, size: 32, elements: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!103 = !{!104, !105, !106, !107, !108}
!104 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!105 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!107 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!108 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !110)
!110 = !{!111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128}
!111 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!112 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!113 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!114 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!115 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!116 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!117 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!120 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!121 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!122 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!123 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!124 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!125 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!126 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!127 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!128 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!129 = !{!130, !193, !197, !198, !201, !357, !390, !391, !267, !392, !395, !277, !28, !398, !399, !7}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES_NGMRES", file: !132, line: 60, baseType: !133)
!132 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/snes/impls/ngmres/snesngmres.h", directory: "/home/users/ndemeye/xSDK")
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !132, line: 7, size: 1984, elements: !134)
!134 = !{!135, !137, !138, !143, !144, !146, !148, !153, !154, !158, !159, !162, !163, !164, !168, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "msize", scope: !133, file: !132, line: 10, baseType: !136, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "restart_it", scope: !133, file: !132, line: 11, baseType: !136, size: 32, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !133, file: !132, line: 12, baseType: !139, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !140, line: 16, baseType: !141)
!140 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !140, line: 16, flags: DIFlagFwdDecl)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "restart_periodic", scope: !133, file: !132, line: 13, baseType: !136, size: 32, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "restart_type", scope: !133, file: !132, line: 15, baseType: !145, size: 32, offset: 160)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESNGMRESRestartType", file: !27, line: 756, baseType: !74)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "select_type", scope: !133, file: !132, line: 16, baseType: !147, size: 32, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESNGMRESSelectType", file: !27, line: 762, baseType: !79)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "Fdot", scope: !133, file: !132, line: 19, baseType: !149, size: 64, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !102, line: 21, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !102, line: 21, flags: DIFlagFwdDecl)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "Xdot", scope: !133, file: !132, line: 20, baseType: !149, size: 64, offset: 320)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "fnorms", scope: !133, file: !132, line: 21, baseType: !155, size: 64, offset: 384)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !157)
!157 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "xnorms", scope: !133, file: !132, line: 22, baseType: !155, size: 64, offset: 448)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !133, file: !132, line: 25, baseType: !160, size: 64, offset: 512)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !156)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "beta", scope: !133, file: !132, line: 26, baseType: !160, size: 64, offset: 576)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "xi", scope: !133, file: !132, line: 27, baseType: !160, size: 64, offset: 640)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "additive_linesearch", scope: !133, file: !132, line: 30, baseType: !165, size: 64, offset: 704)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearch", file: !27, line: 526, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_LineSearch", file: !27, line: 526, flags: DIFlagFwdDecl)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "candidate", scope: !133, file: !132, line: 33, baseType: !169, size: 32, offset: 768)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "approxfunc", scope: !133, file: !132, line: 34, baseType: !169, size: 32, offset: 800)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "singlereduction", scope: !133, file: !132, line: 35, baseType: !169, size: 32, offset: 832)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "gammaA", scope: !133, file: !132, line: 36, baseType: !156, size: 64, offset: 896)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "epsilonB", scope: !133, file: !132, line: 37, baseType: !156, size: 64, offset: 960)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "deltaB", scope: !133, file: !132, line: 38, baseType: !156, size: 64, offset: 1024)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "gammaC", scope: !133, file: !132, line: 39, baseType: !156, size: 64, offset: 1088)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "restart_fm_rise", scope: !133, file: !132, line: 40, baseType: !169, size: 32, offset: 1152)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "andersonBeta", scope: !133, file: !132, line: 42, baseType: !156, size: 64, offset: 1216)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !133, file: !132, line: 45, baseType: !160, size: 64, offset: 1280)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !133, file: !132, line: 46, baseType: !180, size: 32, offset: 1344)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBLASInt", file: !6, line: 140, baseType: !28)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !133, file: !132, line: 47, baseType: !180, size: 32, offset: 1376)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nrhs", scope: !133, file: !132, line: 48, baseType: !180, size: 32, offset: 1408)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "lda", scope: !133, file: !132, line: 49, baseType: !180, size: 32, offset: 1440)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "ldb", scope: !133, file: !132, line: 50, baseType: !180, size: 32, offset: 1472)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !133, file: !132, line: 51, baseType: !155, size: 64, offset: 1536)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "rcond", scope: !133, file: !132, line: 52, baseType: !156, size: 64, offset: 1600)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !133, file: !132, line: 53, baseType: !180, size: 32, offset: 1664)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !133, file: !132, line: 54, baseType: !160, size: 64, offset: 1728)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "rwork", scope: !133, file: !132, line: 55, baseType: !155, size: 64, offset: 1792)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "lwork", scope: !133, file: !132, line: 56, baseType: !180, size: 32, offset: 1856)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !133, file: !132, line: 57, baseType: !180, size: 32, offset: 1888)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "setup_called", scope: !133, file: !132, line: 59, baseType: !169, size: 32, offset: 1920)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !194, line: 330, baseType: !195)
!194 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !194, line: 330, flags: DIFlagFwdDecl)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !200)
!200 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !204, line: 73, size: 4480, elements: !205)
!204 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!205 = !{!206, !208, !250, !251, !252, !254, !255, !256, !257, !265, !266, !268, !272, !276, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !289, !290, !291, !293, !294, !296, !298, !299, !300, !301, !302, !303, !305, !306, !307, !308, !309, !310, !312, !313, !314, !324, !326, !327, !331, !332, !380, !385, !387, !388, !389}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !203, file: !204, line: 74, baseType: !207, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !203, file: !204, line: 75, baseType: !209, size: 448, offset: 64)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 448, elements: !248)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !204, line: 53, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !204, line: 45, size: 448, elements: !212)
!212 = !{!213, !219, !223, !228, !232, !236, !243}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !211, file: !204, line: 46, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!217, !201, !218}
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !211, file: !204, line: 47, baseType: !220, size: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!217, !201, !139}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !211, file: !204, line: 48, baseType: !224, size: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!217, !227}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !211, file: !204, line: 49, baseType: !229, size: 64, offset: 192)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!217, !201, !198, !201}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !211, file: !204, line: 50, baseType: !233, size: 64, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!217, !201, !198, !227}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !211, file: !204, line: 51, baseType: !237, size: 64, offset: 320)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!217, !201, !198, !240}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{null}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !211, file: !204, line: 52, baseType: !244, size: 64, offset: 384)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!217, !201, !198, !247}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!248 = !{!249}
!249 = !DISubrange(count: 1)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !203, file: !204, line: 76, baseType: !193, size: 64, offset: 512)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !203, file: !204, line: 77, baseType: !136, size: 32, offset: 576)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !203, file: !204, line: 78, baseType: !253, size: 64, offset: 640)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !157)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !203, file: !204, line: 78, baseType: !253, size: 64, offset: 704)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !203, file: !204, line: 78, baseType: !253, size: 64, offset: 768)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !203, file: !204, line: 78, baseType: !253, size: 64, offset: 832)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !203, file: !204, line: 79, baseType: !258, size: 64, offset: 896)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !261, line: 27, baseType: !262)
!261 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !263, line: 43, baseType: !264)
!263 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!264 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !203, file: !204, line: 80, baseType: !136, size: 32, offset: 960)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !203, file: !204, line: 81, baseType: !267, size: 32, offset: 992)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !203, file: !204, line: 82, baseType: !269, size: 64, offset: 1024)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !203, file: !204, line: 83, baseType: !273, size: 64, offset: 1088)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !203, file: !204, line: 84, baseType: !277, size: 64, offset: 1152)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !203, file: !204, line: 85, baseType: !277, size: 64, offset: 1216)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !203, file: !204, line: 86, baseType: !277, size: 64, offset: 1280)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !203, file: !204, line: 87, baseType: !277, size: 64, offset: 1344)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !203, file: !204, line: 88, baseType: !201, size: 64, offset: 1408)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !203, file: !204, line: 89, baseType: !258, size: 64, offset: 1472)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !203, file: !204, line: 90, baseType: !277, size: 64, offset: 1536)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !203, file: !204, line: 91, baseType: !277, size: 64, offset: 1600)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !203, file: !204, line: 92, baseType: !136, size: 32, offset: 1664)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !203, file: !204, line: 93, baseType: !197, size: 64, offset: 1728)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !203, file: !204, line: 94, baseType: !288, size: 64, offset: 1792)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !259)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !203, file: !204, line: 95, baseType: !136, size: 32, offset: 1856)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !203, file: !204, line: 95, baseType: !136, size: 32, offset: 1888)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !203, file: !204, line: 96, baseType: !292, size: 64, offset: 1920)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !203, file: !204, line: 96, baseType: !292, size: 64, offset: 1984)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !203, file: !204, line: 97, baseType: !295, size: 64, offset: 2048)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !203, file: !204, line: 97, baseType: !297, size: 64, offset: 2112)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !203, file: !204, line: 98, baseType: !136, size: 32, offset: 2176)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !203, file: !204, line: 98, baseType: !136, size: 32, offset: 2208)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !203, file: !204, line: 99, baseType: !292, size: 64, offset: 2240)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !203, file: !204, line: 99, baseType: !292, size: 64, offset: 2304)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !203, file: !204, line: 100, baseType: !155, size: 64, offset: 2368)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !203, file: !204, line: 100, baseType: !304, size: 64, offset: 2432)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !203, file: !204, line: 101, baseType: !136, size: 32, offset: 2496)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !203, file: !204, line: 101, baseType: !136, size: 32, offset: 2528)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !203, file: !204, line: 102, baseType: !292, size: 64, offset: 2560)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !203, file: !204, line: 102, baseType: !292, size: 64, offset: 2624)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !203, file: !204, line: 103, baseType: !160, size: 64, offset: 2688)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !203, file: !204, line: 103, baseType: !311, size: 64, offset: 2752)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !203, file: !204, line: 104, baseType: !247, size: 64, offset: 2816)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !203, file: !204, line: 105, baseType: !136, size: 32, offset: 2880)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !203, file: !204, line: 106, baseType: !315, size: 128, offset: 2944)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 128, elements: !322)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !204, line: 64, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !204, line: 61, size: 128, elements: !319)
!319 = !{!320, !321}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !318, file: !204, line: 62, baseType: !240, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !318, file: !204, line: 63, baseType: !197, size: 64, offset: 64)
!322 = !{!323}
!323 = !DISubrange(count: 2)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !203, file: !204, line: 107, baseType: !325, size: 64, offset: 3072)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 64, elements: !322)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !203, file: !204, line: 108, baseType: !197, size: 64, offset: 3136)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !203, file: !204, line: 109, baseType: !328, size: 64, offset: 3200)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!217, !197}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !203, file: !204, line: 111, baseType: !136, size: 32, offset: 3264)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !203, file: !204, line: 112, baseType: !333, size: 320, offset: 3328)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 320, elements: !378)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!217, !337, !201, !197}
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !340)
!340 = !{!341, !342, !366, !367, !368, !369, !370, !371, !372, !373, !374}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !339, file: !12, line: 100, baseType: !136, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !339, file: !12, line: 101, baseType: !343, size: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !346)
!346 = !{!347, !348, !349, !350, !351, !354, !355, !356, !360, !361, !363, !364, !365}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !345, file: !12, line: 84, baseType: !277, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !345, file: !12, line: 85, baseType: !277, size: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !345, file: !12, line: 86, baseType: !197, size: 64, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !345, file: !12, line: 87, baseType: !269, size: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !345, file: !12, line: 88, baseType: !352, size: 64, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !345, file: !12, line: 89, baseType: !200, size: 8, offset: 320)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !345, file: !12, line: 90, baseType: !277, size: 64, offset: 384)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !345, file: !12, line: 91, baseType: !357, size: 64, offset: 448)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !358, line: 46, baseType: !359)
!358 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!359 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !345, file: !12, line: 92, baseType: !169, size: 32, offset: 512)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !345, file: !12, line: 93, baseType: !362, size: 32, offset: 544)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !345, file: !12, line: 94, baseType: !343, size: 64, offset: 576)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !345, file: !12, line: 95, baseType: !277, size: 64, offset: 640)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !345, file: !12, line: 96, baseType: !197, size: 64, offset: 704)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !339, file: !12, line: 102, baseType: !277, size: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !339, file: !12, line: 102, baseType: !277, size: 64, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !339, file: !12, line: 103, baseType: !277, size: 64, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !339, file: !12, line: 104, baseType: !193, size: 64, offset: 320)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !339, file: !12, line: 105, baseType: !169, size: 32, offset: 384)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !339, file: !12, line: 105, baseType: !169, size: 32, offset: 416)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !339, file: !12, line: 105, baseType: !169, size: 32, offset: 448)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !339, file: !12, line: 106, baseType: !201, size: 64, offset: 512)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !339, file: !12, line: 107, baseType: !375, size: 64, offset: 576)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!378 = !{!379}
!379 = !DISubrange(count: 5)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !203, file: !204, line: 113, baseType: !381, size: 320, offset: 3648)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !382, size: 320, elements: !378)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!217, !201, !197}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !203, file: !204, line: 114, baseType: !386, size: 320, offset: 3968)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 320, elements: !378)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !203, file: !204, line: 115, baseType: !169, size: 32, offset: 4288)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !203, file: !204, line: 120, baseType: !375, size: 64, offset: 4352)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !203, file: !204, line: 121, baseType: !169, size: 32, offset: 4416)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscEnum", file: !6, line: 58, baseType: !90)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !194, line: 331, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !194, line: 331, flags: DIFlagFwdDecl)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !194, line: 338, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !194, line: 338, flags: DIFlagFwdDecl)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !400, line: 1451, baseType: !240)
!400 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!401 = !{!0, !402}
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "SNESNGMRESSelectTypes", scope: !2, file: !404, line: 6, type: !405, isLocal: false, isDefinition: true)
!404 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/snes/impls/ngmres/snesngmres.c", directory: "/home/users/ndemeye/xSDK")
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !353, size: 384, elements: !406)
!406 = !{!407}
!407 = !DISubrange(count: 6)
!408 = !{i32 7, !"Dwarf Version", i32 4}
!409 = !{i32 2, !"Debug Info Version", i32 3}
!410 = !{i32 1, !"wchar_size", i32 4}
!411 = !{i32 7, !"PIC Level", i32 2}
!412 = !{i32 7, !"uwtable", i32 1}
!413 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!414 = distinct !DISubprogram(name: "SNESReset_NGMRES", scope: !404, file: !404, line: 8, type: !415, scopeLine: 9, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !597)
!415 = !DISubroutineType(types: !416)
!416 = !{!217, !417}
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !27, line: 18, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !420, line: 38, size: 11648, elements: !421)
!420 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/snesimpl.h", directory: "/home/users/ndemeye/xSDK")
!421 = !{!422, !424, !485, !490, !491, !492, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !508, !509, !510, !512, !513, !514, !515, !516, !521, !523, !524, !525, !526, !527, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !563, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !419, file: !420, line: 39, baseType: !423, size: 4480)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !204, line: 122, baseType: !203)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !419, file: !420, line: 39, baseType: !425, size: 1088, offset: 4480)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 1088, elements: !248)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SNESOps", file: !420, line: 12, size: 1088, elements: !427)
!427 = !{!428, !432, !436, !440, !446, !447, !449, !450, !454, !458, !459, !460, !465, !469, !473, !477, !484}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "computeinitialguess", scope: !426, file: !420, line: 13, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!217, !417, !150, !197}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "computescaling", scope: !426, file: !420, line: 14, baseType: !433, size: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!217, !150, !150, !197}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !426, file: !420, line: 15, baseType: !437, size: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!217, !417, !136}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !426, file: !420, line: 16, baseType: !441, size: 64, offset: 192)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!217, !417, !136, !156, !156, !156, !444, !197}
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESConvergedReason", file: !27, line: 257, baseType: !26)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !426, file: !420, line: 17, baseType: !328, size: 64, offset: 256)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !426, file: !420, line: 18, baseType: !448, size: 64, offset: 320)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !426, file: !420, line: 19, baseType: !448, size: 64, offset: 384)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !426, file: !420, line: 20, baseType: !451, size: 64, offset: 448)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!217, !417, !139}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !426, file: !420, line: 21, baseType: !455, size: 64, offset: 512)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!217, !337, !417}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !426, file: !420, line: 22, baseType: !448, size: 64, offset: 576)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !426, file: !420, line: 23, baseType: !448, size: 64, offset: 640)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "usercompute", scope: !426, file: !420, line: 24, baseType: !461, size: 64, offset: 704)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!217, !417, !464}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "userdestroy", scope: !426, file: !420, line: 25, baseType: !466, size: 64, offset: 768)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!217, !464}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !426, file: !420, line: 26, baseType: !470, size: 64, offset: 832)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!217, !417, !150, !150}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "computepfunction", scope: !426, file: !420, line: 27, baseType: !474, size: 64, offset: 896)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!217, !417, !150, !150, !197}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "computepjacobian", scope: !426, file: !420, line: 28, baseType: !478, size: 64, offset: 960)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!217, !417, !150, !481, !481, !197}
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !55, line: 16, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !55, line: 16, flags: DIFlagFwdDecl)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !426, file: !420, line: 29, baseType: !451, size: 64, offset: 1024)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !419, file: !420, line: 40, baseType: !486, size: 64, offset: 5568)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !487, line: 14, baseType: !488)
!487 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !487, line: 14, flags: DIFlagFwdDecl)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !419, file: !420, line: 41, baseType: !169, size: 32, offset: 5632)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "npc", scope: !419, file: !420, line: 42, baseType: !417, size: 64, offset: 5696)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "npcside", scope: !419, file: !420, line: 43, baseType: !493, size: 32, offset: 5760)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !48, line: 85, baseType: !47)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "usesnpc", scope: !419, file: !420, line: 44, baseType: !169, size: 32, offset: 5792)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !419, file: !420, line: 47, baseType: !197, size: 64, offset: 5824)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !419, file: !420, line: 49, baseType: !150, size: 64, offset: 5888)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !419, file: !420, line: 50, baseType: !150, size: 64, offset: 5952)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !419, file: !420, line: 52, baseType: !150, size: 64, offset: 6016)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !419, file: !420, line: 54, baseType: !481, size: 64, offset: 6080)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !419, file: !420, line: 55, baseType: !481, size: 64, offset: 6144)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "picard", scope: !419, file: !420, line: 56, baseType: !481, size: 64, offset: 6208)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "initialguessP", scope: !419, file: !420, line: 57, baseType: !197, size: 64, offset: 6272)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !419, file: !420, line: 58, baseType: !504, size: 64, offset: 6336)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !505, line: 22, baseType: !506)
!505 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !505, line: 22, flags: DIFlagFwdDecl)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !419, file: !420, line: 59, baseType: !165, size: 64, offset: 6400)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "usesksp", scope: !419, file: !420, line: 60, baseType: !169, size: 32, offset: 6464)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "matstruct", scope: !419, file: !420, line: 61, baseType: !511, size: 32, offset: 6496)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !55, line: 285, baseType: !54)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_update", scope: !419, file: !420, line: 63, baseType: !150, size: 64, offset: 6528)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "scaling", scope: !419, file: !420, line: 65, baseType: !150, size: 64, offset: 6592)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "scaP", scope: !419, file: !420, line: 66, baseType: !197, size: 64, offset: 6656)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !419, file: !420, line: 68, baseType: !156, size: 64, offset: 6720)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !419, file: !420, line: 74, baseType: !517, size: 320, offset: 6784)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !518, size: 320, elements: !378)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{!217, !417, !136, !156, !197}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !419, file: !420, line: 75, baseType: !522, size: 320, offset: 7104)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 320, elements: !378)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !419, file: !420, line: 76, baseType: !386, size: 320, offset: 7424)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !419, file: !420, line: 77, baseType: !136, size: 32, offset: 7744)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !419, file: !420, line: 78, baseType: !197, size: 64, offset: 7808)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !419, file: !420, line: 79, baseType: !445, size: 32, offset: 7872)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !419, file: !420, line: 80, baseType: !528, size: 320, offset: 7936)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !529, size: 320, elements: !378)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!217, !417, !197}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !419, file: !420, line: 81, baseType: !522, size: 320, offset: 8256)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !419, file: !420, line: 82, baseType: !386, size: 320, offset: 8576)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !419, file: !420, line: 83, baseType: !136, size: 32, offset: 8896)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !419, file: !420, line: 84, baseType: !169, size: 32, offset: 8928)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !419, file: !420, line: 88, baseType: !169, size: 32, offset: 8960)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !419, file: !420, line: 89, baseType: !197, size: 64, offset: 9024)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !419, file: !420, line: 93, baseType: !136, size: 32, offset: 9088)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !419, file: !420, line: 94, baseType: !136, size: 32, offset: 9120)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !419, file: !420, line: 95, baseType: !136, size: 32, offset: 9152)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !419, file: !420, line: 96, baseType: !136, size: 32, offset: 9184)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "linear_its", scope: !419, file: !420, line: 97, baseType: !136, size: 32, offset: 9216)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !419, file: !420, line: 98, baseType: !156, size: 64, offset: 9280)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !419, file: !420, line: 99, baseType: !156, size: 64, offset: 9344)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !419, file: !420, line: 100, baseType: !156, size: 64, offset: 9408)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !419, file: !420, line: 101, baseType: !156, size: 64, offset: 9472)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !419, file: !420, line: 102, baseType: !156, size: 64, offset: 9536)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !419, file: !420, line: 103, baseType: !156, size: 64, offset: 9600)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "stol", scope: !419, file: !420, line: 104, baseType: !156, size: 64, offset: 9664)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "deltatol", scope: !419, file: !420, line: 105, baseType: !156, size: 64, offset: 9728)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "forceiteration", scope: !419, file: !420, line: 106, baseType: !169, size: 32, offset: 9792)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "lagpreconditioner", scope: !419, file: !420, line: 107, baseType: !136, size: 32, offset: 9824)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "lagjacobian", scope: !419, file: !420, line: 108, baseType: !136, size: 32, offset: 9856)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "jac_iter", scope: !419, file: !420, line: 109, baseType: !136, size: 32, offset: 9888)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "lagjac_persist", scope: !419, file: !420, line: 110, baseType: !169, size: 32, offset: 9920)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "pre_iter", scope: !419, file: !420, line: 111, baseType: !136, size: 32, offset: 9952)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "lagpre_persist", scope: !419, file: !420, line: 112, baseType: !169, size: 32, offset: 9984)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "gridsequence", scope: !419, file: !420, line: 113, baseType: !136, size: 32, offset: 10016)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "tolerancesset", scope: !419, file: !420, line: 115, baseType: !169, size: 32, offset: 10048)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_init_set", scope: !419, file: !420, line: 117, baseType: !169, size: 32, offset: 10080)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "normschedule", scope: !419, file: !420, line: 119, baseType: !562, size: 32, offset: 10112)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESNormSchedule", file: !27, line: 411, baseType: !61)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !419, file: !420, line: 120, baseType: !564, size: 32, offset: 10144)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESFunctionType", file: !27, line: 495, baseType: !69)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !419, file: !420, line: 124, baseType: !136, size: 32, offset: 10176)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !419, file: !420, line: 125, baseType: !149, size: 64, offset: 10240)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !419, file: !420, line: 129, baseType: !136, size: 32, offset: 10304)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist", scope: !419, file: !420, line: 130, baseType: !155, size: 64, offset: 10368)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_its", scope: !419, file: !420, line: 132, baseType: !295, size: 64, offset: 10432)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_len", scope: !419, file: !420, line: 133, baseType: !136, size: 32, offset: 10496)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_max", scope: !419, file: !420, line: 134, baseType: !136, size: 32, offset: 10528)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_reset", scope: !419, file: !420, line: 135, baseType: !169, size: 32, offset: 10560)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_alloc", scope: !419, file: !420, line: 136, baseType: !169, size: 32, offset: 10592)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "counters_reset", scope: !419, file: !420, line: 137, baseType: !169, size: 32, offset: 10624)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "numFailures", scope: !419, file: !420, line: 140, baseType: !136, size: 32, offset: 10656)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "maxFailures", scope: !419, file: !420, line: 141, baseType: !136, size: 32, offset: 10688)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "numLinearSolveFailures", scope: !419, file: !420, line: 143, baseType: !136, size: 32, offset: 10720)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "maxLinearSolveFailures", scope: !419, file: !420, line: 144, baseType: !136, size: 32, offset: 10752)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "domainerror", scope: !419, file: !420, line: 146, baseType: !169, size: 32, offset: 10784)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "jacobiandomainerror", scope: !419, file: !420, line: 147, baseType: !169, size: 32, offset: 10816)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "checkjacdomainerror", scope: !419, file: !420, line: 148, baseType: !169, size: 32, offset: 10848)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_ewconv", scope: !419, file: !420, line: 150, baseType: !169, size: 32, offset: 10880)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "kspconvctx", scope: !419, file: !420, line: 151, baseType: !197, size: 64, offset: 10944)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !419, file: !420, line: 154, baseType: !156, size: 64, offset: 11008)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !419, file: !420, line: 155, baseType: !156, size: 64, offset: 11072)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "vwork", scope: !419, file: !420, line: 157, baseType: !149, size: 64, offset: 11136)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "nvwork", scope: !419, file: !420, line: 158, baseType: !136, size: 32, offset: 11200)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !419, file: !420, line: 160, baseType: !169, size: 32, offset: 11232)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "mf_operator", scope: !419, file: !420, line: 161, baseType: !169, size: 32, offset: 11264)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "mf_version", scope: !419, file: !420, line: 162, baseType: !136, size: 32, offset: 11296)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "vizerotolerance", scope: !419, file: !420, line: 164, baseType: !156, size: 64, offset: 11328)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "xl", scope: !419, file: !420, line: 165, baseType: !150, size: 64, offset: 11392)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "xu", scope: !419, file: !420, line: 165, baseType: !150, size: 64, offset: 11456)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ntruebounds", scope: !419, file: !420, line: 166, baseType: !136, size: 32, offset: 11520)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "usersetbounds", scope: !419, file: !420, line: 167, baseType: !169, size: 32, offset: 11552)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "alwayscomputesfinalresidual", scope: !419, file: !420, line: 169, baseType: !169, size: 32, offset: 11584)
!597 = !{!598, !599, !600, !601, !603, !605}
!598 = !DILocalVariable(name: "snes", arg: 1, scope: !414, file: !404, line: 8, type: !417)
!599 = !DILocalVariable(name: "ngmres", scope: !414, file: !404, line: 10, type: !130)
!600 = !DILocalVariable(name: "ierr", scope: !414, file: !404, line: 11, type: !217)
!601 = !DILocalVariable(name: "ierr__", scope: !602, file: !404, line: 14, type: !217)
!602 = distinct !DILexicalBlock(scope: !414, file: !404, line: 14, column: 54)
!603 = !DILocalVariable(name: "ierr__", scope: !604, file: !404, line: 15, type: !217)
!604 = distinct !DILexicalBlock(scope: !414, file: !404, line: 15, column: 54)
!605 = !DILocalVariable(name: "ierr__", scope: !606, file: !404, line: 16, type: !217)
!606 = distinct !DILexicalBlock(scope: !414, file: !404, line: 16, column: 62)
!607 = !DILocation(line: 0, scope: !414)
!608 = !DILocation(line: 10, column: 49, scope: !414)
!609 = !{!610, !615, i64 1128}
!610 = !{!"_p_SNES", !611, i64 0, !613, i64 560, !615, i64 696, !613, i64 704, !615, i64 712, !613, i64 720, !613, i64 724, !615, i64 728, !615, i64 736, !615, i64 744, !615, i64 752, !615, i64 760, !615, i64 768, !615, i64 776, !615, i64 784, !615, i64 792, !615, i64 800, !613, i64 808, !613, i64 812, !615, i64 816, !615, i64 824, !615, i64 832, !616, i64 840, !613, i64 848, !613, i64 888, !613, i64 928, !612, i64 968, !615, i64 976, !613, i64 984, !613, i64 992, !613, i64 1032, !613, i64 1072, !612, i64 1112, !613, i64 1116, !613, i64 1120, !615, i64 1128, !612, i64 1136, !612, i64 1140, !612, i64 1144, !612, i64 1148, !612, i64 1152, !616, i64 1160, !616, i64 1168, !616, i64 1176, !616, i64 1184, !616, i64 1192, !616, i64 1200, !616, i64 1208, !616, i64 1216, !613, i64 1224, !612, i64 1228, !612, i64 1232, !612, i64 1236, !613, i64 1240, !612, i64 1244, !613, i64 1248, !612, i64 1252, !613, i64 1256, !613, i64 1260, !613, i64 1264, !613, i64 1268, !612, i64 1272, !615, i64 1280, !612, i64 1288, !615, i64 1296, !615, i64 1304, !612, i64 1312, !612, i64 1316, !613, i64 1320, !613, i64 1324, !613, i64 1328, !612, i64 1332, !612, i64 1336, !612, i64 1340, !612, i64 1344, !613, i64 1348, !613, i64 1352, !613, i64 1356, !613, i64 1360, !615, i64 1368, !616, i64 1376, !616, i64 1384, !615, i64 1392, !612, i64 1400, !613, i64 1404, !613, i64 1408, !612, i64 1412, !616, i64 1416, !615, i64 1424, !615, i64 1432, !612, i64 1440, !613, i64 1444, !613, i64 1448}
!611 = !{!"_p_PetscObject", !612, i64 0, !613, i64 8, !615, i64 64, !612, i64 72, !616, i64 80, !616, i64 88, !616, i64 96, !616, i64 104, !617, i64 112, !612, i64 120, !612, i64 124, !615, i64 128, !615, i64 136, !615, i64 144, !615, i64 152, !615, i64 160, !615, i64 168, !615, i64 176, !617, i64 184, !615, i64 192, !615, i64 200, !612, i64 208, !615, i64 216, !617, i64 224, !612, i64 232, !612, i64 236, !615, i64 240, !615, i64 248, !615, i64 256, !615, i64 264, !612, i64 272, !612, i64 276, !615, i64 280, !615, i64 288, !615, i64 296, !615, i64 304, !612, i64 312, !612, i64 316, !615, i64 320, !615, i64 328, !615, i64 336, !615, i64 344, !615, i64 352, !612, i64 360, !613, i64 368, !613, i64 384, !615, i64 392, !615, i64 400, !612, i64 408, !613, i64 416, !613, i64 456, !613, i64 496, !613, i64 536, !615, i64 544, !613, i64 552}
!612 = !{!"int", !613, i64 0}
!613 = !{!"omnipotent char", !614, i64 0}
!614 = !{!"Simple C/C++ TBAA"}
!615 = !{!"any pointer", !613, i64 0}
!616 = !{!"double", !613, i64 0}
!617 = !{!"long", !613, i64 0}
!618 = !DILocation(line: 13, column: 3, scope: !619)
!619 = distinct !DILexicalBlock(scope: !620, file: !404, line: 13, column: 3)
!620 = distinct !DILexicalBlock(scope: !621, file: !404, line: 13, column: 3)
!621 = distinct !DILexicalBlock(scope: !414, file: !404, line: 13, column: 3)
!622 = !{!615, !615, i64 0}
!623 = !DILocation(line: 13, column: 3, scope: !620)
