; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/bcgs/fbcgs/fbcgs.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/bcgs/fbcgs/fbcgs.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque

!70 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_DEPRECATED", value: 11, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK", value: 11, isUnsigned: true)
!72 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL_DEPRECATED", value: 12, isUnsigned: true)
!73 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_CELL", value: 12, isUnsigned: true)
!74 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS_DEPRECATED", value: 13, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_VTK_COORDS", value: 13, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PCICE", value: 14, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_PYTHON", value: 15, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FACTOR_INFO", value: 16, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_LATEX", value: 17, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_XML", value: 18, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_FLAMEGRAPH", value: 19, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_GLVIS", value: 20, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_VIEWER_ASCII_CSV", value: 21, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_BASIC", value: 22, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG", value: 23, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_LG_XRANGE", value: 24, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_CONTOUR", value: 25, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_VIEWER_DRAW_PORTS", value: 26, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTS", value: 27, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTR", value: 28, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_VIEWER_VTK_VTU", value: 29, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_VIEWER_BINARY_MATLAB", value: 30, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_VIEWER_NATIVE", value: 31, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_PETSC", value: 32, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 70, baseType: !5, size: 32, elements: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!105 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 451, baseType: !26, size: 32, elements: !108)
!108 = !{!109, !110, !111, !112, !113}
!109 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!110 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!111 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!112 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!113 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !115, line: 663, baseType: !5, size: 32, elements: !116)
!115 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!116 = !{!117, !118, !119}
!117 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!118 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!119 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !121, line: 155, baseType: !5, size: 32, elements: !122)
!121 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!122 = !{!123, !124, !125, !126, !127}
!123 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!124 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!125 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!126 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!127 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!128 = !{!129, !132, !150, !231, !171, !337}
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !130, line: 46, baseType: !131)
!130 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!131 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !135, line: 73, size: 4480, elements: !136)
!135 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!136 = !{!137, !139, !192, !193, !195, !198, !199, !200, !201, !209, !210, !212, !216, !220, !222, !223, !224, !225, !226, !227, !228, !229, !230, !232, !234, !235, !236, !238, !239, !241, !243, !244, !245, !246, !247, !250, !252, !253, !254, !255, !256, !259, !261, !262, !263, !273, !275, !276, !280, !281, !327, !332, !334, !335, !336}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !134, file: !135, line: 74, baseType: !138, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !134, file: !135, line: 75, baseType: !140, size: 448, offset: 64)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 448, elements: !190)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !135, line: 53, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !135, line: 45, size: 448, elements: !143)
!143 = !{!144, !154, !162, !167, !174, !178, !185}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !142, file: !135, line: 46, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!148, !132, !149}
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !151, line: 330, baseType: !152)
!151 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !151, line: 330, flags: DIFlagFwdDecl)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !142, file: !135, line: 47, baseType: !155, size: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!148, !132, !158}
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !159, line: 16, baseType: !160)
!159 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !159, line: 16, flags: DIFlagFwdDecl)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !142, file: !135, line: 48, baseType: !163, size: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!148, !166}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !142, file: !135, line: 49, baseType: !168, size: 64, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!148, !132, !171, !132}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !142, file: !135, line: 50, baseType: !175, size: 64, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!148, !132, !171, !166}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !142, file: !135, line: 51, baseType: !179, size: 64, offset: 320)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!148, !132, !171, !182}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{null}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !142, file: !135, line: 52, baseType: !186, size: 64, offset: 384)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!148, !132, !171, !189}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!190 = !{!191}
!191 = !DISubrange(count: 1)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !134, file: !135, line: 76, baseType: !150, size: 64, offset: 512)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !134, file: !135, line: 77, baseType: !194, size: 32, offset: 576)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !134, file: !135, line: 78, baseType: !196, size: 64, offset: 640)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !197)
!197 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !134, file: !135, line: 78, baseType: !196, size: 64, offset: 704)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !134, file: !135, line: 78, baseType: !196, size: 64, offset: 768)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !134, file: !135, line: 78, baseType: !196, size: 64, offset: 832)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !134, file: !135, line: 79, baseType: !202, size: 64, offset: 896)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !205, line: 27, baseType: !206)
!205 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !207, line: 43, baseType: !208)
!207 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!208 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !134, file: !135, line: 80, baseType: !194, size: 32, offset: 960)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !134, file: !135, line: 81, baseType: !211, size: 32, offset: 992)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !134, file: !135, line: 82, baseType: !213, size: 64, offset: 1024)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !134, file: !135, line: 83, baseType: !217, size: 64, offset: 1088)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !134, file: !135, line: 84, baseType: !221, size: 64, offset: 1152)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !134, file: !135, line: 85, baseType: !221, size: 64, offset: 1216)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !134, file: !135, line: 86, baseType: !221, size: 64, offset: 1280)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !134, file: !135, line: 87, baseType: !221, size: 64, offset: 1344)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !134, file: !135, line: 88, baseType: !132, size: 64, offset: 1408)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !134, file: !135, line: 89, baseType: !202, size: 64, offset: 1472)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !134, file: !135, line: 90, baseType: !221, size: 64, offset: 1536)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !134, file: !135, line: 91, baseType: !221, size: 64, offset: 1600)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !134, file: !135, line: 92, baseType: !194, size: 32, offset: 1664)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !134, file: !135, line: 93, baseType: !231, size: 64, offset: 1728)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !134, file: !135, line: 94, baseType: !233, size: 64, offset: 1792)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !203)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !134, file: !135, line: 95, baseType: !194, size: 32, offset: 1856)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !134, file: !135, line: 95, baseType: !194, size: 32, offset: 1888)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !134, file: !135, line: 96, baseType: !237, size: 64, offset: 1920)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !134, file: !135, line: 96, baseType: !237, size: 64, offset: 1984)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !134, file: !135, line: 97, baseType: !240, size: 64, offset: 2048)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !134, file: !135, line: 97, baseType: !242, size: 64, offset: 2112)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !134, file: !135, line: 98, baseType: !194, size: 32, offset: 2176)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !134, file: !135, line: 98, baseType: !194, size: 32, offset: 2208)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !134, file: !135, line: 99, baseType: !237, size: 64, offset: 2240)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !134, file: !135, line: 99, baseType: !237, size: 64, offset: 2304)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !134, file: !135, line: 100, baseType: !248, size: 64, offset: 2368)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !197)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !134, file: !135, line: 100, baseType: !251, size: 64, offset: 2432)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !134, file: !135, line: 101, baseType: !194, size: 32, offset: 2496)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !134, file: !135, line: 101, baseType: !194, size: 32, offset: 2528)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !134, file: !135, line: 102, baseType: !237, size: 64, offset: 2560)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !134, file: !135, line: 102, baseType: !237, size: 64, offset: 2624)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !134, file: !135, line: 103, baseType: !257, size: 64, offset: 2688)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !249)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !134, file: !135, line: 103, baseType: !260, size: 64, offset: 2752)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !134, file: !135, line: 104, baseType: !189, size: 64, offset: 2816)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !134, file: !135, line: 105, baseType: !194, size: 32, offset: 2880)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !134, file: !135, line: 106, baseType: !264, size: 128, offset: 2944)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 128, elements: !271)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !135, line: 64, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !135, line: 61, size: 128, elements: !268)
!268 = !{!269, !270}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !267, file: !135, line: 62, baseType: !182, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !267, file: !135, line: 63, baseType: !231, size: 64, offset: 64)
!271 = !{!272}
!272 = !DISubrange(count: 2)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !134, file: !135, line: 107, baseType: !274, size: 64, offset: 3072)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 64, elements: !271)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !134, file: !135, line: 108, baseType: !231, size: 64, offset: 3136)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !134, file: !135, line: 109, baseType: !277, size: 64, offset: 3200)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!148, !231}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !134, file: !135, line: 111, baseType: !194, size: 32, offset: 3264)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !134, file: !135, line: 112, baseType: !282, size: 320, offset: 3328)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 320, elements: !325)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!148, !286, !132, !231}
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !289)
!289 = !{!290, !291, !313, !314, !315, !316, !317, !318, !319, !320, !321}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !288, file: !10, line: 100, baseType: !194, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !288, file: !10, line: 101, baseType: !292, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !295)
!295 = !{!296, !297, !298, !299, !300, !303, !304, !305, !306, !308, !310, !311, !312}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !294, file: !10, line: 84, baseType: !221, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !294, file: !10, line: 85, baseType: !221, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !294, file: !10, line: 86, baseType: !231, size: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !294, file: !10, line: 87, baseType: !213, size: 64, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !294, file: !10, line: 88, baseType: !301, size: 64, offset: 256)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !294, file: !10, line: 89, baseType: !173, size: 8, offset: 320)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !294, file: !10, line: 90, baseType: !221, size: 64, offset: 384)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !294, file: !10, line: 91, baseType: !129, size: 64, offset: 448)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !294, file: !10, line: 92, baseType: !307, size: 32, offset: 512)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !294, file: !10, line: 93, baseType: !309, size: 32, offset: 544)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !294, file: !10, line: 94, baseType: !292, size: 64, offset: 576)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !294, file: !10, line: 95, baseType: !221, size: 64, offset: 640)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !294, file: !10, line: 96, baseType: !231, size: 64, offset: 704)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !288, file: !10, line: 102, baseType: !221, size: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !288, file: !10, line: 102, baseType: !221, size: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !288, file: !10, line: 103, baseType: !221, size: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !288, file: !10, line: 104, baseType: !150, size: 64, offset: 320)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !288, file: !10, line: 105, baseType: !307, size: 32, offset: 384)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !288, file: !10, line: 105, baseType: !307, size: 32, offset: 416)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !288, file: !10, line: 105, baseType: !307, size: 32, offset: 448)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !288, file: !10, line: 106, baseType: !132, size: 64, offset: 512)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !288, file: !10, line: 107, baseType: !322, size: 64, offset: 576)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!325 = !{!326}
!326 = !DISubrange(count: 5)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !134, file: !135, line: 113, baseType: !328, size: 320, offset: 3648)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 320, elements: !325)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!148, !132, !231}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !134, file: !135, line: 114, baseType: !333, size: 320, offset: 3968)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 320, elements: !325)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !134, file: !135, line: 115, baseType: !307, size: 32, offset: 4288)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !134, file: !135, line: 120, baseType: !322, size: 64, offset: 4352)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !134, file: !135, line: 121, baseType: !307, size: 32, offset: 4416)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP_BCGS", file: !339, line: 13, baseType: !340)
!339 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/ksp/impls/bcgs/bcgsimpl.h", directory: "/home/users/ndemeye/xSDK")
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !339, line: 11, size: 64, elements: !341)
!341 = !{!342}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !340, file: !339, line: 12, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !121, line: 21, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !121, line: 21, flags: DIFlagFwdDecl)
!346 = !{i32 7, !"Dwarf Version", i32 4}
!347 = !{i32 2, !"Debug Info Version", i32 3}
!348 = !{i32 1, !"wchar_size", i32 4}
!349 = !{i32 7, !"PIC Level", i32 2}
!350 = !{i32 7, !"uwtable", i32 1}
!351 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!352 = distinct !DISubprogram(name: "KSPCreate_FBCGS", scope: !353, file: !353, line: 165, type: !354, scopeLine: 166, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !595)
!353 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/impls/bcgs/fbcgs/fbcgs.c", directory: "/home/users/ndemeye/xSDK")
!354 = !DISubroutineType(types: !355)
!355 = !{!148, !356}
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !33, line: 22, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !102, line: 75, size: 12800, elements: !359)
!359 = !{!360, !362, !410, !415, !416, !417, !418, !448, !449, !450, !451, !452, !454, !459, !460, !461, !462, !463, !464, !465, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !488, !494, !495, !496, !497, !502, !503, !504, !505, !510, !511, !512, !513, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !565, !566, !567, !568, !569, !576, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !592, !593, !594}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !358, file: !102, line: 76, baseType: !361, size: 4480)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !135, line: 122, baseType: !134)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !358, file: !102, line: 76, baseType: !363, size: 896, offset: 4480)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 896, elements: !190)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !102, line: 18, size: 896, elements: !365)
!365 = !{!366, !371, !375, !377, !385, !386, !390, !391, !395, !399, !403, !404, !408, !409}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !364, file: !102, line: 19, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{!148, !356, !343, !370}
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !364, file: !102, line: 22, baseType: !372, size: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!148, !356, !343, !343, !370}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !364, file: !102, line: 25, baseType: !376, size: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !364, file: !102, line: 26, baseType: !378, size: 64, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!148, !356, !381, !381}
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !382, line: 16, baseType: !383)
!382 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !382, line: 16, flags: DIFlagFwdDecl)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !364, file: !102, line: 27, baseType: !376, size: 64, offset: 256)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !364, file: !102, line: 28, baseType: !387, size: 64, offset: 320)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!148, !286, !356}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !364, file: !102, line: 29, baseType: !376, size: 64, offset: 384)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !364, file: !102, line: 30, baseType: !392, size: 64, offset: 448)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!148, !356, !248, !248}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !364, file: !102, line: 31, baseType: !396, size: 64, offset: 512)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!148, !356, !194, !248, !248, !240}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !364, file: !102, line: 32, baseType: !400, size: 64, offset: 576)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!148, !356, !307, !307, !240, !370, !248, !248}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !364, file: !102, line: 33, baseType: !376, size: 64, offset: 640)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !364, file: !102, line: 34, baseType: !405, size: 64, offset: 704)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!148, !356, !158}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !364, file: !102, line: 35, baseType: !376, size: 64, offset: 768)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !364, file: !102, line: 36, baseType: !405, size: 64, offset: 832)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !358, file: !102, line: 77, baseType: !411, size: 64, offset: 5376)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !412, line: 14, baseType: !413)
!412 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !412, line: 14, flags: DIFlagFwdDecl)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !358, file: !102, line: 78, baseType: !307, size: 32, offset: 5440)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !358, file: !102, line: 79, baseType: !307, size: 32, offset: 5472)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !358, file: !102, line: 81, baseType: !194, size: 32, offset: 5504)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !358, file: !102, line: 82, baseType: !419, size: 64, offset: 5568)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !33, line: 752, baseType: !420)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !102, line: 54, size: 5184, elements: !422)
!422 = !{!423, !424, !444, !445, !446, !447}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !421, file: !102, line: 55, baseType: !361, size: 4480)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !421, file: !102, line: 55, baseType: !425, size: 448, offset: 4480)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 448, elements: !190)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !102, line: 41, size: 448, elements: !427)
!427 = !{!428, !432, !433, !437, !438, !439, !443}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !426, file: !102, line: 42, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!148, !419, !343, !343}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !426, file: !102, line: 43, baseType: !429, size: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !426, file: !102, line: 44, baseType: !434, size: 64, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{!148, !419}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !426, file: !102, line: 45, baseType: !434, size: 64, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !426, file: !102, line: 46, baseType: !434, size: 64, offset: 256)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !426, file: !102, line: 47, baseType: !440, size: 64, offset: 320)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{!148, !419, !158}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !426, file: !102, line: 48, baseType: !434, size: 64, offset: 384)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !421, file: !102, line: 56, baseType: !356, size: 64, offset: 4928)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !421, file: !102, line: 57, baseType: !381, size: 64, offset: 4992)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !421, file: !102, line: 58, baseType: !233, size: 64, offset: 5056)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !421, file: !102, line: 59, baseType: !231, size: 64, offset: 5120)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !358, file: !102, line: 83, baseType: !307, size: 32, offset: 5632)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !358, file: !102, line: 84, baseType: !307, size: 32, offset: 5664)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !358, file: !102, line: 85, baseType: !307, size: 32, offset: 5696)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !358, file: !102, line: 86, baseType: !307, size: 32, offset: 5728)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !358, file: !102, line: 87, baseType: !453, size: 32, offset: 5760)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !24)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !358, file: !102, line: 88, baseType: !455, size: 384, offset: 5792)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 384, elements: !456)
!456 = !{!457, !458}
!457 = !DISubrange(count: 4)
!458 = !DISubrange(count: 3)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !358, file: !102, line: 89, baseType: !249, size: 64, offset: 6208)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !358, file: !102, line: 90, baseType: !249, size: 64, offset: 6272)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !358, file: !102, line: 91, baseType: !249, size: 64, offset: 6336)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !358, file: !102, line: 92, baseType: !249, size: 64, offset: 6400)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !358, file: !102, line: 93, baseType: !249, size: 64, offset: 6464)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !358, file: !102, line: 94, baseType: !249, size: 64, offset: 6528)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !358, file: !102, line: 95, baseType: !466, size: 32, offset: 6592)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !33, line: 540, baseType: !32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !358, file: !102, line: 96, baseType: !307, size: 32, offset: 6624)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !358, file: !102, line: 98, baseType: !343, size: 64, offset: 6656)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !358, file: !102, line: 98, baseType: !343, size: 64, offset: 6720)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !358, file: !102, line: 102, baseType: !248, size: 64, offset: 6784)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !358, file: !102, line: 103, baseType: !248, size: 64, offset: 6848)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !358, file: !102, line: 104, baseType: !194, size: 32, offset: 6912)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !358, file: !102, line: 105, baseType: !194, size: 32, offset: 6944)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !358, file: !102, line: 106, baseType: !307, size: 32, offset: 6976)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !358, file: !102, line: 107, baseType: !248, size: 64, offset: 7040)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !358, file: !102, line: 108, baseType: !248, size: 64, offset: 7104)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !358, file: !102, line: 109, baseType: !194, size: 32, offset: 7168)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !358, file: !102, line: 110, baseType: !194, size: 32, offset: 7200)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !358, file: !102, line: 111, baseType: !307, size: 32, offset: 7232)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !358, file: !102, line: 113, baseType: !194, size: 32, offset: 7264)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !358, file: !102, line: 114, baseType: !307, size: 32, offset: 7296)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !358, file: !102, line: 117, baseType: !194, size: 32, offset: 7328)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !358, file: !102, line: 120, baseType: !484, size: 320, offset: 7360)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 320, elements: !325)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!148, !356, !194, !249, !231}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !358, file: !102, line: 121, baseType: !489, size: 320, offset: 7680)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 320, elements: !325)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{!148, !493}
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !358, file: !102, line: 122, baseType: !333, size: 320, offset: 8000)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !358, file: !102, line: 123, baseType: !194, size: 32, offset: 8320)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !358, file: !102, line: 124, baseType: !307, size: 32, offset: 8352)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !358, file: !102, line: 126, baseType: !498, size: 320, offset: 8384)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 320, elements: !325)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{!148, !356, !231}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !358, file: !102, line: 127, baseType: !489, size: 320, offset: 8704)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !358, file: !102, line: 128, baseType: !333, size: 320, offset: 9024)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !358, file: !102, line: 129, baseType: !194, size: 32, offset: 9344)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !358, file: !102, line: 131, baseType: !506, size: 64, offset: 9408)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!148, !356, !194, !249, !509, !231}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !358, file: !102, line: 132, baseType: !277, size: 64, offset: 9472)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !358, file: !102, line: 133, baseType: !231, size: 64, offset: 9536)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !358, file: !102, line: 135, baseType: !231, size: 64, offset: 9600)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !358, file: !102, line: 137, baseType: !514, size: 64, offset: 9664)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !515)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !25, line: 11, flags: DIFlagFwdDecl)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !358, file: !102, line: 139, baseType: !231, size: 64, offset: 9728)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !358, file: !102, line: 142, baseType: !307, size: 32, offset: 9792)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !358, file: !102, line: 142, baseType: !307, size: 32, offset: 9824)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !358, file: !102, line: 142, baseType: !307, size: 32, offset: 9856)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !358, file: !102, line: 142, baseType: !307, size: 32, offset: 9888)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !358, file: !102, line: 142, baseType: !307, size: 32, offset: 9920)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !358, file: !102, line: 142, baseType: !307, size: 32, offset: 9952)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !358, file: !102, line: 142, baseType: !307, size: 32, offset: 9984)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !358, file: !102, line: 142, baseType: !307, size: 32, offset: 10016)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !358, file: !102, line: 142, baseType: !307, size: 32, offset: 10048)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !358, file: !102, line: 142, baseType: !307, size: 32, offset: 10080)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !358, file: !102, line: 142, baseType: !307, size: 32, offset: 10112)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !358, file: !102, line: 142, baseType: !307, size: 32, offset: 10144)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !358, file: !102, line: 142, baseType: !307, size: 32, offset: 10176)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !358, file: !102, line: 142, baseType: !307, size: 32, offset: 10208)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !358, file: !102, line: 143, baseType: !158, size: 64, offset: 10240)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !358, file: !102, line: 143, baseType: !158, size: 64, offset: 10304)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !358, file: !102, line: 143, baseType: !158, size: 64, offset: 10368)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !358, file: !102, line: 143, baseType: !158, size: 64, offset: 10432)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !358, file: !102, line: 143, baseType: !158, size: 64, offset: 10496)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !358, file: !102, line: 143, baseType: !158, size: 64, offset: 10560)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !358, file: !102, line: 143, baseType: !158, size: 64, offset: 10624)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !358, file: !102, line: 143, baseType: !158, size: 64, offset: 10688)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !358, file: !102, line: 143, baseType: !158, size: 64, offset: 10752)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !358, file: !102, line: 143, baseType: !158, size: 64, offset: 10816)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !358, file: !102, line: 143, baseType: !158, size: 64, offset: 10880)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !358, file: !102, line: 143, baseType: !158, size: 64, offset: 10944)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !358, file: !102, line: 143, baseType: !158, size: 64, offset: 11008)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !358, file: !102, line: 143, baseType: !158, size: 64, offset: 11072)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !358, file: !102, line: 144, baseType: !547, size: 32, offset: 11136)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !57, line: 162, baseType: !56)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !358, file: !102, line: 144, baseType: !547, size: 32, offset: 11168)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !358, file: !102, line: 144, baseType: !547, size: 32, offset: 11200)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !358, file: !102, line: 144, baseType: !547, size: 32, offset: 11232)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !358, file: !102, line: 144, baseType: !547, size: 32, offset: 11264)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !358, file: !102, line: 144, baseType: !547, size: 32, offset: 11296)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !358, file: !102, line: 144, baseType: !547, size: 32, offset: 11328)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !358, file: !102, line: 144, baseType: !547, size: 32, offset: 11360)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !358, file: !102, line: 144, baseType: !547, size: 32, offset: 11392)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !358, file: !102, line: 144, baseType: !547, size: 32, offset: 11424)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !358, file: !102, line: 144, baseType: !547, size: 32, offset: 11456)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !358, file: !102, line: 144, baseType: !547, size: 32, offset: 11488)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !358, file: !102, line: 144, baseType: !547, size: 32, offset: 11520)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !358, file: !102, line: 144, baseType: !547, size: 32, offset: 11552)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !358, file: !102, line: 147, baseType: !194, size: 32, offset: 11584)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !358, file: !102, line: 148, baseType: !370, size: 64, offset: 11648)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !358, file: !102, line: 150, baseType: !564, size: 32, offset: 11712)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !102, line: 70, baseType: !101)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !358, file: !102, line: 151, baseType: !307, size: 32, offset: 11744)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !358, file: !102, line: 153, baseType: !194, size: 32, offset: 11776)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !358, file: !102, line: 154, baseType: !194, size: 32, offset: 11808)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !358, file: !102, line: 156, baseType: !307, size: 32, offset: 11840)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !358, file: !102, line: 161, baseType: !570, size: 192, offset: 11904)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !358, file: !102, line: 157, size: 192, elements: !571)
!571 = !{!572, !573, !574, !575}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !570, file: !102, line: 158, baseType: !381, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !570, file: !102, line: 158, baseType: !381, size: 64, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !570, file: !102, line: 159, baseType: !307, size: 32, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !570, file: !102, line: 160, baseType: !307, size: 32, offset: 160)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !358, file: !102, line: 163, baseType: !577, size: 32, offset: 12096)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !33, line: 451, baseType: !107)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !358, file: !102, line: 165, baseType: !453, size: 32, offset: 12128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !358, file: !102, line: 166, baseType: !577, size: 32, offset: 12160)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !358, file: !102, line: 171, baseType: !307, size: 32, offset: 12192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !358, file: !102, line: 172, baseType: !307, size: 32, offset: 12224)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !358, file: !102, line: 173, baseType: !307, size: 32, offset: 12256)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !358, file: !102, line: 174, baseType: !343, size: 64, offset: 12288)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !358, file: !102, line: 175, baseType: !343, size: 64, offset: 12352)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !358, file: !102, line: 177, baseType: !194, size: 32, offset: 12416)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !358, file: !102, line: 178, baseType: !307, size: 32, offset: 12448)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !358, file: !102, line: 180, baseType: !158, size: 64, offset: 12480)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !358, file: !102, line: 182, baseType: !589, size: 64, offset: 12544)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{!148, !356, !343, !343, !231}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !358, file: !102, line: 183, baseType: !589, size: 64, offset: 12608)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !358, file: !102, line: 184, baseType: !231, size: 64, offset: 12672)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !358, file: !102, line: 184, baseType: !231, size: 64, offset: 12736)
!595 = !{!596, !597, !598, !599, !601, !603, !605, !607}
!596 = !DILocalVariable(name: "ksp", arg: 1, scope: !352, file: !353, line: 165, type: !356)
!597 = !DILocalVariable(name: "ierr", scope: !352, file: !353, line: 167, type: !148)
!598 = !DILocalVariable(name: "bcgs", scope: !352, file: !353, line: 168, type: !337)
!599 = !DILocalVariable(name: "ierr__", scope: !600, file: !353, line: 171, type: !148)
!600 = distinct !DILexicalBlock(scope: !352, file: !353, line: 171, column: 33)
!601 = !DILocalVariable(name: "ierr__", scope: !602, file: !353, line: 182, type: !148)
!602 = distinct !DILexicalBlock(scope: !352, file: !353, line: 182, column: 69)
!603 = !DILocalVariable(name: "ierr__", scope: !604, file: !353, line: 183, type: !148)
!604 = distinct !DILexicalBlock(scope: !352, file: !353, line: 183, column: 72)
!605 = !DILocalVariable(name: "ierr__", scope: !606, file: !353, line: 184, type: !148)
!606 = distinct !DILexicalBlock(scope: !352, file: !353, line: 184, column: 59)
!607 = !DILocalVariable(name: "ierr__", scope: !608, file: !353, line: 185, type: !148)
!608 = distinct !DILexicalBlock(scope: !352, file: !353, line: 185, column: 60)
!609 = !DILocation(line: 0, scope: !352)
!610 = !DILocation(line: 168, column: 3, scope: !352)
!611 = !DILocation(line: 170, column: 3, scope: !612)
!612 = distinct !DILexicalBlock(scope: !613, file: !353, line: 170, column: 3)
!613 = distinct !DILexicalBlock(scope: !614, file: !353, line: 170, column: 3)
!614 = distinct !DILexicalBlock(scope: !352, file: !353, line: 170, column: 3)
!615 = !{!616, !616, i64 0}
!616 = !{!"any pointer", !617, i64 0}
!617 = !{!"omnipotent char", !618, i64 0}
!618 = !{!"Simple C/C++ TBAA"}
!619 = !DILocation(line: 170, column: 3, scope: !613)
!620 = !DILocation(line: 170, column: 3, scope: !621)
!621 = distinct !DILexicalBlock(scope: !622, file: !353, line: 170, column: 3)
!622 = distinct !DILexicalBlock(scope: !612, file: !353, line: 170, column: 3)
!623 = !{!624, !625, i64 1536}
!624 = !{!"", !617, i64 0, !617, i64 512, !617, i64 1024, !617, i64 1280, !625, i64 1536, !625, i64 1540, !617, i64 1544}
!625 = !{!"int", !617, i64 0}
!626 = !DILocation(line: 170, column: 3, scope: !622)
!627 = !DILocation(line: 170, column: 3, scope: !628)
!628 = distinct !DILexicalBlock(scope: !621, file: !353, line: 170, column: 3)
!629 = !{!625, !625, i64 0}
!630 = !{!624, !625, i64 1540}
!631 = !DILocation(line: 171, column: 10, scope: !352)
!632 = !{!"branch_weights", i32 2146410443, i32 1073205}
!633 = !DILocation(line: 0, scope: !600)
!634 = !DILocation(line: 171, column: 33, scope: !600)
!635 = !{!"branch_weights", i32 2000, i32 1}
!636 = !DILocation(line: 171, column: 33, scope: !637)
!637 = distinct !DILexicalBlock(scope: !600, file: !353, line: 171, column: 33)
!638 = !DILocation(line: 173, column: 30, scope: !352)
!639 = !DILocation(line: 173, column: 8, scope: !352)
!640 = !DILocation(line: 173, column: 28, scope: !352)
!641 = !{!642, !616, i64 1216}
