; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/bound/impls/bqnk/bqnktl.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/bound/impls/bqnk/bqnktl.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque

!341 = !DIEnumerator(name: "KSP_CONVERGED_ITS", value: 4)
!342 = !DIEnumerator(name: "KSP_CONVERGED_CG_NEG_CURVE", value: 5)
!343 = !DIEnumerator(name: "KSP_CONVERGED_CG_CONSTRAINED", value: 6)
!344 = !DIEnumerator(name: "KSP_CONVERGED_STEP_LENGTH", value: 7)
!345 = !DIEnumerator(name: "KSP_CONVERGED_HAPPY_BREAKDOWN", value: 8)
!346 = !DIEnumerator(name: "KSP_DIVERGED_NULL", value: -2)
!347 = !DIEnumerator(name: "KSP_DIVERGED_ITS", value: -3)
!348 = !DIEnumerator(name: "KSP_DIVERGED_DTOL", value: -4)
!349 = !DIEnumerator(name: "KSP_DIVERGED_BREAKDOWN", value: -5)
!350 = !DIEnumerator(name: "KSP_DIVERGED_BREAKDOWN_BICG", value: -6)
!351 = !DIEnumerator(name: "KSP_DIVERGED_NONSYMMETRIC", value: -7)
!352 = !DIEnumerator(name: "KSP_DIVERGED_INDEFINITE_PC", value: -8)
!353 = !DIEnumerator(name: "KSP_DIVERGED_NANORINF", value: -9)
!354 = !DIEnumerator(name: "KSP_DIVERGED_INDEFINITE_MAT", value: -10)
!355 = !DIEnumerator(name: "KSP_DIVERGED_PC_FAILED", value: -11)
!356 = !DIEnumerator(name: "KSP_DIVERGED_PCSETUP_FAILED", value: -11)
!357 = !DIEnumerator(name: "KSP_CONVERGED_ITERATING", value: 0)
!358 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !359, line: 663, baseType: !5, size: 32, elements: !360)
!359 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!360 = !{!361, !362, !363}
!361 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!362 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!363 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!364 = !{!365, !369, !370, !1992, !421, !401}
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !366, line: 330, baseType: !367)
!366 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !366, line: 330, flags: DIFlagFwdDecl)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "TAO_BNK", file: !372, line: 209, baseType: !373)
!372 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/tao/bound/impls/bnk/bnk.h", directory: "/home/users/ndemeye/xSDK")
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 10, size: 5888, elements: !374)
!374 = !{!375, !1815, !1821, !1822, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1986, !1987, !1988, !1989, !1990, !1991}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "computehessian", scope: !373, file: !372, line: 15, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!379, !380}
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !91)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tao", file: !314, line: 118, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Tao", file: !383, line: 45, size: 14656, elements: !384)
!383 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/taoimpl.h", directory: "/home/users/ndemeye/xSDK")
!384 = !{!385, !589, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1687, !1693, !1695, !1696, !1697, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1768, !1769, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !382, file: !383, line: 46, baseType: !386, size: 4480)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !387, line: 122, baseType: !388)
!387 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !387, line: 73, size: 4480, elements: !389)
!389 = !{!390, !392, !442, !443, !445, !448, !449, !450, !451, !459, !460, !462, !466, !470, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !483, !484, !485, !487, !488, !490, !492, !493, !494, !495, !496, !499, !501, !502, !503, !504, !505, !508, !510, !511, !512, !522, !524, !525, !529, !530, !579, !584, !586, !587, !588}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !388, file: !387, line: 74, baseType: !391, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !91)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !388, file: !387, line: 75, baseType: !393, size: 448, offset: 64)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 448, elements: !440)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !387, line: 53, baseType: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !387, line: 45, size: 448, elements: !396)
!396 = !{!397, !404, !412, !417, !424, !428, !435}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !395, file: !387, line: 46, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!379, !401, !403}
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !395, file: !387, line: 47, baseType: !405, size: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!379, !401, !408}
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !409, line: 16, baseType: !410)
!409 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !409, line: 16, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !395, file: !387, line: 48, baseType: !413, size: 64, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!379, !416}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !395, file: !387, line: 49, baseType: !418, size: 64, offset: 192)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!379, !401, !421, !401}
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !423)
!423 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !395, file: !387, line: 50, baseType: !425, size: 64, offset: 256)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!379, !401, !421, !416}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !395, file: !387, line: 51, baseType: !429, size: 64, offset: 320)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!379, !401, !421, !432}
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{null}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !395, file: !387, line: 52, baseType: !436, size: 64, offset: 384)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!379, !401, !421, !439}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!440 = !{!441}
!441 = !DISubrange(count: 1)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !388, file: !387, line: 76, baseType: !365, size: 64, offset: 512)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !388, file: !387, line: 77, baseType: !444, size: 32, offset: 576)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !91)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !388, file: !387, line: 78, baseType: !446, size: 64, offset: 640)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !447)
!447 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !388, file: !387, line: 78, baseType: !446, size: 64, offset: 704)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !388, file: !387, line: 78, baseType: !446, size: 64, offset: 768)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !388, file: !387, line: 78, baseType: !446, size: 64, offset: 832)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !388, file: !387, line: 79, baseType: !452, size: 64, offset: 896)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !455, line: 27, baseType: !456)
!455 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !457, line: 43, baseType: !458)
!457 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!458 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !388, file: !387, line: 80, baseType: !444, size: 32, offset: 960)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !388, file: !387, line: 81, baseType: !461, size: 32, offset: 992)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !91)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !388, file: !387, line: 82, baseType: !463, size: 64, offset: 1024)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !464)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !388, file: !387, line: 83, baseType: !467, size: 64, offset: 1088)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !388, file: !387, line: 84, baseType: !471, size: 64, offset: 1152)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !388, file: !387, line: 85, baseType: !471, size: 64, offset: 1216)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !388, file: !387, line: 86, baseType: !471, size: 64, offset: 1280)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !388, file: !387, line: 87, baseType: !471, size: 64, offset: 1344)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !388, file: !387, line: 88, baseType: !401, size: 64, offset: 1408)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !388, file: !387, line: 89, baseType: !452, size: 64, offset: 1472)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !388, file: !387, line: 90, baseType: !471, size: 64, offset: 1536)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !388, file: !387, line: 91, baseType: !471, size: 64, offset: 1600)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !388, file: !387, line: 92, baseType: !444, size: 32, offset: 1664)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !388, file: !387, line: 93, baseType: !369, size: 64, offset: 1728)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !388, file: !387, line: 94, baseType: !482, size: 64, offset: 1792)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !453)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !388, file: !387, line: 95, baseType: !444, size: 32, offset: 1856)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !388, file: !387, line: 95, baseType: !444, size: 32, offset: 1888)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !388, file: !387, line: 96, baseType: !486, size: 64, offset: 1920)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !388, file: !387, line: 96, baseType: !486, size: 64, offset: 1984)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !388, file: !387, line: 97, baseType: !489, size: 64, offset: 2048)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !388, file: !387, line: 97, baseType: !491, size: 64, offset: 2112)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !388, file: !387, line: 98, baseType: !444, size: 32, offset: 2176)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !388, file: !387, line: 98, baseType: !444, size: 32, offset: 2208)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !388, file: !387, line: 99, baseType: !486, size: 64, offset: 2240)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !388, file: !387, line: 99, baseType: !486, size: 64, offset: 2304)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !388, file: !387, line: 100, baseType: !497, size: 64, offset: 2368)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !447)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !388, file: !387, line: 100, baseType: !500, size: 64, offset: 2432)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !388, file: !387, line: 101, baseType: !444, size: 32, offset: 2496)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !388, file: !387, line: 101, baseType: !444, size: 32, offset: 2528)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !388, file: !387, line: 102, baseType: !486, size: 64, offset: 2560)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !388, file: !387, line: 102, baseType: !486, size: 64, offset: 2624)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !388, file: !387, line: 103, baseType: !506, size: 64, offset: 2688)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !498)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !388, file: !387, line: 103, baseType: !509, size: 64, offset: 2752)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !388, file: !387, line: 104, baseType: !439, size: 64, offset: 2816)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !388, file: !387, line: 105, baseType: !444, size: 32, offset: 2880)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !388, file: !387, line: 106, baseType: !513, size: 128, offset: 2944)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 128, elements: !520)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !387, line: 64, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !387, line: 61, size: 128, elements: !517)
!517 = !{!518, !519}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !516, file: !387, line: 62, baseType: !432, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !516, file: !387, line: 63, baseType: !369, size: 64, offset: 64)
!520 = !{!521}
!521 = !DISubrange(count: 2)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !388, file: !387, line: 107, baseType: !523, size: 64, offset: 3072)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 64, elements: !520)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !388, file: !387, line: 108, baseType: !369, size: 64, offset: 3136)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !388, file: !387, line: 109, baseType: !526, size: 64, offset: 3200)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!379, !369}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !388, file: !387, line: 111, baseType: !444, size: 32, offset: 3264)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !388, file: !387, line: 112, baseType: !531, size: 320, offset: 3328)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !532, size: 320, elements: !577)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!379, !535, !401, !369}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !538)
!538 = !{!539, !540, !565, !566, !567, !568, !569, !570, !571, !572, !573}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !537, file: !10, line: 100, baseType: !444, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !537, file: !10, line: 101, baseType: !541, size: 64, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !542)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !544)
!544 = !{!545, !546, !547, !548, !549, !552, !553, !554, !558, !560, !562, !563, !564}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !543, file: !10, line: 84, baseType: !471, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !543, file: !10, line: 85, baseType: !471, size: 64, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !543, file: !10, line: 86, baseType: !369, size: 64, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !543, file: !10, line: 87, baseType: !463, size: 64, offset: 192)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !543, file: !10, line: 88, baseType: !550, size: 64, offset: 256)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !421)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !543, file: !10, line: 89, baseType: !423, size: 8, offset: 320)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !543, file: !10, line: 90, baseType: !471, size: 64, offset: 384)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !543, file: !10, line: 91, baseType: !555, size: 64, offset: 448)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !556, line: 46, baseType: !557)
!556 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!557 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !543, file: !10, line: 92, baseType: !559, size: 32, offset: 512)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !543, file: !10, line: 93, baseType: !561, size: 32, offset: 544)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !543, file: !10, line: 94, baseType: !541, size: 64, offset: 576)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !543, file: !10, line: 95, baseType: !471, size: 64, offset: 640)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !543, file: !10, line: 96, baseType: !369, size: 64, offset: 704)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !537, file: !10, line: 102, baseType: !471, size: 64, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !537, file: !10, line: 102, baseType: !471, size: 64, offset: 192)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !537, file: !10, line: 103, baseType: !471, size: 64, offset: 256)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !537, file: !10, line: 104, baseType: !365, size: 64, offset: 320)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !537, file: !10, line: 105, baseType: !559, size: 32, offset: 384)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !537, file: !10, line: 105, baseType: !559, size: 32, offset: 416)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !537, file: !10, line: 105, baseType: !559, size: 32, offset: 448)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !537, file: !10, line: 106, baseType: !401, size: 64, offset: 512)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !537, file: !10, line: 107, baseType: !574, size: 64, offset: 576)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!577 = !{!578}
!578 = !DISubrange(count: 5)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !388, file: !387, line: 113, baseType: !580, size: 320, offset: 3648)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !581, size: 320, elements: !577)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{!379, !401, !369}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !388, file: !387, line: 114, baseType: !585, size: 320, offset: 3968)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 320, elements: !577)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !388, file: !387, line: 115, baseType: !559, size: 32, offset: 4288)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !388, file: !387, line: 120, baseType: !574, size: 64, offset: 4352)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !388, file: !387, line: 121, baseType: !559, size: 32, offset: 4416)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !382, file: !383, line: 46, baseType: !590, size: 1536, offset: 4480)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 1536, elements: !440)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TaoOps", file: !383, line: 13, size: 1536, elements: !592)
!592 = !{!593, !897, !901, !905, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1635, !1639, !1640, !1641, !1642, !1646, !1650, !1651, !1655, !1656, !1657, !1661, !1665}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !591, file: !383, line: 15, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!379, !380, !597, !497, !369}
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !25, line: 21, baseType: !598)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !600, line: 142, size: 12800, elements: !601)
!600 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/vecimpl.h", directory: "/home/users/ndemeye/xSDK")
!601 = !{!602, !603, !823, !843, !844, !845, !891, !892, !893, !894, !896}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !599, file: !600, line: 143, baseType: !386, size: 4480)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !599, file: !600, line: 143, baseType: !604, size: 5248, offset: 4480)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !605, size: 5248, elements: !440)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VecOps", file: !600, line: 23, size: 5248, elements: !606)
!606 = !{!607, !612, !617, !621, !625, !631, !636, !637, !638, !642, !646, !647, !648, !652, !656, !662, !663, !667, !671, !675, !676, !683, !687, !688, !692, !696, !697, !698, !702, !703, !710, !715, !716, !717, !721, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !742, !743, !744, !748, !752, !753, !754, !755, !759, !760, !761, !762, !763, !764, !765, !769, !770, !774, !781, !782, !787, !788, !792, !793, !794, !795, !796, !797, !798, !799, !803, !804, !805, !811, !815, !816, !817}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !605, file: !600, line: 24, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!379, !597, !611}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "duplicatevecs", scope: !605, file: !600, line: 25, baseType: !613, size: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!379, !597, !444, !616}
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "destroyvecs", scope: !605, file: !600, line: 26, baseType: !618, size: 64, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{!379, !444, !611}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !605, file: !600, line: 27, baseType: !622, size: 64, offset: 192)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!379, !597, !597, !506}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "mdot", scope: !605, file: !600, line: 28, baseType: !626, size: 64, offset: 256)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!379, !597, !444, !629, !506}
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !597)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !605, file: !600, line: 29, baseType: !632, size: 64, offset: 320)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DISubroutineType(types: !634)
!634 = !{!379, !597, !635, !497}
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !25, line: 155, baseType: !24)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "tdot", scope: !605, file: !600, line: 30, baseType: !622, size: 64, offset: 384)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot", scope: !605, file: !600, line: 31, baseType: !626, size: 64, offset: 448)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !605, file: !600, line: 32, baseType: !639, size: 64, offset: 512)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!379, !597, !507}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !605, file: !600, line: 33, baseType: !643, size: 64, offset: 576)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!379, !597, !597}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !605, file: !600, line: 34, baseType: !639, size: 64, offset: 640)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !605, file: !600, line: 35, baseType: !643, size: 64, offset: 704)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !605, file: !600, line: 36, baseType: !649, size: 64, offset: 768)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{!379, !597, !507, !597}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "axpby", scope: !605, file: !600, line: 37, baseType: !653, size: 64, offset: 832)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{!379, !597, !507, !507, !597}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "maxpy", scope: !605, file: !600, line: 38, baseType: !657, size: 64, offset: 896)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!379, !597, !444, !660, !611}
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !507)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !605, file: !600, line: 39, baseType: !649, size: 64, offset: 960)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "waxpy", scope: !605, file: !600, line: 40, baseType: !664, size: 64, offset: 1024)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{!379, !597, !507, !597, !597}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "axpbypcz", scope: !605, file: !600, line: 41, baseType: !668, size: 64, offset: 1088)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!379, !597, !507, !507, !507, !597, !597}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemult", scope: !605, file: !600, line: 42, baseType: !672, size: 64, offset: 1152)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!379, !597, !597, !597}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisedivide", scope: !605, file: !600, line: 43, baseType: !672, size: 64, offset: 1216)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !605, file: !600, line: 44, baseType: !677, size: 64, offset: 1280)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!379, !597, !444, !680, !660, !682}
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !444)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !605, file: !600, line: 45, baseType: !684, size: 64, offset: 1344)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!379, !597}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !605, file: !600, line: 46, baseType: !684, size: 64, offset: 1408)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "getarray", scope: !605, file: !600, line: 47, baseType: !689, size: 64, offset: 1472)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!379, !597, !509}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "getsize", scope: !605, file: !600, line: 48, baseType: !693, size: 64, offset: 1536)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{!379, !597, !489}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsize", scope: !605, file: !600, line: 49, baseType: !693, size: 64, offset: 1600)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "restorearray", scope: !605, file: !600, line: 50, baseType: !689, size: 64, offset: 1664)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !605, file: !600, line: 51, baseType: !699, size: 64, offset: 1728)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DISubroutineType(types: !701)
!701 = !{!379, !597, !489, !497}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !605, file: !600, line: 52, baseType: !699, size: 64, offset: 1792)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !605, file: !600, line: 53, baseType: !704, size: 64, offset: 1856)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{!379, !597, !707}
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !708)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !605, file: !600, line: 54, baseType: !711, size: 64, offset: 1920)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!379, !597, !714, !559}
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecOption", file: !25, line: 475, baseType: !43)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !605, file: !600, line: 55, baseType: !677, size: 64, offset: 1984)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !605, file: !600, line: 56, baseType: !684, size: 64, offset: 2048)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !605, file: !600, line: 57, baseType: !718, size: 64, offset: 2112)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!379, !597, !408}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "placearray", scope: !605, file: !600, line: 58, baseType: !722, size: 64, offset: 2176)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!379, !597, !660}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "replacearray", scope: !605, file: !600, line: 59, baseType: !722, size: 64, offset: 2240)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "dot_local", scope: !605, file: !600, line: 60, baseType: !622, size: 64, offset: 2304)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "tdot_local", scope: !605, file: !600, line: 61, baseType: !622, size: 64, offset: 2368)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "norm_local", scope: !605, file: !600, line: 62, baseType: !632, size: 64, offset: 2432)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "mdot_local", scope: !605, file: !600, line: 63, baseType: !626, size: 64, offset: 2496)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "mtdot_local", scope: !605, file: !600, line: 64, baseType: !626, size: 64, offset: 2560)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !605, file: !600, line: 65, baseType: !718, size: 64, offset: 2624)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "reciprocal", scope: !605, file: !600, line: 66, baseType: !684, size: 64, offset: 2688)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !605, file: !600, line: 67, baseType: !684, size: 64, offset: 2752)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !605, file: !600, line: 68, baseType: !735, size: 64, offset: 2816)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!379, !597, !738}
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !739, line: 30, baseType: !740)
!739 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !739, line: 30, flags: DIFlagFwdDecl)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !605, file: !600, line: 69, baseType: !677, size: 64, offset: 2880)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "resetarray", scope: !605, file: !600, line: 70, baseType: !684, size: 64, offset: 2944)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !605, file: !600, line: 71, baseType: !745, size: 64, offset: 3008)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!379, !535, !597}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "maxpointwisedivide", scope: !605, file: !600, line: 72, baseType: !749, size: 64, offset: 3072)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!379, !597, !597, !497}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemax", scope: !605, file: !600, line: 73, baseType: !672, size: 64, offset: 3136)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemaxabs", scope: !605, file: !600, line: 74, baseType: !672, size: 64, offset: 3200)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "pointwisemin", scope: !605, file: !600, line: 75, baseType: !672, size: 64, offset: 3264)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !605, file: !600, line: 76, baseType: !756, size: 64, offset: 3328)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!379, !597, !444, !680, !506}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "sqrt", scope: !605, file: !600, line: 77, baseType: !684, size: 64, offset: 3392)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "abs", scope: !605, file: !600, line: 78, baseType: !684, size: 64, offset: 3456)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !605, file: !600, line: 79, baseType: !684, size: 64, offset: 3520)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !605, file: !600, line: 80, baseType: !684, size: 64, offset: 3584)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !605, file: !600, line: 81, baseType: !639, size: 64, offset: 3648)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !605, file: !600, line: 82, baseType: !684, size: 64, offset: 3712)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "stridegather", scope: !605, file: !600, line: 83, baseType: !766, size: 64, offset: 3776)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{!379, !597, !444, !597, !682}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "stridescatter", scope: !605, file: !600, line: 84, baseType: !766, size: 64, offset: 3840)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "dotnorm2", scope: !605, file: !600, line: 85, baseType: !771, size: 64, offset: 3904)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{!379, !597, !597, !506, !506}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "getsubvector", scope: !605, file: !600, line: 86, baseType: !775, size: 64, offset: 3968)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{!379, !597, !778, !611}
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !739, line: 11, baseType: !779)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !739, line: 11, flags: DIFlagFwdDecl)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "restoresubvector", scope: !605, file: !600, line: 87, baseType: !775, size: 64, offset: 4032)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayread", scope: !605, file: !600, line: 88, baseType: !783, size: 64, offset: 4096)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{!379, !597, !786}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayread", scope: !605, file: !600, line: 89, baseType: !783, size: 64, offset: 4160)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetgather", scope: !605, file: !600, line: 90, baseType: !789, size: 64, offset: 4224)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{!379, !597, !444, !680, !680, !597, !682}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "stridesubsetscatter", scope: !605, file: !600, line: 91, baseType: !789, size: 64, offset: 4288)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !605, file: !600, line: 92, baseType: !718, size: 64, offset: 4352)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "loadnative", scope: !605, file: !600, line: 93, baseType: !718, size: 64, offset: 4416)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvector", scope: !605, file: !600, line: 94, baseType: !643, size: 64, offset: 4480)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvector", scope: !605, file: !600, line: 95, baseType: !643, size: 64, offset: 4544)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalvectorread", scope: !605, file: !600, line: 96, baseType: !643, size: 64, offset: 4608)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalvectorread", scope: !605, file: !600, line: 97, baseType: !643, size: 64, offset: 4672)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !605, file: !600, line: 98, baseType: !800, size: 64, offset: 4736)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DISubroutineType(types: !802)
!802 = !{!379, !597, !559}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "getarraywrite", scope: !605, file: !600, line: 99, baseType: !689, size: 64, offset: 4800)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "restorearraywrite", scope: !605, file: !600, line: 100, baseType: !689, size: 64, offset: 4864)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayandmemtype", scope: !605, file: !600, line: 101, baseType: !806, size: 64, offset: 4928)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{!379, !597, !509, !809}
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMemType", file: !4, line: 701, baseType: !48)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "getarrayreadandmemtype", scope: !605, file: !600, line: 102, baseType: !812, size: 64, offset: 4992)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DISubroutineType(types: !814)
!814 = !{!379, !597, !786, !809}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayandmemtype", scope: !605, file: !600, line: 103, baseType: !689, size: 64, offset: 5056)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "restorearrayreadandmemtype", scope: !605, file: !600, line: 104, baseType: !783, size: 64, offset: 5120)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "concatenate", scope: !605, file: !600, line: 105, baseType: !818, size: 64, offset: 5184)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!379, !444, !629, !611, !821}
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !599, file: !600, line: 144, baseType: !824, size: 64, offset: 9728)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !739, line: 60, baseType: !825)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !133, line: 240, size: 640, elements: !827)
!827 = !{!828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !826, file: !133, line: 241, baseType: !365, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !826, file: !133, line: 242, baseType: !461, size: 32, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !826, file: !133, line: 243, baseType: !444, size: 32, offset: 96)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !826, file: !133, line: 243, baseType: !444, size: 32, offset: 128)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !826, file: !133, line: 244, baseType: !444, size: 32, offset: 160)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !826, file: !133, line: 244, baseType: !444, size: 32, offset: 192)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !826, file: !133, line: 245, baseType: !489, size: 64, offset: 256)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !826, file: !133, line: 246, baseType: !559, size: 32, offset: 320)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !826, file: !133, line: 247, baseType: !444, size: 32, offset: 352)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !826, file: !133, line: 251, baseType: !444, size: 32, offset: 384)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !826, file: !133, line: 252, baseType: !738, size: 64, offset: 448)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !826, file: !133, line: 253, baseType: !559, size: 32, offset: 512)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !826, file: !133, line: 254, baseType: !444, size: 32, offset: 544)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !826, file: !133, line: 254, baseType: !444, size: 32, offset: 576)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !826, file: !133, line: 255, baseType: !444, size: 32, offset: 608)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !599, file: !600, line: 145, baseType: !369, size: 64, offset: 9792)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "array_gotten", scope: !599, file: !600, line: 146, baseType: !559, size: 32, offset: 9856)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !599, file: !600, line: 147, baseType: !846, size: 1344, offset: 9920)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecStash", file: !600, line: 140, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !600, line: 114, size: 1344, elements: !848)
!848 = !{!849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !867, !868, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !847, file: !600, line: 115, baseType: !444, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !847, file: !600, line: 116, baseType: !444, size: 32, offset: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !847, file: !600, line: 117, baseType: !444, size: 32, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !847, file: !600, line: 118, baseType: !444, size: 32, offset: 96)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !847, file: !600, line: 119, baseType: !444, size: 32, offset: 128)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !847, file: !600, line: 120, baseType: !444, size: 32, offset: 160)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !847, file: !600, line: 121, baseType: !489, size: 64, offset: 192)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !847, file: !600, line: 122, baseType: !506, size: 64, offset: 256)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !847, file: !600, line: 124, baseType: !365, size: 64, offset: 320)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !847, file: !600, line: 125, baseType: !461, size: 32, offset: 384)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !847, file: !600, line: 125, baseType: !461, size: 32, offset: 416)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !847, file: !600, line: 126, baseType: !461, size: 32, offset: 448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !847, file: !600, line: 126, baseType: !461, size: 32, offset: 480)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !847, file: !600, line: 127, baseType: !863, size: 64, offset: 512)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !366, line: 339, baseType: !865)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !366, line: 339, flags: DIFlagFwdDecl)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !847, file: !600, line: 128, baseType: !863, size: 64, offset: 576)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !847, file: !600, line: 129, baseType: !869, size: 64, offset: 640)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !366, line: 341, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !366, line: 351, size: 192, elements: !872)
!872 = !{!873, !874, !875, !876, !877}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !871, file: !366, line: 354, baseType: !91, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !871, file: !366, line: 355, baseType: !91, size: 32, offset: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !871, file: !366, line: 356, baseType: !91, size: 32, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !871, file: !366, line: 361, baseType: !91, size: 32, offset: 96)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !871, file: !366, line: 362, baseType: !555, size: 64, offset: 128)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !847, file: !600, line: 130, baseType: !444, size: 32, offset: 704)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !847, file: !600, line: 130, baseType: !444, size: 32, offset: 736)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !847, file: !600, line: 131, baseType: !506, size: 64, offset: 768)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !847, file: !600, line: 131, baseType: !506, size: 64, offset: 832)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !847, file: !600, line: 132, baseType: !489, size: 64, offset: 896)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !847, file: !600, line: 132, baseType: !489, size: 64, offset: 960)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !847, file: !600, line: 133, baseType: !444, size: 32, offset: 1024)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "nprocs", scope: !847, file: !600, line: 134, baseType: !489, size: 64, offset: 1088)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !847, file: !600, line: 135, baseType: !444, size: 32, offset: 1152)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "donotstash", scope: !847, file: !600, line: 136, baseType: !559, size: 32, offset: 1184)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "ignorenegidx", scope: !847, file: !600, line: 137, baseType: !559, size: 32, offset: 1216)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !847, file: !600, line: 138, baseType: !682, size: 32, offset: 1248)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "bowners", scope: !847, file: !600, line: 139, baseType: !489, size: 64, offset: 1280)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !599, file: !600, line: 147, baseType: !846, size: 1344, offset: 11264)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "petscnative", scope: !599, file: !600, line: 148, baseType: !559, size: 32, offset: 12608)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !599, file: !600, line: 149, baseType: !444, size: 32, offset: 12640)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "offloadmask", scope: !599, file: !600, line: 150, baseType: !895, size: 32, offset: 12672)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOffloadMask", file: !25, line: 472, baseType: !55)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "defaultrandtype", scope: !599, file: !600, line: 157, baseType: !471, size: 64, offset: 12736)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgradient", scope: !591, file: !383, line: 16, baseType: !898, size: 64, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{!379, !380, !597, !497, !597, !369}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "computegradient", scope: !591, file: !383, line: 17, baseType: !902, size: 64, offset: 128)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{!379, !380, !597, !597, !369}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "computehessian", scope: !591, file: !383, line: 18, baseType: !906, size: 64, offset: 192)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{!379, !380, !597, !909, !909, !369}
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !63, line: 16, baseType: !910)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !912, line: 436, size: 23424, elements: !913)
!912 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!913 = !{!914, !915, !1400, !1401, !1402, !1403, !1405, !1406, !1407, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1521, !1522, !1538, !1539, !1540, !1541, !1542, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1577, !1597, !1598, !1600, !1601, !1602, !1603, !1604, !1605, !1623, !1624}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !911, file: !912, line: 437, baseType: !386, size: 4480)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !911, file: !912, line: 437, baseType: !916, size: 9472, offset: 4480)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 9472, elements: !440)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !912, line: 32, size: 9472, elements: !918)
!918 = !{!919, !923, !927, !928, !932, !936, !937, !938, !939, !940, !941, !942, !962, !966, !971, !977, !996, !1001, !1005, !1006, !1010, !1015, !1016, !1021, !1025, !1029, !1033, !1037, !1041, !1042, !1043, !1044, !1045, !1049, !1050, !1055, !1056, !1057, !1058, !1059, !1064, !1071, !1075, !1079, !1083, !1087, !1091, !1092, !1096, !1097, !1101, !1106, !1107, !1108, !1109, !1171, !1179, !1180, !1184, !1185, !1189, !1190, !1194, !1199, !1200, !1204, !1208, !1212, !1213, !1214, !1215, !1216, !1217, !1222, !1223, !1227, !1231, !1235, !1236, !1237, !1241, !1251, !1252, !1256, !1257, !1261, !1262, !1266, !1267, !1271, !1272, !1276, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1290, !1291, !1292, !1293, !1294, !1295, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1310, !1314, !1315, !1316, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1330, !1331, !1332, !1336, !1340, !1341, !1345, !1346, !1347, !1348, !1374, !1378, !1379, !1380, !1381, !1382, !1386, !1387, !1388, !1389, !1390, !1394, !1398, !1399}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !917, file: !912, line: 34, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{!379, !909, !444, !680, !444, !680, !660, !682}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !917, file: !912, line: 35, baseType: !924, size: 64, offset: 64)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{!379, !909, !444, !489, !491, !509}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !917, file: !912, line: 36, baseType: !924, size: 64, offset: 128)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !917, file: !912, line: 37, baseType: !929, size: 64, offset: 192)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{!379, !909, !597, !597}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !917, file: !912, line: 38, baseType: !933, size: 64, offset: 256)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{!379, !909, !597, !597, !597}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !917, file: !912, line: 40, baseType: !929, size: 64, offset: 320)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !917, file: !912, line: 41, baseType: !933, size: 64, offset: 384)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !917, file: !912, line: 42, baseType: !929, size: 64, offset: 448)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !917, file: !912, line: 43, baseType: !933, size: 64, offset: 512)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !917, file: !912, line: 44, baseType: !929, size: 64, offset: 576)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !917, file: !912, line: 46, baseType: !933, size: 64, offset: 640)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !917, file: !912, line: 47, baseType: !943, size: 64, offset: 704)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!379, !909, !778, !778, !946}
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !948)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !63, line: 1239, baseType: !949)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 1226, size: 704, elements: !950)
!950 = !{!951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !949, file: !63, line: 1227, baseType: !498, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !949, file: !63, line: 1228, baseType: !498, size: 64, offset: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !949, file: !63, line: 1229, baseType: !498, size: 64, offset: 128)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !949, file: !63, line: 1230, baseType: !498, size: 64, offset: 192)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !949, file: !63, line: 1231, baseType: !498, size: 64, offset: 256)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !949, file: !63, line: 1232, baseType: !498, size: 64, offset: 320)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !949, file: !63, line: 1233, baseType: !498, size: 64, offset: 384)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !949, file: !63, line: 1234, baseType: !498, size: 64, offset: 448)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !949, file: !63, line: 1236, baseType: !498, size: 64, offset: 512)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !949, file: !63, line: 1237, baseType: !498, size: 64, offset: 576)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !949, file: !63, line: 1238, baseType: !498, size: 64, offset: 640)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !917, file: !912, line: 48, baseType: !963, size: 64, offset: 768)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!379, !909, !778, !946}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !917, file: !912, line: 49, baseType: !967, size: 64, offset: 832)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!379, !909, !597, !498, !970, !498, !444, !444, !597}
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !63, line: 1291, baseType: !62)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !917, file: !912, line: 50, baseType: !972, size: 64, offset: 896)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!379, !909, !975, !976}
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !63, line: 238, baseType: !75)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !917, file: !912, line: 52, baseType: !978, size: 64, offset: 960)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!379, !909, !981, !982}
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !63, line: 612, baseType: !81)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !63, line: 600, baseType: !984)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 592, size: 640, elements: !985)
!985 = !{!986, !987, !988, !989, !990, !991, !992, !993, !994, !995}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !984, file: !63, line: 593, baseType: !446, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !984, file: !63, line: 594, baseType: !446, size: 64, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !984, file: !63, line: 594, baseType: !446, size: 64, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !984, file: !63, line: 594, baseType: !446, size: 64, offset: 192)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !984, file: !63, line: 595, baseType: !446, size: 64, offset: 256)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !984, file: !63, line: 596, baseType: !446, size: 64, offset: 320)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !984, file: !63, line: 597, baseType: !446, size: 64, offset: 384)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !984, file: !63, line: 598, baseType: !446, size: 64, offset: 448)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !984, file: !63, line: 598, baseType: !446, size: 64, offset: 512)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !984, file: !63, line: 599, baseType: !446, size: 64, offset: 576)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !917, file: !912, line: 53, baseType: !997, size: 64, offset: 1024)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!379, !909, !909, !1000}
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !917, file: !912, line: 54, baseType: !1002, size: 64, offset: 1088)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!379, !909, !597}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !917, file: !912, line: 55, baseType: !929, size: 64, offset: 1152)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !917, file: !912, line: 56, baseType: !1007, size: 64, offset: 1216)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!379, !909, !635, !497}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !917, file: !912, line: 58, baseType: !1011, size: 64, offset: 1280)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!379, !909, !1014}
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !63, line: 424, baseType: !86)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !917, file: !912, line: 59, baseType: !1011, size: 64, offset: 1344)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !917, file: !912, line: 60, baseType: !1017, size: 64, offset: 1408)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!379, !909, !1020, !559}
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !63, line: 469, baseType: !90)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !917, file: !912, line: 61, baseType: !1022, size: 64, offset: 1472)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!379, !909}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !917, file: !912, line: 63, baseType: !1026, size: 64, offset: 1536)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!379, !909, !444, !680, !507, !597, !597}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !917, file: !912, line: 64, baseType: !1030, size: 64, offset: 1600)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!379, !909, !909, !778, !778, !946}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !917, file: !912, line: 65, baseType: !1034, size: 64, offset: 1664)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!379, !909, !909, !946}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !917, file: !912, line: 66, baseType: !1038, size: 64, offset: 1728)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!379, !909, !909, !778, !946}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !917, file: !912, line: 67, baseType: !1034, size: 64, offset: 1792)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !917, file: !912, line: 69, baseType: !1022, size: 64, offset: 1856)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !917, file: !912, line: 70, baseType: !1030, size: 64, offset: 1920)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !917, file: !912, line: 71, baseType: !1038, size: 64, offset: 1984)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !917, file: !912, line: 72, baseType: !1046, size: 64, offset: 2048)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!379, !909, !976}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !917, file: !912, line: 73, baseType: !1022, size: 64, offset: 2112)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !917, file: !912, line: 75, baseType: !1051, size: 64, offset: 2176)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!379, !909, !1054, !976}
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !63, line: 563, baseType: !121)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !917, file: !912, line: 76, baseType: !929, size: 64, offset: 2240)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !917, file: !912, line: 77, baseType: !929, size: 64, offset: 2304)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !917, file: !912, line: 78, baseType: !943, size: 64, offset: 2368)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !917, file: !912, line: 79, baseType: !963, size: 64, offset: 2432)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !917, file: !912, line: 81, baseType: !1060, size: 64, offset: 2496)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!379, !909, !507, !909, !1063}
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !63, line: 285, baseType: !126)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !917, file: !912, line: 82, baseType: !1065, size: 64, offset: 2560)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!379, !909, !444, !1068, !1068, !975, !1070}
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !778)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !917, file: !912, line: 83, baseType: !1072, size: 64, offset: 2624)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!379, !909, !444, !822, !444}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !917, file: !912, line: 84, baseType: !1076, size: 64, offset: 2688)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!379, !909, !444, !680, !444, !680, !506}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !917, file: !912, line: 85, baseType: !1080, size: 64, offset: 2752)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!379, !909, !909, !1063}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !917, file: !912, line: 87, baseType: !1084, size: 64, offset: 2816)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!379, !909, !597, !489}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !917, file: !912, line: 88, baseType: !1088, size: 64, offset: 2880)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!379, !909, !507}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !917, file: !912, line: 89, baseType: !1088, size: 64, offset: 2944)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !917, file: !912, line: 90, baseType: !1093, size: 64, offset: 3008)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!379, !909, !597, !682}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !917, file: !912, line: 91, baseType: !1026, size: 64, offset: 3072)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !917, file: !912, line: 93, baseType: !1098, size: 64, offset: 3136)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!379, !909, !707}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !917, file: !912, line: 94, baseType: !1102, size: 64, offset: 3200)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!379, !909, !444, !559, !559, !489, !1105, !1105, !1000}
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !917, file: !912, line: 95, baseType: !1102, size: 64, offset: 3264)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !917, file: !912, line: 96, baseType: !1102, size: 64, offset: 3328)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !917, file: !912, line: 97, baseType: !1102, size: 64, offset: 3392)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !917, file: !912, line: 99, baseType: !1110, size: 64, offset: 3456)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!379, !909, !1113, !1116}
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !739, line: 51, baseType: !1114)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !739, line: 51, flags: DIFlagFwdDecl)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !63, line: 1378, baseType: !1117)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !912, line: 609, size: 6208, elements: !1119)
!1119 = !{!1120, !1121, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1140, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1158, !1159, !1160, !1161, !1162, !1164, !1165, !1166, !1167, !1168, !1169, !1170}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1118, file: !912, line: 610, baseType: !386, size: 4480)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1118, file: !912, line: 610, baseType: !1122, size: 32, offset: 4480)
!1122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 32, elements: !440)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1118, file: !912, line: 611, baseType: !444, size: 32, offset: 4512)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1118, file: !912, line: 611, baseType: !444, size: 32, offset: 4544)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1118, file: !912, line: 611, baseType: !444, size: 32, offset: 4576)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1118, file: !912, line: 612, baseType: !444, size: 32, offset: 4608)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1118, file: !912, line: 613, baseType: !444, size: 32, offset: 4640)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1118, file: !912, line: 614, baseType: !489, size: 64, offset: 4672)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1118, file: !912, line: 615, baseType: !491, size: 64, offset: 4736)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !1118, file: !912, line: 616, baseType: !822, size: 64, offset: 4800)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1118, file: !912, line: 617, baseType: !489, size: 64, offset: 4864)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !1118, file: !912, line: 618, baseType: !1133, size: 64, offset: 4928)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !912, line: 602, baseType: !1135)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !912, line: 598, size: 128, elements: !1136)
!1136 = !{!1137, !1138, !1139}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1135, file: !912, line: 599, baseType: !444, size: 32)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1135, file: !912, line: 600, baseType: !444, size: 32, offset: 32)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1135, file: !912, line: 601, baseType: !506, size: 64, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !1118, file: !912, line: 619, baseType: !1141, size: 64, offset: 4992)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !912, line: 607, baseType: !1143)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !912, line: 604, size: 128, elements: !1144)
!1144 = !{!1145, !1146}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1143, file: !912, line: 605, baseType: !444, size: 32)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !1143, file: !912, line: 606, baseType: !506, size: 64, offset: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !1118, file: !912, line: 620, baseType: !506, size: 64, offset: 5056)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !1118, file: !912, line: 621, baseType: !498, size: 64, offset: 5120)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !1118, file: !912, line: 622, baseType: !498, size: 64, offset: 5184)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !1118, file: !912, line: 623, baseType: !597, size: 64, offset: 5248)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !1118, file: !912, line: 623, baseType: !597, size: 64, offset: 5312)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !1118, file: !912, line: 623, baseType: !597, size: 64, offset: 5376)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !1118, file: !912, line: 624, baseType: !559, size: 32, offset: 5440)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1118, file: !912, line: 625, baseType: !1155, size: 64, offset: 5504)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{!379}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !1118, file: !912, line: 626, baseType: !369, size: 64, offset: 5568)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !1118, file: !912, line: 627, baseType: !597, size: 64, offset: 5632)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1118, file: !912, line: 628, baseType: !444, size: 32, offset: 5696)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !1118, file: !912, line: 629, baseType: !421, size: 64, offset: 5760)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1118, file: !912, line: 630, baseType: !1163, size: 32, offset: 5824)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !133, line: 213, baseType: !132)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1118, file: !912, line: 631, baseType: !444, size: 32, offset: 5856)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !1118, file: !912, line: 631, baseType: !444, size: 32, offset: 5888)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1118, file: !912, line: 632, baseType: !559, size: 32, offset: 5920)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !1118, file: !912, line: 633, baseType: !559, size: 32, offset: 5952)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !1118, file: !912, line: 634, baseType: !432, size: 64, offset: 6016)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !1118, file: !912, line: 634, baseType: !369, size: 64, offset: 6080)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !1118, file: !912, line: 635, baseType: !452, size: 64, offset: 6144)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !917, file: !912, line: 100, baseType: !1172, size: 64, offset: 3520)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = !DISubroutineType(types: !1174)
!1174 = !{!379, !909, !444, !444, !1175, !1178}
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !133, line: 215, baseType: !1177)
!1177 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !917, file: !912, line: 101, baseType: !1022, size: 64, offset: 3584)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !917, file: !912, line: 102, baseType: !1181, size: 64, offset: 3648)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = !DISubroutineType(types: !1183)
!1183 = !{!379, !909, !778, !778, !976}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !917, file: !912, line: 103, baseType: !920, size: 64, offset: 3712)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !917, file: !912, line: 105, baseType: !1186, size: 64, offset: 3776)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = !DISubroutineType(types: !1188)
!1188 = !{!379, !909, !778, !778, !975, !976}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !917, file: !912, line: 106, baseType: !1022, size: 64, offset: 3840)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !917, file: !912, line: 107, baseType: !1191, size: 64, offset: 3904)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DISubroutineType(types: !1193)
!1193 = !{!379, !909, !408}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !917, file: !912, line: 108, baseType: !1195, size: 64, offset: 3968)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1196 = !DISubroutineType(types: !1197)
!1197 = !{!379, !909, !1198, !975, !976}
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !63, line: 25, baseType: !421)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !917, file: !912, line: 109, baseType: !1155, size: 64, offset: 4032)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !917, file: !912, line: 111, baseType: !1201, size: 64, offset: 4096)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = !DISubroutineType(types: !1203)
!1203 = !{!379, !909, !909, !909, !498, !909}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !917, file: !912, line: 112, baseType: !1205, size: 64, offset: 4160)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{!379, !909, !909, !909, !909}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !917, file: !912, line: 113, baseType: !1209, size: 64, offset: 4224)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64)
!1210 = !DISubroutineType(types: !1211)
!1211 = !{!379, !909, !738, !738}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !917, file: !912, line: 114, baseType: !920, size: 64, offset: 4288)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !917, file: !912, line: 115, baseType: !1026, size: 64, offset: 4352)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !917, file: !912, line: 117, baseType: !1084, size: 64, offset: 4416)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !917, file: !912, line: 118, baseType: !1084, size: 64, offset: 4480)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !917, file: !912, line: 119, baseType: !1195, size: 64, offset: 4544)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !917, file: !912, line: 120, baseType: !1218, size: 64, offset: 4608)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64)
!1219 = !DISubroutineType(types: !1220)
!1220 = !{!379, !909, !1221, !1000}
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !63, line: 1675, baseType: !137)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !917, file: !912, line: 121, baseType: !1155, size: 64, offset: 4672)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !917, file: !912, line: 123, baseType: !1224, size: 64, offset: 4736)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64)
!1225 = !DISubroutineType(types: !1226)
!1226 = !{!379, !909, !444, !369}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !917, file: !912, line: 124, baseType: !1228, size: 64, offset: 4800)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{!379, !909, !1116, !597, !369}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !917, file: !912, line: 125, baseType: !1232, size: 64, offset: 4864)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = !DISubroutineType(types: !1234)
!1234 = !{!379, !535, !909}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !917, file: !912, line: 126, baseType: !929, size: 64, offset: 4928)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !917, file: !912, line: 127, baseType: !929, size: 64, offset: 4992)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !917, file: !912, line: 129, baseType: !1238, size: 64, offset: 5056)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = !DISubroutineType(types: !1240)
!1240 = !{!379, !909, !822}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !917, file: !912, line: 130, baseType: !1242, size: 64, offset: 5120)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64)
!1243 = !DISubroutineType(types: !1244)
!1244 = !{!379, !909, !1245, !1245}
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !25, line: 654, baseType: !1246)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !25, line: 653, size: 128, elements: !1248)
!1248 = !{!1249, !1250}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1247, file: !25, line: 653, baseType: !444, size: 32)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1247, file: !25, line: 653, baseType: !597, size: 64, offset: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !917, file: !912, line: 131, baseType: !1242, size: 64, offset: 5184)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !917, file: !912, line: 132, baseType: !1253, size: 64, offset: 5248)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64)
!1254 = !DISubroutineType(types: !1255)
!1255 = !{!379, !909, !489, !489, !489}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !917, file: !912, line: 133, baseType: !1191, size: 64, offset: 5312)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !917, file: !912, line: 135, baseType: !1258, size: 64, offset: 5376)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{!379, !909, !498, !1000}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !917, file: !912, line: 136, baseType: !1258, size: 64, offset: 5440)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !917, file: !912, line: 137, baseType: !1263, size: 64, offset: 5504)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{!379, !909, !1000}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !917, file: !912, line: 138, baseType: !920, size: 64, offset: 5568)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !917, file: !912, line: 139, baseType: !1268, size: 64, offset: 5632)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{!379, !909, !611, !611}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !917, file: !912, line: 141, baseType: !1155, size: 64, offset: 5696)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !917, file: !912, line: 142, baseType: !1273, size: 64, offset: 5760)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64)
!1274 = !DISubroutineType(types: !1275)
!1275 = !{!379, !909, !909, !498, !909}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !917, file: !912, line: 143, baseType: !1277, size: 64, offset: 5824)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64)
!1278 = !DISubroutineType(types: !1279)
!1279 = !{!379, !909, !909, !909}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !917, file: !912, line: 144, baseType: !1155, size: 64, offset: 5888)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !917, file: !912, line: 145, baseType: !1273, size: 64, offset: 5952)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !917, file: !912, line: 147, baseType: !1277, size: 64, offset: 6016)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !917, file: !912, line: 148, baseType: !1155, size: 64, offset: 6080)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !917, file: !912, line: 149, baseType: !1273, size: 64, offset: 6144)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !917, file: !912, line: 150, baseType: !1277, size: 64, offset: 6208)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !917, file: !912, line: 151, baseType: !1287, size: 64, offset: 6272)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64)
!1288 = !DISubroutineType(types: !1289)
!1289 = !{!379, !909, !559}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !917, file: !912, line: 153, baseType: !1022, size: 64, offset: 6336)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !917, file: !912, line: 154, baseType: !1022, size: 64, offset: 6400)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !917, file: !912, line: 155, baseType: !1022, size: 64, offset: 6464)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !917, file: !912, line: 156, baseType: !1022, size: 64, offset: 6528)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !917, file: !912, line: 157, baseType: !1191, size: 64, offset: 6592)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !917, file: !912, line: 159, baseType: !1296, size: 64, offset: 6656)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64)
!1297 = !DISubroutineType(types: !1298)
!1298 = !{!379, !909, !444, !660}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !917, file: !912, line: 160, baseType: !1022, size: 64, offset: 6720)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !917, file: !912, line: 161, baseType: !1022, size: 64, offset: 6784)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !917, file: !912, line: 162, baseType: !1022, size: 64, offset: 6848)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !917, file: !912, line: 163, baseType: !1022, size: 64, offset: 6912)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !917, file: !912, line: 165, baseType: !1277, size: 64, offset: 6976)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !917, file: !912, line: 166, baseType: !1277, size: 64, offset: 7040)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !917, file: !912, line: 167, baseType: !1084, size: 64, offset: 7104)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !917, file: !912, line: 168, baseType: !1307, size: 64, offset: 7168)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64)
!1308 = !DISubroutineType(types: !1309)
!1309 = !{!379, !909, !597, !444}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !917, file: !912, line: 169, baseType: !1311, size: 64, offset: 7232)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64)
!1312 = !DISubroutineType(types: !1313)
!1313 = !{!379, !909, !1000, !489}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !917, file: !912, line: 171, baseType: !1046, size: 64, offset: 7296)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !917, file: !912, line: 172, baseType: !1022, size: 64, offset: 7360)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !917, file: !912, line: 173, baseType: !1317, size: 64, offset: 7424)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64)
!1318 = !DISubroutineType(types: !1319)
!1319 = !{!379, !909, !489, !1105}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !917, file: !912, line: 174, baseType: !1181, size: 64, offset: 7488)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !917, file: !912, line: 175, baseType: !1181, size: 64, offset: 7552)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !917, file: !912, line: 177, baseType: !929, size: 64, offset: 7616)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !917, file: !912, line: 178, baseType: !972, size: 64, offset: 7680)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !917, file: !912, line: 179, baseType: !929, size: 64, offset: 7744)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !917, file: !912, line: 180, baseType: !933, size: 64, offset: 7808)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !917, file: !912, line: 181, baseType: !1327, size: 64, offset: 7872)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{!379, !909, !365, !975, !976}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !917, file: !912, line: 183, baseType: !1238, size: 64, offset: 7936)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !917, file: !912, line: 184, baseType: !1007, size: 64, offset: 8000)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !917, file: !912, line: 185, baseType: !1333, size: 64, offset: 8064)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64)
!1334 = !DISubroutineType(types: !1335)
!1335 = !{!379, !909, !786}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !917, file: !912, line: 186, baseType: !1337, size: 64, offset: 8128)
