; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/linesearch/impls/l2/linesearchl2.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/linesearch/impls/l2/linesearchl2.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_LineSearch = type { %struct._p_PetscObject, [1 x %struct._LineSearchOps], %struct._p_SNES*, i8*, i32, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Vec*, i32, %struct._p_Vec**, double, i32, double, double, double, i32, i32, double, double, double, i32, double, double, double, i32, double, i8*, i8*, %struct._p_PetscViewer*, [5 x i32 (%struct._p_LineSearch*, i8*)*], [5 x i32 (i8**)*], [5 x i8*], i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/linesearch/impls/l2/linesearchl2.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!2 = !{!3, !9, !24, !33, !39}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 170, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 81, baseType: !5, size: 32, elements: !11)
!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!12 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 616, baseType: !5, size: 32, elements: !26)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsnes.h", directory: "/home/users/ndemeye/xSDK")
!26 = !{!27, !28, !29, !30, !31, !32}
!27 = !DIEnumerator(name: "SNES_LINESEARCH_SUCCEEDED", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_NANORINF", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_DOMAIN", value: 2, isUnsigned: true)
!30 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_REDUCT", value: 3, isUnsigned: true)
!31 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_USER", value: 4, isUnsigned: true)
!32 = !DIEnumerator(name: "SNES_LINESEARCH_FAILED_FUNCTION", value: 5, isUnsigned: true)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !34, line: 663, baseType: !5, size: 32, elements: !35)
!34 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!35 = !{!36, !37, !38}
!36 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!37 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!38 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !40, line: 155, baseType: !5, size: 32, elements: !41)
!40 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!41 = !{!42, !43, !44, !45, !46}
!42 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!43 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!44 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!45 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!46 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!47 = !{!48, !51, !55, !56, !115}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!50 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !52, line: 330, baseType: !53)
!52 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !52, line: 330, flags: DIFlagFwdDecl)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !59, line: 73, size: 4480, elements: !60)
!59 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!60 = !{!61, !64, !110, !111, !113, !116, !117, !118, !119, !127, !128, !130, !134, !138, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !151, !152, !153, !155, !156, !158, !160, !161, !162, !163, !164, !167, !169, !170, !171, !172, !173, !176, !178, !179, !180, !190, !192, !193, !197, !198, !247, !252, !254, !255, !256}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !58, file: !59, line: 74, baseType: !62, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !63)
!63 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !58, file: !59, line: 75, baseType: !65, size: 448, offset: 64)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 448, elements: !108)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !59, line: 53, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !59, line: 45, size: 448, elements: !68)
!68 = !{!69, !75, !83, !88, !92, !96, !103}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !67, file: !59, line: 46, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!73, !56, !74}
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !63)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !67, file: !59, line: 47, baseType: !76, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!73, !56, !79}
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !80, line: 16, baseType: !81)
!80 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !80, line: 16, flags: DIFlagFwdDecl)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !67, file: !59, line: 48, baseType: !84, size: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{!73, !87}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !67, file: !59, line: 49, baseType: !89, size: 64, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!73, !56, !48, !56}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !67, file: !59, line: 50, baseType: !93, size: 64, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!73, !56, !48, !87}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !67, file: !59, line: 51, baseType: !97, size: 64, offset: 320)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!73, !56, !48, !100}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{null}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !67, file: !59, line: 52, baseType: !104, size: 64, offset: 384)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!73, !56, !48, !107}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!108 = !{!109}
!109 = !DISubrange(count: 1)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !58, file: !59, line: 76, baseType: !51, size: 64, offset: 512)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !58, file: !59, line: 77, baseType: !112, size: 32, offset: 576)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !63)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !58, file: !59, line: 78, baseType: !114, size: 64, offset: 640)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !115)
!115 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !58, file: !59, line: 78, baseType: !114, size: 64, offset: 704)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !58, file: !59, line: 78, baseType: !114, size: 64, offset: 768)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !58, file: !59, line: 78, baseType: !114, size: 64, offset: 832)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !58, file: !59, line: 79, baseType: !120, size: 64, offset: 896)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !123, line: 27, baseType: !124)
!123 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !125, line: 43, baseType: !126)
!125 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!126 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !58, file: !59, line: 80, baseType: !112, size: 32, offset: 960)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !58, file: !59, line: 81, baseType: !129, size: 32, offset: 992)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !63)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !58, file: !59, line: 82, baseType: !131, size: 64, offset: 1024)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !58, file: !59, line: 83, baseType: !135, size: 64, offset: 1088)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !58, file: !59, line: 84, baseType: !139, size: 64, offset: 1152)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !58, file: !59, line: 85, baseType: !139, size: 64, offset: 1216)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !58, file: !59, line: 86, baseType: !139, size: 64, offset: 1280)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !58, file: !59, line: 87, baseType: !139, size: 64, offset: 1344)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !58, file: !59, line: 88, baseType: !56, size: 64, offset: 1408)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !58, file: !59, line: 89, baseType: !120, size: 64, offset: 1472)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !58, file: !59, line: 90, baseType: !139, size: 64, offset: 1536)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !58, file: !59, line: 91, baseType: !139, size: 64, offset: 1600)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !58, file: !59, line: 92, baseType: !112, size: 32, offset: 1664)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !58, file: !59, line: 93, baseType: !55, size: 64, offset: 1728)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !58, file: !59, line: 94, baseType: !150, size: 64, offset: 1792)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !121)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !58, file: !59, line: 95, baseType: !112, size: 32, offset: 1856)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !58, file: !59, line: 95, baseType: !112, size: 32, offset: 1888)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !58, file: !59, line: 96, baseType: !154, size: 64, offset: 1920)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !58, file: !59, line: 96, baseType: !154, size: 64, offset: 1984)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !58, file: !59, line: 97, baseType: !157, size: 64, offset: 2048)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !58, file: !59, line: 97, baseType: !159, size: 64, offset: 2112)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !58, file: !59, line: 98, baseType: !112, size: 32, offset: 2176)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !58, file: !59, line: 98, baseType: !112, size: 32, offset: 2208)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !58, file: !59, line: 99, baseType: !154, size: 64, offset: 2240)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !58, file: !59, line: 99, baseType: !154, size: 64, offset: 2304)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !58, file: !59, line: 100, baseType: !165, size: 64, offset: 2368)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !115)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !58, file: !59, line: 100, baseType: !168, size: 64, offset: 2432)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !58, file: !59, line: 101, baseType: !112, size: 32, offset: 2496)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !58, file: !59, line: 101, baseType: !112, size: 32, offset: 2528)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !58, file: !59, line: 102, baseType: !154, size: 64, offset: 2560)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !58, file: !59, line: 102, baseType: !154, size: 64, offset: 2624)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !58, file: !59, line: 103, baseType: !174, size: 64, offset: 2688)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !166)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !58, file: !59, line: 103, baseType: !177, size: 64, offset: 2752)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !58, file: !59, line: 104, baseType: !107, size: 64, offset: 2816)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !58, file: !59, line: 105, baseType: !112, size: 32, offset: 2880)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !58, file: !59, line: 106, baseType: !181, size: 128, offset: 2944)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 128, elements: !188)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !59, line: 64, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !59, line: 61, size: 128, elements: !185)
!185 = !{!186, !187}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !184, file: !59, line: 62, baseType: !100, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !184, file: !59, line: 63, baseType: !55, size: 64, offset: 64)
!188 = !{!189}
!189 = !DISubrange(count: 2)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !58, file: !59, line: 107, baseType: !191, size: 64, offset: 3072)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 64, elements: !188)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !58, file: !59, line: 108, baseType: !55, size: 64, offset: 3136)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !58, file: !59, line: 109, baseType: !194, size: 64, offset: 3200)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!73, !55}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !58, file: !59, line: 111, baseType: !112, size: 32, offset: 3264)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !58, file: !59, line: 112, baseType: !199, size: 320, offset: 3328)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 320, elements: !245)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!73, !203, !56, !55}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !206)
!206 = !{!207, !208, !233, !234, !235, !236, !237, !238, !239, !240, !241}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !205, file: !10, line: 100, baseType: !112, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !205, file: !10, line: 101, baseType: !209, size: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !212)
!212 = !{!213, !214, !215, !216, !217, !220, !221, !222, !226, !228, !230, !231, !232}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !211, file: !10, line: 84, baseType: !139, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !211, file: !10, line: 85, baseType: !139, size: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !211, file: !10, line: 86, baseType: !55, size: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !211, file: !10, line: 87, baseType: !131, size: 64, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !211, file: !10, line: 88, baseType: !218, size: 64, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !211, file: !10, line: 89, baseType: !50, size: 8, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !211, file: !10, line: 90, baseType: !139, size: 64, offset: 384)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !211, file: !10, line: 91, baseType: !223, size: 64, offset: 448)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !224, line: 46, baseType: !225)
!224 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!225 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !211, file: !10, line: 92, baseType: !227, size: 32, offset: 512)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !211, file: !10, line: 93, baseType: !229, size: 32, offset: 544)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !211, file: !10, line: 94, baseType: !209, size: 64, offset: 576)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !211, file: !10, line: 95, baseType: !139, size: 64, offset: 640)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !211, file: !10, line: 96, baseType: !55, size: 64, offset: 704)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !205, file: !10, line: 102, baseType: !139, size: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !205, file: !10, line: 102, baseType: !139, size: 64, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !205, file: !10, line: 103, baseType: !139, size: 64, offset: 256)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !205, file: !10, line: 104, baseType: !51, size: 64, offset: 320)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !205, file: !10, line: 105, baseType: !227, size: 32, offset: 384)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !205, file: !10, line: 105, baseType: !227, size: 32, offset: 416)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !205, file: !10, line: 105, baseType: !227, size: 32, offset: 448)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !205, file: !10, line: 106, baseType: !56, size: 64, offset: 512)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !205, file: !10, line: 107, baseType: !242, size: 64, offset: 576)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!245 = !{!246}
!246 = !DISubrange(count: 5)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !58, file: !59, line: 113, baseType: !248, size: 320, offset: 3648)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 320, elements: !245)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!73, !56, !55}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !58, file: !59, line: 114, baseType: !253, size: 320, offset: 3968)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 320, elements: !245)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !58, file: !59, line: 115, baseType: !227, size: 32, offset: 4288)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !58, file: !59, line: 120, baseType: !242, size: 64, offset: 4352)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !58, file: !59, line: 121, baseType: !227, size: 32, offset: 4416)
!257 = !{i32 7, !"Dwarf Version", i32 4}
!258 = !{i32 2, !"Debug Info Version", i32 3}
!259 = !{i32 1, !"wchar_size", i32 4}
!260 = !{i32 7, !"PIC Level", i32 2}
!261 = !{i32 7, !"uwtable", i32 1}
!262 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!263 = distinct !DISubprogram(name: "SNESLineSearchCreate_L2", scope: !264, file: !264, line: 195, type: !265, scopeLine: 196, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !365)
!264 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/snes/linesearch/impls/l2/linesearchl2.c", directory: "/home/users/ndemeye/xSDK")
!265 = !DISubroutineType(types: !266)
!266 = !{!73, !267}
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearch", file: !25, line: 526, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_LineSearch", file: !270, line: 29, size: 8000, elements: !271)
!270 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/linesearchimpl.h", directory: "/home/users/ndemeye/xSDK")
!271 = !{!272, !274, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !332, !333, !334, !335, !336, !337, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !357, !363, !364}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !269, file: !270, line: 30, baseType: !273, size: 4480)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !59, line: 122, baseType: !58)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !269, file: !270, line: 30, baseType: !275, size: 704, offset: 4480)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 704, elements: !108)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LineSearchOps", file: !270, line: 13, size: 704, elements: !277)
!277 = !{!278, !282, !285, !293, !301, !306, !310, !314, !315, !316, !317}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !276, file: !270, line: 14, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!73, !267, !79}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !276, file: !270, line: 15, baseType: !283, size: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchApplyFunc", file: !25, line: 554, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "precheck", scope: !276, file: !270, line: 16, baseType: !286, size: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!73, !267, !289, !289, !292, !55}
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !40, line: 21, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !40, line: 21, flags: DIFlagFwdDecl)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "viproject", scope: !276, file: !270, line: 17, baseType: !294, size: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchVIProjectFunc", file: !25, line: 552, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!73, !298, !289}
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !25, line: 18, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !25, line: 18, flags: DIFlagFwdDecl)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "vinorm", scope: !276, file: !270, line: 18, baseType: !302, size: 64, offset: 256)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchVINormFunc", file: !25, line: 553, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DISubroutineType(types: !305)
!305 = !{!73, !298, !289, !289, !165}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "postcheck", scope: !276, file: !270, line: 19, baseType: !307, size: 64, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!73, !267, !289, !289, !289, !292, !292, !55}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !276, file: !270, line: 20, baseType: !311, size: 64, offset: 384)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!73, !203, !267}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !276, file: !270, line: 21, baseType: !284, size: 64, offset: 448)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !276, file: !270, line: 22, baseType: !284, size: 64, offset: 512)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !276, file: !270, line: 23, baseType: !284, size: 64, offset: 576)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "snesfunc", scope: !276, file: !270, line: 24, baseType: !318, size: 64, offset: 640)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!73, !298, !289, !289}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "snes", scope: !269, file: !270, line: 32, baseType: !298, size: 64, offset: 5184)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !269, file: !270, line: 34, baseType: !55, size: 64, offset: 5248)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !269, file: !270, line: 36, baseType: !227, size: 32, offset: 5312)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !269, file: !270, line: 38, baseType: !289, size: 64, offset: 5376)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_new", scope: !269, file: !270, line: 39, baseType: !289, size: 64, offset: 5440)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !269, file: !270, line: 40, baseType: !289, size: 64, offset: 5504)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_new", scope: !269, file: !270, line: 41, baseType: !289, size: 64, offset: 5568)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "vec_update", scope: !269, file: !270, line: 42, baseType: !289, size: 64, offset: 5632)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !269, file: !270, line: 44, baseType: !112, size: 32, offset: 5696)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !269, file: !270, line: 45, baseType: !331, size: 64, offset: 5760)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !269, file: !270, line: 47, baseType: !166, size: 64, offset: 5824)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "norms", scope: !269, file: !270, line: 49, baseType: !227, size: 32, offset: 5888)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "fnorm", scope: !269, file: !270, line: 50, baseType: !166, size: 64, offset: 5952)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !269, file: !270, line: 51, baseType: !166, size: 64, offset: 6016)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !269, file: !270, line: 52, baseType: !166, size: 64, offset: 6080)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !269, file: !270, line: 53, baseType: !338, size: 32, offset: 6144)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearchReason", file: !25, line: 621, baseType: !24)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "keeplambda", scope: !269, file: !270, line: 54, baseType: !227, size: 32, offset: 6176)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !269, file: !270, line: 56, baseType: !166, size: 64, offset: 6208)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "maxstep", scope: !269, file: !270, line: 57, baseType: !166, size: 64, offset: 6272)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "steptol", scope: !269, file: !270, line: 58, baseType: !166, size: 64, offset: 6336)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !269, file: !270, line: 59, baseType: !112, size: 32, offset: 6400)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !269, file: !270, line: 60, baseType: !166, size: 64, offset: 6464)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "atol", scope: !269, file: !270, line: 61, baseType: !166, size: 64, offset: 6528)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ltol", scope: !269, file: !270, line: 62, baseType: !166, size: 64, offset: 6592)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !269, file: !270, line: 63, baseType: !112, size: 32, offset: 6656)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !269, file: !270, line: 65, baseType: !166, size: 64, offset: 6720)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "precheckctx", scope: !269, file: !270, line: 67, baseType: !55, size: 64, offset: 6784)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "postcheckctx", scope: !269, file: !270, line: 68, baseType: !55, size: 64, offset: 6848)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !269, file: !270, line: 70, baseType: !79, size: 64, offset: 6912)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "monitorftns", scope: !269, file: !270, line: 71, baseType: !353, size: 320, offset: 6976)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 320, elements: !245)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!73, !267, !55}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !269, file: !270, line: 72, baseType: !358, size: 320, offset: 7296)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 320, elements: !245)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!73, !362}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !269, file: !270, line: 73, baseType: !253, size: 320, offset: 7616)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !269, file: !270, line: 74, baseType: !112, size: 32, offset: 7936)
!365 = !{!366}
!366 = !DILocalVariable(name: "linesearch", arg: 1, scope: !263, file: !264, line: 195, type: !267)
!367 = !DILocation(line: 0, scope: !263)
!368 = !DILocation(line: 197, column: 3, scope: !369)
!369 = distinct !DILexicalBlock(scope: !370, file: !264, line: 197, column: 3)
!370 = distinct !DILexicalBlock(scope: !371, file: !264, line: 197, column: 3)
!371 = distinct !DILexicalBlock(scope: !263, file: !264, line: 197, column: 3)
!372 = !{!373, !373, i64 0}
!373 = !{!"any pointer", !374, i64 0}
!374 = !{!"omnipotent char", !375, i64 0}
!375 = !{!"Simple C/C++ TBAA"}
!376 = !DILocation(line: 197, column: 3, scope: !370)
!377 = !DILocation(line: 197, column: 3, scope: !378)
!378 = distinct !DILexicalBlock(scope: !379, file: !264, line: 197, column: 3)
!379 = distinct !DILexicalBlock(scope: !369, file: !264, line: 197, column: 3)
!380 = !{!381, !382, i64 1536}
!381 = !{!"", !374, i64 0, !374, i64 512, !374, i64 1024, !374, i64 1280, !382, i64 1536, !382, i64 1540, !374, i64 1544}
!382 = !{!"int", !374, i64 0}
!383 = !DILocation(line: 197, column: 3, scope: !379)
!384 = !DILocation(line: 197, column: 3, scope: !385)
!385 = distinct !DILexicalBlock(scope: !378, file: !264, line: 197, column: 3)
!386 = !{!382, !382, i64 0}
!387 = !{!381, !382, i64 1540}
!388 = !DILocation(line: 206, column: 3, scope: !389)
!389 = distinct !DILexicalBlock(scope: !390, file: !264, line: 206, column: 3)
!390 = distinct !DILexicalBlock(scope: !391, file: !264, line: 206, column: 3)
!391 = distinct !DILexicalBlock(scope: !263, file: !264, line: 206, column: 3)
!392 = !DILocation(line: 198, column: 20, scope: !263)
!393 = !DILocation(line: 198, column: 35, scope: !263)
!394 = !{!395, !373, i64 8}
!395 = !{!"_LineSearchOps", !373, i64 0, !373, i64 8, !373, i64 16, !373, i64 24, !373, i64 32, !373, i64 40, !373, i64 48, !373, i64 56, !373, i64 64, !373, i64 72, !373, i64 80}
!396 = !DILocation(line: 200, column: 20, scope: !263)
!397 = !DILocation(line: 202, column: 20, scope: !263)
!398 = !DILocation(line: 202, column: 35, scope: !263)
!399 = !{!395, !373, i64 0}
!400 = !DILocation(line: 205, column: 15, scope: !263)
!401 = !DILocation(line: 205, column: 23, scope: !263)
!402 = !DILocation(line: 200, column: 35, scope: !263)
!403 = !{!404, !382, i64 800}
!404 = !{!"_p_LineSearch", !405, i64 0, !374, i64 560, !373, i64 648, !373, i64 656, !374, i64 664, !373, i64 672, !373, i64 680, !373, i64 688, !373, i64 696, !373, i64 704, !382, i64 712, !373, i64 720, !406, i64 728, !374, i64 736, !406, i64 744, !406, i64 752, !406, i64 760, !374, i64 768, !374, i64 772, !406, i64 776, !406, i64 784, !406, i64 792, !382, i64 800, !406, i64 808, !406, i64 816, !406, i64 824, !382, i64 832, !406, i64 840, !373, i64 848, !373, i64 856, !373, i64 864, !374, i64 872, !374, i64 912, !374, i64 952, !382, i64 992}
!405 = !{!"_p_PetscObject", !382, i64 0, !374, i64 8, !373, i64 64, !382, i64 72, !406, i64 80, !406, i64 88, !406, i64 96, !406, i64 104, !407, i64 112, !382, i64 120, !382, i64 124, !373, i64 128, !373, i64 136, !373, i64 144, !373, i64 152, !373, i64 160, !373, i64 168, !373, i64 176, !407, i64 184, !373, i64 192, !373, i64 200, !382, i64 208, !373, i64 216, !407, i64 224, !382, i64 232, !382, i64 236, !373, i64 240, !373, i64 248, !373, i64 256, !373, i64 264, !382, i64 272, !382, i64 276, !373, i64 280, !373, i64 288, !373, i64 296, !373, i64 304, !382, i64 312, !382, i64 316, !373, i64 320, !373, i64 328, !373, i64 336, !373, i64 344, !373, i64 352, !382, i64 360, !374, i64 368, !374, i64 384, !373, i64 392, !373, i64 400, !382, i64 408, !374, i64 416, !374, i64 456, !374, i64 496, !374, i64 536, !373, i64 544, !374, i64 552}
!406 = !{!"double", !374, i64 0}
!407 = !{!"long", !374, i64 0}
!408 = !DILocation(line: 206, column: 3, scope: !390)
!409 = !DILocation(line: 206, column: 3, scope: !410)
