; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/mg/mgfunc.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/mg/mgfunc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct._p_Mat = type opaque
%struct._p_Vec = type opaque
%struct.ompi_communicator_t = type opaque
%struct._p_PC = type { %struct._p_PetscObject, [1 x %struct._PCOps], %struct._p_DM*, i32, i64, i64, i32, i32, i32, i32, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 (%struct._p_PC*, i32, %struct._p_IS**, %struct._p_IS**, %struct._p_Mat**, i8*)*, i8*, i8*, i32, i8*, i32, i32 }

!78 = !DIEnumerator(name: "PC_MG_GALERKIN_EXTERNAL", value: 4, isUnsigned: true)
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 330, baseType: !5, size: 32, elements: !80)
!80 = !{!81, !82, !83, !84}
!81 = !DIEnumerator(name: "PCMG_POLYNOMIAL", value: 0, isUnsigned: true)
!82 = !DIEnumerator(name: "PCMG_HARMONIC", value: 1, isUnsigned: true)
!83 = !DIEnumerator(name: "PCMG_EIGENVECTOR", value: 2, isUnsigned: true)
!84 = !DIEnumerator(name: "PCMG_GENERALIZED_EIGENVECTOR", value: 3, isUnsigned: true)
!85 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !24, line: 385, baseType: !5, size: 32, elements: !86)
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104}
!87 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!103 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!104 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 451, baseType: !45, size: 32, elements: !107)
!106 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!107 = !{!108, !109, !110, !111, !112}
!108 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!109 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!110 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!111 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!112 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!113 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 517, baseType: !45, size: 32, elements: !114)
!114 = !{!115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135}
!115 = !DIEnumerator(name: "KSP_CONVERGED_RTOL_NORMAL", value: 1)
!116 = !DIEnumerator(name: "KSP_CONVERGED_ATOL_NORMAL", value: 9)
!117 = !DIEnumerator(name: "KSP_CONVERGED_RTOL", value: 2)
!118 = !DIEnumerator(name: "KSP_CONVERGED_ATOL", value: 3)
!119 = !DIEnumerator(name: "KSP_CONVERGED_ITS", value: 4)
!120 = !DIEnumerator(name: "KSP_CONVERGED_CG_NEG_CURVE", value: 5)
!121 = !DIEnumerator(name: "KSP_CONVERGED_CG_CONSTRAINED", value: 6)
!122 = !DIEnumerator(name: "KSP_CONVERGED_STEP_LENGTH", value: 7)
!123 = !DIEnumerator(name: "KSP_CONVERGED_HAPPY_BREAKDOWN", value: 8)
!124 = !DIEnumerator(name: "KSP_DIVERGED_NULL", value: -2)
!125 = !DIEnumerator(name: "KSP_DIVERGED_ITS", value: -3)
!126 = !DIEnumerator(name: "KSP_DIVERGED_DTOL", value: -4)
!127 = !DIEnumerator(name: "KSP_DIVERGED_BREAKDOWN", value: -5)
!128 = !DIEnumerator(name: "KSP_DIVERGED_BREAKDOWN_BICG", value: -6)
!129 = !DIEnumerator(name: "KSP_DIVERGED_NONSYMMETRIC", value: -7)
!130 = !DIEnumerator(name: "KSP_DIVERGED_INDEFINITE_PC", value: -8)
!131 = !DIEnumerator(name: "KSP_DIVERGED_NANORINF", value: -9)
!132 = !DIEnumerator(name: "KSP_DIVERGED_INDEFINITE_MAT", value: -10)
!133 = !DIEnumerator(name: "KSP_DIVERGED_PC_FAILED", value: -11)
!134 = !DIEnumerator(name: "KSP_DIVERGED_PCSETUP_FAILED", value: -11)
!135 = !DIEnumerator(name: "KSP_CONVERGED_ITERATING", value: 0)
!136 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 279, baseType: !5, size: 32, elements: !137)
!137 = !{!138, !139}
!138 = !DIEnumerator(name: "PC_MG_CYCLE_V", value: 1, isUnsigned: true)
!139 = !DIEnumerator(name: "PC_MG_CYCLE_W", value: 2, isUnsigned: true)
!140 = !{!141, !145, !146, !149, !261, !316, !536, !539, !326, !45, !5}
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !142, line: 330, baseType: !143)
!142 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !142, line: 330, flags: DIFlagFwdDecl)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_MG", file: !151, line: 79, baseType: !152)
!151 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcmgimpl.h", directory: "/home/users/ndemeye/xSDK")
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !151, line: 53, size: 2240, elements: !153)
!153 = !{!154, !156, !158, !159, !161, !163, !164, !166, !167, !168, !169, !170, !171, !225, !226, !227, !230, !231, !232, !233, !234, !236, !531, !535}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "am", scope: !152, file: !151, line: 54, baseType: !155, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCMGType", file: !44, line: 264, baseType: !66)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "cyclesperpcapply", scope: !152, file: !151, line: 55, baseType: !157, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !24, line: 102, baseType: !45)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "maxlevels", scope: !152, file: !151, line: 56, baseType: !157, size: 32, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "galerkin", scope: !152, file: !151, line: 57, baseType: !160, size: 32, offset: 96)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCMGGalerkinType", file: !44, line: 297, baseType: !72)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "usedmfornumberoflevels", scope: !152, file: !151, line: 58, baseType: !162, size: 32, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !24, line: 170, baseType: !23)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "adaptInterpolation", scope: !152, file: !151, line: 60, baseType: !162, size: 32, offset: 160)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "coarseSpaceType", scope: !152, file: !151, line: 61, baseType: !165, size: 32, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCMGCoarseSpaceType", file: !44, line: 330, baseType: !79)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !152, file: !151, line: 62, baseType: !157, size: 32, offset: 224)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "eigenvalue", scope: !152, file: !151, line: 63, baseType: !157, size: 32, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "mespMonitor", scope: !152, file: !151, line: 64, baseType: !162, size: 32, offset: 288)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "compatibleRelaxation", scope: !152, file: !151, line: 66, baseType: !162, size: 32, offset: 320)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nlevels", scope: !152, file: !151, line: 68, baseType: !157, size: 32, offset: 352)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !152, file: !151, line: 69, baseType: !172, size: 64, offset: 384)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_MG_Levels", file: !151, line: 48, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !151, line: 14, size: 1600, elements: !176)
!176 = !{!177, !178, !179, !180, !185, !186, !187, !191, !192, !193, !195, !200, !201, !205, !206, !207, !211, !212, !213, !214, !215, !216, !217, !218, !219, !222, !223, !224}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "cycles", scope: !175, file: !151, line: 15, baseType: !157, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !175, file: !151, line: 16, baseType: !157, size: 32, offset: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !175, file: !151, line: 17, baseType: !157, size: 32, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !175, file: !151, line: 18, baseType: !181, size: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !182, line: 21, baseType: !183)
!182 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !182, line: 21, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !175, file: !151, line: 19, baseType: !181, size: 64, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !175, file: !151, line: 20, baseType: !181, size: 64, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !175, file: !151, line: 21, baseType: !188, size: 64, offset: 320)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !11, line: 16, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !11, line: 16, flags: DIFlagFwdDecl)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !175, file: !151, line: 22, baseType: !188, size: 64, offset: 384)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "R", scope: !175, file: !151, line: 23, baseType: !188, size: 64, offset: 448)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "coarseSpace", scope: !175, file: !151, line: 24, baseType: !194, size: 64, offset: 512)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !175, file: !151, line: 29, baseType: !196, size: 64, offset: 576)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!199, !188, !181, !181, !181}
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !24, line: 14, baseType: !45)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "residualtranspose", scope: !175, file: !151, line: 30, baseType: !196, size: 64, offset: 640)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "matresidual", scope: !175, file: !151, line: 31, baseType: !202, size: 64, offset: 704)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!199, !188, !188, !188, !188}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "matresidualtranspose", scope: !175, file: !151, line: 32, baseType: !202, size: 64, offset: 768)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !175, file: !151, line: 34, baseType: !188, size: 64, offset: 832)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "smoothd", scope: !175, file: !151, line: 35, baseType: !208, size: 64, offset: 896)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !106, line: 22, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !106, line: 22, flags: DIFlagFwdDecl)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "smoothu", scope: !175, file: !151, line: 36, baseType: !208, size: 64, offset: 960)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "cr", scope: !175, file: !151, line: 37, baseType: !208, size: 64, offset: 1024)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "crx", scope: !175, file: !151, line: 38, baseType: !181, size: 64, offset: 1088)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "crb", scope: !175, file: !151, line: 39, baseType: !181, size: 64, offset: 1152)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !175, file: !151, line: 40, baseType: !188, size: 64, offset: 1216)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "restrct", scope: !175, file: !151, line: 41, baseType: !188, size: 64, offset: 1280)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "inject", scope: !175, file: !151, line: 42, baseType: !188, size: 64, offset: 1344)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "rscale", scope: !175, file: !151, line: 43, baseType: !181, size: 64, offset: 1408)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "eventsmoothsetup", scope: !175, file: !151, line: 44, baseType: !220, size: 32, offset: 1472)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogEvent", file: !221, line: 80, baseType: !45)
!221 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsclog.h", directory: "/home/users/ndemeye/xSDK")
!222 = !DIDerivedType(tag: DW_TAG_member, name: "eventsmoothsolve", scope: !175, file: !151, line: 45, baseType: !220, size: 32, offset: 1504)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "eventresidual", scope: !175, file: !151, line: 46, baseType: !220, size: 32, offset: 1536)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "eventinterprestrict", scope: !175, file: !151, line: 47, baseType: !220, size: 32, offset: 1568)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "default_smoothu", scope: !152, file: !151, line: 70, baseType: !157, size: 32, offset: 448)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "default_smoothd", scope: !152, file: !151, line: 71, baseType: !157, size: 32, offset: 480)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !152, file: !151, line: 72, baseType: !228, size: 64, offset: 512)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !24, line: 189, baseType: !229)
!229 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !152, file: !151, line: 72, baseType: !228, size: 64, offset: 576)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "dtol", scope: !152, file: !151, line: 72, baseType: !228, size: 64, offset: 640)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !152, file: !151, line: 72, baseType: !228, size: 64, offset: 704)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "innerctx", scope: !152, file: !151, line: 74, baseType: !145, size: 64, offset: 768)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "stageApply", scope: !152, file: !151, line: 75, baseType: !235, size: 32, offset: 832)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogStage", file: !221, line: 89, baseType: !45)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !152, file: !151, line: 76, baseType: !237, size: 64, offset: 896)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!199, !240, !268}
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !44, line: 11, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !243, line: 37, size: 6720, elements: !244)
!243 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcimpl.h", directory: "/home/users/ndemeye/xSDK")
!244 = !{!245, !442, !495, !500, !501, !502, !503, !504, !506, !507, !508, !509, !510, !511, !512, !513, !514, !524, !525, !526, !527, !528, !530}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !242, file: !243, line: 38, baseType: !246, size: 4480)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !247, line: 122, baseType: !248)
!247 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !247, line: 73, size: 4480, elements: !249)
!249 = !{!250, !252, !299, !300, !301, !303, !304, !305, !306, !314, !315, !317, !321, !325, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !338, !339, !340, !342, !343, !345, !347, !348, !349, !350, !351, !353, !355, !356, !357, !358, !359, !362, !364, !365, !366, !376, !378, !379, !383, !384, !432, !437, !439, !440, !441}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !248, file: !247, line: 74, baseType: !251, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !24, line: 32, baseType: !45)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !248, file: !247, line: 75, baseType: !253, size: 448, offset: 64)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 448, elements: !297)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !247, line: 53, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !247, line: 45, size: 448, elements: !256)
!256 = !{!257, !264, !272, !277, !281, !285, !292}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !255, file: !247, line: 46, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{!199, !261, !263}
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !24, line: 430, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !255, file: !247, line: 47, baseType: !265, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!199, !261, !268}
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !269, line: 16, baseType: !270)
!269 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !269, line: 16, flags: DIFlagFwdDecl)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !255, file: !247, line: 48, baseType: !273, size: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!199, !276}
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !255, file: !247, line: 49, baseType: !278, size: 64, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!199, !261, !146, !261}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !255, file: !247, line: 50, baseType: !282, size: 64, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!199, !261, !146, !276}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !255, file: !247, line: 51, baseType: !286, size: 64, offset: 320)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!199, !261, !146, !289}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{null}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !255, file: !247, line: 52, baseType: !293, size: 64, offset: 384)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!199, !261, !146, !296}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!297 = !{!298}
!298 = !DISubrange(count: 1)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !248, file: !247, line: 76, baseType: !141, size: 64, offset: 512)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !248, file: !247, line: 77, baseType: !157, size: 32, offset: 576)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !248, file: !247, line: 78, baseType: !302, size: 64, offset: 640)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !24, line: 360, baseType: !229)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !248, file: !247, line: 78, baseType: !302, size: 64, offset: 704)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !248, file: !247, line: 78, baseType: !302, size: 64, offset: 768)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !248, file: !247, line: 78, baseType: !302, size: 64, offset: 832)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !248, file: !247, line: 79, baseType: !307, size: 64, offset: 896)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !24, line: 442, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !24, line: 90, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !310, line: 27, baseType: !311)
!310 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !312, line: 43, baseType: !313)
!312 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!313 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !248, file: !247, line: 80, baseType: !157, size: 32, offset: 960)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !248, file: !247, line: 81, baseType: !316, size: 32, offset: 992)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !24, line: 49, baseType: !45)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !248, file: !247, line: 82, baseType: !318, size: 64, offset: 1024)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !24, line: 465, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !24, line: 465, flags: DIFlagFwdDecl)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !248, file: !247, line: 83, baseType: !322, size: 64, offset: 1088)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !24, line: 496, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !24, line: 496, flags: DIFlagFwdDecl)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !248, file: !247, line: 84, baseType: !326, size: 64, offset: 1152)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !248, file: !247, line: 85, baseType: !326, size: 64, offset: 1216)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !248, file: !247, line: 86, baseType: !326, size: 64, offset: 1280)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !248, file: !247, line: 87, baseType: !326, size: 64, offset: 1344)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !248, file: !247, line: 88, baseType: !261, size: 64, offset: 1408)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !248, file: !247, line: 89, baseType: !307, size: 64, offset: 1472)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !248, file: !247, line: 90, baseType: !326, size: 64, offset: 1536)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !248, file: !247, line: 91, baseType: !326, size: 64, offset: 1600)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !248, file: !247, line: 92, baseType: !157, size: 32, offset: 1664)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !248, file: !247, line: 93, baseType: !145, size: 64, offset: 1728)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !248, file: !247, line: 94, baseType: !337, size: 64, offset: 1792)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !24, line: 455, baseType: !308)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !248, file: !247, line: 95, baseType: !157, size: 32, offset: 1856)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !248, file: !247, line: 95, baseType: !157, size: 32, offset: 1888)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !248, file: !247, line: 96, baseType: !341, size: 64, offset: 1920)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !248, file: !247, line: 96, baseType: !341, size: 64, offset: 1984)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !248, file: !247, line: 97, baseType: !344, size: 64, offset: 2048)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !248, file: !247, line: 97, baseType: !346, size: 64, offset: 2112)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !248, file: !247, line: 98, baseType: !157, size: 32, offset: 2176)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !248, file: !247, line: 98, baseType: !157, size: 32, offset: 2208)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !248, file: !247, line: 99, baseType: !341, size: 64, offset: 2240)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !248, file: !247, line: 99, baseType: !341, size: 64, offset: 2304)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !248, file: !247, line: 100, baseType: !352, size: 64, offset: 2368)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !248, file: !247, line: 100, baseType: !354, size: 64, offset: 2432)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !248, file: !247, line: 101, baseType: !157, size: 32, offset: 2496)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !248, file: !247, line: 101, baseType: !157, size: 32, offset: 2528)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !248, file: !247, line: 102, baseType: !341, size: 64, offset: 2560)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !248, file: !247, line: 102, baseType: !341, size: 64, offset: 2624)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !248, file: !247, line: 103, baseType: !360, size: 64, offset: 2688)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !24, line: 305, baseType: !228)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !248, file: !247, line: 103, baseType: !363, size: 64, offset: 2752)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !248, file: !247, line: 104, baseType: !296, size: 64, offset: 2816)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !248, file: !247, line: 105, baseType: !157, size: 32, offset: 2880)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !248, file: !247, line: 106, baseType: !367, size: 128, offset: 2944)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 128, elements: !374)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !247, line: 64, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !247, line: 61, size: 128, elements: !371)
!371 = !{!372, !373}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !370, file: !247, line: 62, baseType: !289, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !370, file: !247, line: 63, baseType: !145, size: 64, offset: 64)
!374 = !{!375}
!375 = !DISubrange(count: 2)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !248, file: !247, line: 107, baseType: !377, size: 64, offset: 3072)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 64, elements: !374)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !248, file: !247, line: 108, baseType: !145, size: 64, offset: 3136)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !248, file: !247, line: 109, baseType: !380, size: 64, offset: 3200)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!199, !145}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !248, file: !247, line: 111, baseType: !157, size: 32, offset: 3264)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !248, file: !247, line: 112, baseType: !385, size: 320, offset: 3328)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 320, elements: !430)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!199, !389, !261, !145}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !29, line: 108, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !29, line: 99, size: 640, elements: !392)
!392 = !{!393, !394, !418, !419, !420, !421, !422, !423, !424, !425, !426}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !391, file: !29, line: 100, baseType: !157, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !391, file: !29, line: 101, baseType: !395, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !29, line: 82, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !29, line: 83, size: 768, elements: !398)
!398 = !{!399, !400, !401, !402, !403, !406, !407, !408, !412, !413, !415, !416, !417}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !397, file: !29, line: 84, baseType: !326, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !397, file: !29, line: 85, baseType: !326, size: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !397, file: !29, line: 86, baseType: !145, size: 64, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !397, file: !29, line: 87, baseType: !318, size: 64, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !397, file: !29, line: 88, baseType: !404, size: 64, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !397, file: !29, line: 89, baseType: !148, size: 8, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !397, file: !29, line: 90, baseType: !326, size: 64, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !397, file: !29, line: 91, baseType: !409, size: 64, offset: 448)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !410, line: 46, baseType: !411)
!410 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!411 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !397, file: !29, line: 92, baseType: !162, size: 32, offset: 512)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !397, file: !29, line: 93, baseType: !414, size: 32, offset: 544)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !29, line: 81, baseType: !28)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !397, file: !29, line: 94, baseType: !395, size: 64, offset: 576)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !397, file: !29, line: 95, baseType: !326, size: 64, offset: 640)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !397, file: !29, line: 96, baseType: !145, size: 64, offset: 704)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !391, file: !29, line: 102, baseType: !326, size: 64, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !391, file: !29, line: 102, baseType: !326, size: 64, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !391, file: !29, line: 103, baseType: !326, size: 64, offset: 256)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !391, file: !29, line: 104, baseType: !141, size: 64, offset: 320)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !391, file: !29, line: 105, baseType: !162, size: 32, offset: 384)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !391, file: !29, line: 105, baseType: !162, size: 32, offset: 416)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !391, file: !29, line: 105, baseType: !162, size: 32, offset: 448)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !391, file: !29, line: 106, baseType: !261, size: 64, offset: 512)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !391, file: !29, line: 107, baseType: !427, size: 64, offset: 576)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !29, line: 10, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !29, line: 10, flags: DIFlagFwdDecl)
!430 = !{!431}
!431 = !DISubrange(count: 5)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !248, file: !247, line: 113, baseType: !433, size: 320, offset: 3648)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 320, elements: !430)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{!199, !261, !145}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !248, file: !247, line: 114, baseType: !438, size: 320, offset: 3968)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 320, elements: !430)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !248, file: !247, line: 115, baseType: !162, size: 32, offset: 4288)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !248, file: !247, line: 120, baseType: !427, size: 64, offset: 4352)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !248, file: !247, line: 121, baseType: !162, size: 32, offset: 4416)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !242, file: !243, line: 38, baseType: !443, size: 1152, offset: 4480)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 1152, elements: !297)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PCOps", file: !243, line: 13, size: 1152, elements: !445)
!445 = !{!446, !450, !454, !458, !464, !469, !470, !474, !478, !482, !483, !488, !489, !490, !491, !492, !493, !494}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !444, file: !243, line: 14, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!199, !240}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !444, file: !243, line: 15, baseType: !451, size: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!199, !240, !181, !181}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "matapply", scope: !444, file: !243, line: 16, baseType: !455, size: 64, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!199, !240, !188, !188}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "applyrichardson", scope: !444, file: !243, line: 17, baseType: !459, size: 64, offset: 192)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!199, !240, !181, !181, !181, !228, !228, !228, !157, !162, !344, !462}
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCRichardsonConvergedReason", file: !44, line: 102, baseType: !43)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "applyBA", scope: !444, file: !243, line: 18, baseType: !465, size: 64, offset: 256)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!199, !240, !468, !181, !181, !181}
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !44, line: 85, baseType: !51)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "applytranspose", scope: !444, file: !243, line: 19, baseType: !451, size: 64, offset: 320)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "applyBAtranspose", scope: !444, file: !243, line: 20, baseType: !471, size: 64, offset: 384)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!199, !240, !157, !181, !181, !181}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !444, file: !243, line: 21, baseType: !475, size: 64, offset: 448)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!199, !389, !240}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !444, file: !243, line: 22, baseType: !479, size: 64, offset: 512)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!199, !240, !208, !181, !181}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !444, file: !243, line: 23, baseType: !479, size: 64, offset: 576)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "getfactoredmatrix", scope: !444, file: !243, line: 24, baseType: !484, size: 64, offset: 640)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!199, !240, !487}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricleft", scope: !444, file: !243, line: 25, baseType: !451, size: 64, offset: 704)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricright", scope: !444, file: !243, line: 26, baseType: !451, size: 64, offset: 768)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "setuponblocks", scope: !444, file: !243, line: 27, baseType: !447, size: 64, offset: 832)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !444, file: !243, line: 28, baseType: !447, size: 64, offset: 896)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !444, file: !243, line: 29, baseType: !237, size: 64, offset: 960)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !444, file: !243, line: 30, baseType: !447, size: 64, offset: 1024)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !444, file: !243, line: 31, baseType: !237, size: 64, offset: 1088)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !242, file: !243, line: 39, baseType: !496, size: 64, offset: 5632)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !497, line: 14, baseType: !498)
!497 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !497, line: 14, flags: DIFlagFwdDecl)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !242, file: !243, line: 40, baseType: !157, size: 32, offset: 5696)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "matstate", scope: !242, file: !243, line: 41, baseType: !337, size: 64, offset: 5760)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "matnonzerostate", scope: !242, file: !243, line: 41, baseType: !337, size: 64, offset: 5824)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "reusepreconditioner", scope: !242, file: !243, line: 42, baseType: !162, size: 32, offset: 5888)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !242, file: !243, line: 43, baseType: !505, size: 32, offset: 5920)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !11, line: 285, baseType: !17)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !242, file: !243, line: 45, baseType: !157, size: 32, offset: 5952)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "erroriffailure", scope: !242, file: !243, line: 46, baseType: !162, size: 32, offset: 5984)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !242, file: !243, line: 47, baseType: !188, size: 64, offset: 6016)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "pmat", scope: !242, file: !243, line: 47, baseType: !188, size: 64, offset: 6080)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleright", scope: !242, file: !243, line: 48, baseType: !181, size: 64, offset: 6144)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleleft", scope: !242, file: !243, line: 48, baseType: !181, size: 64, offset: 6208)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !242, file: !243, line: 49, baseType: !162, size: 32, offset: 6272)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "useAmat", scope: !242, file: !243, line: 50, baseType: !162, size: 32, offset: 6304)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatrices", scope: !242, file: !243, line: 51, baseType: !515, size: 64, offset: 6336)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{!199, !240, !157, !518, !518, !487, !145}
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !520)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !521, line: 11, baseType: !522)
!521 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !521, line: 11, flags: DIFlagFwdDecl)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatricesP", scope: !242, file: !243, line: 52, baseType: !145, size: 64, offset: 6400)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !242, file: !243, line: 53, baseType: !145, size: 64, offset: 6464)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "presolvedone", scope: !242, file: !243, line: 54, baseType: !157, size: 32, offset: 6528)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !242, file: !243, line: 55, baseType: !145, size: 64, offset: 6592)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "failedreason", scope: !242, file: !243, line: 56, baseType: !529, size: 32, offset: 6656)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !44, line: 395, baseType: !57)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "failedreasonrank", scope: !242, file: !243, line: 57, baseType: !529, size: 32, offset: 6688)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "min_eigen_DinvA", scope: !152, file: !151, line: 77, baseType: !532, size: 640, offset: 960)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 640, elements: !533)
!533 = !{!534}
!534 = !DISubrange(count: 10)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "max_eigen_DinvA", scope: !152, file: !151, line: 78, baseType: !532, size: 640, offset: 1600)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !142, line: 331, baseType: !537)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !142, line: 331, flags: DIFlagFwdDecl)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !142, line: 338, baseType: !540)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !142, line: 338, flags: DIFlagFwdDecl)
!542 = !{i32 7, !"Dwarf Version", i32 4}
!543 = !{i32 2, !"Debug Info Version", i32 3}
!544 = !{i32 1, !"wchar_size", i32 4}
!545 = !{i32 7, !"PIC Level", i32 2}
!546 = !{i32 7, !"uwtable", i32 1}
!547 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!548 = distinct !DISubprogram(name: "PCMGResidualDefault", scope: !549, file: !549, line: 22, type: !197, scopeLine: 23, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !550)
!549 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/mg/mgfunc.c", directory: "/home/users/ndemeye/xSDK")
!550 = !{!551, !552, !553, !554, !555, !556}
!551 = !DILocalVariable(name: "mat", arg: 1, scope: !548, file: !549, line: 22, type: !188)
!552 = !DILocalVariable(name: "b", arg: 2, scope: !548, file: !549, line: 22, type: !181)
!553 = !DILocalVariable(name: "x", arg: 3, scope: !548, file: !549, line: 22, type: !181)
!554 = !DILocalVariable(name: "r", arg: 4, scope: !548, file: !549, line: 22, type: !181)
!555 = !DILocalVariable(name: "ierr", scope: !548, file: !549, line: 24, type: !199)
!556 = !DILocalVariable(name: "ierr__", scope: !557, file: !549, line: 27, type: !199)
!557 = distinct !DILexicalBlock(scope: !548, file: !549, line: 27, column: 33)
!558 = !DILocation(line: 0, scope: !548)
!559 = !DILocation(line: 26, column: 3, scope: !560)
!560 = distinct !DILexicalBlock(scope: !561, file: !549, line: 26, column: 3)
!561 = distinct !DILexicalBlock(scope: !562, file: !549, line: 26, column: 3)
!562 = distinct !DILexicalBlock(scope: !548, file: !549, line: 26, column: 3)
!563 = !{!564, !564, i64 0}
!564 = !{!"any pointer", !565, i64 0}
!565 = !{!"omnipotent char", !566, i64 0}
!566 = !{!"Simple C/C++ TBAA"}
!567 = !DILocation(line: 26, column: 3, scope: !561)
!568 = !DILocation(line: 26, column: 3, scope: !569)
!569 = distinct !DILexicalBlock(scope: !570, file: !549, line: 26, column: 3)
!570 = distinct !DILexicalBlock(scope: !560, file: !549, line: 26, column: 3)
!571 = !{!572, !573, i64 1536}
!572 = !{!"", !565, i64 0, !565, i64 512, !565, i64 1024, !565, i64 1280, !573, i64 1536, !573, i64 1540, !565, i64 1544}
!573 = !{!"int", !565, i64 0}
!574 = !DILocation(line: 26, column: 3, scope: !570)
!575 = !DILocation(line: 26, column: 3, scope: !576)
!576 = distinct !DILexicalBlock(scope: !569, file: !549, line: 26, column: 3)
!577 = !{!573, !573, i64 0}
!578 = !{!572, !573, i64 1540}
!579 = !DILocation(line: 27, column: 10, scope: !548)
!580 = !DILocation(line: 0, scope: !557)
!581 = !DILocation(line: 27, column: 33, scope: !582)
!582 = distinct !DILexicalBlock(scope: !557, file: !549, line: 27, column: 33)
!583 = !DILocation(line: 27, column: 33, scope: !557)
!584 = !{!"branch_weights", i32 2000, i32 1}
!585 = !DILocation(line: 28, column: 3, scope: !586)
!586 = distinct !DILexicalBlock(scope: !587, file: !549, line: 28, column: 3)
!587 = distinct !DILexicalBlock(scope: !588, file: !549, line: 28, column: 3)
!588 = distinct !DILexicalBlock(scope: !548, file: !549, line: 28, column: 3)
!589 = !DILocation(line: 28, column: 3, scope: !587)
!590 = !DILocation(line: 28, column: 3, scope: !591)
