; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/tr/tr.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/tr/tr.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_datatype_t = type opaque
%struct._p_SNES = type { %struct._p_PetscObject, [1 x %struct._SNESOps], %struct._p_DM*, i32, %struct._p_SNES*, i32, i32, i8*, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Vec*, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Mat*, i8*, %struct._p_KSP*, %struct._p_LineSearch*, i32, i32, %struct._p_Vec*, %struct._p_Vec*, i8*, double, [5 x i32 (%struct._p_SNES*, i32, double, i8*)*], [5 x i32 (i8**)*], [5 x i8*], i32, i8*, i32, [5 x i32 (%struct._p_SNES*, i8*)*], [5 x i32 (i8**)*], [5 x i8*], i32, i32, i32, i8*, i32, i32, i32, i32, i32, double, double, double, double, double, double, double, double, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct._p_Vec**, i32, double*, i32*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, double, double, %struct._p_Vec**, i32, i32, i32, i32, double, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 }

!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 406, baseType: !26, size: 32, elements: !60)
!60 = !{!61, !62, !63, !64, !65, !66}
!61 = !DIEnumerator(name: "SNES_NORM_DEFAULT", value: -1)
!62 = !DIEnumerator(name: "SNES_NORM_NONE", value: 0)
!63 = !DIEnumerator(name: "SNES_NORM_ALWAYS", value: 1)
!64 = !DIEnumerator(name: "SNES_NORM_INITIAL_ONLY", value: 2)
!65 = !DIEnumerator(name: "SNES_NORM_FINAL_ONLY", value: 3)
!66 = !DIEnumerator(name: "SNES_NORM_INITIAL_FINAL_ONLY", value: 4)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 493, baseType: !26, size: 32, elements: !68)
!68 = !{!69, !70, !71}
!69 = !DIEnumerator(name: "SNES_FUNCTION_DEFAULT", value: -1)
!70 = !DIEnumerator(name: "SNES_FUNCTION_UNPRECONDITIONED", value: 0)
!71 = !DIEnumerator(name: "SNES_FUNCTION_PRECONDITIONED", value: 1)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !73, line: 663, baseType: !5, size: 32, elements: !74)
!73 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!74 = !{!75, !76, !77}
!75 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !79)
!79 = !{!80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97}
!80 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!98 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !99, line: 517, baseType: !26, size: 32, elements: !100)
!99 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!100 = !{!101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121}
!101 = !DIEnumerator(name: "KSP_CONVERGED_RTOL_NORMAL", value: 1)
!102 = !DIEnumerator(name: "KSP_CONVERGED_ATOL_NORMAL", value: 9)
!103 = !DIEnumerator(name: "KSP_CONVERGED_RTOL", value: 2)
!104 = !DIEnumerator(name: "KSP_CONVERGED_ATOL", value: 3)
!105 = !DIEnumerator(name: "KSP_CONVERGED_ITS", value: 4)
!106 = !DIEnumerator(name: "KSP_CONVERGED_CG_NEG_CURVE", value: 5)
!107 = !DIEnumerator(name: "KSP_CONVERGED_CG_CONSTRAINED", value: 6)
!108 = !DIEnumerator(name: "KSP_CONVERGED_STEP_LENGTH", value: 7)
!109 = !DIEnumerator(name: "KSP_CONVERGED_HAPPY_BREAKDOWN", value: 8)
!110 = !DIEnumerator(name: "KSP_DIVERGED_NULL", value: -2)
!111 = !DIEnumerator(name: "KSP_DIVERGED_ITS", value: -3)
!112 = !DIEnumerator(name: "KSP_DIVERGED_DTOL", value: -4)
!113 = !DIEnumerator(name: "KSP_DIVERGED_BREAKDOWN", value: -5)
!114 = !DIEnumerator(name: "KSP_DIVERGED_BREAKDOWN_BICG", value: -6)
!115 = !DIEnumerator(name: "KSP_DIVERGED_NONSYMMETRIC", value: -7)
!116 = !DIEnumerator(name: "KSP_DIVERGED_INDEFINITE_PC", value: -8)
!117 = !DIEnumerator(name: "KSP_DIVERGED_NANORINF", value: -9)
!118 = !DIEnumerator(name: "KSP_DIVERGED_INDEFINITE_MAT", value: -10)
!119 = !DIEnumerator(name: "KSP_DIVERGED_PC_FAILED", value: -11)
!120 = !DIEnumerator(name: "KSP_DIVERGED_PCSETUP_FAILED", value: -11)
!121 = !DIEnumerator(name: "KSP_CONVERGED_ITERATING", value: 0)
!122 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !123, line: 155, baseType: !5, size: 32, elements: !124)
!123 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!124 = !{!125, !126, !127, !128, !129}
!125 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!126 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!127 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!128 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!129 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!130 = !{!131, !179, !259, !176, !200, !333, !239, !554, !557, !249, !26, !138, !560, !5}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES_NEWTONTR", file: !133, line: 27, baseType: !134)
!133 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/snes/impls/tr/trimpl.h", directory: "/home/users/ndemeye/xSDK")
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !133, line: 11, size: 960, elements: !135)
!135 = !{!136, !139, !140, !141, !142, !143, !144, !145, !146, !148, !149, !150, !548, !549, !553}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !134, file: !133, line: 13, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !138)
!138 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "eta", scope: !134, file: !133, line: 14, baseType: !137, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !134, file: !133, line: 15, baseType: !137, size: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "delta0", scope: !134, file: !133, line: 16, baseType: !137, size: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "delta1", scope: !134, file: !133, line: 17, baseType: !137, size: 64, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "delta2", scope: !134, file: !133, line: 18, baseType: !137, size: 64, offset: 320)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "delta3", scope: !134, file: !133, line: 19, baseType: !137, size: 64, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "sigma", scope: !134, file: !133, line: 20, baseType: !137, size: 64, offset: 448)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "itflag", scope: !134, file: !133, line: 21, baseType: !147, size: 32, offset: 512)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !134, file: !133, line: 22, baseType: !137, size: 64, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !134, file: !133, line: 22, baseType: !137, size: 64, offset: 640)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "precheck", scope: !134, file: !133, line: 23, baseType: !151, size: 64, offset: 704)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!154, !155, !374, !374, !547, !259}
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !25, line: 18, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !158, line: 38, size: 11648, elements: !159)
!158 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/snesimpl.h", directory: "/home/users/ndemeye/xSDK")
!159 = !{!160, !366, !432, !437, !438, !439, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !454, !458, !459, !461, !462, !463, !464, !465, !470, !472, !473, !474, !475, !476, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !512, !514, !515, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !157, file: !158, line: 39, baseType: !161, size: 4480)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !162, line: 122, baseType: !163)
!162 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !162, line: 73, size: 4480, elements: !164)
!164 = !{!165, !167, !221, !222, !224, !226, !227, !228, !229, !237, !238, !240, !244, !248, !250, !251, !252, !253, !254, !255, !256, !257, !258, !260, !262, !263, !264, !266, !267, !269, !271, !272, !273, !274, !275, !277, !279, !280, !281, !282, !283, !286, !288, !289, !290, !300, !302, !303, !307, !308, !356, !361, !363, !364, !365}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !163, file: !162, line: 74, baseType: !166, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !163, file: !162, line: 75, baseType: !168, size: 448, offset: 64)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 448, elements: !219)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !162, line: 53, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !162, line: 45, size: 448, elements: !171)
!171 = !{!172, !183, !191, !196, !203, !207, !214}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !170, file: !162, line: 46, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!154, !176, !178}
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !180, line: 330, baseType: !181)
!180 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !180, line: 330, flags: DIFlagFwdDecl)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !170, file: !162, line: 47, baseType: !184, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!154, !176, !187}
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !188, line: 16, baseType: !189)
!188 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !188, line: 16, flags: DIFlagFwdDecl)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !170, file: !162, line: 48, baseType: !192, size: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!154, !195}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !170, file: !162, line: 49, baseType: !197, size: 64, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!154, !176, !200, !176}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !170, file: !162, line: 50, baseType: !204, size: 64, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!154, !176, !200, !195}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !170, file: !162, line: 51, baseType: !208, size: 64, offset: 320)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!154, !176, !200, !211}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{null}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !170, file: !162, line: 52, baseType: !215, size: 64, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!154, !176, !200, !218}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!219 = !{!220}
!220 = !DISubrange(count: 1)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !163, file: !162, line: 76, baseType: !179, size: 64, offset: 512)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !163, file: !162, line: 77, baseType: !223, size: 32, offset: 576)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !163, file: !162, line: 78, baseType: !225, size: 64, offset: 640)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !138)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !163, file: !162, line: 78, baseType: !225, size: 64, offset: 704)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !163, file: !162, line: 78, baseType: !225, size: 64, offset: 768)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !163, file: !162, line: 78, baseType: !225, size: 64, offset: 832)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !163, file: !162, line: 79, baseType: !230, size: 64, offset: 896)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !233, line: 27, baseType: !234)
!233 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !235, line: 43, baseType: !236)
!235 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!236 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !163, file: !162, line: 80, baseType: !223, size: 32, offset: 960)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !163, file: !162, line: 81, baseType: !239, size: 32, offset: 992)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !163, file: !162, line: 82, baseType: !241, size: 64, offset: 1024)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !163, file: !162, line: 83, baseType: !245, size: 64, offset: 1088)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !163, file: !162, line: 84, baseType: !249, size: 64, offset: 1152)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !163, file: !162, line: 85, baseType: !249, size: 64, offset: 1216)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !163, file: !162, line: 86, baseType: !249, size: 64, offset: 1280)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !163, file: !162, line: 87, baseType: !249, size: 64, offset: 1344)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !163, file: !162, line: 88, baseType: !176, size: 64, offset: 1408)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !163, file: !162, line: 89, baseType: !230, size: 64, offset: 1472)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !163, file: !162, line: 90, baseType: !249, size: 64, offset: 1536)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !163, file: !162, line: 91, baseType: !249, size: 64, offset: 1600)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !163, file: !162, line: 92, baseType: !223, size: 32, offset: 1664)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !163, file: !162, line: 93, baseType: !259, size: 64, offset: 1728)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !163, file: !162, line: 94, baseType: !261, size: 64, offset: 1792)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !231)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !163, file: !162, line: 95, baseType: !223, size: 32, offset: 1856)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !163, file: !162, line: 95, baseType: !223, size: 32, offset: 1888)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !163, file: !162, line: 96, baseType: !265, size: 64, offset: 1920)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !163, file: !162, line: 96, baseType: !265, size: 64, offset: 1984)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !163, file: !162, line: 97, baseType: !268, size: 64, offset: 2048)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !163, file: !162, line: 97, baseType: !270, size: 64, offset: 2112)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !163, file: !162, line: 98, baseType: !223, size: 32, offset: 2176)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !163, file: !162, line: 98, baseType: !223, size: 32, offset: 2208)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !163, file: !162, line: 99, baseType: !265, size: 64, offset: 2240)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !163, file: !162, line: 99, baseType: !265, size: 64, offset: 2304)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !163, file: !162, line: 100, baseType: !276, size: 64, offset: 2368)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !163, file: !162, line: 100, baseType: !278, size: 64, offset: 2432)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !163, file: !162, line: 101, baseType: !223, size: 32, offset: 2496)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !163, file: !162, line: 101, baseType: !223, size: 32, offset: 2528)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !163, file: !162, line: 102, baseType: !265, size: 64, offset: 2560)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !163, file: !162, line: 102, baseType: !265, size: 64, offset: 2624)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !163, file: !162, line: 103, baseType: !284, size: 64, offset: 2688)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !137)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !163, file: !162, line: 103, baseType: !287, size: 64, offset: 2752)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !163, file: !162, line: 104, baseType: !218, size: 64, offset: 2816)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !163, file: !162, line: 105, baseType: !223, size: 32, offset: 2880)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !163, file: !162, line: 106, baseType: !291, size: 128, offset: 2944)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 128, elements: !298)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !162, line: 64, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !162, line: 61, size: 128, elements: !295)
!295 = !{!296, !297}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !294, file: !162, line: 62, baseType: !211, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !294, file: !162, line: 63, baseType: !259, size: 64, offset: 64)
!298 = !{!299}
!299 = !DISubrange(count: 2)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !163, file: !162, line: 107, baseType: !301, size: 64, offset: 3072)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 64, elements: !298)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !163, file: !162, line: 108, baseType: !259, size: 64, offset: 3136)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !163, file: !162, line: 109, baseType: !304, size: 64, offset: 3200)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!154, !259}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !163, file: !162, line: 111, baseType: !223, size: 32, offset: 3264)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !163, file: !162, line: 112, baseType: !309, size: 320, offset: 3328)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 320, elements: !354)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!154, !313, !176, !259}
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !316)
!316 = !{!317, !318, !342, !343, !344, !345, !346, !347, !348, !349, !350}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !315, file: !10, line: 100, baseType: !223, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !315, file: !10, line: 101, baseType: !319, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !322)
!322 = !{!323, !324, !325, !326, !327, !330, !331, !332, !336, !337, !339, !340, !341}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !321, file: !10, line: 84, baseType: !249, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !321, file: !10, line: 85, baseType: !249, size: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !321, file: !10, line: 86, baseType: !259, size: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !321, file: !10, line: 87, baseType: !241, size: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !321, file: !10, line: 88, baseType: !328, size: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !200)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !321, file: !10, line: 89, baseType: !202, size: 8, offset: 320)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !321, file: !10, line: 90, baseType: !249, size: 64, offset: 384)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !321, file: !10, line: 91, baseType: !333, size: 64, offset: 448)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !334, line: 46, baseType: !335)
!334 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!335 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !321, file: !10, line: 92, baseType: !147, size: 32, offset: 512)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !321, file: !10, line: 93, baseType: !338, size: 32, offset: 544)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !321, file: !10, line: 94, baseType: !319, size: 64, offset: 576)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !321, file: !10, line: 95, baseType: !249, size: 64, offset: 640)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !321, file: !10, line: 96, baseType: !259, size: 64, offset: 704)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !315, file: !10, line: 102, baseType: !249, size: 64, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !315, file: !10, line: 102, baseType: !249, size: 64, offset: 192)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !315, file: !10, line: 103, baseType: !249, size: 64, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !315, file: !10, line: 104, baseType: !179, size: 64, offset: 320)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !315, file: !10, line: 105, baseType: !147, size: 32, offset: 384)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !315, file: !10, line: 105, baseType: !147, size: 32, offset: 416)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !315, file: !10, line: 105, baseType: !147, size: 32, offset: 448)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !315, file: !10, line: 106, baseType: !176, size: 64, offset: 512)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !315, file: !10, line: 107, baseType: !351, size: 64, offset: 576)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!354 = !{!355}
!355 = !DISubrange(count: 5)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !163, file: !162, line: 113, baseType: !357, size: 320, offset: 3648)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !358, size: 320, elements: !354)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!154, !176, !259}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !163, file: !162, line: 114, baseType: !362, size: 320, offset: 3968)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 320, elements: !354)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !163, file: !162, line: 115, baseType: !147, size: 32, offset: 4288)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !163, file: !162, line: 120, baseType: !351, size: 64, offset: 4352)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !163, file: !162, line: 121, baseType: !147, size: 32, offset: 4416)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !157, file: !158, line: 39, baseType: !367, size: 1088, offset: 4480)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 1088, elements: !219)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SNESOps", file: !158, line: 12, size: 1088, elements: !369)
!369 = !{!370, !377, !381, !385, !391, !392, !396, !397, !401, !405, !406, !407, !412, !416, !420, !424, !431}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "computeinitialguess", scope: !368, file: !158, line: 13, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!154, !155, !374, !259}
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !123, line: 21, baseType: !375)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !123, line: 21, flags: DIFlagFwdDecl)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "computescaling", scope: !368, file: !158, line: 14, baseType: !378, size: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!154, !374, !374, !259}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !368, file: !158, line: 15, baseType: !382, size: 64, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!154, !155, !223}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !368, file: !158, line: 16, baseType: !386, size: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!154, !155, !223, !137, !137, !137, !389, !259}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESConvergedReason", file: !25, line: 257, baseType: !24)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !368, file: !158, line: 17, baseType: !304, size: 64, offset: 256)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !368, file: !158, line: 18, baseType: !393, size: 64, offset: 320)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!154, !155}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !368, file: !158, line: 19, baseType: !393, size: 64, offset: 384)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !368, file: !158, line: 20, baseType: !398, size: 64, offset: 448)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!154, !155, !187}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !368, file: !158, line: 21, baseType: !402, size: 64, offset: 512)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!154, !313, !155}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !368, file: !158, line: 22, baseType: !393, size: 64, offset: 576)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !368, file: !158, line: 23, baseType: !393, size: 64, offset: 640)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "usercompute", scope: !368, file: !158, line: 24, baseType: !408, size: 64, offset: 704)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!154, !155, !411}
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "userdestroy", scope: !368, file: !158, line: 25, baseType: !413, size: 64, offset: 768)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!154, !411}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !368, file: !158, line: 26, baseType: !417, size: 64, offset: 832)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!154, !155, !374, !374}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "computepfunction", scope: !368, file: !158, line: 27, baseType: !421, size: 64, offset: 896)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!154, !155, !374, !374, !259}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "computepjacobian", scope: !368, file: !158, line: 28, baseType: !425, size: 64, offset: 960)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!154, !155, !374, !428, !428, !259}
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !53, line: 16, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !53, line: 16, flags: DIFlagFwdDecl)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !368, file: !158, line: 29, baseType: !398, size: 64, offset: 1024)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !157, file: !158, line: 40, baseType: !433, size: 64, offset: 5568)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !434, line: 14, baseType: !435)
!434 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !434, line: 14, flags: DIFlagFwdDecl)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !157, file: !158, line: 41, baseType: !147, size: 32, offset: 5632)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "npc", scope: !157, file: !158, line: 42, baseType: !155, size: 64, offset: 5696)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "npcside", scope: !157, file: !158, line: 43, baseType: !440, size: 32, offset: 5760)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !46, line: 85, baseType: !45)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "usesnpc", scope: !157, file: !158, line: 44, baseType: !147, size: 32, offset: 5792)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !157, file: !158, line: 47, baseType: !259, size: 64, offset: 5824)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !157, file: !158, line: 49, baseType: !374, size: 64, offset: 5888)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !157, file: !158, line: 50, baseType: !374, size: 64, offset: 5952)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !157, file: !158, line: 52, baseType: !374, size: 64, offset: 6016)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !157, file: !158, line: 54, baseType: !428, size: 64, offset: 6080)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !157, file: !158, line: 55, baseType: !428, size: 64, offset: 6144)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "picard", scope: !157, file: !158, line: 56, baseType: !428, size: 64, offset: 6208)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "initialguessP", scope: !157, file: !158, line: 57, baseType: !259, size: 64, offset: 6272)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !157, file: !158, line: 58, baseType: !451, size: 64, offset: 6336)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !99, line: 22, baseType: !452)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !99, line: 22, flags: DIFlagFwdDecl)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !157, file: !158, line: 59, baseType: !455, size: 64, offset: 6400)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearch", file: !25, line: 526, baseType: !456)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_LineSearch", file: !25, line: 526, flags: DIFlagFwdDecl)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "usesksp", scope: !157, file: !158, line: 60, baseType: !147, size: 32, offset: 6464)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "matstruct", scope: !157, file: !158, line: 61, baseType: !460, size: 32, offset: 6496)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !53, line: 285, baseType: !52)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_update", scope: !157, file: !158, line: 63, baseType: !374, size: 64, offset: 6528)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "scaling", scope: !157, file: !158, line: 65, baseType: !374, size: 64, offset: 6592)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "scaP", scope: !157, file: !158, line: 66, baseType: !259, size: 64, offset: 6656)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !157, file: !158, line: 68, baseType: !137, size: 64, offset: 6720)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !157, file: !158, line: 74, baseType: !466, size: 320, offset: 6784)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 320, elements: !354)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!154, !155, !223, !137, !259}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !157, file: !158, line: 75, baseType: !471, size: 320, offset: 7104)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !413, size: 320, elements: !354)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !157, file: !158, line: 76, baseType: !362, size: 320, offset: 7424)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !157, file: !158, line: 77, baseType: !223, size: 32, offset: 7744)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !157, file: !158, line: 78, baseType: !259, size: 64, offset: 7808)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !157, file: !158, line: 79, baseType: !390, size: 32, offset: 7872)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !157, file: !158, line: 80, baseType: !477, size: 320, offset: 7936)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 320, elements: !354)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!154, !155, !259}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !157, file: !158, line: 81, baseType: !471, size: 320, offset: 8256)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !157, file: !158, line: 82, baseType: !362, size: 320, offset: 8576)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !157, file: !158, line: 83, baseType: !223, size: 32, offset: 8896)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !157, file: !158, line: 84, baseType: !147, size: 32, offset: 8928)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !157, file: !158, line: 88, baseType: !147, size: 32, offset: 8960)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !157, file: !158, line: 89, baseType: !259, size: 64, offset: 9024)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !157, file: !158, line: 93, baseType: !223, size: 32, offset: 9088)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !157, file: !158, line: 94, baseType: !223, size: 32, offset: 9120)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !157, file: !158, line: 95, baseType: !223, size: 32, offset: 9152)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !157, file: !158, line: 96, baseType: !223, size: 32, offset: 9184)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "linear_its", scope: !157, file: !158, line: 97, baseType: !223, size: 32, offset: 9216)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !157, file: !158, line: 98, baseType: !137, size: 64, offset: 9280)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !157, file: !158, line: 99, baseType: !137, size: 64, offset: 9344)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !157, file: !158, line: 100, baseType: !137, size: 64, offset: 9408)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !157, file: !158, line: 101, baseType: !137, size: 64, offset: 9472)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !157, file: !158, line: 102, baseType: !137, size: 64, offset: 9536)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !157, file: !158, line: 103, baseType: !137, size: 64, offset: 9600)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "stol", scope: !157, file: !158, line: 104, baseType: !137, size: 64, offset: 9664)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "deltatol", scope: !157, file: !158, line: 105, baseType: !137, size: 64, offset: 9728)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "forceiteration", scope: !157, file: !158, line: 106, baseType: !147, size: 32, offset: 9792)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "lagpreconditioner", scope: !157, file: !158, line: 107, baseType: !223, size: 32, offset: 9824)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "lagjacobian", scope: !157, file: !158, line: 108, baseType: !223, size: 32, offset: 9856)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "jac_iter", scope: !157, file: !158, line: 109, baseType: !223, size: 32, offset: 9888)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "lagjac_persist", scope: !157, file: !158, line: 110, baseType: !147, size: 32, offset: 9920)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "pre_iter", scope: !157, file: !158, line: 111, baseType: !223, size: 32, offset: 9952)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "lagpre_persist", scope: !157, file: !158, line: 112, baseType: !147, size: 32, offset: 9984)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "gridsequence", scope: !157, file: !158, line: 113, baseType: !223, size: 32, offset: 10016)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "tolerancesset", scope: !157, file: !158, line: 115, baseType: !147, size: 32, offset: 10048)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_init_set", scope: !157, file: !158, line: 117, baseType: !147, size: 32, offset: 10080)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "normschedule", scope: !157, file: !158, line: 119, baseType: !511, size: 32, offset: 10112)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESNormSchedule", file: !25, line: 411, baseType: !59)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !157, file: !158, line: 120, baseType: !513, size: 32, offset: 10144)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESFunctionType", file: !25, line: 495, baseType: !67)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !157, file: !158, line: 124, baseType: !223, size: 32, offset: 10176)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !157, file: !158, line: 125, baseType: !516, size: 64, offset: 10240)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !157, file: !158, line: 129, baseType: !223, size: 32, offset: 10304)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist", scope: !157, file: !158, line: 130, baseType: !276, size: 64, offset: 10368)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_its", scope: !157, file: !158, line: 132, baseType: !268, size: 64, offset: 10432)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_len", scope: !157, file: !158, line: 133, baseType: !223, size: 32, offset: 10496)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_max", scope: !157, file: !158, line: 134, baseType: !223, size: 32, offset: 10528)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_reset", scope: !157, file: !158, line: 135, baseType: !147, size: 32, offset: 10560)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_alloc", scope: !157, file: !158, line: 136, baseType: !147, size: 32, offset: 10592)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "counters_reset", scope: !157, file: !158, line: 137, baseType: !147, size: 32, offset: 10624)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "numFailures", scope: !157, file: !158, line: 140, baseType: !223, size: 32, offset: 10656)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "maxFailures", scope: !157, file: !158, line: 141, baseType: !223, size: 32, offset: 10688)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "numLinearSolveFailures", scope: !157, file: !158, line: 143, baseType: !223, size: 32, offset: 10720)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "maxLinearSolveFailures", scope: !157, file: !158, line: 144, baseType: !223, size: 32, offset: 10752)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "domainerror", scope: !157, file: !158, line: 146, baseType: !147, size: 32, offset: 10784)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "jacobiandomainerror", scope: !157, file: !158, line: 147, baseType: !147, size: 32, offset: 10816)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "checkjacdomainerror", scope: !157, file: !158, line: 148, baseType: !147, size: 32, offset: 10848)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_ewconv", scope: !157, file: !158, line: 150, baseType: !147, size: 32, offset: 10880)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "kspconvctx", scope: !157, file: !158, line: 151, baseType: !259, size: 64, offset: 10944)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !157, file: !158, line: 154, baseType: !137, size: 64, offset: 11008)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !157, file: !158, line: 155, baseType: !137, size: 64, offset: 11072)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "vwork", scope: !157, file: !158, line: 157, baseType: !516, size: 64, offset: 11136)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "nvwork", scope: !157, file: !158, line: 158, baseType: !223, size: 32, offset: 11200)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !157, file: !158, line: 160, baseType: !147, size: 32, offset: 11232)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "mf_operator", scope: !157, file: !158, line: 161, baseType: !147, size: 32, offset: 11264)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "mf_version", scope: !157, file: !158, line: 162, baseType: !223, size: 32, offset: 11296)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "vizerotolerance", scope: !157, file: !158, line: 164, baseType: !137, size: 64, offset: 11328)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "xl", scope: !157, file: !158, line: 165, baseType: !374, size: 64, offset: 11392)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "xu", scope: !157, file: !158, line: 165, baseType: !374, size: 64, offset: 11456)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ntruebounds", scope: !157, file: !158, line: 166, baseType: !223, size: 32, offset: 11520)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "usersetbounds", scope: !157, file: !158, line: 167, baseType: !147, size: 32, offset: 11552)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "alwayscomputesfinalresidual", scope: !157, file: !158, line: 169, baseType: !147, size: 32, offset: 11584)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "precheckctx", scope: !134, file: !133, line: 24, baseType: !259, size: 64, offset: 768)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "postcheck", scope: !134, file: !133, line: 25, baseType: !550, size: 64, offset: 832)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!154, !155, !374, !374, !374, !547, !547, !259}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "postcheckctx", scope: !134, file: !133, line: 26, baseType: !259, size: 64, offset: 896)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !180, line: 331, baseType: !555)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !180, line: 331, flags: DIFlagFwdDecl)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !180, line: 338, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !180, line: 338, flags: DIFlagFwdDecl)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES_TR_KSPConverged_Ctx", file: !562, line: 10, baseType: !563)
!562 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/snes/impls/tr/tr.c", directory: "/home/users/ndemeye/xSDK")
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !562, line: 4, size: 256, elements: !564)
!564 = !{!565, !566, !572, !573}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "snes", scope: !563, file: !562, line: 5, baseType: !155, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "convtest", scope: !563, file: !562, line: 7, baseType: !567, size: 64, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!154, !451, !223, !137, !570, !259}
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !99, line: 540, baseType: !98)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "convdestroy", scope: !563, file: !562, line: 8, baseType: !304, size: 64, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "convctx", scope: !563, file: !562, line: 9, baseType: !259, size: 64, offset: 192)
!574 = !{i32 7, !"Dwarf Version", i32 4}
!575 = !{i32 2, !"Debug Info Version", i32 3}
!576 = !{i32 1, !"wchar_size", i32 4}
!577 = !{i32 7, !"PIC Level", i32 2}
!578 = !{i32 7, !"uwtable", i32 1}
!579 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!580 = distinct !DISubprogram(name: "SNESNewtonTRSetPreCheck", scope: !562, file: !562, line: 87, type: !581, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !583)
!581 = !DISubroutineType(types: !582)
!582 = !{!154, !155, !151, !259}
!583 = !{!584, !585, !586, !587}
!584 = !DILocalVariable(name: "snes", arg: 1, scope: !580, file: !562, line: 87, type: !155)
!585 = !DILocalVariable(name: "func", arg: 2, scope: !580, file: !562, line: 87, type: !151)
!586 = !DILocalVariable(name: "ctx", arg: 3, scope: !580, file: !562, line: 87, type: !259)
!587 = !DILocalVariable(name: "tr", scope: !580, file: !562, line: 89, type: !131)
!588 = !DILocation(line: 0, scope: !580)
!589 = !DILocation(line: 89, column: 46, scope: !580)
!590 = !{!591, !596, i64 1128}
!591 = !{!"_p_SNES", !592, i64 0, !594, i64 560, !596, i64 696, !594, i64 704, !596, i64 712, !594, i64 720, !594, i64 724, !596, i64 728, !596, i64 736, !596, i64 744, !596, i64 752, !596, i64 760, !596, i64 768, !596, i64 776, !596, i64 784, !596, i64 792, !596, i64 800, !594, i64 808, !594, i64 812, !596, i64 816, !596, i64 824, !596, i64 832, !597, i64 840, !594, i64 848, !594, i64 888, !594, i64 928, !593, i64 968, !596, i64 976, !594, i64 984, !594, i64 992, !594, i64 1032, !594, i64 1072, !593, i64 1112, !594, i64 1116, !594, i64 1120, !596, i64 1128, !593, i64 1136, !593, i64 1140, !593, i64 1144, !593, i64 1148, !593, i64 1152, !597, i64 1160, !597, i64 1168, !597, i64 1176, !597, i64 1184, !597, i64 1192, !597, i64 1200, !597, i64 1208, !597, i64 1216, !594, i64 1224, !593, i64 1228, !593, i64 1232, !593, i64 1236, !594, i64 1240, !593, i64 1244, !594, i64 1248, !593, i64 1252, !594, i64 1256, !594, i64 1260, !594, i64 1264, !594, i64 1268, !593, i64 1272, !596, i64 1280, !593, i64 1288, !596, i64 1296, !596, i64 1304, !593, i64 1312, !593, i64 1316, !594, i64 1320, !594, i64 1324, !594, i64 1328, !593, i64 1332, !593, i64 1336, !593, i64 1340, !593, i64 1344, !594, i64 1348, !594, i64 1352, !594, i64 1356, !594, i64 1360, !596, i64 1368, !597, i64 1376, !597, i64 1384, !596, i64 1392, !593, i64 1400, !594, i64 1404, !594, i64 1408, !593, i64 1412, !597, i64 1416, !596, i64 1424, !596, i64 1432, !593, i64 1440, !594, i64 1444, !594, i64 1448}
!592 = !{!"_p_PetscObject", !593, i64 0, !594, i64 8, !596, i64 64, !593, i64 72, !597, i64 80, !597, i64 88, !597, i64 96, !597, i64 104, !598, i64 112, !593, i64 120, !593, i64 124, !596, i64 128, !596, i64 136, !596, i64 144, !596, i64 152, !596, i64 160, !596, i64 168, !596, i64 176, !598, i64 184, !596, i64 192, !596, i64 200, !593, i64 208, !596, i64 216, !598, i64 224, !593, i64 232, !593, i64 236, !596, i64 240, !596, i64 248, !596, i64 256, !596, i64 264, !593, i64 272, !593, i64 276, !596, i64 280, !596, i64 288, !596, i64 296, !596, i64 304, !593, i64 312, !593, i64 316, !596, i64 320, !596, i64 328, !596, i64 336, !596, i64 344, !596, i64 352, !593, i64 360, !594, i64 368, !594, i64 384, !596, i64 392, !596, i64 400, !593, i64 408, !594, i64 416, !594, i64 456, !594, i64 496, !594, i64 536, !596, i64 544, !594, i64 552}
!593 = !{!"int", !594, i64 0}
!594 = !{!"omnipotent char", !595, i64 0}
!595 = !{!"Simple C/C++ TBAA"}
!596 = !{!"any pointer", !594, i64 0}
!597 = !{!"double", !594, i64 0}
!598 = !{!"long", !594, i64 0}
!599 = !DILocation(line: 91, column: 3, scope: !600)
!600 = distinct !DILexicalBlock(scope: !601, file: !562, line: 91, column: 3)
