; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/interface/iguess.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/interface/iguess.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._n_PetscFunctionList = type opaque
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!97 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_VIZ", value: 33, isUnsigned: true)
!98 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_XDMF", value: 34, isUnsigned: true)
!99 = !DIEnumerator(name: "PETSC_VIEWER_HDF5_MAT", value: 35, isUnsigned: true)
!100 = !DIEnumerator(name: "PETSC_VIEWER_NOFORMAT", value: 36, isUnsigned: true)
!101 = !DIEnumerator(name: "PETSC_VIEWER_LOAD_BALANCE", value: 37, isUnsigned: true)
!102 = !DIEnumerator(name: "PETSC_VIEWER_FAILED", value: 38, isUnsigned: true)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !104, line: 70, baseType: !7, size: 32, elements: !105)
!104 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/kspimpl.h", directory: "/home/users/ndemeye/xSDK")
!105 = !{!106, !107, !108}
!106 = !DIEnumerator(name: "KSP_SETUP_NEW", value: 0, isUnsigned: true)
!107 = !DIEnumerator(name: "KSP_SETUP_NEWMATRIX", value: 1, isUnsigned: true)
!108 = !DIEnumerator(name: "KSP_SETUP_NEWRHS", value: 2, isUnsigned: true)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 451, baseType: !28, size: 32, elements: !110)
!110 = !{!111, !112, !113, !114, !115}
!111 = !DIEnumerator(name: "KSP_NORM_DEFAULT", value: -1)
!112 = !DIEnumerator(name: "KSP_NORM_NONE", value: 0)
!113 = !DIEnumerator(name: "KSP_NORM_PRECONDITIONED", value: 1)
!114 = !DIEnumerator(name: "KSP_NORM_UNPRECONDITIONED", value: 2)
!115 = !DIEnumerator(name: "KSP_NORM_NATURAL", value: 3)
!116 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !117, line: 663, baseType: !7, size: 32, elements: !118)
!117 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!118 = !{!119, !120, !121}
!119 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!120 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!121 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!122 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 385, baseType: !7, size: 32, elements: !123)
!123 = !{!124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141}
!124 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!125 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!126 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!127 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!128 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!129 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!130 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!131 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!132 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!133 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!134 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!135 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!136 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!137 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!138 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!139 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!140 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!141 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!142 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !143, line: 624, baseType: !7, size: 32, elements: !144)
!143 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!144 = !{!145, !146, !147, !148}
!145 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!146 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!147 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!148 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!149 = !{!150, !153, !154, !159, !162, !241, !28, !325, !359, !360, !361}
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !143, line: 330, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !143, line: 330, flags: DIFlagFwdDecl)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !155, line: 1451, baseType: !156)
!155 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{null}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !161)
!161 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !165, line: 73, size: 4480, elements: !166)
!165 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!166 = !{!167, !169, !212, !213, !215, !218, !219, !220, !221, !229, !230, !232, !236, !240, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !253, !254, !255, !257, !258, !260, !262, !263, !264, !265, !266, !269, !271, !272, !273, !274, !275, !278, !280, !281, !282, !292, !294, !295, !299, !300, !349, !354, !356, !357, !358}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !164, file: !165, line: 74, baseType: !168, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !164, file: !165, line: 75, baseType: !170, size: 448, offset: 64)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 448, elements: !210)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !165, line: 53, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !165, line: 45, size: 448, elements: !173)
!173 = !{!174, !180, !188, !193, !197, !201, !205}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !172, file: !165, line: 46, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!178, !162, !179}
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !172, file: !165, line: 47, baseType: !181, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!178, !162, !184}
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !185, line: 16, baseType: !186)
!185 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !185, line: 16, flags: DIFlagFwdDecl)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !172, file: !165, line: 48, baseType: !189, size: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!178, !192}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !172, file: !165, line: 49, baseType: !194, size: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!178, !162, !159, !162}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !172, file: !165, line: 50, baseType: !198, size: 64, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!178, !162, !159, !192}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !172, file: !165, line: 51, baseType: !202, size: 64, offset: 320)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!178, !162, !159, !156}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !172, file: !165, line: 52, baseType: !206, size: 64, offset: 384)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!178, !162, !159, !209}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!210 = !{!211}
!211 = !DISubrange(count: 1)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !164, file: !165, line: 76, baseType: !150, size: 64, offset: 512)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !164, file: !165, line: 77, baseType: !214, size: 32, offset: 576)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !164, file: !165, line: 78, baseType: !216, size: 64, offset: 640)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !217)
!217 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !164, file: !165, line: 78, baseType: !216, size: 64, offset: 704)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !164, file: !165, line: 78, baseType: !216, size: 64, offset: 768)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !164, file: !165, line: 78, baseType: !216, size: 64, offset: 832)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !164, file: !165, line: 79, baseType: !222, size: 64, offset: 896)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !225, line: 27, baseType: !226)
!225 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !227, line: 43, baseType: !228)
!227 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!228 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !164, file: !165, line: 80, baseType: !214, size: 32, offset: 960)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !164, file: !165, line: 81, baseType: !231, size: 32, offset: 992)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !164, file: !165, line: 82, baseType: !233, size: 64, offset: 1024)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !164, file: !165, line: 83, baseType: !237, size: 64, offset: 1088)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !164, file: !165, line: 84, baseType: !241, size: 64, offset: 1152)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !164, file: !165, line: 85, baseType: !241, size: 64, offset: 1216)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !164, file: !165, line: 86, baseType: !241, size: 64, offset: 1280)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !164, file: !165, line: 87, baseType: !241, size: 64, offset: 1344)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !164, file: !165, line: 88, baseType: !162, size: 64, offset: 1408)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !164, file: !165, line: 89, baseType: !222, size: 64, offset: 1472)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !164, file: !165, line: 90, baseType: !241, size: 64, offset: 1536)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !164, file: !165, line: 91, baseType: !241, size: 64, offset: 1600)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !164, file: !165, line: 92, baseType: !214, size: 32, offset: 1664)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !164, file: !165, line: 93, baseType: !153, size: 64, offset: 1728)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !164, file: !165, line: 94, baseType: !252, size: 64, offset: 1792)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !223)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !164, file: !165, line: 95, baseType: !214, size: 32, offset: 1856)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !164, file: !165, line: 95, baseType: !214, size: 32, offset: 1888)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !164, file: !165, line: 96, baseType: !256, size: 64, offset: 1920)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !164, file: !165, line: 96, baseType: !256, size: 64, offset: 1984)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !164, file: !165, line: 97, baseType: !259, size: 64, offset: 2048)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !164, file: !165, line: 97, baseType: !261, size: 64, offset: 2112)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !164, file: !165, line: 98, baseType: !214, size: 32, offset: 2176)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !164, file: !165, line: 98, baseType: !214, size: 32, offset: 2208)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !164, file: !165, line: 99, baseType: !256, size: 64, offset: 2240)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !164, file: !165, line: 99, baseType: !256, size: 64, offset: 2304)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !164, file: !165, line: 100, baseType: !267, size: 64, offset: 2368)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !217)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !164, file: !165, line: 100, baseType: !270, size: 64, offset: 2432)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !164, file: !165, line: 101, baseType: !214, size: 32, offset: 2496)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !164, file: !165, line: 101, baseType: !214, size: 32, offset: 2528)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !164, file: !165, line: 102, baseType: !256, size: 64, offset: 2560)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !164, file: !165, line: 102, baseType: !256, size: 64, offset: 2624)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !164, file: !165, line: 103, baseType: !276, size: 64, offset: 2688)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !268)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !164, file: !165, line: 103, baseType: !279, size: 64, offset: 2752)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !164, file: !165, line: 104, baseType: !209, size: 64, offset: 2816)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !164, file: !165, line: 105, baseType: !214, size: 32, offset: 2880)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !164, file: !165, line: 106, baseType: !283, size: 128, offset: 2944)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !284, size: 128, elements: !290)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !165, line: 64, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !165, line: 61, size: 128, elements: !287)
!287 = !{!288, !289}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !286, file: !165, line: 62, baseType: !156, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !286, file: !165, line: 63, baseType: !153, size: 64, offset: 64)
!290 = !{!291}
!291 = !DISubrange(count: 2)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !164, file: !165, line: 107, baseType: !293, size: 64, offset: 3072)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 64, elements: !290)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !164, file: !165, line: 108, baseType: !153, size: 64, offset: 3136)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !164, file: !165, line: 109, baseType: !296, size: 64, offset: 3200)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!178, !153}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !164, file: !165, line: 111, baseType: !214, size: 32, offset: 3264)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !164, file: !165, line: 112, baseType: !301, size: 320, offset: 3328)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 320, elements: !347)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!178, !305, !162, !153}
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !308)
!308 = !{!309, !310, !335, !336, !337, !338, !339, !340, !341, !342, !343}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !307, file: !12, line: 100, baseType: !214, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !307, file: !12, line: 101, baseType: !311, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !314)
!314 = !{!315, !316, !317, !318, !319, !322, !323, !324, !328, !330, !332, !333, !334}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !313, file: !12, line: 84, baseType: !241, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !313, file: !12, line: 85, baseType: !241, size: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !313, file: !12, line: 86, baseType: !153, size: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !313, file: !12, line: 87, baseType: !233, size: 64, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !313, file: !12, line: 88, baseType: !320, size: 64, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !313, file: !12, line: 89, baseType: !161, size: 8, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !313, file: !12, line: 90, baseType: !241, size: 64, offset: 384)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !313, file: !12, line: 91, baseType: !325, size: 64, offset: 448)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !326, line: 46, baseType: !327)
!326 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!327 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !313, file: !12, line: 92, baseType: !329, size: 32, offset: 512)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !313, file: !12, line: 93, baseType: !331, size: 32, offset: 544)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !313, file: !12, line: 94, baseType: !311, size: 64, offset: 576)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !313, file: !12, line: 95, baseType: !241, size: 64, offset: 640)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !313, file: !12, line: 96, baseType: !153, size: 64, offset: 704)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !307, file: !12, line: 102, baseType: !241, size: 64, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !307, file: !12, line: 102, baseType: !241, size: 64, offset: 192)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !307, file: !12, line: 103, baseType: !241, size: 64, offset: 256)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !307, file: !12, line: 104, baseType: !150, size: 64, offset: 320)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !307, file: !12, line: 105, baseType: !329, size: 32, offset: 384)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !307, file: !12, line: 105, baseType: !329, size: 32, offset: 416)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !307, file: !12, line: 105, baseType: !329, size: 32, offset: 448)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !307, file: !12, line: 106, baseType: !162, size: 64, offset: 512)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !307, file: !12, line: 107, baseType: !344, size: 64, offset: 576)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!347 = !{!348}
!348 = !DISubrange(count: 5)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !164, file: !165, line: 113, baseType: !350, size: 320, offset: 3648)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 320, elements: !347)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!178, !162, !153}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !164, file: !165, line: 114, baseType: !355, size: 320, offset: 3968)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 320, elements: !347)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !164, file: !165, line: 115, baseType: !329, size: 32, offset: 4288)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !164, file: !165, line: 120, baseType: !344, size: 64, offset: 4352)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !164, file: !165, line: 121, baseType: !329, size: 32, offset: 4416)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectDestroyFunction", file: !165, line: 130, baseType: !189)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectViewFunction", file: !165, line: 131, baseType: !181)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!362 = !{!0, !363}
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "KSPGuessRegisterAllCalled", scope: !2, file: !365, line: 4, type: !329, isLocal: true, isDefinition: true)
!365 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/ksp/interface/iguess.c", directory: "/home/users/ndemeye/xSDK")
!366 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!367 = !{i32 7, !"Dwarf Version", i32 4}
!368 = !{i32 2, !"Debug Info Version", i32 3}
!369 = !{i32 1, !"wchar_size", i32 4}
!370 = !{i32 7, !"PIC Level", i32 2}
!371 = !{i32 7, !"uwtable", i32 1}
!372 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!373 = distinct !DISubprogram(name: "KSPGuessRegister", scope: !365, file: !365, line: 33, type: !374, scopeLine: 34, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !621)
!374 = !DISubroutineType(types: !375)
!375 = !{!178, !159, !376}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!178, !379}
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPGuess", file: !35, line: 752, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSPGuess", file: !104, line: 54, size: 5184, elements: !382)
!382 = !{!383, !385, !406, !618, !619, !620}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !381, file: !104, line: 55, baseType: !384, size: 4480)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !165, line: 122, baseType: !164)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !381, file: !104, line: 55, baseType: !386, size: 448, offset: 4480)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 448, elements: !210)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPGuessOps", file: !104, line: 41, size: 448, elements: !388)
!388 = !{!389, !397, !398, !399, !400, !401, !405}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "formguess", scope: !387, file: !104, line: 42, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!178, !379, !393, !393}
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !394, line: 21, baseType: !395)
!394 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !394, line: 21, flags: DIFlagFwdDecl)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !387, file: !104, line: 43, baseType: !390, size: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !387, file: !104, line: 44, baseType: !376, size: 64, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !387, file: !104, line: 45, baseType: !376, size: 64, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !387, file: !104, line: 46, baseType: !376, size: 64, offset: 256)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !387, file: !104, line: 47, baseType: !402, size: 64, offset: 320)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!178, !379, !184}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !387, file: !104, line: 48, baseType: !376, size: 64, offset: 384)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !381, file: !104, line: 56, baseType: !407, size: 64, offset: 4928)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !35, line: 22, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !104, line: 75, size: 12800, elements: !410)
!410 = !{!411, !412, !462, !467, !468, !469, !470, !471, !472, !473, !474, !475, !477, !482, !483, !484, !485, !486, !487, !488, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !511, !517, !518, !519, !520, !525, !526, !527, !528, !533, !534, !535, !536, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !588, !589, !590, !591, !592, !599, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !615, !616, !617}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !409, file: !104, line: 76, baseType: !384, size: 4480)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !409, file: !104, line: 76, baseType: !413, size: 896, offset: 4480)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 896, elements: !210)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_KSPOps", file: !104, line: 18, size: 896, elements: !415)
!415 = !{!416, !421, !425, !429, !437, !438, !442, !443, !447, !451, !455, !456, !460, !461}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "buildsolution", scope: !414, file: !104, line: 19, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!178, !407, !393, !420}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "buildresidual", scope: !414, file: !104, line: 22, baseType: !422, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!178, !407, !393, !393, !420}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !414, file: !104, line: 25, baseType: !426, size: 64, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!178, !407}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !414, file: !104, line: 26, baseType: !430, size: 64, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!178, !407, !433, !433}
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !434, line: 16, baseType: !435)
!434 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !434, line: 16, flags: DIFlagFwdDecl)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !414, file: !104, line: 27, baseType: !426, size: 64, offset: 256)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !414, file: !104, line: 28, baseType: !439, size: 64, offset: 320)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!178, !305, !407}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "publishoptions", scope: !414, file: !104, line: 29, baseType: !426, size: 64, offset: 384)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "computeextremesingularvalues", scope: !414, file: !104, line: 30, baseType: !444, size: 64, offset: 448)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!178, !407, !267, !267}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "computeeigenvalues", scope: !414, file: !104, line: 31, baseType: !448, size: 64, offset: 512)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{!178, !407, !214, !267, !267, !259}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "computeritz", scope: !414, file: !104, line: 32, baseType: !452, size: 64, offset: 576)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{!178, !407, !329, !329, !259, !420, !267, !267}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !414, file: !104, line: 33, baseType: !426, size: 64, offset: 640)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !414, file: !104, line: 34, baseType: !457, size: 64, offset: 704)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!178, !407, !184}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !414, file: !104, line: 35, baseType: !426, size: 64, offset: 768)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !414, file: !104, line: 36, baseType: !457, size: 64, offset: 832)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !409, file: !104, line: 77, baseType: !463, size: 64, offset: 5376)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !464, line: 14, baseType: !465)
!464 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !464, line: 14, flags: DIFlagFwdDecl)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !409, file: !104, line: 78, baseType: !329, size: 32, offset: 5440)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "dmActive", scope: !409, file: !104, line: 79, baseType: !329, size: 32, offset: 5472)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !409, file: !104, line: 81, baseType: !214, size: 32, offset: 5504)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "guess", scope: !409, file: !104, line: 82, baseType: !379, size: 64, offset: 5568)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "guess_zero", scope: !409, file: !104, line: 83, baseType: !329, size: 32, offset: 5632)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "calc_sings", scope: !409, file: !104, line: 84, baseType: !329, size: 32, offset: 5664)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "calc_ritz", scope: !409, file: !104, line: 85, baseType: !329, size: 32, offset: 5696)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "guess_knoll", scope: !409, file: !104, line: 86, baseType: !329, size: 32, offset: 5728)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side", scope: !409, file: !104, line: 87, baseType: !476, size: 32, offset: 5760)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !27, line: 85, baseType: !26)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "normsupporttable", scope: !409, file: !104, line: 88, baseType: !478, size: 384, offset: 5792)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 384, elements: !479)
!479 = !{!480, !481}
!480 = !DISubrange(count: 4)
!481 = !DISubrange(count: 3)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !409, file: !104, line: 89, baseType: !268, size: 64, offset: 6208)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !409, file: !104, line: 90, baseType: !268, size: 64, offset: 6272)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !409, file: !104, line: 91, baseType: !268, size: 64, offset: 6336)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !409, file: !104, line: 92, baseType: !268, size: 64, offset: 6400)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !409, file: !104, line: 93, baseType: !268, size: 64, offset: 6464)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm", scope: !409, file: !104, line: 94, baseType: !268, size: 64, offset: 6528)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !409, file: !104, line: 95, baseType: !489, size: 32, offset: 6592)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPConvergedReason", file: !35, line: 540, baseType: !34)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !409, file: !104, line: 96, baseType: !329, size: 32, offset: 6624)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !409, file: !104, line: 98, baseType: !393, size: 64, offset: 6656)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !409, file: !104, line: 98, baseType: !393, size: 64, offset: 6720)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist", scope: !409, file: !104, line: 102, baseType: !267, size: 64, offset: 6784)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_alloc", scope: !409, file: !104, line: 103, baseType: !267, size: 64, offset: 6848)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_len", scope: !409, file: !104, line: 104, baseType: !214, size: 32, offset: 6912)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_max", scope: !409, file: !104, line: 105, baseType: !214, size: 32, offset: 6944)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "res_hist_reset", scope: !409, file: !104, line: 106, baseType: !329, size: 32, offset: 6976)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist", scope: !409, file: !104, line: 107, baseType: !267, size: 64, offset: 7040)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_alloc", scope: !409, file: !104, line: 108, baseType: !267, size: 64, offset: 7104)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_len", scope: !409, file: !104, line: 109, baseType: !214, size: 32, offset: 7168)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_max", scope: !409, file: !104, line: 110, baseType: !214, size: 32, offset: 7200)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "err_hist_reset", scope: !409, file: !104, line: 111, baseType: !329, size: 32, offset: 7232)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "chknorm", scope: !409, file: !104, line: 113, baseType: !214, size: 32, offset: 7264)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "lagnorm", scope: !409, file: !104, line: 114, baseType: !329, size: 32, offset: 7296)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !409, file: !104, line: 117, baseType: !214, size: 32, offset: 7328)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !409, file: !104, line: 120, baseType: !507, size: 320, offset: 7360)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !508, size: 320, elements: !347)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!178, !407, !214, !268, !153}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !409, file: !104, line: 121, baseType: !512, size: 320, offset: 7680)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 320, elements: !347)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!178, !516}
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !409, file: !104, line: 122, baseType: !355, size: 320, offset: 8000)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !409, file: !104, line: 123, baseType: !214, size: 32, offset: 8320)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "pauseFinal", scope: !409, file: !104, line: 124, baseType: !329, size: 32, offset: 8352)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !409, file: !104, line: 126, baseType: !521, size: 320, offset: 8384)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !522, size: 320, elements: !347)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!178, !407, !153}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !409, file: !104, line: 127, baseType: !512, size: 320, offset: 8704)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !409, file: !104, line: 128, baseType: !355, size: 320, offset: 9024)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !409, file: !104, line: 129, baseType: !214, size: 32, offset: 9344)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !409, file: !104, line: 131, baseType: !529, size: 64, offset: 9408)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!178, !407, !214, !268, !532, !153}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !409, file: !104, line: 132, baseType: !296, size: 64, offset: 9472)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !409, file: !104, line: 133, baseType: !153, size: 64, offset: 9536)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !409, file: !104, line: 135, baseType: !153, size: 64, offset: 9600)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !409, file: !104, line: 137, baseType: !537, size: 64, offset: 9664)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !27, line: 11, baseType: !538)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !27, line: 11, flags: DIFlagFwdDecl)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !409, file: !104, line: 139, baseType: !153, size: 64, offset: 9728)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !409, file: !104, line: 142, baseType: !329, size: 32, offset: 9792)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "viewPre", scope: !409, file: !104, line: 142, baseType: !329, size: 32, offset: 9824)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "viewRate", scope: !409, file: !104, line: 142, baseType: !329, size: 32, offset: 9856)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "viewMat", scope: !409, file: !104, line: 142, baseType: !329, size: 32, offset: 9888)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "viewPMat", scope: !409, file: !104, line: 142, baseType: !329, size: 32, offset: 9920)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "viewRhs", scope: !409, file: !104, line: 142, baseType: !329, size: 32, offset: 9952)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "viewSol", scope: !409, file: !104, line: 142, baseType: !329, size: 32, offset: 9984)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "viewMatExp", scope: !409, file: !104, line: 142, baseType: !329, size: 32, offset: 10016)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "viewEV", scope: !409, file: !104, line: 142, baseType: !329, size: 32, offset: 10048)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "viewSV", scope: !409, file: !104, line: 142, baseType: !329, size: 32, offset: 10080)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "viewEVExp", scope: !409, file: !104, line: 142, baseType: !329, size: 32, offset: 10112)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "viewFinalRes", scope: !409, file: !104, line: 142, baseType: !329, size: 32, offset: 10144)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "viewPOpExp", scope: !409, file: !104, line: 142, baseType: !329, size: 32, offset: 10176)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "viewDScale", scope: !409, file: !104, line: 142, baseType: !329, size: 32, offset: 10208)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !409, file: !104, line: 143, baseType: !184, size: 64, offset: 10240)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPre", scope: !409, file: !104, line: 143, baseType: !184, size: 64, offset: 10304)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRate", scope: !409, file: !104, line: 143, baseType: !184, size: 64, offset: 10368)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMat", scope: !409, file: !104, line: 143, baseType: !184, size: 64, offset: 10432)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPMat", scope: !409, file: !104, line: 143, baseType: !184, size: 64, offset: 10496)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "viewerRhs", scope: !409, file: !104, line: 143, baseType: !184, size: 64, offset: 10560)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSol", scope: !409, file: !104, line: 143, baseType: !184, size: 64, offset: 10624)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "viewerMatExp", scope: !409, file: !104, line: 143, baseType: !184, size: 64, offset: 10688)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEV", scope: !409, file: !104, line: 143, baseType: !184, size: 64, offset: 10752)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "viewerSV", scope: !409, file: !104, line: 143, baseType: !184, size: 64, offset: 10816)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "viewerEVExp", scope: !409, file: !104, line: 143, baseType: !184, size: 64, offset: 10880)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "viewerFinalRes", scope: !409, file: !104, line: 143, baseType: !184, size: 64, offset: 10944)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "viewerPOpExp", scope: !409, file: !104, line: 143, baseType: !184, size: 64, offset: 11008)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "viewerDScale", scope: !409, file: !104, line: 143, baseType: !184, size: 64, offset: 11072)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !409, file: !104, line: 144, baseType: !570, size: 32, offset: 11136)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewerFormat", file: !59, line: 162, baseType: !58)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "formatPre", scope: !409, file: !104, line: 144, baseType: !570, size: 32, offset: 11168)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "formatRate", scope: !409, file: !104, line: 144, baseType: !570, size: 32, offset: 11200)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "formatMat", scope: !409, file: !104, line: 144, baseType: !570, size: 32, offset: 11232)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "formatPMat", scope: !409, file: !104, line: 144, baseType: !570, size: 32, offset: 11264)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "formatRhs", scope: !409, file: !104, line: 144, baseType: !570, size: 32, offset: 11296)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "formatSol", scope: !409, file: !104, line: 144, baseType: !570, size: 32, offset: 11328)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "formatMatExp", scope: !409, file: !104, line: 144, baseType: !570, size: 32, offset: 11360)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "formatEV", scope: !409, file: !104, line: 144, baseType: !570, size: 32, offset: 11392)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "formatSV", scope: !409, file: !104, line: 144, baseType: !570, size: 32, offset: 11424)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "formatEVExp", scope: !409, file: !104, line: 144, baseType: !570, size: 32, offset: 11456)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "formatFinalRes", scope: !409, file: !104, line: 144, baseType: !570, size: 32, offset: 11488)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "formatPOpExp", scope: !409, file: !104, line: 144, baseType: !570, size: 32, offset: 11520)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "formatDScale", scope: !409, file: !104, line: 144, baseType: !570, size: 32, offset: 11552)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !409, file: !104, line: 147, baseType: !214, size: 32, offset: 11584)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !409, file: !104, line: 148, baseType: !420, size: 64, offset: 11648)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "setupstage", scope: !409, file: !104, line: 150, baseType: !587, size: 32, offset: 11712)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPSetUpStage", file: !104, line: 70, baseType: !103)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "setupnewmatrix", scope: !409, file: !104, line: 151, baseType: !329, size: 32, offset: 11744)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "its", scope: !409, file: !104, line: 153, baseType: !214, size: 32, offset: 11776)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "totalits", scope: !409, file: !104, line: 154, baseType: !214, size: 32, offset: 11808)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "transpose_solve", scope: !409, file: !104, line: 156, baseType: !329, size: 32, offset: 11840)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !409, file: !104, line: 161, baseType: !593, size: 192, offset: 11904)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !409, file: !104, line: 157, size: 192, elements: !594)
!594 = !{!595, !596, !597, !598}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "AT", scope: !593, file: !104, line: 158, baseType: !433, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "BT", scope: !593, file: !104, line: 158, baseType: !433, size: 64, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "use_explicittranspose", scope: !593, file: !104, line: 159, baseType: !329, size: 32, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_transpose", scope: !593, file: !104, line: 160, baseType: !329, size: 32, offset: 160)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "normtype", scope: !409, file: !104, line: 163, baseType: !600, size: 32, offset: 12096)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSPNormType", file: !35, line: 451, baseType: !109)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "pc_side_set", scope: !409, file: !104, line: 165, baseType: !476, size: 32, offset: 12128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "normtype_set", scope: !409, file: !104, line: 166, baseType: !600, size: 32, offset: 12160)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !409, file: !104, line: 171, baseType: !329, size: 32, offset: 12192)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix", scope: !409, file: !104, line: 172, baseType: !329, size: 32, offset: 12224)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "dscalefix2", scope: !409, file: !104, line: 173, baseType: !329, size: 32, offset: 12256)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal", scope: !409, file: !104, line: 174, baseType: !393, size: 64, offset: 12288)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "truediagonal", scope: !409, file: !104, line: 175, baseType: !393, size: 64, offset: 12352)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !409, file: !104, line: 177, baseType: !214, size: 32, offset: 12416)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "skippcsetfromoptions", scope: !409, file: !104, line: 178, baseType: !329, size: 32, offset: 12448)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "eigviewer", scope: !409, file: !104, line: 180, baseType: !184, size: 64, offset: 12480)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !409, file: !104, line: 182, baseType: !612, size: 64, offset: 12544)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{!178, !407, !393, !393, !153}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !409, file: !104, line: 183, baseType: !612, size: 64, offset: 12608)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "prectx", scope: !409, file: !104, line: 184, baseType: !153, size: 64, offset: 12672)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "postctx", scope: !409, file: !104, line: 184, baseType: !153, size: 64, offset: 12736)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !381, file: !104, line: 57, baseType: !433, size: 64, offset: 4992)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "omatstate", scope: !381, file: !104, line: 58, baseType: !252, size: 64, offset: 5056)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !381, file: !104, line: 59, baseType: !153, size: 64, offset: 5120)
!621 = !{!622, !623, !624, !625, !627}
!622 = !DILocalVariable(name: "sname", arg: 1, scope: !373, file: !365, line: 33, type: !159)
!623 = !DILocalVariable(name: "function", arg: 2, scope: !373, file: !365, line: 33, type: !376)
!624 = !DILocalVariable(name: "ierr", scope: !373, file: !365, line: 35, type: !178)
!625 = !DILocalVariable(name: "ierr__", scope: !626, file: !365, line: 38, type: !178)
!626 = distinct !DILexicalBlock(scope: !373, file: !365, line: 38, column: 33)
!627 = !DILocalVariable(name: "ierr__", scope: !628, file: !365, line: 39, type: !178)
!628 = distinct !DILexicalBlock(scope: !373, file: !365, line: 39, column: 61)
!629 = !DILocation(line: 0, scope: !373)
!630 = !DILocation(line: 37, column: 3, scope: !631)
!631 = distinct !DILexicalBlock(scope: !632, file: !365, line: 37, column: 3)
!632 = distinct !DILexicalBlock(scope: !633, file: !365, line: 37, column: 3)
!633 = distinct !DILexicalBlock(scope: !373, file: !365, line: 37, column: 3)
!634 = !{!635, !635, i64 0}
!635 = !{!"any pointer", !636, i64 0}
!636 = !{!"omnipotent char", !637, i64 0}
!637 = !{!"Simple C/C++ TBAA"}
!638 = !DILocation(line: 37, column: 3, scope: !632)
!639 = !DILocation(line: 37, column: 3, scope: !640)
!640 = distinct !DILexicalBlock(scope: !641, file: !365, line: 37, column: 3)
!641 = distinct !DILexicalBlock(scope: !631, file: !365, line: 37, column: 3)
!642 = !{!643, !644, i64 1536}
!643 = !{!"", !636, i64 0, !636, i64 512, !636, i64 1024, !636, i64 1280, !644, i64 1536, !644, i64 1540, !636, i64 1544}
!644 = !{!"int", !636, i64 0}
!645 = !DILocation(line: 37, column: 3, scope: !641)
!646 = !DILocation(line: 37, column: 3, scope: !647)
!647 = distinct !DILexicalBlock(scope: !640, file: !365, line: 37, column: 3)
!648 = !{!644, !644, i64 0}
!649 = !{!643, !644, i64 1540}
!650 = !DILocation(line: 38, column: 10, scope: !373)
!651 = !DILocation(line: 0, scope: !626)
!652 = !DILocation(line: 38, column: 33, scope: !653)
!653 = distinct !DILexicalBlock(scope: !626, file: !365, line: 38, column: 33)
!654 = !DILocation(line: 38, column: 33, scope: !626)
!655 = !{!"branch_weights", i32 2000, i32 1}
!656 = !DILocation(line: 39, column: 10, scope: !373)
!657 = !DILocation(line: 0, scope: !628)
!658 = !DILocation(line: 39, column: 61, scope: !659)
!659 = distinct !DILexicalBlock(scope: !628, file: !365, line: 39, column: 61)
!660 = !DILocation(line: 39, column: 61, scope: !628)
!661 = !DILocation(line: 40, column: 3, scope: !662)
!662 = distinct !DILexicalBlock(scope: !663, file: !365, line: 40, column: 3)
!663 = distinct !DILexicalBlock(scope: !664, file: !365, line: 40, column: 3)
!664 = distinct !DILexicalBlock(scope: !373, file: !365, line: 40, column: 3)
!665 = !DILocation(line: 40, column: 3, scope: !663)
!666 = !DILocation(line: 40, column: 3, scope: !667)
!667 = distinct !DILexicalBlock(scope: !668, file: !365, line: 40, column: 3)
!668 = distinct !DILexicalBlock(scope: !662, file: !365, line: 40, column: 3)
!669 = !DILocation(line: 40, column: 3, scope: !668)
!670 = !DILocation(line: 40, column: 3, scope: !671)
!671 = distinct !DILexicalBlock(scope: !672, file: !365, line: 40, column: 3)
!672 = distinct !DILexicalBlock(scope: !667, file: !365, line: 40, column: 3)
!673 = !{!643, !636, i64 1544}
!674 = !DILocation(line: 40, column: 3, scope: !672)
!675 = !DILocation(line: 40, column: 3, scope: !676)
!676 = distinct !DILexicalBlock(scope: !671, file: !365, line: 40, column: 3)
!677 = !DILocation(line: 40, column: 3, scope: !678)
!678 = distinct !DILexicalBlock(scope: !667, file: !365, line: 40, column: 3)
!679 = !DILocation(line: 40, column: 3, scope: !680)
!680 = distinct !DILexicalBlock(scope: !678, file: !365, line: 40, column: 3)
!681 = !DILocation(line: 40, column: 3, scope: !682)
!682 = distinct !DILexicalBlock(scope: !683, file: !365, line: 40, column: 3)
