; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/baij/mpi/mmbaij.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/baij/mpi/mmbaij.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Vec = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!256 = !DIEnumerator(name: "MATOP_MULT_HERMITIAN_TRANS_ADD", value: 122, isUnsigned: true)
!257 = !DIEnumerator(name: "MATOP_GET_MULTI_PROC_BLOCK", value: 123, isUnsigned: true)
!258 = !DIEnumerator(name: "MATOP_FIND_NONZERO_ROWS", value: 124, isUnsigned: true)
!259 = !DIEnumerator(name: "MATOP_GET_COLUMN_NORMS", value: 125, isUnsigned: true)
!260 = !DIEnumerator(name: "MATOP_INVERT_BLOCK_DIAGONAL", value: 126, isUnsigned: true)
!261 = !DIEnumerator(name: "MATOP_CREATE_SUB_MATRICES_MPI", value: 128, isUnsigned: true)
!262 = !DIEnumerator(name: "MATOP_SET_VALUES_BATCH", value: 129, isUnsigned: true)
!263 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT", value: 130, isUnsigned: true)
!264 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_SYMBO", value: 131, isUnsigned: true)
!265 = !DIEnumerator(name: "MATOP_TRANSPOSE_MAT_MULT_NUMER", value: 132, isUnsigned: true)
!266 = !DIEnumerator(name: "MATOP_TRANSPOSE_COLORING_CREAT", value: 133, isUnsigned: true)
!267 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_SPT", value: 134, isUnsigned: true)
!268 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_DEN", value: 135, isUnsigned: true)
!269 = !DIEnumerator(name: "MATOP_RART", value: 136, isUnsigned: true)
!270 = !DIEnumerator(name: "MATOP_RART_SYMBOLIC", value: 137, isUnsigned: true)
!271 = !DIEnumerator(name: "MATOP_RART_NUMERIC", value: 138, isUnsigned: true)
!272 = !DIEnumerator(name: "MATOP_SET_BLOCK_SIZES", value: 139, isUnsigned: true)
!273 = !DIEnumerator(name: "MATOP_AYPX", value: 140, isUnsigned: true)
!274 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!275 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!276 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!277 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!278 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!279 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!280 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !54, line: 161, baseType: !7, size: 32, elements: !281)
!281 = !{!282, !283, !284, !285, !286, !287, !288, !289}
!282 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!285 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!286 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!287 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!288 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!289 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!290 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !54, line: 1265, baseType: !7, size: 32, elements: !291)
!291 = !{!292, !293, !294}
!292 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!293 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!294 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!295 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !54, line: 1203, baseType: !7, size: 32, elements: !296)
!296 = !{!297, !298, !299, !300, !301}
!297 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!300 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!301 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!302 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !54, line: 187, baseType: !7, size: 32, elements: !303)
!303 = !{!304, !305, !306, !307, !308, !309, !310}
!304 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!305 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!306 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!307 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!308 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!309 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!310 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!311 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !312, line: 663, baseType: !7, size: 32, elements: !313)
!312 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!313 = !{!314, !315, !316}
!314 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!315 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!316 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!317 = !{!318, !1486, !356, !436, !510, !353, !377, !1567, !325, !512}
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_MPIBAIJ", file: !320, line: 69, baseType: !321)
!320 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/baij/mpi/mpibaij.h", directory: "/home/users/ndemeye/xSDK")
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !320, line: 67, size: 2240, elements: !322)
!322 = !{!323, !326, !327, !328, !329, !330, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1444, !1445, !1446, !1458, !1459, !1460, !1461, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "rangebs", scope: !321, file: !320, line: 68, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !90)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "rstartbs", scope: !321, file: !320, line: 68, baseType: !325, size: 32, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "rendbs", scope: !321, file: !320, line: 68, baseType: !325, size: 32, offset: 96)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "cstartbs", scope: !321, file: !320, line: 68, baseType: !325, size: 32, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "cendbs", scope: !321, file: !320, line: 68, baseType: !325, size: 32, offset: 160)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !321, file: !320, line: 68, baseType: !331, size: 64, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !54, line: 16, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !334, line: 436, size: 23424, elements: !335)
!334 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!335 = !{!336, !544, !1188, !1189, !1190, !1191, !1193, !1194, !1195, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1322, !1323, !1339, !1340, !1341, !1342, !1343, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1378, !1398, !1399, !1401, !1402, !1403, !1404, !1405, !1406, !1424, !1425}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !333, file: !334, line: 437, baseType: !337, size: 4480)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !338, line: 122, baseType: !339)
!338 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !338, line: 73, size: 4480, elements: !340)
!340 = !{!341, !343, !398, !399, !400, !403, !404, !405, !406, !414, !415, !417, !421, !425, !427, !428, !429, !430, !431, !432, !433, !434, !435, !437, !439, !440, !441, !443, !444, !445, !447, !448, !449, !450, !451, !454, !456, !457, !458, !459, !460, !463, !465, !466, !467, !477, !479, !480, !484, !485, !534, !539, !541, !542, !543}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !339, file: !338, line: 74, baseType: !342, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !90)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !339, file: !338, line: 75, baseType: !344, size: 448, offset: 64)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !345, size: 448, elements: !396)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !338, line: 53, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !338, line: 45, size: 448, elements: !347)
!347 = !{!348, !360, !368, !373, !380, !384, !391}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !346, file: !338, line: 46, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{!352, !353, !355}
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !90)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !357, line: 330, baseType: !358)
!357 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !357, line: 330, flags: DIFlagFwdDecl)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !346, file: !338, line: 47, baseType: !361, size: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!352, !353, !364}
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !365, line: 16, baseType: !366)
!365 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !365, line: 16, flags: DIFlagFwdDecl)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !346, file: !338, line: 48, baseType: !369, size: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!352, !372}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !346, file: !338, line: 49, baseType: !374, size: 64, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!352, !353, !377, !353}
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !379)
!379 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !346, file: !338, line: 50, baseType: !381, size: 64, offset: 256)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!352, !353, !377, !372}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !346, file: !338, line: 51, baseType: !385, size: 64, offset: 320)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!352, !353, !377, !388}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{null}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !346, file: !338, line: 52, baseType: !392, size: 64, offset: 384)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!352, !353, !377, !395}
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!396 = !{!397}
!397 = !DISubrange(count: 1)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !339, file: !338, line: 76, baseType: !356, size: 64, offset: 512)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !339, file: !338, line: 77, baseType: !325, size: 32, offset: 576)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !339, file: !338, line: 78, baseType: !401, size: 64, offset: 640)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !402)
!402 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !339, file: !338, line: 78, baseType: !401, size: 64, offset: 704)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !339, file: !338, line: 78, baseType: !401, size: 64, offset: 768)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !339, file: !338, line: 78, baseType: !401, size: 64, offset: 832)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !339, file: !338, line: 79, baseType: !407, size: 64, offset: 896)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !410, line: 27, baseType: !411)
!410 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !412, line: 43, baseType: !413)
!412 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!413 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !339, file: !338, line: 80, baseType: !325, size: 32, offset: 960)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !339, file: !338, line: 81, baseType: !416, size: 32, offset: 992)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !90)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !339, file: !338, line: 82, baseType: !418, size: 64, offset: 1024)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !339, file: !338, line: 83, baseType: !422, size: 64, offset: 1088)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !423)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !339, file: !338, line: 84, baseType: !426, size: 64, offset: 1152)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !339, file: !338, line: 85, baseType: !426, size: 64, offset: 1216)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !339, file: !338, line: 86, baseType: !426, size: 64, offset: 1280)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !339, file: !338, line: 87, baseType: !426, size: 64, offset: 1344)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !339, file: !338, line: 88, baseType: !353, size: 64, offset: 1408)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !339, file: !338, line: 89, baseType: !407, size: 64, offset: 1472)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !339, file: !338, line: 90, baseType: !426, size: 64, offset: 1536)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !339, file: !338, line: 91, baseType: !426, size: 64, offset: 1600)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !339, file: !338, line: 92, baseType: !325, size: 32, offset: 1664)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !339, file: !338, line: 93, baseType: !436, size: 64, offset: 1728)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !339, file: !338, line: 94, baseType: !438, size: 64, offset: 1792)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !408)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !339, file: !338, line: 95, baseType: !325, size: 32, offset: 1856)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !339, file: !338, line: 95, baseType: !325, size: 32, offset: 1888)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !339, file: !338, line: 96, baseType: !442, size: 64, offset: 1920)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !339, file: !338, line: 96, baseType: !442, size: 64, offset: 1984)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !339, file: !338, line: 97, baseType: !324, size: 64, offset: 2048)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !339, file: !338, line: 97, baseType: !446, size: 64, offset: 2112)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !339, file: !338, line: 98, baseType: !325, size: 32, offset: 2176)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !339, file: !338, line: 98, baseType: !325, size: 32, offset: 2208)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !339, file: !338, line: 99, baseType: !442, size: 64, offset: 2240)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !339, file: !338, line: 99, baseType: !442, size: 64, offset: 2304)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !339, file: !338, line: 100, baseType: !452, size: 64, offset: 2368)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !402)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !339, file: !338, line: 100, baseType: !455, size: 64, offset: 2432)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !339, file: !338, line: 101, baseType: !325, size: 32, offset: 2496)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !339, file: !338, line: 101, baseType: !325, size: 32, offset: 2528)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !339, file: !338, line: 102, baseType: !442, size: 64, offset: 2560)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !339, file: !338, line: 102, baseType: !442, size: 64, offset: 2624)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !339, file: !338, line: 103, baseType: !461, size: 64, offset: 2688)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !453)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !339, file: !338, line: 103, baseType: !464, size: 64, offset: 2752)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !339, file: !338, line: 104, baseType: !395, size: 64, offset: 2816)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !339, file: !338, line: 105, baseType: !325, size: 32, offset: 2880)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !339, file: !338, line: 106, baseType: !468, size: 128, offset: 2944)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 128, elements: !475)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !338, line: 64, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !338, line: 61, size: 128, elements: !472)
!472 = !{!473, !474}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !471, file: !338, line: 62, baseType: !388, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !471, file: !338, line: 63, baseType: !436, size: 64, offset: 64)
!475 = !{!476}
!476 = !DISubrange(count: 2)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !339, file: !338, line: 107, baseType: !478, size: 64, offset: 3072)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !325, size: 64, elements: !475)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !339, file: !338, line: 108, baseType: !436, size: 64, offset: 3136)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !339, file: !338, line: 109, baseType: !481, size: 64, offset: 3200)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!352, !436}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !339, file: !338, line: 111, baseType: !325, size: 32, offset: 3264)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !339, file: !338, line: 112, baseType: !486, size: 320, offset: 3328)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !487, size: 320, elements: !532)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!352, !490, !353, !436}
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !493)
!493 = !{!494, !495, !520, !521, !522, !523, !524, !525, !526, !527, !528}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !492, file: !12, line: 100, baseType: !325, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !492, file: !12, line: 101, baseType: !496, size: 64, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !497)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !499)
!499 = !{!500, !501, !502, !503, !504, !507, !508, !509, !513, !515, !517, !518, !519}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !498, file: !12, line: 84, baseType: !426, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !498, file: !12, line: 85, baseType: !426, size: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !498, file: !12, line: 86, baseType: !436, size: 64, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !498, file: !12, line: 87, baseType: !418, size: 64, offset: 192)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !498, file: !12, line: 88, baseType: !505, size: 64, offset: 256)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !377)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !498, file: !12, line: 89, baseType: !379, size: 8, offset: 320)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !498, file: !12, line: 90, baseType: !426, size: 64, offset: 384)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !498, file: !12, line: 91, baseType: !510, size: 64, offset: 448)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !511, line: 46, baseType: !512)
!511 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!512 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !498, file: !12, line: 92, baseType: !514, size: 32, offset: 512)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !498, file: !12, line: 93, baseType: !516, size: 32, offset: 544)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !498, file: !12, line: 94, baseType: !496, size: 64, offset: 576)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !498, file: !12, line: 95, baseType: !426, size: 64, offset: 640)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !498, file: !12, line: 96, baseType: !436, size: 64, offset: 704)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !492, file: !12, line: 102, baseType: !426, size: 64, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !492, file: !12, line: 102, baseType: !426, size: 64, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !492, file: !12, line: 103, baseType: !426, size: 64, offset: 256)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !492, file: !12, line: 104, baseType: !356, size: 64, offset: 320)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !492, file: !12, line: 105, baseType: !514, size: 32, offset: 384)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !492, file: !12, line: 105, baseType: !514, size: 32, offset: 416)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !492, file: !12, line: 105, baseType: !514, size: 32, offset: 448)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !492, file: !12, line: 106, baseType: !353, size: 64, offset: 512)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !492, file: !12, line: 107, baseType: !529, size: 64, offset: 576)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!532 = !{!533}
!533 = !DISubrange(count: 5)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !339, file: !338, line: 113, baseType: !535, size: 320, offset: 3648)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 320, elements: !532)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!352, !353, !436}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !339, file: !338, line: 114, baseType: !540, size: 320, offset: 3968)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 320, elements: !532)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !339, file: !338, line: 115, baseType: !514, size: 32, offset: 4288)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !339, file: !338, line: 120, baseType: !529, size: 64, offset: 4352)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !339, file: !338, line: 121, baseType: !514, size: 32, offset: 4416)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !333, file: !334, line: 437, baseType: !545, size: 9472, offset: 4480)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 9472, elements: !396)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !334, line: 32, size: 9472, elements: !547)
!547 = !{!548, !557, !561, !562, !569, !573, !574, !575, !576, !577, !578, !579, !737, !741, !746, !752, !771, !775, !779, !780, !785, !790, !791, !796, !800, !804, !808, !812, !816, !817, !818, !819, !820, !824, !825, !830, !831, !832, !833, !834, !839, !846, !850, !854, !858, !862, !866, !867, !871, !872, !879, !883, !884, !885, !886, !960, !965, !966, !970, !971, !975, !976, !980, !985, !986, !990, !994, !998, !999, !1000, !1001, !1002, !1003, !1008, !1009, !1013, !1017, !1021, !1022, !1023, !1027, !1037, !1038, !1042, !1043, !1047, !1048, !1052, !1053, !1058, !1059, !1063, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1077, !1078, !1079, !1080, !1081, !1082, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1097, !1101, !1102, !1103, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1117, !1118, !1119, !1124, !1128, !1129, !1133, !1134, !1135, !1136, !1162, !1166, !1167, !1168, !1169, !1170, !1174, !1175, !1176, !1177, !1178, !1182, !1186, !1187}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !546, file: !334, line: 34, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!352, !331, !325, !552, !325, !552, !554, !556}
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !325)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !462)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !6, line: 580, baseType: !26)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !546, file: !334, line: 35, baseType: !558, size: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{!352, !331, !325, !324, !446, !464}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !546, file: !334, line: 36, baseType: !558, size: 64, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !546, file: !334, line: 37, baseType: !563, size: 64, offset: 192)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{!352, !331, !566, !566}
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !78, line: 21, baseType: !567)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !78, line: 21, flags: DIFlagFwdDecl)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !546, file: !334, line: 38, baseType: !570, size: 64, offset: 256)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!352, !331, !566, !566, !566}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !546, file: !334, line: 40, baseType: !563, size: 64, offset: 320)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !546, file: !334, line: 41, baseType: !570, size: 64, offset: 384)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !546, file: !334, line: 42, baseType: !563, size: 64, offset: 448)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !546, file: !334, line: 43, baseType: !570, size: 64, offset: 512)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !546, file: !334, line: 44, baseType: !563, size: 64, offset: 576)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !546, file: !334, line: 46, baseType: !570, size: 64, offset: 640)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !546, file: !334, line: 47, baseType: !580, size: 64, offset: 704)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{!352, !331, !583, !583, !721}
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !584, line: 11, baseType: !585)
!584 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !48, line: 50, size: 7104, elements: !587)
!587 = !{!588, !589, !654, !708, !709, !710, !711, !712, !713, !714, !715, !718}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !586, file: !48, line: 51, baseType: !337, size: 4480)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !586, file: !48, line: 51, baseType: !590, size: 1536, offset: 4480)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 1536, elements: !396)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ISOps", file: !48, line: 21, size: 1536, elements: !592)
!592 = !{!593, !598, !599, !604, !608, !609, !614, !618, !619, !623, !624, !628, !629, !634, !638, !642, !646, !647, !648, !649, !650, !651, !652, !653}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "getindices", scope: !591, file: !48, line: 22, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!352, !583, !597}
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "restoreindices", scope: !591, file: !48, line: 23, baseType: !594, size: 64, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "invertpermutation", scope: !591, file: !48, line: 24, baseType: !600, size: 64, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{!352, !583, !325, !603}
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "sort", scope: !591, file: !48, line: 25, baseType: !605, size: 64, offset: 192)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!352, !583}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "sortremovedups", scope: !591, file: !48, line: 26, baseType: !605, size: 64, offset: 256)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "sorted", scope: !591, file: !48, line: 27, baseType: !610, size: 64, offset: 320)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!352, !583, !613}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !591, file: !48, line: 28, baseType: !615, size: 64, offset: 384)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!352, !583, !603}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !591, file: !48, line: 29, baseType: !605, size: 64, offset: 448)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !591, file: !48, line: 30, baseType: !620, size: 64, offset: 512)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!352, !583, !364}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !591, file: !48, line: 31, baseType: !620, size: 64, offset: 576)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !591, file: !48, line: 32, baseType: !625, size: 64, offset: 640)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!352, !583, !583}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "togeneral", scope: !591, file: !48, line: 33, baseType: !605, size: 64, offset: 704)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "oncomm", scope: !591, file: !48, line: 34, baseType: !630, size: 64, offset: 768)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!352, !583, !356, !633, !603}
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscCopyMode", file: !6, line: 327, baseType: !37)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksize", scope: !591, file: !48, line: 35, baseType: !635, size: 64, offset: 832)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!352, !583, !325}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "contiguous", scope: !591, file: !48, line: 36, baseType: !639, size: 64, offset: 896)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!352, !583, !325, !325, !324, !613}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "locate", scope: !591, file: !48, line: 37, baseType: !643, size: 64, offset: 960)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!352, !583, !325, !324}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "sortedlocal", scope: !591, file: !48, line: 38, baseType: !610, size: 64, offset: 1024)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "sortedglobal", scope: !591, file: !48, line: 39, baseType: !610, size: 64, offset: 1088)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "uniquelocal", scope: !591, file: !48, line: 40, baseType: !610, size: 64, offset: 1152)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "uniqueglobal", scope: !591, file: !48, line: 41, baseType: !610, size: 64, offset: 1216)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "permlocal", scope: !591, file: !48, line: 42, baseType: !610, size: 64, offset: 1280)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "permglobal", scope: !591, file: !48, line: 43, baseType: !610, size: 64, offset: 1344)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "intervallocal", scope: !591, file: !48, line: 44, baseType: !610, size: 64, offset: 1408)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "intervalglobal", scope: !591, file: !48, line: 45, baseType: !610, size: 64, offset: 1472)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !586, file: !48, line: 52, baseType: !655, size: 64, offset: 6016)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !584, line: 60, baseType: !656)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !43, line: 240, size: 640, elements: !658)
!658 = !{!659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !704, !705, !706, !707}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !657, file: !43, line: 241, baseType: !356, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !657, file: !43, line: 242, baseType: !416, size: 32, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !657, file: !43, line: 243, baseType: !325, size: 32, offset: 96)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !657, file: !43, line: 243, baseType: !325, size: 32, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !657, file: !43, line: 244, baseType: !325, size: 32, offset: 160)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !657, file: !43, line: 244, baseType: !325, size: 32, offset: 192)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !657, file: !43, line: 245, baseType: !324, size: 64, offset: 256)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !657, file: !43, line: 246, baseType: !514, size: 32, offset: 320)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !657, file: !43, line: 247, baseType: !325, size: 32, offset: 352)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !657, file: !43, line: 251, baseType: !325, size: 32, offset: 384)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !657, file: !43, line: 252, baseType: !670, size: 64, offset: 448)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !584, line: 30, baseType: !671)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !48, line: 73, size: 5440, elements: !673)
!673 = !{!674, !675, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !672, file: !48, line: 74, baseType: !337, size: 4480)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !672, file: !48, line: 74, baseType: !676, size: 256, offset: 4480)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !677, size: 256, elements: !396)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ISLocalToGlobalMappingOps", file: !48, line: 66, size: 256, elements: !678)
!678 = !{!679, !683, !688, !689}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingsetup", scope: !677, file: !48, line: 67, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!352, !670}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingapply", scope: !677, file: !48, line: 68, baseType: !684, size: 64, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!352, !670, !687, !325, !552, !324, !324}
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISGlobalToLocalMappingMode", file: !43, line: 149, baseType: !42)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingapplyblock", scope: !677, file: !48, line: 69, baseType: !684, size: 64, offset: 128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !677, file: !48, line: 70, baseType: !680, size: 64, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !672, file: !48, line: 75, baseType: !325, size: 32, offset: 4736)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !672, file: !48, line: 76, baseType: !325, size: 32, offset: 4768)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "indices", scope: !672, file: !48, line: 77, baseType: !324, size: 64, offset: 4800)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "globalstart", scope: !672, file: !48, line: 78, baseType: !325, size: 32, offset: 4864)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "globalend", scope: !672, file: !48, line: 79, baseType: !325, size: 32, offset: 4896)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "info_cached", scope: !672, file: !48, line: 80, baseType: !514, size: 32, offset: 4928)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "info_free", scope: !672, file: !48, line: 81, baseType: !514, size: 32, offset: 4960)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "info_nproc", scope: !672, file: !48, line: 82, baseType: !325, size: 32, offset: 4992)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "info_procs", scope: !672, file: !48, line: 83, baseType: !324, size: 64, offset: 5056)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "info_numprocs", scope: !672, file: !48, line: 84, baseType: !324, size: 64, offset: 5120)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "info_indices", scope: !672, file: !48, line: 85, baseType: !446, size: 64, offset: 5184)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "info_nodec", scope: !672, file: !48, line: 86, baseType: !324, size: 64, offset: 5248)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "info_nodei", scope: !672, file: !48, line: 87, baseType: !446, size: 64, offset: 5312)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !672, file: !48, line: 88, baseType: !436, size: 64, offset: 5376)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !657, file: !43, line: 253, baseType: !514, size: 32, offset: 512)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !657, file: !43, line: 254, baseType: !325, size: 32, offset: 544)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !657, file: !43, line: 254, baseType: !325, size: 32, offset: 576)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !657, file: !43, line: 255, baseType: !325, size: 32, offset: 608)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !586, file: !48, line: 53, baseType: !325, size: 32, offset: 6080)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !586, file: !48, line: 53, baseType: !325, size: 32, offset: 6112)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !586, file: !48, line: 54, baseType: !436, size: 64, offset: 6144)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !586, file: !48, line: 55, baseType: !324, size: 64, offset: 6208)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !586, file: !48, line: 55, baseType: !324, size: 64, offset: 6272)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "local_offset", scope: !586, file: !48, line: 56, baseType: !325, size: 32, offset: 6336)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "complement", scope: !586, file: !48, line: 57, baseType: !583, size: 64, offset: 6400)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "info_permanent", scope: !586, file: !48, line: 58, baseType: !716, size: 320, offset: 6464)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 320, elements: !717)
!717 = !{!476, !533}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !586, file: !48, line: 59, baseType: !719, size: 320, offset: 6784)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !720, size: 320, elements: !717)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISInfoBool", file: !48, line: 48, baseType: !47)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !723)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !54, line: 1239, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !54, line: 1226, size: 704, elements: !725)
!725 = !{!726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !724, file: !54, line: 1227, baseType: !453, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !724, file: !54, line: 1228, baseType: !453, size: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !724, file: !54, line: 1229, baseType: !453, size: 64, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !724, file: !54, line: 1230, baseType: !453, size: 64, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !724, file: !54, line: 1231, baseType: !453, size: 64, offset: 256)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !724, file: !54, line: 1232, baseType: !453, size: 64, offset: 320)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !724, file: !54, line: 1233, baseType: !453, size: 64, offset: 384)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !724, file: !54, line: 1234, baseType: !453, size: 64, offset: 448)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !724, file: !54, line: 1236, baseType: !453, size: 64, offset: 512)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !724, file: !54, line: 1237, baseType: !453, size: 64, offset: 576)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !724, file: !54, line: 1238, baseType: !453, size: 64, offset: 640)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !546, file: !334, line: 48, baseType: !738, size: 64, offset: 768)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!352, !331, !583, !721}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !546, file: !334, line: 49, baseType: !742, size: 64, offset: 832)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!352, !331, !566, !453, !745, !453, !325, !325, !566}
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !54, line: 1291, baseType: !53)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !546, file: !334, line: 50, baseType: !747, size: 64, offset: 896)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!352, !331, !750, !751}
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !54, line: 238, baseType: !66)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !546, file: !334, line: 52, baseType: !753, size: 64, offset: 960)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!352, !331, !756, !757}
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !54, line: 612, baseType: !72)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !54, line: 600, baseType: !759)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !54, line: 592, size: 640, elements: !760)
!760 = !{!761, !762, !763, !764, !765, !766, !767, !768, !769, !770}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !759, file: !54, line: 593, baseType: !401, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !759, file: !54, line: 594, baseType: !401, size: 64, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !759, file: !54, line: 594, baseType: !401, size: 64, offset: 128)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !759, file: !54, line: 594, baseType: !401, size: 64, offset: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !759, file: !54, line: 595, baseType: !401, size: 64, offset: 256)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !759, file: !54, line: 596, baseType: !401, size: 64, offset: 320)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !759, file: !54, line: 597, baseType: !401, size: 64, offset: 384)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !759, file: !54, line: 598, baseType: !401, size: 64, offset: 448)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !759, file: !54, line: 598, baseType: !401, size: 64, offset: 512)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !759, file: !54, line: 599, baseType: !401, size: 64, offset: 576)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !546, file: !334, line: 53, baseType: !772, size: 64, offset: 1024)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!352, !331, !331, !613}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !546, file: !334, line: 54, baseType: !776, size: 64, offset: 1088)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{!352, !331, !566}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !546, file: !334, line: 55, baseType: !563, size: 64, offset: 1152)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !546, file: !334, line: 56, baseType: !781, size: 64, offset: 1216)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DISubroutineType(types: !783)
!783 = !{!352, !331, !784, !452}
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !78, line: 155, baseType: !77)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !546, file: !334, line: 58, baseType: !786, size: 64, offset: 1280)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!352, !331, !789}
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !54, line: 424, baseType: !85)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !546, file: !334, line: 59, baseType: !786, size: 64, offset: 1344)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !546, file: !334, line: 60, baseType: !792, size: 64, offset: 1408)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{!352, !331, !795, !514}
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !54, line: 469, baseType: !89)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !546, file: !334, line: 61, baseType: !797, size: 64, offset: 1472)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{!352, !331}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !546, file: !334, line: 63, baseType: !801, size: 64, offset: 1536)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{!352, !331, !325, !552, !462, !566, !566}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !546, file: !334, line: 64, baseType: !805, size: 64, offset: 1600)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DISubroutineType(types: !807)
!807 = !{!352, !331, !331, !583, !583, !721}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !546, file: !334, line: 65, baseType: !809, size: 64, offset: 1664)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!352, !331, !331, !721}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !546, file: !334, line: 66, baseType: !813, size: 64, offset: 1728)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{!352, !331, !331, !583, !721}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !546, file: !334, line: 67, baseType: !809, size: 64, offset: 1792)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !546, file: !334, line: 69, baseType: !797, size: 64, offset: 1856)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !546, file: !334, line: 70, baseType: !805, size: 64, offset: 1920)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !546, file: !334, line: 71, baseType: !813, size: 64, offset: 1984)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !546, file: !334, line: 72, baseType: !821, size: 64, offset: 2048)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{!352, !331, !751}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !546, file: !334, line: 73, baseType: !797, size: 64, offset: 2112)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !546, file: !334, line: 75, baseType: !826, size: 64, offset: 2176)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{!352, !331, !829, !751}
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !54, line: 563, baseType: !120)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !546, file: !334, line: 76, baseType: !563, size: 64, offset: 2240)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !546, file: !334, line: 77, baseType: !563, size: 64, offset: 2304)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !546, file: !334, line: 78, baseType: !580, size: 64, offset: 2368)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !546, file: !334, line: 79, baseType: !738, size: 64, offset: 2432)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !546, file: !334, line: 81, baseType: !835, size: 64, offset: 2496)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!352, !331, !462, !331, !838}
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !54, line: 285, baseType: !125)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !546, file: !334, line: 82, baseType: !840, size: 64, offset: 2560)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{!352, !331, !325, !843, !843, !750, !845}
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !583)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !546, file: !334, line: 83, baseType: !847, size: 64, offset: 2624)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{!352, !331, !325, !603, !325}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !546, file: !334, line: 84, baseType: !851, size: 64, offset: 2688)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{!352, !331, !325, !552, !325, !552, !461}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !546, file: !334, line: 85, baseType: !855, size: 64, offset: 2752)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!352, !331, !331, !838}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !546, file: !334, line: 87, baseType: !859, size: 64, offset: 2816)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!352, !331, !566, !324}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !546, file: !334, line: 88, baseType: !863, size: 64, offset: 2880)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{!352, !331, !462}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !546, file: !334, line: 89, baseType: !863, size: 64, offset: 2944)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !546, file: !334, line: 90, baseType: !868, size: 64, offset: 3008)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!352, !331, !566, !556}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !546, file: !334, line: 91, baseType: !801, size: 64, offset: 3072)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !546, file: !334, line: 93, baseType: !873, size: 64, offset: 3136)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{!352, !331, !876}
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !6, line: 523, baseType: !877)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !6, line: 523, flags: DIFlagFwdDecl)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !546, file: !334, line: 94, baseType: !880, size: 64, offset: 3200)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DISubroutineType(types: !882)
!882 = !{!352, !331, !325, !514, !514, !324, !597, !597, !613}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !546, file: !334, line: 95, baseType: !880, size: 64, offset: 3264)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !546, file: !334, line: 96, baseType: !880, size: 64, offset: 3328)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !546, file: !334, line: 97, baseType: !880, size: 64, offset: 3392)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !546, file: !334, line: 99, baseType: !887, size: 64, offset: 3456)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{!352, !331, !890, !906}
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !584, line: 51, baseType: !891)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !48, line: 91, size: 384, elements: !893)
!893 = !{!894, !895, !896, !897, !898, !902, !903, !905}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !892, file: !48, line: 92, baseType: !325, size: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !892, file: !48, line: 93, baseType: !325, size: 32, offset: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "is", scope: !892, file: !48, line: 94, baseType: !603, size: 64, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !892, file: !48, line: 95, baseType: !356, size: 64, offset: 128)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !892, file: !48, line: 96, baseType: !899, size: 64, offset: 192)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !43, line: 215, baseType: !901)
!901 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !892, file: !48, line: 97, baseType: !325, size: 32, offset: 256)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !892, file: !48, line: 98, baseType: !904, size: 32, offset: 288)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !43, line: 213, baseType: !131)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !892, file: !48, line: 99, baseType: !514, size: 32, offset: 320)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !54, line: 1378, baseType: !907)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !334, line: 609, size: 6208, elements: !909)
!909 = !{!910, !911, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !930, !937, !938, !939, !940, !941, !942, !943, !944, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !908, file: !334, line: 610, baseType: !337, size: 4480)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !908, file: !334, line: 610, baseType: !912, size: 32, offset: 4480)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 32, elements: !396)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !908, file: !334, line: 611, baseType: !325, size: 32, offset: 4512)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !908, file: !334, line: 611, baseType: !325, size: 32, offset: 4544)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !908, file: !334, line: 611, baseType: !325, size: 32, offset: 4576)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !908, file: !334, line: 612, baseType: !325, size: 32, offset: 4608)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !908, file: !334, line: 613, baseType: !325, size: 32, offset: 4640)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !908, file: !334, line: 614, baseType: !324, size: 64, offset: 4672)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !908, file: !334, line: 615, baseType: !446, size: 64, offset: 4736)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !908, file: !334, line: 616, baseType: !603, size: 64, offset: 4800)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !908, file: !334, line: 617, baseType: !324, size: 64, offset: 4864)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !908, file: !334, line: 618, baseType: !923, size: 64, offset: 4928)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !334, line: 602, baseType: !925)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !334, line: 598, size: 128, elements: !926)
!926 = !{!927, !928, !929}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !925, file: !334, line: 599, baseType: !325, size: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !925, file: !334, line: 600, baseType: !325, size: 32, offset: 32)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !925, file: !334, line: 601, baseType: !461, size: 64, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !908, file: !334, line: 619, baseType: !931, size: 64, offset: 4992)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !334, line: 607, baseType: !933)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !334, line: 604, size: 128, elements: !934)
!934 = !{!935, !936}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !933, file: !334, line: 605, baseType: !325, size: 32)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !933, file: !334, line: 606, baseType: !461, size: 64, offset: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !908, file: !334, line: 620, baseType: !461, size: 64, offset: 5056)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !908, file: !334, line: 621, baseType: !453, size: 64, offset: 5120)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !908, file: !334, line: 622, baseType: !453, size: 64, offset: 5184)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !908, file: !334, line: 623, baseType: !566, size: 64, offset: 5248)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !908, file: !334, line: 623, baseType: !566, size: 64, offset: 5312)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !908, file: !334, line: 623, baseType: !566, size: 64, offset: 5376)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !908, file: !334, line: 624, baseType: !514, size: 32, offset: 5440)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !908, file: !334, line: 625, baseType: !945, size: 64, offset: 5504)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!352}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !908, file: !334, line: 626, baseType: !436, size: 64, offset: 5568)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !908, file: !334, line: 627, baseType: !566, size: 64, offset: 5632)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !908, file: !334, line: 628, baseType: !325, size: 32, offset: 5696)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !908, file: !334, line: 629, baseType: !377, size: 64, offset: 5760)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !908, file: !334, line: 630, baseType: !904, size: 32, offset: 5824)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !908, file: !334, line: 631, baseType: !325, size: 32, offset: 5856)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !908, file: !334, line: 631, baseType: !325, size: 32, offset: 5888)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !908, file: !334, line: 632, baseType: !514, size: 32, offset: 5920)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !908, file: !334, line: 633, baseType: !514, size: 32, offset: 5952)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !908, file: !334, line: 634, baseType: !388, size: 64, offset: 6016)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !908, file: !334, line: 634, baseType: !436, size: 64, offset: 6080)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !908, file: !334, line: 635, baseType: !407, size: 64, offset: 6144)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !546, file: !334, line: 100, baseType: !961, size: 64, offset: 3520)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!352, !331, !325, !325, !899, !964}
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !546, file: !334, line: 101, baseType: !797, size: 64, offset: 3584)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !546, file: !334, line: 102, baseType: !967, size: 64, offset: 3648)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!352, !331, !583, !583, !751}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !546, file: !334, line: 103, baseType: !549, size: 64, offset: 3712)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !546, file: !334, line: 105, baseType: !972, size: 64, offset: 3776)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!352, !331, !583, !583, !750, !751}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !546, file: !334, line: 106, baseType: !797, size: 64, offset: 3840)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !546, file: !334, line: 107, baseType: !977, size: 64, offset: 3904)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!352, !331, !364}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !546, file: !334, line: 108, baseType: !981, size: 64, offset: 3968)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!352, !331, !984, !750, !751}
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !54, line: 25, baseType: !377)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !546, file: !334, line: 109, baseType: !945, size: 64, offset: 4032)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !546, file: !334, line: 111, baseType: !987, size: 64, offset: 4096)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!352, !331, !331, !331, !453, !331}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !546, file: !334, line: 112, baseType: !991, size: 64, offset: 4160)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!352, !331, !331, !331, !331}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !546, file: !334, line: 113, baseType: !995, size: 64, offset: 4224)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!352, !331, !670, !670}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !546, file: !334, line: 114, baseType: !549, size: 64, offset: 4288)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !546, file: !334, line: 115, baseType: !801, size: 64, offset: 4352)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !546, file: !334, line: 117, baseType: !859, size: 64, offset: 4416)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !546, file: !334, line: 118, baseType: !859, size: 64, offset: 4480)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !546, file: !334, line: 119, baseType: !981, size: 64, offset: 4544)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !546, file: !334, line: 120, baseType: !1004, size: 64, offset: 4608)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!352, !331, !1007, !613}
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !54, line: 1675, baseType: !135)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !546, file: !334, line: 121, baseType: !945, size: 64, offset: 4672)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !546, file: !334, line: 123, baseType: !1010, size: 64, offset: 4736)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!352, !331, !325, !436}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !546, file: !334, line: 124, baseType: !1014, size: 64, offset: 4800)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!352, !331, !906, !566, !436}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !546, file: !334, line: 125, baseType: !1018, size: 64, offset: 4864)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!352, !490, !331}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !546, file: !334, line: 126, baseType: !563, size: 64, offset: 4928)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !546, file: !334, line: 127, baseType: !563, size: 64, offset: 4992)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !546, file: !334, line: 129, baseType: !1024, size: 64, offset: 5056)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!352, !331, !603}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !546, file: !334, line: 130, baseType: !1028, size: 64, offset: 5120)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!352, !331, !1031, !1031}
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !78, line: 654, baseType: !1032)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !78, line: 653, size: 128, elements: !1034)
!1034 = !{!1035, !1036}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1033, file: !78, line: 653, baseType: !325, size: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1033, file: !78, line: 653, baseType: !566, size: 64, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !546, file: !334, line: 131, baseType: !1028, size: 64, offset: 5184)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !546, file: !334, line: 132, baseType: !1039, size: 64, offset: 5248)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!352, !331, !324, !324, !324}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !546, file: !334, line: 133, baseType: !977, size: 64, offset: 5312)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !546, file: !334, line: 135, baseType: !1044, size: 64, offset: 5376)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!352, !331, !453, !613}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !546, file: !334, line: 136, baseType: !1044, size: 64, offset: 5440)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !546, file: !334, line: 137, baseType: !1049, size: 64, offset: 5504)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!352, !331, !613}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !546, file: !334, line: 138, baseType: !549, size: 64, offset: 5568)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !546, file: !334, line: 139, baseType: !1054, size: 64, offset: 5632)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!352, !331, !1057, !1057}
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !546, file: !334, line: 141, baseType: !945, size: 64, offset: 5696)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !546, file: !334, line: 142, baseType: !1060, size: 64, offset: 5760)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!352, !331, !331, !453, !331}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !546, file: !334, line: 143, baseType: !1064, size: 64, offset: 5824)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!352, !331, !331, !331}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !546, file: !334, line: 144, baseType: !945, size: 64, offset: 5888)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !546, file: !334, line: 145, baseType: !1060, size: 64, offset: 5952)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !546, file: !334, line: 147, baseType: !1064, size: 64, offset: 6016)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !546, file: !334, line: 148, baseType: !945, size: 64, offset: 6080)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !546, file: !334, line: 149, baseType: !1060, size: 64, offset: 6144)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !546, file: !334, line: 150, baseType: !1064, size: 64, offset: 6208)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !546, file: !334, line: 151, baseType: !1074, size: 64, offset: 6272)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!352, !331, !514}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !546, file: !334, line: 153, baseType: !797, size: 64, offset: 6336)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !546, file: !334, line: 154, baseType: !797, size: 64, offset: 6400)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !546, file: !334, line: 155, baseType: !797, size: 64, offset: 6464)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !546, file: !334, line: 156, baseType: !797, size: 64, offset: 6528)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !546, file: !334, line: 157, baseType: !977, size: 64, offset: 6592)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !546, file: !334, line: 159, baseType: !1083, size: 64, offset: 6656)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!352, !331, !325, !554}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !546, file: !334, line: 160, baseType: !797, size: 64, offset: 6720)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !546, file: !334, line: 161, baseType: !797, size: 64, offset: 6784)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !546, file: !334, line: 162, baseType: !797, size: 64, offset: 6848)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !546, file: !334, line: 163, baseType: !797, size: 64, offset: 6912)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !546, file: !334, line: 165, baseType: !1064, size: 64, offset: 6976)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !546, file: !334, line: 166, baseType: !1064, size: 64, offset: 7040)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !546, file: !334, line: 167, baseType: !859, size: 64, offset: 7104)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !546, file: !334, line: 168, baseType: !1094, size: 64, offset: 7168)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{!352, !331, !566, !325}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !546, file: !334, line: 169, baseType: !1098, size: 64, offset: 7232)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!352, !331, !613, !324}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !546, file: !334, line: 171, baseType: !821, size: 64, offset: 7296)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !546, file: !334, line: 172, baseType: !797, size: 64, offset: 7360)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !546, file: !334, line: 173, baseType: !1104, size: 64, offset: 7424)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!352, !331, !324, !597}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !546, file: !334, line: 174, baseType: !967, size: 64, offset: 7488)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !546, file: !334, line: 175, baseType: !967, size: 64, offset: 7552)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !546, file: !334, line: 177, baseType: !563, size: 64, offset: 7616)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !546, file: !334, line: 178, baseType: !747, size: 64, offset: 7680)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !546, file: !334, line: 179, baseType: !563, size: 64, offset: 7744)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !546, file: !334, line: 180, baseType: !570, size: 64, offset: 7808)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !546, file: !334, line: 181, baseType: !1114, size: 64, offset: 7872)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!352, !331, !356, !750, !751}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !546, file: !334, line: 183, baseType: !1024, size: 64, offset: 7936)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !546, file: !334, line: 184, baseType: !781, size: 64, offset: 8000)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !546, file: !334, line: 185, baseType: !1120, size: 64, offset: 8064)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{!352, !331, !1123}
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !546, file: !334, line: 186, baseType: !1125, size: 64, offset: 8128)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!352, !331, !325, !552, !461}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !546, file: !334, line: 187, baseType: !840, size: 64, offset: 8192)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !546, file: !334, line: 189, baseType: !1130, size: 64, offset: 8256)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!352, !331, !325, !325, !324, !554}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !546, file: !334, line: 190, baseType: !945, size: 64, offset: 8320)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !546, file: !334, line: 191, baseType: !1060, size: 64, offset: 8384)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !546, file: !334, line: 192, baseType: !1064, size: 64, offset: 8448)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !546, file: !334, line: 193, baseType: !1137, size: 64, offset: 8512)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!352, !331, !890, !1140}
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !54, line: 1401, baseType: !1141)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !334, line: 660, size: 5312, elements: !1143)
!1143 = !{!1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1142, file: !334, line: 661, baseType: !337, size: 4480)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1142, file: !334, line: 661, baseType: !912, size: 32, offset: 4480)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1142, file: !334, line: 662, baseType: !325, size: 32, offset: 4512)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1142, file: !334, line: 662, baseType: !325, size: 32, offset: 4544)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1142, file: !334, line: 662, baseType: !325, size: 32, offset: 4576)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1142, file: !334, line: 663, baseType: !325, size: 32, offset: 4608)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1142, file: !334, line: 664, baseType: !325, size: 32, offset: 4640)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1142, file: !334, line: 665, baseType: !324, size: 64, offset: 4672)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1142, file: !334, line: 666, baseType: !324, size: 64, offset: 4736)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1142, file: !334, line: 667, baseType: !325, size: 32, offset: 4800)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1142, file: !334, line: 668, baseType: !904, size: 32, offset: 4832)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1142, file: !334, line: 670, baseType: !324, size: 64, offset: 4864)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1142, file: !334, line: 670, baseType: !324, size: 64, offset: 4928)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1142, file: !334, line: 671, baseType: !324, size: 64, offset: 4992)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1142, file: !334, line: 672, baseType: !324, size: 64, offset: 5056)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1142, file: !334, line: 673, baseType: !324, size: 64, offset: 5120)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1142, file: !334, line: 674, baseType: !325, size: 32, offset: 5184)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1142, file: !334, line: 675, baseType: !324, size: 64, offset: 5248)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !546, file: !334, line: 195, baseType: !1163, size: 64, offset: 8576)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = !DISubroutineType(types: !1165)
!1165 = !{!352, !1140, !331, !331}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !546, file: !334, line: 196, baseType: !1163, size: 64, offset: 8640)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !546, file: !334, line: 197, baseType: !945, size: 64, offset: 8704)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !546, file: !334, line: 198, baseType: !1060, size: 64, offset: 8768)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !546, file: !334, line: 199, baseType: !1064, size: 64, offset: 8832)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !546, file: !334, line: 201, baseType: !1171, size: 64, offset: 8896)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{!352, !331, !325, !325}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !546, file: !334, line: 202, baseType: !835, size: 64, offset: 8960)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !546, file: !334, line: 203, baseType: !570, size: 64, offset: 9024)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !546, file: !334, line: 204, baseType: !887, size: 64, offset: 9088)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !546, file: !334, line: 205, baseType: !1024, size: 64, offset: 9152)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !546, file: !334, line: 206, baseType: !1179, size: 64, offset: 9216)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64)
!1180 = !DISubroutineType(types: !1181)
!1181 = !{!352, !356, !331, !325, !750, !751}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !546, file: !334, line: 208, baseType: !1183, size: 64, offset: 9280)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{!352, !325, !845}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !546, file: !334, line: 209, baseType: !1064, size: 64, offset: 9344)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !546, file: !334, line: 210, baseType: !851, size: 64, offset: 9408)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !333, file: !334, line: 438, baseType: !655, size: 64, offset: 13952)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !333, file: !334, line: 438, baseType: !655, size: 64, offset: 14016)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !333, file: !334, line: 439, baseType: !436, size: 64, offset: 14080)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !333, file: !334, line: 440, baseType: !1192, size: 32, offset: 14144)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !54, line: 161, baseType: !280)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !333, file: !334, line: 441, baseType: !514, size: 32, offset: 14176)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !333, file: !334, line: 442, baseType: !514, size: 32, offset: 14208)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !333, file: !334, line: 443, baseType: !1196, size: 448, offset: 14272)
!1196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1197, size: 448, elements: !1198)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !54, line: 1159, baseType: !377)
!1198 = !{!1199}
!1199 = !DISubrange(count: 7)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !333, file: !334, line: 444, baseType: !514, size: 32, offset: 14720)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !333, file: !334, line: 445, baseType: !514, size: 32, offset: 14752)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !333, file: !334, line: 446, baseType: !325, size: 32, offset: 14784)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !333, file: !334, line: 447, baseType: !438, size: 64, offset: 14848)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !333, file: !334, line: 448, baseType: !438, size: 64, offset: 14912)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !333, file: !334, line: 449, baseType: !758, size: 640, offset: 14976)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !333, file: !334, line: 450, baseType: !556, size: 32, offset: 15616)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !333, file: !334, line: 451, baseType: !1208, size: 2880, offset: 15680)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !334, line: 318, baseType: !1209)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !334, line: 319, size: 2880, elements: !1210)
!1210 = !{!1211, !1212, !1213, !1214, !1215, !1216, !1217, !1230, !1231, !1236, !1241, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1256, !1257, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1289, !1290, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1313, !1314, !1315, !1319, !1320}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1209, file: !334, line: 320, baseType: !325, size: 32)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1209, file: !334, line: 321, baseType: !325, size: 32, offset: 32)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1209, file: !334, line: 322, baseType: !325, size: 32, offset: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1209, file: !334, line: 323, baseType: !325, size: 32, offset: 96)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1209, file: !334, line: 324, baseType: !325, size: 32, offset: 128)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1209, file: !334, line: 325, baseType: !325, size: 32, offset: 160)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1209, file: !334, line: 326, baseType: !1218, size: 64, offset: 192)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !334, line: 293, baseType: !1219)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !334, line: 295, size: 448, elements: !1221)
!1221 = !{!1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1220, file: !334, line: 296, baseType: !1218, size: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1220, file: !334, line: 297, baseType: !461, size: 64, offset: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1220, file: !334, line: 297, baseType: !461, size: 64, offset: 128)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1220, file: !334, line: 298, baseType: !324, size: 64, offset: 192)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1220, file: !334, line: 298, baseType: !324, size: 64, offset: 256)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1220, file: !334, line: 299, baseType: !325, size: 32, offset: 320)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1220, file: !334, line: 300, baseType: !325, size: 32, offset: 352)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1220, file: !334, line: 301, baseType: !325, size: 32, offset: 384)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1209, file: !334, line: 326, baseType: !1218, size: 64, offset: 256)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1209, file: !334, line: 328, baseType: !1232, size: 64, offset: 320)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = !DISubroutineType(types: !1234)
!1234 = !{!352, !331, !1235, !324}
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
