; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/leastsquares/impls/brgn/ftn-custom/zbrgnf.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/tao/leastsquares/impls/brgn/ftn-custom/zbrgnf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ompi_predefined_communicator_t = type opaque
%struct.anon = type { i32, i32 }
%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }

!4 = !{!5, !11, !26, !43, !48, !54}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 170, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 81, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!14 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!24 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!25 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 181, baseType: !28, size: 32, elements: !29)
!27 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctao.h", directory: "/home/users/ndemeye/xSDK")
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!30 = !DIEnumerator(name: "TAO_CONVERGED_GATOL", value: 3)
!31 = !DIEnumerator(name: "TAO_CONVERGED_GRTOL", value: 4)
!32 = !DIEnumerator(name: "TAO_CONVERGED_GTTOL", value: 5)
!33 = !DIEnumerator(name: "TAO_CONVERGED_STEPTOL", value: 6)
!34 = !DIEnumerator(name: "TAO_CONVERGED_MINF", value: 7)
!35 = !DIEnumerator(name: "TAO_CONVERGED_USER", value: 8)
!36 = !DIEnumerator(name: "TAO_DIVERGED_MAXITS", value: -2)
!37 = !DIEnumerator(name: "TAO_DIVERGED_NAN", value: -4)
!38 = !DIEnumerator(name: "TAO_DIVERGED_MAXFCN", value: -5)
!39 = !DIEnumerator(name: "TAO_DIVERGED_LS_FAILURE", value: -6)
!40 = !DIEnumerator(name: "TAO_DIVERGED_TR_REDUCTION", value: -7)
!41 = !DIEnumerator(name: "TAO_DIVERGED_USER", value: -8)
!42 = !DIEnumerator(name: "TAO_CONTINUE_ITERATING", value: 0)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 26, baseType: !7, size: 32, elements: !44)
!44 = !{!45, !46, !47}
!45 = !DIEnumerator(name: "TAO_SUBSET_SUBVEC", value: 0, isUnsigned: true)
!46 = !DIEnumerator(name: "TAO_SUBSET_MASK", value: 1, isUnsigned: true)
!47 = !DIEnumerator(name: "TAO_SUBSET_MATRIXFREE", value: 2, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !49, line: 663, baseType: !7, size: 32, elements: !50)
!49 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!50 = !{!51, !52, !53}
!51 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!52 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !55, line: 55, baseType: !7, size: 32, elements: !56)
!55 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!56 = !{!57, !58, !59}
!57 = !DIEnumerator(name: "PETSC_FORTRAN_CALLBACK_CLASS", value: 0, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_FORTRAN_CALLBACK_SUBTYPE", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_FORTRAN_CALLBACK_MAXTYPE", value: 2, isUnsigned: true)
!60 = !{!61, !64, !67, !68, !69, !73, !271, !273, !107}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{null}
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !65, line: 100, baseType: !66)
!65 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!66 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !70, line: 330, baseType: !71)
!70 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !70, line: 330, flags: DIFlagFwdDecl)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !6, line: 430, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !55, line: 73, size: 4480, elements: !76)
!76 = !{!77, !79, !125, !126, !128, !131, !132, !133, !134, !142, !143, !145, !149, !153, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !166, !167, !168, !170, !171, !173, !175, !176, !177, !178, !179, !182, !184, !185, !186, !187, !188, !191, !193, !194, !195, !205, !207, !208, !212, !213, !261, !266, !268, !269, !270}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !75, file: !55, line: 74, baseType: !78, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !6, line: 32, baseType: !28)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !75, file: !55, line: 75, baseType: !80, size: 448, offset: 64)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 448, elements: !123)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !55, line: 53, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 45, size: 448, elements: !83)
!83 = !{!84, !90, !98, !103, !110, !114, !118}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !82, file: !55, line: 46, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{!88, !73, !89}
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !6, line: 14, baseType: !28)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !82, file: !55, line: 47, baseType: !91, size: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!88, !73, !94}
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !95, line: 16, baseType: !96)
!95 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !95, line: 16, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !82, file: !55, line: 48, baseType: !99, size: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!88, !102}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !82, file: !55, line: 49, baseType: !104, size: 64, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!88, !73, !107, !73}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!109 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !82, file: !55, line: 50, baseType: !111, size: 64, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!88, !73, !107, !102}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !82, file: !55, line: 51, baseType: !115, size: 64, offset: 320)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!88, !73, !107, !61}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !82, file: !55, line: 52, baseType: !119, size: 64, offset: 384)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!88, !73, !107, !122}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!123 = !{!124}
!124 = !DISubrange(count: 1)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !75, file: !55, line: 76, baseType: !69, size: 64, offset: 512)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !75, file: !55, line: 77, baseType: !127, size: 32, offset: 576)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !6, line: 102, baseType: !28)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !75, file: !55, line: 78, baseType: !129, size: 64, offset: 640)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !6, line: 360, baseType: !130)
!130 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !75, file: !55, line: 78, baseType: !129, size: 64, offset: 704)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !75, file: !55, line: 78, baseType: !129, size: 64, offset: 768)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !75, file: !55, line: 78, baseType: !129, size: 64, offset: 832)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !75, file: !55, line: 79, baseType: !135, size: 64, offset: 896)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !6, line: 442, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !6, line: 90, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !138, line: 27, baseType: !139)
!138 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !140, line: 43, baseType: !141)
!140 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!141 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !75, file: !55, line: 80, baseType: !127, size: 32, offset: 960)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !75, file: !55, line: 81, baseType: !144, size: 32, offset: 992)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !6, line: 49, baseType: !28)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !75, file: !55, line: 82, baseType: !146, size: 64, offset: 1024)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !6, line: 465, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !6, line: 465, flags: DIFlagFwdDecl)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !75, file: !55, line: 83, baseType: !150, size: 64, offset: 1088)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !6, line: 496, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !6, line: 496, flags: DIFlagFwdDecl)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !75, file: !55, line: 84, baseType: !154, size: 64, offset: 1152)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !75, file: !55, line: 85, baseType: !154, size: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !75, file: !55, line: 86, baseType: !154, size: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !75, file: !55, line: 87, baseType: !154, size: 64, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !75, file: !55, line: 88, baseType: !73, size: 64, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !75, file: !55, line: 89, baseType: !135, size: 64, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !75, file: !55, line: 90, baseType: !154, size: 64, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !75, file: !55, line: 91, baseType: !154, size: 64, offset: 1600)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !75, file: !55, line: 92, baseType: !127, size: 32, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !75, file: !55, line: 93, baseType: !68, size: 64, offset: 1728)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !75, file: !55, line: 94, baseType: !165, size: 64, offset: 1792)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !6, line: 455, baseType: !136)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !75, file: !55, line: 95, baseType: !127, size: 32, offset: 1856)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !75, file: !55, line: 95, baseType: !127, size: 32, offset: 1888)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !75, file: !55, line: 96, baseType: !169, size: 64, offset: 1920)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !75, file: !55, line: 96, baseType: !169, size: 64, offset: 1984)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !75, file: !55, line: 97, baseType: !172, size: 64, offset: 2048)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !75, file: !55, line: 97, baseType: !174, size: 64, offset: 2112)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !75, file: !55, line: 98, baseType: !127, size: 32, offset: 2176)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !75, file: !55, line: 98, baseType: !127, size: 32, offset: 2208)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !75, file: !55, line: 99, baseType: !169, size: 64, offset: 2240)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !75, file: !55, line: 99, baseType: !169, size: 64, offset: 2304)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !75, file: !55, line: 100, baseType: !180, size: 64, offset: 2368)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !6, line: 189, baseType: !130)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !75, file: !55, line: 100, baseType: !183, size: 64, offset: 2432)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !75, file: !55, line: 101, baseType: !127, size: 32, offset: 2496)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !75, file: !55, line: 101, baseType: !127, size: 32, offset: 2528)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !75, file: !55, line: 102, baseType: !169, size: 64, offset: 2560)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !75, file: !55, line: 102, baseType: !169, size: 64, offset: 2624)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !75, file: !55, line: 103, baseType: !189, size: 64, offset: 2688)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !6, line: 305, baseType: !181)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !75, file: !55, line: 103, baseType: !192, size: 64, offset: 2752)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !75, file: !55, line: 104, baseType: !122, size: 64, offset: 2816)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !75, file: !55, line: 105, baseType: !127, size: 32, offset: 2880)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !75, file: !55, line: 106, baseType: !196, size: 128, offset: 2944)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 128, elements: !203)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !55, line: 64, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 61, size: 128, elements: !200)
!200 = !{!201, !202}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !199, file: !55, line: 62, baseType: !61, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !199, file: !55, line: 63, baseType: !68, size: 64, offset: 64)
!203 = !{!204}
!204 = !DISubrange(count: 2)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !75, file: !55, line: 107, baseType: !206, size: 64, offset: 3072)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 64, elements: !203)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !75, file: !55, line: 108, baseType: !68, size: 64, offset: 3136)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !75, file: !55, line: 109, baseType: !209, size: 64, offset: 3200)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!88, !68}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !75, file: !55, line: 111, baseType: !127, size: 32, offset: 3264)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !75, file: !55, line: 112, baseType: !214, size: 320, offset: 3328)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 320, elements: !259)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!88, !218, !73, !68}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !12, line: 108, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !12, line: 99, size: 640, elements: !221)
!221 = !{!222, !223, !247, !248, !249, !250, !251, !252, !253, !254, !255}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !220, file: !12, line: 100, baseType: !127, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !220, file: !12, line: 101, baseType: !224, size: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !12, line: 82, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !12, line: 83, size: 768, elements: !227)
!227 = !{!228, !229, !230, !231, !232, !235, !236, !237, !240, !242, !244, !245, !246}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !226, file: !12, line: 84, baseType: !154, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !226, file: !12, line: 85, baseType: !154, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !226, file: !12, line: 86, baseType: !68, size: 64, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !226, file: !12, line: 87, baseType: !146, size: 64, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !226, file: !12, line: 88, baseType: !233, size: 64, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !226, file: !12, line: 89, baseType: !109, size: 8, offset: 320)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !226, file: !12, line: 90, baseType: !154, size: 64, offset: 384)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !226, file: !12, line: 91, baseType: !238, size: 64, offset: 448)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !239, line: 46, baseType: !66)
!239 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!240 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !226, file: !12, line: 92, baseType: !241, size: 32, offset: 512)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !6, line: 170, baseType: !5)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !226, file: !12, line: 93, baseType: !243, size: 32, offset: 544)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !12, line: 81, baseType: !11)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !226, file: !12, line: 94, baseType: !224, size: 64, offset: 576)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !226, file: !12, line: 95, baseType: !154, size: 64, offset: 640)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !226, file: !12, line: 96, baseType: !68, size: 64, offset: 704)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !220, file: !12, line: 102, baseType: !154, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !220, file: !12, line: 102, baseType: !154, size: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !220, file: !12, line: 103, baseType: !154, size: 64, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !220, file: !12, line: 104, baseType: !69, size: 64, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !220, file: !12, line: 105, baseType: !241, size: 32, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !220, file: !12, line: 105, baseType: !241, size: 32, offset: 416)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !220, file: !12, line: 105, baseType: !241, size: 32, offset: 448)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !220, file: !12, line: 106, baseType: !73, size: 64, offset: 512)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !220, file: !12, line: 107, baseType: !256, size: 64, offset: 576)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !12, line: 10, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !12, line: 10, flags: DIFlagFwdDecl)
!259 = !{!260}
!260 = !DISubrange(count: 5)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !75, file: !55, line: 113, baseType: !262, size: 320, offset: 3648)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 320, elements: !259)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!88, !73, !68}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !75, file: !55, line: 114, baseType: !267, size: 320, offset: 3968)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 320, elements: !259)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !75, file: !55, line: 115, baseType: !241, size: 32, offset: 4288)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !75, file: !55, line: 120, baseType: !256, size: 64, offset: 4352)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !75, file: !55, line: 121, baseType: !241, size: 32, offset: 4416)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscVoidFunction", file: !272, line: 1451, baseType: !61)
!272 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsys.h", directory: "/home/users/ndemeye/xSDK")
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!274 = !{!0}
!275 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/tao/leastsquares/impls/brgn/ftn-custom/zbrgnf.c", directory: "/home/users/ndemeye/xSDK")
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !275, line: 13, size: 64, elements: !277)
!277 = !{!278, !280}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "objgrad", scope: !276, file: !275, line: 14, baseType: !279, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallbackId", file: !55, line: 56, baseType: !28)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "hess", scope: !276, file: !275, line: 15, baseType: !279, size: 32, offset: 32)
!281 = !{i32 7, !"Dwarf Version", i32 4}
!282 = !{i32 2, !"Debug Info Version", i32 3}
!283 = !{i32 1, !"wchar_size", i32 4}
!284 = !{i32 7, !"PIC Level", i32 2}
!285 = !{i32 7, !"uwtable", i32 1}
!286 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!287 = distinct !DISubprogram(name: "taobrgnsetregularizerobjectiveandgradientroutine_", scope: !275, file: !275, line: 28, type: !288, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !528)
!288 = !DISubroutineType(types: !289)
!289 = !{null, !290, !523, !68, !527}
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tao", file: !27, line: 118, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Tao", file: !294, line: 45, size: 14656, elements: !295)
!294 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/taoimpl.h", directory: "/home/users/ndemeye/xSDK")
!295 = !{!296, !298, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !391, !396, !398, !399, !400, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !475, !476, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !515, !516, !517, !518, !519, !520, !521, !522}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !293, file: !294, line: 46, baseType: !297, size: 4480)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !55, line: 122, baseType: !75)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !293, file: !294, line: 46, baseType: !299, size: 1536, offset: 4480)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 1536, elements: !123)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TaoOps", file: !294, line: 13, size: 1536, elements: !301)
!301 = !{!302, !310, !314, !318, !326, !327, !328, !329, !330, !331, !332, !336, !340, !341, !342, !343, !347, !351, !352, !356, !360, !361, !365, !369}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjective", scope: !300, file: !294, line: 15, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DISubroutineType(types: !305)
!305 = !{!88, !291, !306, !180, !68}
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !307, line: 21, baseType: !308)
!307 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !307, line: 21, flags: DIFlagFwdDecl)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "computeobjectiveandgradient", scope: !300, file: !294, line: 16, baseType: !311, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!88, !291, !306, !180, !306, !68}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "computegradient", scope: !300, file: !294, line: 17, baseType: !315, size: 64, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!88, !291, !306, !306, !68}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "computehessian", scope: !300, file: !294, line: 18, baseType: !319, size: 64, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!88, !291, !306, !322, !322, !68}
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !323, line: 16, baseType: !324)
!323 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !323, line: 16, flags: DIFlagFwdDecl)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidual", scope: !300, file: !294, line: 19, baseType: !315, size: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "computeresidualjacobian", scope: !300, file: !294, line: 20, baseType: !319, size: 64, offset: 320)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "computeconstraints", scope: !300, file: !294, line: 21, baseType: !315, size: 64, offset: 384)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "computeinequalityconstraints", scope: !300, file: !294, line: 22, baseType: !315, size: 64, offset: 448)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "computeequalityconstraints", scope: !300, file: !294, line: 23, baseType: !315, size: 64, offset: 512)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobian", scope: !300, file: !294, line: 24, baseType: !319, size: 64, offset: 576)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianstate", scope: !300, file: !294, line: 25, baseType: !333, size: 64, offset: 640)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!88, !291, !306, !322, !322, !322, !68}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobiandesign", scope: !300, file: !294, line: 26, baseType: !337, size: 64, offset: 704)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!88, !291, !306, !322, !68}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianinequality", scope: !300, file: !294, line: 27, baseType: !319, size: 64, offset: 768)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "computejacobianequality", scope: !300, file: !294, line: 28, baseType: !319, size: 64, offset: 832)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "computebounds", scope: !300, file: !294, line: 29, baseType: !315, size: 64, offset: 896)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !300, file: !294, line: 30, baseType: !344, size: 64, offset: 960)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!88, !291, !127, !68}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "convergencetest", scope: !300, file: !294, line: 31, baseType: !348, size: 64, offset: 1024)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!88, !291, !68}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "convergencedestroy", scope: !300, file: !294, line: 32, baseType: !209, size: 64, offset: 1088)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "computedual", scope: !300, file: !294, line: 35, baseType: !353, size: 64, offset: 1152)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!88, !291, !306, !306}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !300, file: !294, line: 36, baseType: !357, size: 64, offset: 1216)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!88, !291}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !300, file: !294, line: 37, baseType: !357, size: 64, offset: 1280)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !300, file: !294, line: 38, baseType: !362, size: 64, offset: 1344)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!88, !291, !94}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !300, file: !294, line: 39, baseType: !366, size: 64, offset: 1408)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!88, !218, !291}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !300, file: !294, line: 40, baseType: !357, size: 64, offset: 1472)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !293, file: !294, line: 47, baseType: !68, size: 64, offset: 6016)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "user_objP", scope: !293, file: !294, line: 48, baseType: !68, size: 64, offset: 6080)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "user_objgradP", scope: !293, file: !294, line: 49, baseType: !68, size: 64, offset: 6144)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "user_gradP", scope: !293, file: !294, line: 50, baseType: !68, size: 64, offset: 6208)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "user_hessP", scope: !293, file: !294, line: 51, baseType: !68, size: 64, offset: 6272)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsresP", scope: !293, file: !294, line: 52, baseType: !68, size: 64, offset: 6336)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "user_lsjacP", scope: !293, file: !294, line: 53, baseType: !68, size: 64, offset: 6400)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "user_conP", scope: !293, file: !294, line: 54, baseType: !68, size: 64, offset: 6464)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_equalityP", scope: !293, file: !294, line: 55, baseType: !68, size: 64, offset: 6528)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "user_con_inequalityP", scope: !293, file: !294, line: 56, baseType: !68, size: 64, offset: 6592)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "user_jacP", scope: !293, file: !294, line: 57, baseType: !68, size: 64, offset: 6656)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_equalityP", scope: !293, file: !294, line: 58, baseType: !68, size: 64, offset: 6720)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_inequalityP", scope: !293, file: !294, line: 59, baseType: !68, size: 64, offset: 6784)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_stateP", scope: !293, file: !294, line: 60, baseType: !68, size: 64, offset: 6848)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "user_jac_designP", scope: !293, file: !294, line: 61, baseType: !68, size: 64, offset: 6912)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "user_boundsP", scope: !293, file: !294, line: 62, baseType: !68, size: 64, offset: 6976)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "user_update", scope: !293, file: !294, line: 63, baseType: !68, size: 64, offset: 7040)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !293, file: !294, line: 65, baseType: !388, size: 640, offset: 7104)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 640, elements: !389)
!389 = !{!390}
!390 = !DISubrange(count: 10)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !293, file: !294, line: 66, baseType: !392, size: 640, offset: 7744)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, size: 640, elements: !389)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!88, !67}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !293, file: !294, line: 67, baseType: !397, size: 640, offset: 8384)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 640, elements: !389)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !293, file: !294, line: 68, baseType: !127, size: 32, offset: 9024)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !293, file: !294, line: 69, baseType: !68, size: 64, offset: 9088)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !293, file: !294, line: 70, baseType: !401, size: 32, offset: 9152)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoConvergedReason", file: !27, line: 196, baseType: !26)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !293, file: !294, line: 72, baseType: !241, size: 32, offset: 9184)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !293, file: !294, line: 73, baseType: !68, size: 64, offset: 9216)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "solution", scope: !293, file: !294, line: 75, baseType: !306, size: 64, offset: 9280)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !293, file: !294, line: 76, baseType: !306, size: 64, offset: 9344)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "stepdirection", scope: !293, file: !294, line: 77, baseType: !306, size: 64, offset: 9408)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "XL", scope: !293, file: !294, line: 78, baseType: !306, size: 64, offset: 9472)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "XU", scope: !293, file: !294, line: 79, baseType: !306, size: 64, offset: 9536)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "IL", scope: !293, file: !294, line: 80, baseType: !306, size: 64, offset: 9600)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "IU", scope: !293, file: !294, line: 81, baseType: !306, size: 64, offset: 9664)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "DI", scope: !293, file: !294, line: 82, baseType: !306, size: 64, offset: 9728)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "DE", scope: !293, file: !294, line: 83, baseType: !306, size: 64, offset: 9792)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "hessian", scope: !293, file: !294, line: 84, baseType: !322, size: 64, offset: 9856)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "hessian_pre", scope: !293, file: !294, line: 85, baseType: !322, size: 64, offset: 9920)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm", scope: !293, file: !294, line: 86, baseType: !322, size: 64, offset: 9984)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_norm_tmp", scope: !293, file: !294, line: 87, baseType: !306, size: 64, offset: 10048)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ls_res", scope: !293, file: !294, line: 88, baseType: !306, size: 64, offset: 10112)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac", scope: !293, file: !294, line: 89, baseType: !322, size: 64, offset: 10176)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ls_jac_pre", scope: !293, file: !294, line: 90, baseType: !322, size: 64, offset: 10240)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_v", scope: !293, file: !294, line: 91, baseType: !306, size: 64, offset: 10304)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_n", scope: !293, file: !294, line: 92, baseType: !127, size: 32, offset: 10368)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_rows", scope: !293, file: !294, line: 93, baseType: !172, size: 64, offset: 10432)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_cols", scope: !293, file: !294, line: 94, baseType: !172, size: 64, offset: 10496)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "res_weights_w", scope: !293, file: !294, line: 95, baseType: !180, size: 64, offset: 10560)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !293, file: !294, line: 96, baseType: !306, size: 64, offset: 10624)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_equality", scope: !293, file: !294, line: 97, baseType: !306, size: 64, offset: 10688)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "constraints_inequality", scope: !293, file: !294, line: 98, baseType: !306, size: 64, offset: 10752)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !293, file: !294, line: 99, baseType: !322, size: 64, offset: 10816)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !293, file: !294, line: 100, baseType: !322, size: 64, offset: 10880)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality", scope: !293, file: !294, line: 101, baseType: !322, size: 64, offset: 10944)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_inequality_pre", scope: !293, file: !294, line: 102, baseType: !322, size: 64, offset: 11008)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality", scope: !293, file: !294, line: 103, baseType: !322, size: 64, offset: 11072)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_equality_pre", scope: !293, file: !294, line: 104, baseType: !322, size: 64, offset: 11136)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state", scope: !293, file: !294, line: 105, baseType: !322, size: 64, offset: 11200)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_inv", scope: !293, file: !294, line: 106, baseType: !322, size: 64, offset: 11264)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design", scope: !293, file: !294, line: 107, baseType: !322, size: 64, offset: 11328)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_state_pre", scope: !293, file: !294, line: 108, baseType: !322, size: 64, offset: 11392)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_design_pre", scope: !293, file: !294, line: 109, baseType: !322, size: 64, offset: 11456)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "state_is", scope: !293, file: !294, line: 110, baseType: !440, size: 64, offset: 11520)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !441, line: 11, baseType: !442)
!441 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !441, line: 11, flags: DIFlagFwdDecl)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "design_is", scope: !293, file: !294, line: 111, baseType: !440, size: 64, offset: 11584)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !293, file: !294, line: 112, baseType: !181, size: 64, offset: 11648)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !293, file: !294, line: 113, baseType: !181, size: 64, offset: 11712)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "gnorm0", scope: !293, file: !294, line: 114, baseType: !181, size: 64, offset: 11776)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm", scope: !293, file: !294, line: 115, baseType: !181, size: 64, offset: 11840)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "cnorm0", scope: !293, file: !294, line: 116, baseType: !181, size: 64, offset: 11904)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !293, file: !294, line: 117, baseType: !181, size: 64, offset: 11968)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "max_it", scope: !293, file: !294, line: 119, baseType: !127, size: 32, offset: 12032)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !293, file: !294, line: 120, baseType: !127, size: 32, offset: 12064)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "max_constraints", scope: !293, file: !294, line: 121, baseType: !127, size: 32, offset: 12096)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !293, file: !294, line: 122, baseType: !127, size: 32, offset: 12128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ngrads", scope: !293, file: !294, line: 123, baseType: !127, size: 32, offset: 12160)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncgrads", scope: !293, file: !294, line: 124, baseType: !127, size: 32, offset: 12192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "nhess", scope: !293, file: !294, line: 125, baseType: !127, size: 32, offset: 12224)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "niter", scope: !293, file: !294, line: 126, baseType: !127, size: 32, offset: 12256)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ntotalits", scope: !293, file: !294, line: 127, baseType: !127, size: 32, offset: 12288)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "nconstraints", scope: !293, file: !294, line: 128, baseType: !127, size: 32, offset: 12320)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "niconstraints", scope: !293, file: !294, line: 129, baseType: !127, size: 32, offset: 12352)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "neconstraints", scope: !293, file: !294, line: 130, baseType: !127, size: 32, offset: 12384)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "njac", scope: !293, file: !294, line: 131, baseType: !127, size: 32, offset: 12416)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "njac_equality", scope: !293, file: !294, line: 132, baseType: !127, size: 32, offset: 12448)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "njac_inequality", scope: !293, file: !294, line: 133, baseType: !127, size: 32, offset: 12480)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "njac_state", scope: !293, file: !294, line: 134, baseType: !127, size: 32, offset: 12512)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "njac_design", scope: !293, file: !294, line: 135, baseType: !127, size: 32, offset: 12544)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_its", scope: !293, file: !294, line: 137, baseType: !127, size: 32, offset: 12576)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_tot_its", scope: !293, file: !294, line: 138, baseType: !127, size: 32, offset: 12608)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !293, file: !294, line: 140, baseType: !471, size: 64, offset: 12672)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoLineSearch", file: !472, line: 5, baseType: !473)
!472 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsctaolinesearch.h", directory: "/home/users/ndemeye/xSDK")
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_TaoLineSearch", file: !472, line: 5, flags: DIFlagFwdDecl)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "lsflag", scope: !293, file: !294, line: 141, baseType: !241, size: 32, offset: 12736)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !293, file: !294, line: 142, baseType: !477, size: 64, offset: 12800)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !478, line: 22, baseType: !479)
!478 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !478, line: 22, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "trust0", scope: !293, file: !294, line: 143, baseType: !181, size: 64, offset: 12864)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !293, file: !294, line: 144, baseType: !181, size: 64, offset: 12928)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "gatol", scope: !293, file: !294, line: 146, baseType: !181, size: 64, offset: 12992)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "grtol", scope: !293, file: !294, line: 147, baseType: !181, size: 64, offset: 13056)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "gttol", scope: !293, file: !294, line: 148, baseType: !181, size: 64, offset: 13120)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "catol", scope: !293, file: !294, line: 149, baseType: !181, size: 64, offset: 13184)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "crtol", scope: !293, file: !294, line: 150, baseType: !181, size: 64, offset: 13248)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "steptol", scope: !293, file: !294, line: 151, baseType: !181, size: 64, offset: 13312)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "fmin", scope: !293, file: !294, line: 152, baseType: !181, size: 64, offset: 13376)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs_changed", scope: !293, file: !294, line: 153, baseType: !241, size: 32, offset: 13440)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "max_it_changed", scope: !293, file: !294, line: 154, baseType: !241, size: 32, offset: 13472)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "gatol_changed", scope: !293, file: !294, line: 155, baseType: !241, size: 32, offset: 13504)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "grtol_changed", scope: !293, file: !294, line: 156, baseType: !241, size: 32, offset: 13536)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "gttol_changed", scope: !293, file: !294, line: 157, baseType: !241, size: 32, offset: 13568)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "fmin_changed", scope: !293, file: !294, line: 158, baseType: !241, size: 32, offset: 13600)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "catol_changed", scope: !293, file: !294, line: 159, baseType: !241, size: 32, offset: 13632)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "crtol_changed", scope: !293, file: !294, line: 160, baseType: !241, size: 32, offset: 13664)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "steptol_changed", scope: !293, file: !294, line: 161, baseType: !241, size: 32, offset: 13696)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "trust0_changed", scope: !293, file: !294, line: 162, baseType: !241, size: 32, offset: 13728)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "printreason", scope: !293, file: !294, line: 163, baseType: !241, size: 32, offset: 13760)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "viewsolution", scope: !293, file: !294, line: 164, baseType: !241, size: 32, offset: 13792)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "viewgradient", scope: !293, file: !294, line: 165, baseType: !241, size: 32, offset: 13824)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "viewconstraints", scope: !293, file: !294, line: 166, baseType: !241, size: 32, offset: 13856)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "viewhessian", scope: !293, file: !294, line: 167, baseType: !241, size: 32, offset: 13888)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "viewjacobian", scope: !293, file: !294, line: 168, baseType: !241, size: 32, offset: 13920)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "bounded", scope: !293, file: !294, line: 169, baseType: !241, size: 32, offset: 13952)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "constrained", scope: !293, file: !294, line: 170, baseType: !241, size: 32, offset: 13984)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "eq_constrained", scope: !293, file: !294, line: 171, baseType: !241, size: 32, offset: 14016)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_constrained", scope: !293, file: !294, line: 172, baseType: !241, size: 32, offset: 14048)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ineq_doublesided", scope: !293, file: !294, line: 173, baseType: !241, size: 32, offset: 14080)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "header_printed", scope: !293, file: !294, line: 174, baseType: !241, size: 32, offset: 14112)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "recycle", scope: !293, file: !294, line: 175, baseType: !241, size: 32, offset: 14144)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "subset_type", scope: !293, file: !294, line: 177, baseType: !514, size: 32, offset: 14176)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaoSubsetType", file: !27, line: 26, baseType: !43)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "hist_max", scope: !293, file: !294, line: 178, baseType: !127, size: 32, offset: 14208)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "hist_obj", scope: !293, file: !294, line: 179, baseType: !180, size: 64, offset: 14272)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "hist_resid", scope: !293, file: !294, line: 180, baseType: !180, size: 64, offset: 14336)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "hist_cnorm", scope: !293, file: !294, line: 181, baseType: !180, size: 64, offset: 14400)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "hist_lits", scope: !293, file: !294, line: 182, baseType: !172, size: 64, offset: 14464)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "hist_len", scope: !293, file: !294, line: 183, baseType: !127, size: 32, offset: 14528)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "hist_reset", scope: !293, file: !294, line: 184, baseType: !241, size: 32, offset: 14560)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "hist_malloc", scope: !293, file: !294, line: 185, baseType: !241, size: 32, offset: 14592)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !290, !526, !180, !526, !68, !527}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!528 = !{!529, !530, !531, !532}
!529 = !DILocalVariable(name: "tao", arg: 1, scope: !287, file: !275, line: 28, type: !290)
!530 = !DILocalVariable(name: "func", arg: 2, scope: !287, file: !275, line: 28, type: !523)
!531 = !DILocalVariable(name: "ctx", arg: 3, scope: !287, file: !275, line: 28, type: !68)
!532 = !DILocalVariable(name: "ierr", arg: 4, scope: !287, file: !275, line: 28, type: !527)
!533 = !DILocation(line: 0, scope: !287)
!534 = !DILocation(line: 30, column: 5, scope: !535)
!535 = distinct !DILexicalBlock(scope: !287, file: !275, line: 30, column: 5)
!536 = !{!537, !537, i64 0}
!537 = !{!"any pointer", !538, i64 0}
!538 = !{!"omnipotent char", !539, i64 0}
!539 = !{!"Simple C/C++ TBAA"}
!540 = !DILocation(line: 30, column: 5, scope: !287)
!541 = !DILocation(line: 30, column: 5, scope: !542)
!542 = distinct !DILexicalBlock(scope: !535, file: !275, line: 30, column: 5)
!543 = !DILocation(line: 30, column: 5, scope: !544)
!544 = distinct !DILexicalBlock(scope: !542, file: !275, line: 30, column: 5)
!545 = !DILocation(line: 31, column: 56, scope: !287)
!546 = !DILocation(line: 31, column: 103, scope: !287)
!547 = !DILocation(line: 31, column: 13, scope: !287)
!548 = !DILocation(line: 31, column: 11, scope: !287)
!549 = !{!550, !550, i64 0}
!550 = !{!"int", !538, i64 0}
!551 = !DILocation(line: 32, column: 10, scope: !552)
!552 = distinct !DILexicalBlock(scope: !287, file: !275, line: 32, column: 9)
!553 = !DILocation(line: 32, column: 9, scope: !287)
!554 = !DILocation(line: 32, column: 74, scope: !552)
!555 = !DILocation(line: 32, column: 25, scope: !552)
!556 = !DILocation(line: 32, column: 17, scope: !552)
!557 = !DILocation(line: 33, column: 1, scope: !287)
!558 = !DISubprogram(name: "PetscError", scope: !49, file: !49, line: 668, type: !559, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !561)
!559 = !DISubroutineType(types: !560)
!560 = !{!88, !71, !28, !107, !107, !28, !48, !107, null}
!561 = !{}
!562 = !DISubprogram(name: "PetscObjectSetFortranCallback", scope: !55, file: !55, line: 176, type: !563, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !561)
!563 = !DISubroutineType(types: !564)
!564 = !{!28, !74, !54, !565, !61, !68}
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!566 = !DISubprogram(name: "TaoBRGNSetRegularizerObjectiveAndGradientRoutine", scope: !27, file: !27, line: 358, type: !567, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !561)
!567 = !DISubroutineType(types: !568)
!568 = !{!28, !292, !569, !68}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{!28, !292, !308, !572, !308, !68}
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!573 = distinct !DISubprogram(name: "ourtaobrgnregobjgradroutine", scope: !275, file: !275, line: 18, type: !312, scopeLine: 19, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !574)
!574 = !{!575, !576, !577, !578, !579, !580, !582, !583, !584, !586}
!575 = !DILocalVariable(name: "tao", arg: 1, scope: !573, file: !275, line: 18, type: !291)
!576 = !DILocalVariable(name: "x", arg: 2, scope: !573, file: !275, line: 18, type: !306)
!577 = !DILocalVariable(name: "f", arg: 3, scope: !573, file: !275, line: 18, type: !180)
!578 = !DILocalVariable(name: "g", arg: 4, scope: !573, file: !275, line: 18, type: !306)
