; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/kaczmarz/kaczmarz.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/kaczmarz/kaczmarz.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscOptionItems = type { i32, %struct._n_PetscOptionItem*, i8*, i8*, i8*, %struct.ompi_communicator_t*, i32, i32, i32, %struct._p_PetscObject*, %struct._n_PetscOptions* }
%struct._n_PetscOptionItem = type { i8*, i8*, i8*, %struct._n_PetscFunctionList*, i8**, i8, i8*, i64, i32, i32, %struct._n_PetscOptionItem*, i8*, i8* }
%struct._n_PetscFunctionList = type opaque
%struct.ompi_communicator_t = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !60, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/kaczmarz/kaczmarz.c", directory: "/home/users/ndemeye/xSDK/code-analysis/src/static/callgraph-xSDK")
!2 = !{!3, !9, !24, !32, !38, !45, !54}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 170, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsystypes.h", directory: "/home/users/ndemeye/xSDK")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "PETSC_FALSE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PETSC_TRUE", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 81, baseType: !5, size: 32, elements: !11)
!10 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscoptions.h", directory: "/home/users/ndemeye/xSDK")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!12 = !DIEnumerator(name: "OPTION_INT", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "OPTION_BOOL", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "OPTION_REAL", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "OPTION_FLIST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OPTION_STRING", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "OPTION_REAL_ARRAY", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "OPTION_SCALAR_ARRAY", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "OPTION_HEAD", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "OPTION_INT_ARRAY", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "OPTION_ELIST", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "OPTION_BOOL_ARRAY", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "OPTION_STRING_ARRAY", value: 11, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 98, baseType: !26, size: 32, elements: !27)
!25 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpctypes.h", directory: "/home/users/ndemeye/xSDK")
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_RTOL", value: 2)
!29 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_ATOL", value: 3)
!30 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_ITS", value: 4)
!31 = !DIEnumerator(name: "PCRICHARDSON_DIVERGED_DTOL", value: -4)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 85, baseType: !26, size: 32, elements: !33)
!33 = !{!34, !35, !36, !37}
!34 = !DIEnumerator(name: "PC_SIDE_DEFAULT", value: -1)
!35 = !DIEnumerator(name: "PC_LEFT", value: 0)
!36 = !DIEnumerator(name: "PC_RIGHT", value: 1)
!37 = !DIEnumerator(name: "PC_SYMMETRIC", value: 2)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 285, baseType: !5, size: 32, elements: !40)
!39 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!40 = !{!41, !42, !43, !44}
!41 = !DIEnumerator(name: "DIFFERENT_NONZERO_PATTERN", value: 0, isUnsigned: true)
!42 = !DIEnumerator(name: "SUBSET_NONZERO_PATTERN", value: 1, isUnsigned: true)
!43 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!44 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 395, baseType: !26, size: 32, elements: !46)
!46 = !{!47, !48, !49, !50, !51, !52, !53}
!47 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!48 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!49 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!50 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!51 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!52 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!53 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !55, line: 663, baseType: !5, size: 32, elements: !56)
!55 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!56 = !{!57, !58, !59}
!57 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!58 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!60 = !{!61, !71, !75, !76, !79, !68, !243}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_Kaczmarz", file: !63, line: 6, baseType: !64)
!63 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/kaczmarz/kaczmarz.c", directory: "/home/users/ndemeye/xSDK")
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 3, size: 128, elements: !65)
!65 = !{!66, !69}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !64, file: !63, line: 4, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !68)
!68 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "symmetric", scope: !64, file: !63, line: 5, baseType: !70, size: 32, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !72, line: 330, baseType: !73)
!72 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !72, line: 330, flags: DIFlagFwdDecl)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!78 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !82, line: 73, size: 4480, elements: !83)
!82 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!83 = !{!84, !86, !132, !133, !135, !137, !138, !139, !140, !148, !149, !151, !155, !159, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !172, !173, !174, !176, !177, !179, !181, !182, !183, !184, !185, !187, !189, !190, !191, !192, !193, !196, !198, !199, !200, !210, !212, !213, !217, !218, !266, !271, !273, !274, !275}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !81, file: !82, line: 74, baseType: !85, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !81, file: !82, line: 75, baseType: !87, size: 448, offset: 64)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 448, elements: !130)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !82, line: 53, baseType: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !82, line: 45, size: 448, elements: !90)
!90 = !{!91, !97, !105, !110, !114, !118, !125}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !89, file: !82, line: 46, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!95, !79, !96}
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !89, file: !82, line: 47, baseType: !98, size: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!95, !79, !101}
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !102, line: 16, baseType: !103)
!102 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !102, line: 16, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !89, file: !82, line: 48, baseType: !106, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!95, !109}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !89, file: !82, line: 49, baseType: !111, size: 64, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!95, !79, !76, !79}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !89, file: !82, line: 50, baseType: !115, size: 64, offset: 256)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!95, !79, !76, !109}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !89, file: !82, line: 51, baseType: !119, size: 64, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!95, !79, !76, !122}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{null}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !89, file: !82, line: 52, baseType: !126, size: 64, offset: 384)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!95, !79, !76, !129}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!130 = !{!131}
!131 = !DISubrange(count: 1)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !81, file: !82, line: 76, baseType: !71, size: 64, offset: 512)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !81, file: !82, line: 77, baseType: !134, size: 32, offset: 576)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !81, file: !82, line: 78, baseType: !136, size: 64, offset: 640)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !68)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !81, file: !82, line: 78, baseType: !136, size: 64, offset: 704)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !81, file: !82, line: 78, baseType: !136, size: 64, offset: 768)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !81, file: !82, line: 78, baseType: !136, size: 64, offset: 832)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !81, file: !82, line: 79, baseType: !141, size: 64, offset: 896)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !144, line: 27, baseType: !145)
!144 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !146, line: 43, baseType: !147)
!146 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!147 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !81, file: !82, line: 80, baseType: !134, size: 32, offset: 960)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !81, file: !82, line: 81, baseType: !150, size: 32, offset: 992)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !81, file: !82, line: 82, baseType: !152, size: 64, offset: 1024)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !81, file: !82, line: 83, baseType: !156, size: 64, offset: 1088)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !81, file: !82, line: 84, baseType: !160, size: 64, offset: 1152)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !81, file: !82, line: 85, baseType: !160, size: 64, offset: 1216)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !81, file: !82, line: 86, baseType: !160, size: 64, offset: 1280)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !81, file: !82, line: 87, baseType: !160, size: 64, offset: 1344)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !81, file: !82, line: 88, baseType: !79, size: 64, offset: 1408)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !81, file: !82, line: 89, baseType: !141, size: 64, offset: 1472)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !81, file: !82, line: 90, baseType: !160, size: 64, offset: 1536)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !81, file: !82, line: 91, baseType: !160, size: 64, offset: 1600)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !81, file: !82, line: 92, baseType: !134, size: 32, offset: 1664)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !81, file: !82, line: 93, baseType: !75, size: 64, offset: 1728)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !81, file: !82, line: 94, baseType: !171, size: 64, offset: 1792)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !142)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !81, file: !82, line: 95, baseType: !134, size: 32, offset: 1856)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !81, file: !82, line: 95, baseType: !134, size: 32, offset: 1888)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !81, file: !82, line: 96, baseType: !175, size: 64, offset: 1920)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !81, file: !82, line: 96, baseType: !175, size: 64, offset: 1984)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !81, file: !82, line: 97, baseType: !178, size: 64, offset: 2048)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !81, file: !82, line: 97, baseType: !180, size: 64, offset: 2112)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !81, file: !82, line: 98, baseType: !134, size: 32, offset: 2176)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !81, file: !82, line: 98, baseType: !134, size: 32, offset: 2208)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !81, file: !82, line: 99, baseType: !175, size: 64, offset: 2240)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !81, file: !82, line: 99, baseType: !175, size: 64, offset: 2304)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !81, file: !82, line: 100, baseType: !186, size: 64, offset: 2368)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !81, file: !82, line: 100, baseType: !188, size: 64, offset: 2432)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !81, file: !82, line: 101, baseType: !134, size: 32, offset: 2496)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !81, file: !82, line: 101, baseType: !134, size: 32, offset: 2528)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !81, file: !82, line: 102, baseType: !175, size: 64, offset: 2560)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !81, file: !82, line: 102, baseType: !175, size: 64, offset: 2624)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !81, file: !82, line: 103, baseType: !194, size: 64, offset: 2688)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !67)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !81, file: !82, line: 103, baseType: !197, size: 64, offset: 2752)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !81, file: !82, line: 104, baseType: !129, size: 64, offset: 2816)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !81, file: !82, line: 105, baseType: !134, size: 32, offset: 2880)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !81, file: !82, line: 106, baseType: !201, size: 128, offset: 2944)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 128, elements: !208)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !82, line: 64, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !82, line: 61, size: 128, elements: !205)
!205 = !{!206, !207}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !204, file: !82, line: 62, baseType: !122, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !204, file: !82, line: 63, baseType: !75, size: 64, offset: 64)
!208 = !{!209}
!209 = !DISubrange(count: 2)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !81, file: !82, line: 107, baseType: !211, size: 64, offset: 3072)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 64, elements: !208)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !81, file: !82, line: 108, baseType: !75, size: 64, offset: 3136)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !81, file: !82, line: 109, baseType: !214, size: 64, offset: 3200)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!95, !75}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !81, file: !82, line: 111, baseType: !134, size: 32, offset: 3264)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !81, file: !82, line: 112, baseType: !219, size: 320, offset: 3328)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, size: 320, elements: !264)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!95, !223, !79, !75}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !226)
!226 = !{!227, !228, !252, !253, !254, !255, !256, !257, !258, !259, !260}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !225, file: !10, line: 100, baseType: !134, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !225, file: !10, line: 101, baseType: !229, size: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !232)
!232 = !{!233, !234, !235, !236, !237, !240, !241, !242, !246, !247, !249, !250, !251}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !231, file: !10, line: 84, baseType: !160, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !231, file: !10, line: 85, baseType: !160, size: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !231, file: !10, line: 86, baseType: !75, size: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !231, file: !10, line: 87, baseType: !152, size: 64, offset: 192)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !231, file: !10, line: 88, baseType: !238, size: 64, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !231, file: !10, line: 89, baseType: !78, size: 8, offset: 320)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !231, file: !10, line: 90, baseType: !160, size: 64, offset: 384)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !231, file: !10, line: 91, baseType: !243, size: 64, offset: 448)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !244, line: 46, baseType: !245)
!244 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!245 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !231, file: !10, line: 92, baseType: !70, size: 32, offset: 512)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !231, file: !10, line: 93, baseType: !248, size: 32, offset: 544)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !231, file: !10, line: 94, baseType: !229, size: 64, offset: 576)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !231, file: !10, line: 95, baseType: !160, size: 64, offset: 640)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !231, file: !10, line: 96, baseType: !75, size: 64, offset: 704)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !225, file: !10, line: 102, baseType: !160, size: 64, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !225, file: !10, line: 102, baseType: !160, size: 64, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !225, file: !10, line: 103, baseType: !160, size: 64, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !225, file: !10, line: 104, baseType: !71, size: 64, offset: 320)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !225, file: !10, line: 105, baseType: !70, size: 32, offset: 384)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !225, file: !10, line: 105, baseType: !70, size: 32, offset: 416)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !225, file: !10, line: 105, baseType: !70, size: 32, offset: 448)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !225, file: !10, line: 106, baseType: !79, size: 64, offset: 512)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !225, file: !10, line: 107, baseType: !261, size: 64, offset: 576)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!264 = !{!265}
!265 = !DISubrange(count: 5)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !81, file: !82, line: 113, baseType: !267, size: 320, offset: 3648)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 320, elements: !264)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!95, !79, !75}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !81, file: !82, line: 114, baseType: !272, size: 320, offset: 3968)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 320, elements: !264)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !81, file: !82, line: 115, baseType: !70, size: 32, offset: 4288)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !81, file: !82, line: 120, baseType: !261, size: 64, offset: 4352)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !81, file: !82, line: 121, baseType: !70, size: 32, offset: 4416)
!276 = !{i32 7, !"Dwarf Version", i32 4}
!277 = !{i32 2, !"Debug Info Version", i32 3}
!278 = !{i32 1, !"wchar_size", i32 4}
!279 = !{i32 7, !"PIC Level", i32 2}
!280 = !{i32 7, !"uwtable", i32 1}
!281 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!282 = distinct !DISubprogram(name: "PCSetFromOptions_Kaczmarz", scope: !63, file: !63, line: 81, type: !283, scopeLine: 82, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !393)
!283 = !DISubroutineType(types: !284)
!284 = !{!95, !223, !285}
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC", file: !25, line: 11, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PC", file: !288, line: 37, size: 6720, elements: !289)
!288 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/pcimpl.h", directory: "/home/users/ndemeye/xSDK")
!289 = !{!290, !292, !357, !362, !363, !364, !365, !366, !368, !369, !370, !371, !372, !373, !374, !375, !376, !386, !387, !388, !389, !390, !392}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !287, file: !288, line: 38, baseType: !291, size: 4480)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !82, line: 122, baseType: !81)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !287, file: !288, line: 38, baseType: !293, size: 1152, offset: 4480)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 1152, elements: !130)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PCOps", file: !288, line: 13, size: 1152, elements: !295)
!295 = !{!296, !300, !308, !315, !321, !326, !327, !331, !333, !341, !342, !347, !348, !349, !350, !351, !355, !356}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !294, file: !288, line: 14, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!95, !285}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !294, file: !288, line: 15, baseType: !301, size: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!95, !285, !304, !304}
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !305, line: 21, baseType: !306)
!305 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !305, line: 21, flags: DIFlagFwdDecl)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "matapply", scope: !294, file: !288, line: 16, baseType: !309, size: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!95, !285, !312, !312}
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !39, line: 16, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !39, line: 16, flags: DIFlagFwdDecl)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "applyrichardson", scope: !294, file: !288, line: 17, baseType: !316, size: 64, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!95, !285, !304, !304, !304, !67, !67, !67, !134, !70, !178, !319}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCRichardsonConvergedReason", file: !25, line: 102, baseType: !24)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "applyBA", scope: !294, file: !288, line: 18, baseType: !322, size: 64, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!95, !285, !325, !304, !304, !304}
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !25, line: 85, baseType: !32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "applytranspose", scope: !294, file: !288, line: 19, baseType: !301, size: 64, offset: 320)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "applyBAtranspose", scope: !294, file: !288, line: 20, baseType: !328, size: 64, offset: 384)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!95, !285, !134, !304, !304, !304}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !294, file: !288, line: 21, baseType: !332, size: 64, offset: 448)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "presolve", scope: !294, file: !288, line: 22, baseType: !334, size: 64, offset: 512)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!95, !285, !337, !304, !304}
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !338, line: 22, baseType: !339)
!338 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !338, line: 22, flags: DIFlagFwdDecl)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "postsolve", scope: !294, file: !288, line: 23, baseType: !334, size: 64, offset: 576)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "getfactoredmatrix", scope: !294, file: !288, line: 24, baseType: !343, size: 64, offset: 640)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!95, !285, !346}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricleft", scope: !294, file: !288, line: 25, baseType: !301, size: 64, offset: 704)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "applysymmetricright", scope: !294, file: !288, line: 26, baseType: !301, size: 64, offset: 768)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "setuponblocks", scope: !294, file: !288, line: 27, baseType: !297, size: 64, offset: 832)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !294, file: !288, line: 28, baseType: !297, size: 64, offset: 896)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !294, file: !288, line: 29, baseType: !352, size: 64, offset: 960)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!95, !285, !101}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !294, file: !288, line: 30, baseType: !297, size: 64, offset: 1024)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !294, file: !288, line: 31, baseType: !352, size: 64, offset: 1088)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !287, file: !288, line: 39, baseType: !358, size: 64, offset: 5632)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !359, line: 14, baseType: !360)
!359 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !359, line: 14, flags: DIFlagFwdDecl)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !287, file: !288, line: 40, baseType: !134, size: 32, offset: 5696)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "matstate", scope: !287, file: !288, line: 41, baseType: !171, size: 64, offset: 5760)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "matnonzerostate", scope: !287, file: !288, line: 41, baseType: !171, size: 64, offset: 5824)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "reusepreconditioner", scope: !287, file: !288, line: 42, baseType: !70, size: 32, offset: 5888)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !287, file: !288, line: 43, baseType: !367, size: 32, offset: 5920)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !39, line: 285, baseType: !38)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !287, file: !288, line: 45, baseType: !134, size: 32, offset: 5952)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "erroriffailure", scope: !287, file: !288, line: 46, baseType: !70, size: 32, offset: 5984)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !287, file: !288, line: 47, baseType: !312, size: 64, offset: 6016)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "pmat", scope: !287, file: !288, line: 47, baseType: !312, size: 64, offset: 6080)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleright", scope: !287, file: !288, line: 48, baseType: !304, size: 64, offset: 6144)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscaleleft", scope: !287, file: !288, line: 48, baseType: !304, size: 64, offset: 6208)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !287, file: !288, line: 49, baseType: !70, size: 32, offset: 6272)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "useAmat", scope: !287, file: !288, line: 50, baseType: !70, size: 32, offset: 6304)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatrices", scope: !287, file: !288, line: 51, baseType: !377, size: 64, offset: 6336)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!95, !285, !134, !380, !380, !346, !75}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !383, line: 11, baseType: !384)
!383 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !383, line: 11, flags: DIFlagFwdDecl)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "modifysubmatricesP", scope: !287, file: !288, line: 52, baseType: !75, size: 64, offset: 6400)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !287, file: !288, line: 53, baseType: !75, size: 64, offset: 6464)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "presolvedone", scope: !287, file: !288, line: 54, baseType: !134, size: 32, offset: 6528)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !287, file: !288, line: 55, baseType: !75, size: 64, offset: 6592)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "failedreason", scope: !287, file: !288, line: 56, baseType: !391, size: 32, offset: 6656)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCFailedReason", file: !25, line: 395, baseType: !45)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "failedreasonrank", scope: !287, file: !288, line: 57, baseType: !391, size: 32, offset: 6688)
!393 = !{!394, !395, !396, !397, !398, !400, !402, !404}
!394 = !DILocalVariable(name: "PetscOptionsObject", arg: 1, scope: !282, file: !63, line: 81, type: !223)
!395 = !DILocalVariable(name: "pc", arg: 2, scope: !282, file: !63, line: 81, type: !285)
!396 = !DILocalVariable(name: "jac", scope: !282, file: !63, line: 83, type: !61)
!397 = !DILocalVariable(name: "ierr", scope: !282, file: !63, line: 84, type: !95)
!398 = !DILocalVariable(name: "ierr__", scope: !399, file: !63, line: 87, type: !95)
!399 = distinct !DILexicalBlock(scope: !282, file: !63, line: 87, column: 66)
!400 = !DILocalVariable(name: "ierr__", scope: !401, file: !63, line: 88, type: !95)
!401 = distinct !DILexicalBlock(scope: !282, file: !63, line: 88, column: 116)
!402 = !DILocalVariable(name: "ierr__", scope: !403, file: !63, line: 89, type: !95)
!403 = distinct !DILexicalBlock(scope: !282, file: !63, line: 89, column: 130)
!404 = !DILocalVariable(name: "ierr__", scope: !405, file: !63, line: 90, type: !95)
!405 = distinct !DILexicalBlock(scope: !282, file: !63, line: 90, column: 29)
!406 = !DILocation(line: 0, scope: !282)
!407 = !DILocation(line: 83, column: 43, scope: !282)
!408 = !{!409, !414, i64 808}
!409 = !{!"_p_PC", !410, i64 0, !412, i64 560, !414, i64 704, !411, i64 712, !416, i64 720, !416, i64 728, !412, i64 736, !412, i64 740, !411, i64 744, !412, i64 748, !414, i64 752, !414, i64 760, !414, i64 768, !414, i64 776, !412, i64 784, !412, i64 788, !414, i64 792, !414, i64 800, !414, i64 808, !411, i64 816, !414, i64 824, !412, i64 832, !412, i64 836}
!410 = !{!"_p_PetscObject", !411, i64 0, !412, i64 8, !414, i64 64, !411, i64 72, !415, i64 80, !415, i64 88, !415, i64 96, !415, i64 104, !416, i64 112, !411, i64 120, !411, i64 124, !414, i64 128, !414, i64 136, !414, i64 144, !414, i64 152, !414, i64 160, !414, i64 168, !414, i64 176, !416, i64 184, !414, i64 192, !414, i64 200, !411, i64 208, !414, i64 216, !416, i64 224, !411, i64 232, !411, i64 236, !414, i64 240, !414, i64 248, !414, i64 256, !414, i64 264, !411, i64 272, !411, i64 276, !414, i64 280, !414, i64 288, !414, i64 296, !414, i64 304, !411, i64 312, !411, i64 316, !414, i64 320, !414, i64 328, !414, i64 336, !414, i64 344, !414, i64 352, !411, i64 360, !412, i64 368, !412, i64 384, !414, i64 392, !414, i64 400, !411, i64 408, !412, i64 416, !412, i64 456, !412, i64 496, !412, i64 536, !414, i64 544, !412, i64 552}
!411 = !{!"int", !412, i64 0}
!412 = !{!"omnipotent char", !413, i64 0}
!413 = !{!"Simple C/C++ TBAA"}
!414 = !{!"any pointer", !412, i64 0}
!415 = !{!"double", !412, i64 0}
!416 = !{!"long", !412, i64 0}
!417 = !DILocation(line: 86, column: 3, scope: !418)
!418 = distinct !DILexicalBlock(scope: !419, file: !63, line: 86, column: 3)
!419 = distinct !DILexicalBlock(scope: !420, file: !63, line: 86, column: 3)
!420 = distinct !DILexicalBlock(scope: !282, file: !63, line: 86, column: 3)
!421 = !{!414, !414, i64 0}
!422 = !DILocation(line: 86, column: 3, scope: !419)
!423 = !DILocation(line: 86, column: 3, scope: !424)
!424 = distinct !DILexicalBlock(scope: !425, file: !63, line: 86, column: 3)
!425 = distinct !DILexicalBlock(scope: !418, file: !63, line: 86, column: 3)
!426 = !{!427, !411, i64 1536}
!427 = !{!"", !412, i64 0, !412, i64 512, !412, i64 1024, !412, i64 1280, !411, i64 1536, !411, i64 1540, !412, i64 1544}
!428 = !DILocation(line: 86, column: 3, scope: !425)
!429 = !DILocation(line: 86, column: 3, scope: !430)
!430 = distinct !DILexicalBlock(scope: !424, file: !63, line: 86, column: 3)
!431 = !{!411, !411, i64 0}
!432 = !{!427, !411, i64 1540}
!433 = !DILocation(line: 87, column: 10, scope: !282)
!434 = !DILocation(line: 0, scope: !399)
!435 = !DILocation(line: 87, column: 66, scope: !436)
!436 = distinct !DILexicalBlock(scope: !399, file: !63, line: 87, column: 66)
!437 = !DILocation(line: 87, column: 66, scope: !399)
