; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/patch/patchcreate.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/dm/impls/patch/patchcreate.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PetscOptionItems = type { i32, %struct._n_PetscOptionItem*, i8*, i8*, i8*, %struct.ompi_communicator_t*, i32, i32, i32, %struct._p_PetscObject*, %struct._n_PetscOptions* }
%struct._n_PetscOptionItem = type { i8*, i8*, i8*, %struct._n_PetscFunctionList*, i8**, i8, i8*, i64, i32, i32, %struct._n_PetscOptionItem*, i8*, i8* }
%struct._n_PetscFunctionList = type opaque
%struct.ompi_communicator_t = type opaque

!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 74, baseType: !5, size: 32, elements: !42)
!41 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!42 = !{!43, !44, !45}
!43 = !DIEnumerator(name: "DM_POINTLOCATION_NONE", value: 0, isUnsigned: true)
!44 = !DIEnumerator(name: "DM_POINTLOCATION_NEAREST", value: 1, isUnsigned: true)
!45 = !DIEnumerator(name: "DM_POINTLOCATION_REMOVE", value: 2, isUnsigned: true)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 140, baseType: !5, size: 32, elements: !48)
!47 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/dmimpl.h", directory: "/home/users/ndemeye/xSDK")
!48 = !{!49, !50}
!49 = !DIEnumerator(name: "DMVEC_STATUS_IN", value: 0, isUnsigned: true)
!50 = !DIEnumerator(name: "DMVEC_STATUS_OUT", value: 1, isUnsigned: true)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 42, baseType: !5, size: 32, elements: !52)
!52 = !{!53, !54, !55, !56, !57}
!53 = !DIEnumerator(name: "DM_BOUNDARY_NONE", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "DM_BOUNDARY_GHOSTED", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "DM_BOUNDARY_MIRROR", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "DM_BOUNDARY_PERIODIC", value: 3, isUnsigned: true)
!57 = !DIEnumerator(name: "DM_BOUNDARY_TWIST", value: 4, isUnsigned: true)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 60, baseType: !5, size: 32, elements: !59)
!59 = !{!60, !61, !62, !63, !64, !65}
!60 = !DIEnumerator(name: "DM_BC_ESSENTIAL", value: 1, isUnsigned: true)
!61 = !DIEnumerator(name: "DM_BC_ESSENTIAL_FIELD", value: 5, isUnsigned: true)
!62 = !DIEnumerator(name: "DM_BC_NATURAL", value: 2, isUnsigned: true)
!63 = !DIEnumerator(name: "DM_BC_NATURAL_FIELD", value: 6, isUnsigned: true)
!64 = !DIEnumerator(name: "DM_BC_ESSENTIAL_BD_FIELD", value: 9, isUnsigned: true)
!65 = !DIEnumerator(name: "DM_BC_NATURAL_RIEMANN", value: 10, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !67, line: 663, baseType: !5, size: 32, elements: !68)
!67 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!68 = !{!69, !70, !71}
!69 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!70 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!71 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !73)
!73 = !{!74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91}
!74 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!75 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!78 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!79 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!80 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!92 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !93, line: 14, baseType: !5, size: 32, elements: !94)
!93 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmdatypes.h", directory: "/home/users/ndemeye/xSDK")
!94 = !{!95, !96}
!95 = !DIEnumerator(name: "DMDA_STENCIL_STAR", value: 0, isUnsigned: true)
!96 = !DIEnumerator(name: "DMDA_STENCIL_BOX", value: 1, isUnsigned: true)
!97 = !{!98, !102, !103, !139, !273, !307}
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !99, line: 330, baseType: !100)
!99 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !99, line: 330, flags: DIFlagFwdDecl)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !106, line: 73, size: 4480, elements: !107)
!106 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!107 = !{!108, !111, !160, !161, !163, !166, !167, !168, !169, !177, !178, !180, !184, !188, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !201, !202, !203, !205, !206, !208, !210, !211, !212, !213, !214, !217, !219, !220, !221, !222, !223, !226, !228, !229, !230, !240, !242, !243, !247, !248, !297, !302, !304, !305, !306}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !105, file: !106, line: 74, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !110)
!110 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !105, file: !106, line: 75, baseType: !112, size: 448, offset: 64)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 448, elements: !158)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !106, line: 53, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !106, line: 45, size: 448, elements: !115)
!115 = !{!116, !122, !130, !135, !142, !146, !153}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !114, file: !106, line: 46, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!120, !103, !121}
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !110)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !114, file: !106, line: 47, baseType: !123, size: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!120, !103, !126}
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !127, line: 16, baseType: !128)
!127 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !127, line: 16, flags: DIFlagFwdDecl)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !114, file: !106, line: 48, baseType: !131, size: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!120, !134}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !114, file: !106, line: 49, baseType: !136, size: 64, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!120, !103, !139, !103}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !114, file: !106, line: 50, baseType: !143, size: 64, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!120, !103, !139, !134}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !114, file: !106, line: 51, baseType: !147, size: 64, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!120, !103, !139, !150}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{null}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !114, file: !106, line: 52, baseType: !154, size: 64, offset: 384)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!120, !103, !139, !157}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!158 = !{!159}
!159 = !DISubrange(count: 1)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !105, file: !106, line: 76, baseType: !98, size: 64, offset: 512)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !105, file: !106, line: 77, baseType: !162, size: 32, offset: 576)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !110)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !105, file: !106, line: 78, baseType: !164, size: 64, offset: 640)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !165)
!165 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !105, file: !106, line: 78, baseType: !164, size: 64, offset: 704)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !105, file: !106, line: 78, baseType: !164, size: 64, offset: 768)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !105, file: !106, line: 78, baseType: !164, size: 64, offset: 832)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !105, file: !106, line: 79, baseType: !170, size: 64, offset: 896)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !173, line: 27, baseType: !174)
!173 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !175, line: 43, baseType: !176)
!175 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!176 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !105, file: !106, line: 80, baseType: !162, size: 32, offset: 960)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !105, file: !106, line: 81, baseType: !179, size: 32, offset: 992)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !110)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !105, file: !106, line: 82, baseType: !181, size: 64, offset: 1024)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !105, file: !106, line: 83, baseType: !185, size: 64, offset: 1088)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !105, file: !106, line: 84, baseType: !189, size: 64, offset: 1152)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !105, file: !106, line: 85, baseType: !189, size: 64, offset: 1216)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !105, file: !106, line: 86, baseType: !189, size: 64, offset: 1280)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !105, file: !106, line: 87, baseType: !189, size: 64, offset: 1344)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !105, file: !106, line: 88, baseType: !103, size: 64, offset: 1408)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !105, file: !106, line: 89, baseType: !170, size: 64, offset: 1472)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !105, file: !106, line: 90, baseType: !189, size: 64, offset: 1536)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !105, file: !106, line: 91, baseType: !189, size: 64, offset: 1600)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !105, file: !106, line: 92, baseType: !162, size: 32, offset: 1664)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !105, file: !106, line: 93, baseType: !102, size: 64, offset: 1728)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !105, file: !106, line: 94, baseType: !200, size: 64, offset: 1792)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !171)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !105, file: !106, line: 95, baseType: !162, size: 32, offset: 1856)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !105, file: !106, line: 95, baseType: !162, size: 32, offset: 1888)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !105, file: !106, line: 96, baseType: !204, size: 64, offset: 1920)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !105, file: !106, line: 96, baseType: !204, size: 64, offset: 1984)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !105, file: !106, line: 97, baseType: !207, size: 64, offset: 2048)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !105, file: !106, line: 97, baseType: !209, size: 64, offset: 2112)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !105, file: !106, line: 98, baseType: !162, size: 32, offset: 2176)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !105, file: !106, line: 98, baseType: !162, size: 32, offset: 2208)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !105, file: !106, line: 99, baseType: !204, size: 64, offset: 2240)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !105, file: !106, line: 99, baseType: !204, size: 64, offset: 2304)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !105, file: !106, line: 100, baseType: !215, size: 64, offset: 2368)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !165)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !105, file: !106, line: 100, baseType: !218, size: 64, offset: 2432)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !105, file: !106, line: 101, baseType: !162, size: 32, offset: 2496)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !105, file: !106, line: 101, baseType: !162, size: 32, offset: 2528)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !105, file: !106, line: 102, baseType: !204, size: 64, offset: 2560)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !105, file: !106, line: 102, baseType: !204, size: 64, offset: 2624)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !105, file: !106, line: 103, baseType: !224, size: 64, offset: 2688)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !216)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !105, file: !106, line: 103, baseType: !227, size: 64, offset: 2752)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !105, file: !106, line: 104, baseType: !157, size: 64, offset: 2816)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !105, file: !106, line: 105, baseType: !162, size: 32, offset: 2880)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !105, file: !106, line: 106, baseType: !231, size: 128, offset: 2944)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 128, elements: !238)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !106, line: 64, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !106, line: 61, size: 128, elements: !235)
!235 = !{!236, !237}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !234, file: !106, line: 62, baseType: !150, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !234, file: !106, line: 63, baseType: !102, size: 64, offset: 64)
!238 = !{!239}
!239 = !DISubrange(count: 2)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !105, file: !106, line: 107, baseType: !241, size: 64, offset: 3072)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 64, elements: !238)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !105, file: !106, line: 108, baseType: !102, size: 64, offset: 3136)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !105, file: !106, line: 109, baseType: !244, size: 64, offset: 3200)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!120, !102}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !105, file: !106, line: 111, baseType: !162, size: 32, offset: 3264)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !105, file: !106, line: 112, baseType: !249, size: 320, offset: 3328)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 320, elements: !295)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!120, !253, !103, !102}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !256)
!256 = !{!257, !258, !283, !284, !285, !286, !287, !288, !289, !290, !291}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !255, file: !10, line: 100, baseType: !162, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !255, file: !10, line: 101, baseType: !259, size: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !262)
!262 = !{!263, !264, !265, !266, !267, !270, !271, !272, !276, !278, !280, !281, !282}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !261, file: !10, line: 84, baseType: !189, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !261, file: !10, line: 85, baseType: !189, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !261, file: !10, line: 86, baseType: !102, size: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !261, file: !10, line: 87, baseType: !181, size: 64, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !261, file: !10, line: 88, baseType: !268, size: 64, offset: 256)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !261, file: !10, line: 89, baseType: !141, size: 8, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !261, file: !10, line: 90, baseType: !189, size: 64, offset: 384)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !261, file: !10, line: 91, baseType: !273, size: 64, offset: 448)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !274, line: 46, baseType: !275)
!274 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!275 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !261, file: !10, line: 92, baseType: !277, size: 32, offset: 512)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !261, file: !10, line: 93, baseType: !279, size: 32, offset: 544)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !261, file: !10, line: 94, baseType: !259, size: 64, offset: 576)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !261, file: !10, line: 95, baseType: !189, size: 64, offset: 640)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !261, file: !10, line: 96, baseType: !102, size: 64, offset: 704)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !255, file: !10, line: 102, baseType: !189, size: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !255, file: !10, line: 102, baseType: !189, size: 64, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !255, file: !10, line: 103, baseType: !189, size: 64, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !255, file: !10, line: 104, baseType: !98, size: 64, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !255, file: !10, line: 105, baseType: !277, size: 32, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !255, file: !10, line: 105, baseType: !277, size: 32, offset: 416)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !255, file: !10, line: 105, baseType: !277, size: 32, offset: 448)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !255, file: !10, line: 106, baseType: !103, size: 64, offset: 512)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !255, file: !10, line: 107, baseType: !292, size: 64, offset: 576)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!295 = !{!296}
!296 = !DISubrange(count: 5)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !105, file: !106, line: 113, baseType: !298, size: 320, offset: 3648)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 320, elements: !295)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!120, !103, !102}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !105, file: !106, line: 114, baseType: !303, size: 320, offset: 3968)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 320, elements: !295)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !105, file: !106, line: 115, baseType: !277, size: 32, offset: 4288)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !105, file: !106, line: 120, baseType: !292, size: 64, offset: 4352)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !105, file: !106, line: 121, baseType: !277, size: 32, offset: 4416)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM_Patch", file: !309, line: 13, baseType: !310)
!309 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/dmpatchimpl.h", directory: "/home/users/ndemeye/xSDK")
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !309, line: 8, size: 384, elements: !311)
!311 = !{!312, !313, !1062, !1070}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !310, file: !309, line: 9, baseType: !162, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "dmCoarse", scope: !310, file: !309, line: 10, baseType: !314, size: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !41, line: 14, baseType: !315)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !47, line: 202, size: 40000, elements: !317)
!317 = !{!318, !320, !557, !561, !562, !563, !564, !574, !575, !583, !584, !592, !593, !594, !595, !599, !600, !604, !606, !608, !609, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !637, !649, !661, !673, !682, !683, !706, !707, !708, !709, !710, !711, !713, !804, !805, !825, !826, !827, !828, !829, !830, !834, !835, !839, !840, !841, !842, !843, !844, !845, !846, !847, !850, !862, !863, !864, !873, !961, !962, !1050, !1051, !1052, !1053, !1055, !1057, !1058, !1059, !1060, !1061}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !316, file: !47, line: 203, baseType: !319, size: 4480)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !106, line: 122, baseType: !105)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !316, file: !47, line: 203, baseType: !321, size: 3456, offset: 4480)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 3456, elements: !158)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMOps", file: !47, line: 30, size: 3456, elements: !323)
!323 = !{!324, !328, !329, !334, !338, !342, !343, !344, !353, !354, !355, !367, !368, !376, !385, !394, !398, !402, !403, !408, !409, !413, !414, !418, !419, !427, !431, !436, !437, !438, !439, !440, !441, !442, !446, !452, !456, !461, !465, !476, !480, !485, !492, !496, !497, !503, !514, !518, !528, !532, !540, !544, !552, !553}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !322, file: !47, line: 31, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!120, !314, !126}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !322, file: !47, line: 32, baseType: !325, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !322, file: !47, line: 33, baseType: !330, size: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{!120, !314, !333}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !322, file: !47, line: 34, baseType: !335, size: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!120, !253, !314}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !322, file: !47, line: 35, baseType: !339, size: 64, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!120, !314}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalsection", scope: !322, file: !47, line: 36, baseType: !339, size: 64, offset: 320)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "createdefaultconstraints", scope: !322, file: !47, line: 37, baseType: !339, size: 64, offset: 384)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "createglobalvector", scope: !322, file: !47, line: 38, baseType: !345, size: 64, offset: 448)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!120, !314, !348}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !350, line: 21, baseType: !351)
!350 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !350, line: 21, flags: DIFlagFwdDecl)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "createlocalvector", scope: !322, file: !47, line: 39, baseType: !345, size: 64, offset: 512)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "getlocaltoglobalmapping", scope: !322, file: !47, line: 40, baseType: !339, size: 64, offset: 576)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "createfieldis", scope: !322, file: !47, line: 41, baseType: !356, size: 64, offset: 640)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{!120, !314, !207, !359, !361}
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !364, line: 11, baseType: !365)
!364 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !364, line: 11, flags: DIFlagFwdDecl)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatedm", scope: !322, file: !47, line: 42, baseType: !330, size: 64, offset: 704)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "createcoordinatefield", scope: !322, file: !47, line: 43, baseType: !369, size: 64, offset: 768)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!120, !314, !372}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMField", file: !41, line: 165, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMField", file: !41, line: 165, flags: DIFlagFwdDecl)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "getcoloring", scope: !322, file: !47, line: 45, baseType: !377, size: 64, offset: 832)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!120, !314, !380, !381}
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !25, line: 213, baseType: !24)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !364, line: 51, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !364, line: 51, flags: DIFlagFwdDecl)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "creatematrix", scope: !322, file: !47, line: 46, baseType: !386, size: 64, offset: 896)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!120, !314, !389}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !391, line: 16, baseType: !392)
!391 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !391, line: 16, flags: DIFlagFwdDecl)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "createinterpolation", scope: !322, file: !47, line: 47, baseType: !395, size: 64, offset: 960)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!120, !314, !314, !389, !348}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "createrestriction", scope: !322, file: !47, line: 48, baseType: !399, size: 64, offset: 1024)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!120, !314, !314, !389}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "createmassmatrix", scope: !322, file: !47, line: 49, baseType: !399, size: 64, offset: 1088)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "hascreateinjection", scope: !322, file: !47, line: 50, baseType: !404, size: 64, offset: 1152)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!120, !314, !407}
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "createinjection", scope: !322, file: !47, line: 51, baseType: !399, size: 64, offset: 1216)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !322, file: !47, line: 53, baseType: !410, size: 64, offset: 1280)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!120, !314, !98, !333}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "coarsen", scope: !322, file: !47, line: 54, baseType: !410, size: 64, offset: 1344)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "refinehierarchy", scope: !322, file: !47, line: 55, baseType: !415, size: 64, offset: 1408)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!120, !314, !162, !333}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhierarchy", scope: !322, file: !47, line: 56, baseType: !415, size: 64, offset: 1472)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "adaptlabel", scope: !322, file: !47, line: 57, baseType: !420, size: 64, offset: 1536)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!120, !314, !423, !333}
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabel", file: !424, line: 12, baseType: !425)
!424 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmlabel.h", directory: "/home/users/ndemeye/xSDK")
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DMLabel", file: !424, line: 12, flags: DIFlagFwdDecl)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "adaptmetric", scope: !322, file: !47, line: 58, baseType: !428, size: 64, offset: 1600)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!120, !314, !349, !423, !333}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalbegin", scope: !322, file: !47, line: 60, baseType: !432, size: 64, offset: 1664)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!120, !314, !349, !435, !349}
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !29)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalend", scope: !322, file: !47, line: 61, baseType: !432, size: 64, offset: 1728)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalbegin", scope: !322, file: !47, line: 62, baseType: !432, size: 64, offset: 1792)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "localtoglobalend", scope: !322, file: !47, line: 63, baseType: !432, size: 64, offset: 1856)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalbegin", scope: !322, file: !47, line: 64, baseType: !432, size: 64, offset: 1920)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "localtolocalend", scope: !322, file: !47, line: 65, baseType: !432, size: 64, offset: 1984)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !322, file: !47, line: 67, baseType: !339, size: 64, offset: 2048)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !322, file: !47, line: 69, baseType: !443, size: 64, offset: 2112)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!120, !314, !349, !349}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "createsubdm", scope: !322, file: !47, line: 71, baseType: !447, size: 64, offset: 2176)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!120, !314, !162, !450, !362, !333}
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "createsuperdm", scope: !322, file: !47, line: 72, baseType: !453, size: 64, offset: 2240)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!120, !333, !162, !361, !333}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "createfielddecomposition", scope: !322, file: !47, line: 73, baseType: !457, size: 64, offset: 2304)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!120, !314, !207, !359, !361, !460}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "createdomaindecomposition", scope: !322, file: !47, line: 74, baseType: !462, size: 64, offset: 2368)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!120, !314, !207, !359, !361, !361, !460}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "createddscatters", scope: !322, file: !47, line: 75, baseType: !466, size: 64, offset: 2432)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!120, !314, !162, !333, !469, !469, !469}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecScatter", file: !472, line: 59, baseType: !473)
!472 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsftypes.h", directory: "/home/users/ndemeye/xSDK")
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSF", file: !472, line: 15, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSF", file: !472, line: 15, flags: DIFlagFwdDecl)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "getdimpoints", scope: !322, file: !47, line: 77, baseType: !477, size: 64, offset: 2496)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!120, !314, !162, !207, !207}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "locatepoints", scope: !322, file: !47, line: 78, baseType: !481, size: 64, offset: 2560)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!120, !314, !349, !484, !473}
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMPointLocationType", file: !41, line: 74, baseType: !40)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "getneighbors", scope: !322, file: !47, line: 79, baseType: !486, size: 64, offset: 2624)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!120, !314, !207, !489}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "getboundingbox", scope: !322, file: !47, line: 80, baseType: !493, size: 64, offset: 2688)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{!120, !314, !215, !215}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalboundingbox", scope: !322, file: !47, line: 81, baseType: !493, size: 64, offset: 2752)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "locatepointssubdomain", scope: !322, file: !47, line: 82, baseType: !498, size: 64, offset: 2816)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!120, !314, !349, !501}
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlocal", scope: !322, file: !47, line: 84, baseType: !504, size: 64, offset: 2880)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!120, !314, !216, !507, !513, !435, !349}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!120, !162, !216, !511, !162, !224, !102}
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !216)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "projectfunctionlabellocal", scope: !322, file: !47, line: 85, baseType: !515, size: 64, offset: 2944)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{!120, !314, !216, !423, !162, !450, !162, !450, !507, !513, !435, !349}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlocal", scope: !322, file: !47, line: 86, baseType: !519, size: 64, offset: 3008)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{!120, !314, !216, !349, !522, !435, !349}
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !162, !162, !162, !450, !450, !526, !526, !526, !450, !450, !526, !526, !526, !216, !511, !162, !526, !224}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !225)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "projectfieldlabellocal", scope: !322, file: !47, line: 87, baseType: !529, size: 64, offset: 3072)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!120, !314, !216, !423, !162, !450, !162, !450, !349, !522, !435, !349}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "projectbdfieldlabellocal", scope: !322, file: !47, line: 88, baseType: !533, size: 64, offset: 3136)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!120, !314, !216, !423, !162, !450, !162, !450, !349, !536, !435, !349}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{null, !162, !162, !162, !450, !450, !526, !526, !526, !450, !450, !526, !526, !526, !216, !511, !511, !162, !526, !224}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "computel2diff", scope: !322, file: !47, line: 89, baseType: !541, size: 64, offset: 3200)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!120, !314, !216, !507, !513, !349, !215}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "computel2gradientdiff", scope: !322, file: !47, line: 90, baseType: !545, size: 64, offset: 3264)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{!120, !314, !216, !548, !513, !349, !511, !215}
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!120, !162, !216, !511, !511, !162, !224, !102}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "computel2fielddiff", scope: !322, file: !47, line: 91, baseType: !541, size: 64, offset: 3328)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "getcompatibility", scope: !322, file: !47, line: 93, baseType: !554, size: 64, offset: 3392)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!120, !314, !314, !407, !407}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "localin", scope: !316, file: !47, line: 204, baseType: !558, size: 6400, offset: 7936)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 6400, elements: !559)
!559 = !{!560}
!560 = !DISubrange(count: 100)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "localout", scope: !316, file: !47, line: 204, baseType: !558, size: 6400, offset: 14336)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "globalin", scope: !316, file: !47, line: 205, baseType: !558, size: 6400, offset: 20736)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "globalout", scope: !316, file: !47, line: 205, baseType: !558, size: 6400, offset: 27136)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "namedglobal", scope: !316, file: !47, line: 206, baseType: !565, size: 64, offset: 33536)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMNamedVecLink", file: !47, line: 141, baseType: !566)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMNamedVecLink", file: !47, line: 142, size: 256, elements: !568)
!568 = !{!569, !570, !571, !573}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "X", scope: !567, file: !47, line: 143, baseType: !349, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !567, file: !47, line: 144, baseType: !189, size: 64, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !567, file: !47, line: 145, baseType: !572, size: 32, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMVecStatus", file: !47, line: 140, baseType: !46)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !567, file: !47, line: 146, baseType: !565, size: 64, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "namedlocal", scope: !316, file: !47, line: 207, baseType: !565, size: 64, offset: 33600)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !316, file: !47, line: 208, baseType: !576, size: 64, offset: 33664)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMWorkLink", file: !47, line: 149, baseType: !577)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMWorkLink", file: !47, line: 150, size: 192, elements: !579)
!579 = !{!580, !581, !582}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !578, file: !47, line: 151, baseType: !273, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !578, file: !47, line: 152, baseType: !102, size: 64, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !578, file: !47, line: 153, baseType: !576, size: 64, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !316, file: !47, line: 208, baseType: !576, size: 64, offset: 33728)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "labels", scope: !316, file: !47, line: 209, baseType: !585, size: 64, offset: 33792)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLabelLink", file: !47, line: 163, baseType: !586)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DMLabelLink", file: !47, line: 158, size: 192, elements: !588)
!588 = !{!589, !590, !591}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !587, file: !47, line: 159, baseType: !423, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !587, file: !47, line: 160, baseType: !277, size: 32, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !587, file: !47, line: 161, baseType: !586, size: 64, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "depthLabel", scope: !316, file: !47, line: 210, baseType: !423, size: 64, offset: 33856)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "celltypeLabel", scope: !316, file: !47, line: 211, baseType: !423, size: 64, offset: 33920)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !316, file: !47, line: 212, baseType: !102, size: 64, offset: 33984)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ctxdestroy", scope: !316, file: !47, line: 213, baseType: !596, size: 64, offset: 34048)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{!120, !513}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "coloringtype", scope: !316, file: !47, line: 214, baseType: !380, size: 32, offset: 34112)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !316, file: !47, line: 215, baseType: !601, size: 64, offset: 34176)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !391, line: 1378, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !391, line: 1378, flags: DIFlagFwdDecl)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "vectype", scope: !316, file: !47, line: 216, baseType: !605, size: 64, offset: 34240)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "VecType", file: !350, line: 83, baseType: !139)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "mattype", scope: !316, file: !47, line: 217, baseType: !607, size: 64, offset: 34304)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !391, line: 25, baseType: !139)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !316, file: !47, line: 218, baseType: !162, size: 32, offset: 34368)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ltogmap", scope: !316, file: !47, line: 219, baseType: !610, size: 64, offset: 34432)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !364, line: 30, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !364, line: 30, flags: DIFlagFwdDecl)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_only", scope: !316, file: !47, line: 220, baseType: !277, size: 32, offset: 34496)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "structure_only", scope: !316, file: !47, line: 221, baseType: !277, size: 32, offset: 34528)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "levelup", scope: !316, file: !47, line: 222, baseType: !162, size: 32, offset: 34560)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "leveldown", scope: !316, file: !47, line: 222, baseType: !162, size: 32, offset: 34592)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !316, file: !47, line: 223, baseType: !277, size: 32, offset: 34624)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !316, file: !47, line: 224, baseType: !277, size: 32, offset: 34656)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !316, file: !47, line: 225, baseType: !102, size: 64, offset: 34688)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "coarseMesh", scope: !316, file: !47, line: 227, baseType: !314, size: 64, offset: 34752)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "fineMesh", scope: !316, file: !47, line: 228, baseType: !314, size: 64, offset: 34816)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !316, file: !47, line: 229, baseType: !623, size: 64, offset: 34880)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCoarsenHookLink", file: !47, line: 100, baseType: !624)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMCoarsenHookLink", file: !47, line: 101, size: 256, elements: !626)
!626 = !{!627, !631, !635, !636}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "coarsenhook", scope: !625, file: !47, line: 102, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!120, !314, !314, !102}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !625, file: !47, line: 103, baseType: !632, size: 64, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DISubroutineType(types: !634)
!634 = !{!120, !314, !390, !349, !390, !314, !102}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !625, file: !47, line: 104, baseType: !102, size: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !625, file: !47, line: 105, baseType: !623, size: 64, offset: 192)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !316, file: !47, line: 230, baseType: !638, size: 64, offset: 34944)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMRefineHookLink", file: !47, line: 108, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMRefineHookLink", file: !47, line: 109, size: 256, elements: !641)
!641 = !{!642, !643, !647, !648}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "refinehook", scope: !640, file: !47, line: 110, baseType: !628, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "interphook", scope: !640, file: !47, line: 111, baseType: !644, size: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!120, !314, !390, !314, !102}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !640, file: !47, line: 112, baseType: !102, size: 64, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !640, file: !47, line: 113, baseType: !638, size: 64, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "subdomainhook", scope: !316, file: !47, line: 231, baseType: !650, size: 64, offset: 35008)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSubDomainHookLink", file: !47, line: 116, baseType: !651)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMSubDomainHookLink", file: !47, line: 117, size: 256, elements: !653)
!653 = !{!654, !655, !659, !660}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ddhook", scope: !652, file: !47, line: 118, baseType: !628, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "restricthook", scope: !652, file: !47, line: 119, baseType: !656, size: 64, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!120, !314, !471, !471, !314, !102}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !652, file: !47, line: 120, baseType: !102, size: 64, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !652, file: !47, line: 121, baseType: !650, size: 64, offset: 192)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "gtolhook", scope: !316, file: !47, line: 232, baseType: !662, size: 64, offset: 35072)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGlobalToLocalHookLink", file: !47, line: 124, baseType: !663)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMGlobalToLocalHookLink", file: !47, line: 125, size: 256, elements: !665)
!665 = !{!666, !670, !671, !672}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !664, file: !47, line: 126, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!120, !314, !349, !435, !349, !102}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !664, file: !47, line: 127, baseType: !667, size: 64, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !664, file: !47, line: 128, baseType: !102, size: 64, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !664, file: !47, line: 129, baseType: !662, size: 64, offset: 192)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ltoghook", scope: !316, file: !47, line: 233, baseType: !674, size: 64, offset: 35136)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMLocalToGlobalHookLink", file: !47, line: 132, baseType: !675)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DMLocalToGlobalHookLink", file: !47, line: 133, size: 256, elements: !677)
!677 = !{!678, !679, !680, !681}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "beginhook", scope: !676, file: !47, line: 134, baseType: !667, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "endhook", scope: !676, file: !47, line: 135, baseType: !667, size: 64, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !676, file: !47, line: 136, baseType: !102, size: 64, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !676, file: !47, line: 137, baseType: !674, size: 64, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !316, file: !47, line: 235, baseType: !162, size: 32, offset: 35200)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "auxData", scope: !316, file: !47, line: 237, baseType: !684, size: 64, offset: 35264)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapAux", file: !47, line: 27, baseType: !685)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapAux_t", file: !47, line: 27, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapAux_s", file: !47, line: 27, size: 320, elements: !688)
!688 = !{!689, !693, !694, !695, !696, !698, !705}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !687, file: !47, line: 27, baseType: !690, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !691, line: 166, baseType: !692)
!691 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/khash/khash.h", directory: "/home/users/ndemeye/xSDK")
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !691, line: 139, baseType: !5)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !687, file: !47, line: 27, baseType: !690, size: 32, offset: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !687, file: !47, line: 27, baseType: !690, size: 32, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !687, file: !47, line: 27, baseType: !690, size: 32, offset: 96)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !687, file: !47, line: 27, baseType: !697, size: 64, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !687, file: !47, line: 27, baseType: !699, size: 64, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHashAuxKey", file: !47, line: 21, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscHashAuxKey", file: !47, line: 17, size: 128, elements: !702)
!702 = !{!703, !704}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !701, file: !47, line: 19, baseType: !423, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !701, file: !47, line: 20, baseType: !162, size: 32, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !687, file: !47, line: 27, baseType: !348, size: 64, offset: 256)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "sfMigration", scope: !316, file: !47, line: 239, baseType: !473, size: 64, offset: 35328)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !316, file: !47, line: 240, baseType: !473, size: 64, offset: 35392)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "sectionSF", scope: !316, file: !47, line: 241, baseType: !473, size: 64, offset: 35456)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "sfNatural", scope: !316, file: !47, line: 242, baseType: !473, size: 64, offset: 35520)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "useNatural", scope: !316, file: !47, line: 243, baseType: !277, size: 32, offset: 35584)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !316, file: !47, line: 245, baseType: !712, size: 64, offset: 35616)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 64, elements: !238)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "localSection", scope: !316, file: !47, line: 246, baseType: !714, size: 64, offset: 35712)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSection", file: !715, line: 18, baseType: !716)
!715 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscsectiontypes.h", directory: "/home/users/ndemeye/xSDK")
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSection", file: !718, line: 29, size: 5760, elements: !719)
!718 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/sectionimpl.h", directory: "/home/users/ndemeye/xSDK")
!719 = !{!720, !721, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !739, !740, !741, !742, !767, !768, !769}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !717, file: !718, line: 30, baseType: !319, size: 4480)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !717, file: !718, line: 30, baseType: !722, size: 32, offset: 4480)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 32, elements: !158)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "pStart", scope: !717, file: !718, line: 31, baseType: !162, size: 32, offset: 4512)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "pEnd", scope: !717, file: !718, line: 31, baseType: !162, size: 32, offset: 4544)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !717, file: !718, line: 32, baseType: !363, size: 64, offset: 4608)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "pointMajor", scope: !717, file: !718, line: 33, baseType: !277, size: 32, offset: 4672)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "includesConstraints", scope: !717, file: !718, line: 34, baseType: !277, size: 32, offset: 4704)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "atlasDof", scope: !717, file: !718, line: 35, baseType: !207, size: 64, offset: 4736)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "atlasOff", scope: !717, file: !718, line: 36, baseType: !207, size: 64, offset: 4800)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "maxDof", scope: !717, file: !718, line: 37, baseType: !162, size: 32, offset: 4864)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !717, file: !718, line: 38, baseType: !714, size: 64, offset: 4928)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "bcIndices", scope: !717, file: !718, line: 39, baseType: !207, size: 64, offset: 4992)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !717, file: !718, line: 40, baseType: !277, size: 32, offset: 5056)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "numFields", scope: !717, file: !718, line: 42, baseType: !162, size: 32, offset: 5088)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "fieldNames", scope: !717, file: !718, line: 43, baseType: !360, size: 64, offset: 5120)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "numFieldComponents", scope: !717, file: !718, line: 44, baseType: !207, size: 64, offset: 5184)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !717, file: !718, line: 45, baseType: !738, size: 64, offset: 5248)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "useFieldOff", scope: !717, file: !718, line: 46, baseType: !277, size: 32, offset: 5312)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "compNames", scope: !717, file: !718, line: 47, baseType: !359, size: 64, offset: 5376)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "clObj", scope: !717, file: !718, line: 49, baseType: !103, size: 64, offset: 5440)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "clHash", scope: !717, file: !718, line: 50, baseType: !743, size: 64, offset: 5504)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClPerm", file: !718, line: 27, baseType: !744)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_ClPerm_t", file: !718, line: 27, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_ClPerm_s", file: !718, line: 27, size: 320, elements: !747)
!747 = !{!748, !749, !750, !751, !752, !753, !760}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !746, file: !718, line: 27, baseType: !690, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !746, file: !718, line: 27, baseType: !690, size: 32, offset: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !746, file: !718, line: 27, baseType: !690, size: 32, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !746, file: !718, line: 27, baseType: !690, size: 32, offset: 96)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !746, file: !718, line: 27, baseType: !697, size: 64, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !746, file: !718, line: 27, baseType: !754, size: 64, offset: 192)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermKey", file: !718, line: 10, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PetscSectionClosurePermKey", file: !718, line: 8, size: 64, elements: !757)
!757 = !{!758, !759}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !756, file: !718, line: 9, baseType: !162, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !756, file: !718, line: 9, baseType: !162, size: 32, offset: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !746, file: !718, line: 27, baseType: !761, size: 64, offset: 256)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionClosurePermVal", file: !718, line: 14, baseType: !763)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !718, line: 12, size: 128, elements: !764)
!764 = !{!765, !766}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !763, file: !718, line: 13, baseType: !207, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "invPerm", scope: !763, file: !718, line: 13, baseType: !207, size: 64, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "clSection", scope: !717, file: !718, line: 51, baseType: !714, size: 64, offset: 5568)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "clPoints", scope: !717, file: !718, line: 52, baseType: !363, size: 64, offset: 5632)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !717, file: !718, line: 53, baseType: !770, size: 64, offset: 5696)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSectionSym", file: !715, line: 33, baseType: !771)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscSectionSym", file: !718, line: 72, size: 4864, elements: !773)
!773 = !{!774, !775, !793, !794, !803}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !772, file: !718, line: 73, baseType: !319, size: 4480)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !772, file: !718, line: 73, baseType: !776, size: 192, offset: 4480)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !777, size: 192, elements: !158)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscSectionSymOps", file: !718, line: 56, size: 192, elements: !778)
!778 = !{!779, !785, !789}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "getpoints", scope: !777, file: !718, line: 57, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{!120, !770, !714, !162, !450, !783, !784}
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !777, file: !718, line: 58, baseType: !786, size: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!120, !770}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !777, file: !718, line: 59, baseType: !790, size: 64, offset: 128)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{!120, !770, !126}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !772, file: !718, line: 74, baseType: !102, size: 64, offset: 4672)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "workin", scope: !772, file: !718, line: 75, baseType: !795, size: 64, offset: 4736)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "SymWorkLink", file: !718, line: 62, baseType: !796)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_SymWorkLink", file: !718, line: 64, size: 256, elements: !798)
!798 = !{!799, !800, !801, !802}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !797, file: !718, line: 66, baseType: !795, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "perms", scope: !797, file: !718, line: 67, baseType: !783, size: 64, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "rots", scope: !797, file: !718, line: 68, baseType: !784, size: 64, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "numPoints", scope: !797, file: !718, line: 69, baseType: !162, size: 32, offset: 192)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "workout", scope: !772, file: !718, line: 76, baseType: !795, size: 64, offset: 4800)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "globalSection", scope: !316, file: !47, line: 247, baseType: !714, size: 64, offset: 35776)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !316, file: !47, line: 248, baseType: !806, size: 64, offset: 35840)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !364, line: 60, baseType: !807)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !25, line: 240, size: 640, elements: !809)
!809 = !{!810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !808, file: !25, line: 241, baseType: !98, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !808, file: !25, line: 242, baseType: !179, size: 32, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !808, file: !25, line: 243, baseType: !162, size: 32, offset: 96)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !808, file: !25, line: 243, baseType: !162, size: 32, offset: 128)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !808, file: !25, line: 244, baseType: !162, size: 32, offset: 160)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !808, file: !25, line: 244, baseType: !162, size: 32, offset: 192)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !808, file: !25, line: 245, baseType: !207, size: 64, offset: 256)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !808, file: !25, line: 246, baseType: !277, size: 32, offset: 320)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !808, file: !25, line: 247, baseType: !162, size: 32, offset: 352)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !808, file: !25, line: 251, baseType: !162, size: 32, offset: 384)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !808, file: !25, line: 252, baseType: !610, size: 64, offset: 448)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !808, file: !25, line: 253, baseType: !277, size: 32, offset: 512)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !808, file: !25, line: 254, baseType: !162, size: 32, offset: 544)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !808, file: !25, line: 254, baseType: !162, size: 32, offset: 576)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !808, file: !25, line: 255, baseType: !162, size: 32, offset: 608)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintSection", scope: !316, file: !47, line: 250, baseType: !714, size: 64, offset: 35904)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "defaultConstraintMat", scope: !316, file: !47, line: 251, baseType: !390, size: 64, offset: 35968)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "transformDM", scope: !316, file: !47, line: 253, baseType: !314, size: 64, offset: 36032)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !316, file: !47, line: 254, baseType: !349, size: 64, offset: 36096)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "transformCtx", scope: !316, file: !47, line: 255, baseType: !102, size: 64, offset: 36160)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "transformSetUp", scope: !316, file: !47, line: 256, baseType: !831, size: 64, offset: 36224)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{!120, !314, !102}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "transformDestroy", scope: !316, file: !47, line: 257, baseType: !831, size: 64, offset: 36288)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "transformGetMatrix", scope: !316, file: !47, line: 258, baseType: !836, size: 64, offset: 36352)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{!120, !314, !511, !277, !784, !102}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !316, file: !47, line: 260, baseType: !162, size: 32, offset: 36416)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateDM", scope: !316, file: !47, line: 261, baseType: !314, size: 64, offset: 36480)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "coordinates", scope: !316, file: !47, line: 262, baseType: !349, size: 64, offset: 36544)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "coordinatesLocal", scope: !316, file: !47, line: 263, baseType: !349, size: 64, offset: 36608)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !316, file: !47, line: 264, baseType: !277, size: 32, offset: 36672)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "coordinateField", scope: !316, file: !47, line: 265, baseType: !373, size: 64, offset: 36736)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !316, file: !47, line: 266, baseType: !215, size: 64, offset: 36800)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "maxCell", scope: !316, file: !47, line: 266, baseType: !215, size: 64, offset: 36864)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "bdtype", scope: !316, file: !47, line: 267, baseType: !848, size: 64, offset: 36928)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryType", file: !41, line: 42, baseType: !51)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "nullspaceConstructors", scope: !316, file: !47, line: 269, baseType: !851, size: 640, offset: 36992)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !852, size: 640, elements: !860)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "NullSpaceFunc", file: !47, line: 15, baseType: !853)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{!120, !314, !162, !162, !856}
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !391, line: 1723, baseType: !858)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !391, line: 1723, flags: DIFlagFwdDecl)
!860 = !{!861}
!861 = !DISubrange(count: 10)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "nearnullspaceConstructors", scope: !316, file: !47, line: 270, baseType: !851, size: 640, offset: 37632)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !316, file: !47, line: 272, baseType: !162, size: 32, offset: 38272)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !316, file: !47, line: 273, baseType: !865, size: 64, offset: 38336)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "RegionField", file: !47, line: 178, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Field", file: !47, line: 173, size: 256, elements: !868)
!868 = !{!869, !870, !871, !872}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !867, file: !47, line: 174, baseType: !103, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !867, file: !47, line: 175, baseType: !423, size: 64, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "adjacency", scope: !867, file: !47, line: 176, baseType: !712, size: 64, offset: 128)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "avoidTensor", scope: !867, file: !47, line: 177, baseType: !277, size: 32, offset: 192)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !316, file: !47, line: 274, baseType: !874, size: 64, offset: 38400)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundary", file: !47, line: 165, baseType: !875)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Boundary", file: !47, line: 167, size: 192, elements: !877)
!877 = !{!878, !959, !960}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "dsboundary", scope: !876, file: !47, line: 168, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSBoundary", file: !880, line: 11, baseType: !881)
!880 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscdsimpl.h", directory: "/home/users/ndemeye/xSDK")
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_DSBoundary", file: !880, line: 13, size: 832, elements: !883)
!883 = !{!884, !885, !886, !887, !888, !889, !950, !952, !953, !954, !955, !956, !957, !958}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !882, file: !880, line: 14, baseType: !139, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !882, file: !880, line: 15, baseType: !423, size: 64, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "lname", scope: !882, file: !880, line: 16, baseType: !139, size: 64, offset: 128)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "Nv", scope: !882, file: !880, line: 17, baseType: !162, size: 32, offset: 192)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !882, file: !880, line: 18, baseType: !207, size: 64, offset: 256)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "wf", scope: !882, file: !880, line: 19, baseType: !890, size: 64, offset: 320)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscWeakForm", file: !891, line: 22, baseType: !892)
!891 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdstypes.h", directory: "/home/users/ndemeye/xSDK")
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscWeakForm", file: !880, line: 81, size: 4992, elements: !894)
!894 = !{!895, !896, !910, !911, !912, !921}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !893, file: !880, line: 82, baseType: !319, size: 4480)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !893, file: !880, line: 82, baseType: !897, size: 256, offset: 4480)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !898, size: 256, elements: !158)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscWeakFormOps", file: !880, line: 74, size: 256, elements: !899)
!899 = !{!900, !904, !905, !909}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !898, file: !880, line: 75, baseType: !901, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{!120, !890}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !898, file: !880, line: 76, baseType: !901, size: 64, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !898, file: !880, line: 77, baseType: !906, size: 64, offset: 128)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{!120, !890, !126}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !898, file: !880, line: 78, baseType: !901, size: 64, offset: 192)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !893, file: !880, line: 83, baseType: !102, size: 64, offset: 4736)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !893, file: !880, line: 85, baseType: !162, size: 32, offset: 4800)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !893, file: !880, line: 86, baseType: !913, size: 64, offset: 4864)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunkBuffer", file: !880, line: 41, baseType: !915)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !880, line: 36, size: 256, elements: !916)
!916 = !{!917, !918, !919, !920}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !915, file: !880, line: 37, baseType: !273, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !915, file: !880, line: 38, baseType: !273, size: 64, offset: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "unitbytes", scope: !915, file: !880, line: 39, baseType: !273, size: 64, offset: 128)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !915, file: !880, line: 40, baseType: !189, size: 64, offset: 192)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "form", scope: !893, file: !880, line: 87, baseType: !922, size: 64, offset: 4928)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscHMapForm", file: !880, line: 54, baseType: !924)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "kh_HMapForm_t", file: !880, line: 54, baseType: !926)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kh_HMapForm_s", file: !880, line: 54, size: 320, elements: !927)
!927 = !{!928, !929, !930, !931, !932, !933, !942}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "n_buckets", scope: !926, file: !880, line: 54, baseType: !690, size: 32)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !926, file: !880, line: 54, baseType: !690, size: 32, offset: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "n_occupied", scope: !926, file: !880, line: 54, baseType: !690, size: 32, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !926, file: !880, line: 54, baseType: !690, size: 32, offset: 96)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !926, file: !880, line: 54, baseType: !697, size: 64, offset: 128)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !926, file: !880, line: 54, baseType: !934, size: 64, offset: 192)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFormKey", file: !891, line: 41, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscFormKey", file: !891, line: 35, size: 192, elements: !937)
!937 = !{!938, !939, !940, !941}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !936, file: !891, line: 37, baseType: !423, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !936, file: !891, line: 38, baseType: !162, size: 32, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !936, file: !891, line: 39, baseType: !162, size: 32, offset: 96)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !936, file: !891, line: 40, baseType: !162, size: 32, offset: 128)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !926, file: !880, line: 54, baseType: !943, size: 64, offset: 256)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscChunk", file: !880, line: 34, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !880, line: 30, size: 96, elements: !946)
!946 = !{!947, !948, !949}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !945, file: !880, line: 31, baseType: !162, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !945, file: !880, line: 32, baseType: !162, size: 32, offset: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !945, file: !880, line: 33, baseType: !162, size: 32, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !882, file: !880, line: 20, baseType: !951, size: 32, offset: 384)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMBoundaryConditionType", file: !41, line: 60, baseType: !58)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !882, file: !880, line: 21, baseType: !162, size: 32, offset: 416)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !882, file: !880, line: 22, baseType: !162, size: 32, offset: 448)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "comps", scope: !882, file: !880, line: 23, baseType: !207, size: 64, offset: 512)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !882, file: !880, line: 24, baseType: !150, size: 64, offset: 576)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "func_t", scope: !882, file: !880, line: 25, baseType: !150, size: 64, offset: 640)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !882, file: !880, line: 26, baseType: !102, size: 64, offset: 704)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !882, file: !880, line: 27, baseType: !879, size: 64, offset: 768)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !876, file: !47, line: 169, baseType: !423, size: 64, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !876, file: !47, line: 170, baseType: !874, size: 64, offset: 128)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "Nds", scope: !316, file: !47, line: 275, baseType: !162, size: 32, offset: 38464)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "probs", scope: !316, file: !47, line: 276, baseType: !963, size: 64, offset: 38528)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSpace", file: !47, line: 184, baseType: !965)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Space", file: !47, line: 180, size: 192, elements: !966)
!966 = !{!967, !1048, !1049}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !965, file: !47, line: 181, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscDS", file: !891, line: 13, baseType: !969)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscDS", file: !880, line: 98, size: 7232, elements: !971)
!971 = !{!972, !973, !987, !988, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1004, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !970, file: !880, line: 99, baseType: !319, size: 4480)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !970, file: !880, line: 99, baseType: !974, size: 256, offset: 4480)
!974 = !DICompositeType(tag: DW_TAG_array_type, baseType: !975, size: 256, elements: !158)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PetscDSOps", file: !880, line: 91, size: 256, elements: !976)
!976 = !{!977, !981, !982, !986}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !975, file: !880, line: 92, baseType: !978, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!120, !968}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !975, file: !880, line: 93, baseType: !978, size: 64, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !975, file: !880, line: 94, baseType: !983, size: 64, offset: 128)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!120, !968, !126}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !975, file: !880, line: 95, baseType: !978, size: 64, offset: 192)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !970, file: !880, line: 100, baseType: !102, size: 64, offset: 4736)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "subprobs", scope: !970, file: !880, line: 101, baseType: !989, size: 64, offset: 4800)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !970, file: !880, line: 102, baseType: !277, size: 32, offset: 4864)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "isHybrid", scope: !970, file: !880, line: 103, baseType: !277, size: 32, offset: 4896)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "dimEmbed", scope: !970, file: !880, line: 104, baseType: !162, size: 32, offset: 4928)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "Nf", scope: !970, file: !880, line: 105, baseType: !162, size: 32, offset: 4960)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "disc", scope: !970, file: !880, line: 106, baseType: !134, size: 64, offset: 4992)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "boundary", scope: !970, file: !880, line: 108, baseType: !879, size: 64, offset: 5056)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "useJacPre", scope: !970, file: !880, line: 109, baseType: !277, size: 32, offset: 5120)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "implicit", scope: !970, file: !880, line: 110, baseType: !407, size: 64, offset: 5184)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "jetDegree", scope: !970, file: !880, line: 111, baseType: !207, size: 64, offset: 5248)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "wf", scope: !970, file: !880, line: 112, baseType: !890, size: 64, offset: 5312)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !970, file: !880, line: 113, baseType: !1001, size: 64, offset: 5376)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscPointFunc", file: !1003, line: 563, baseType: !523)
!1003 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscds.h", directory: "/home/users/ndemeye/xSDK")
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "exactSol", scope: !970, file: !880, line: 114, baseType: !1005, size: 64, offset: 5440)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSimplePointFunc", file: !1003, line: 580, baseType: !508)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "exactCtx", scope: !970, file: !880, line: 115, baseType: !513, size: 64, offset: 5504)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "exactSol_t", scope: !970, file: !880, line: 116, baseType: !1005, size: 64, offset: 5568)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "exactCtx_t", scope: !970, file: !880, line: 117, baseType: !513, size: 64, offset: 5632)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "numConstants", scope: !970, file: !880, line: 118, baseType: !162, size: 32, offset: 5696)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "constants", scope: !970, file: !880, line: 119, baseType: !224, size: 64, offset: 5760)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !970, file: !880, line: 120, baseType: !513, size: 64, offset: 5824)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "totDim", scope: !970, file: !880, line: 122, baseType: !162, size: 32, offset: 5888)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "totComp", scope: !970, file: !880, line: 123, baseType: !162, size: 32, offset: 5920)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !970, file: !880, line: 124, baseType: !207, size: 64, offset: 5952)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "Nb", scope: !970, file: !880, line: 125, baseType: !207, size: 64, offset: 6016)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !970, file: !880, line: 126, baseType: !207, size: 64, offset: 6080)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "offDer", scope: !970, file: !880, line: 127, baseType: !207, size: 64, offset: 6144)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "T", scope: !970, file: !880, line: 128, baseType: !1020, size: 64, offset: 6208)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscTabulation", file: !1022, line: 481, baseType: !1023)
!1022 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdt.h", directory: "/home/users/ndemeye/xSDK")
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscTabulation", file: !1022, line: 469, size: 256, elements: !1025)
!1025 = !{!1026, !1027, !1028, !1029, !1030, !1031, !1032}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "K", scope: !1024, file: !1022, line: 470, baseType: !162, size: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "Nr", scope: !1024, file: !1022, line: 471, baseType: !162, size: 32, offset: 32)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "Np", scope: !1024, file: !1022, line: 472, baseType: !162, size: 32, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "Nb", scope: !1024, file: !1022, line: 473, baseType: !162, size: 32, offset: 96)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "Nc", scope: !1024, file: !1022, line: 474, baseType: !162, size: 32, offset: 128)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "cdim", scope: !1024, file: !1022, line: 475, baseType: !162, size: 32, offset: 160)
