; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/gs/snesgs.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/snes/impls/gs/snesgs.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_predefined_datatype_t = type opaque
%struct.ompi_predefined_op_t = type opaque
%struct.ompi_datatype_t = type opaque
%struct._n_PetscSegBuffer = type opaque

!33 = !DIEnumerator(name: "SNES_DIVERGED_FUNCTION_COUNT", value: -2)
!34 = !DIEnumerator(name: "SNES_DIVERGED_LINEAR_SOLVE", value: -3)
!35 = !DIEnumerator(name: "SNES_DIVERGED_FNORM_NAN", value: -4)
!36 = !DIEnumerator(name: "SNES_DIVERGED_MAX_IT", value: -5)
!37 = !DIEnumerator(name: "SNES_DIVERGED_LINE_SEARCH", value: -6)
!38 = !DIEnumerator(name: "SNES_DIVERGED_INNER", value: -7)
!39 = !DIEnumerator(name: "SNES_DIVERGED_LOCAL_MIN", value: -8)
!40 = !DIEnumerator(name: "SNES_DIVERGED_DTOL", value: -9)
!41 = !DIEnumerator(name: "SNES_DIVERGED_JACOBIAN_DOMAIN", value: -10)
!42 = !DIEnumerator(name: "SNES_DIVERGED_TR_DELTA", value: -11)
!43 = !DIEnumerator(name: "SNES_CONVERGED_TR_DELTA", value: -11)
!44 = !DIEnumerator(name: "SNES_CONVERGED_ITERATING", value: 0)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !46, line: 85, baseType: !26, size: 32, elements: !47)
!46 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpctypes.h", directory: "/home/users/ndemeye/xSDK")
!47 = !{!48, !49, !50, !51}
!48 = !DIEnumerator(name: "PC_SIDE_DEFAULT", value: -1)
!49 = !DIEnumerator(name: "PC_LEFT", value: 0)
!50 = !DIEnumerator(name: "PC_RIGHT", value: 1)
!51 = !DIEnumerator(name: "PC_SYMMETRIC", value: 2)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !53, line: 285, baseType: !5, size: 32, elements: !54)
!53 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmat.h", directory: "/home/users/ndemeye/xSDK")
!54 = !{!55, !56, !57, !58}
!55 = !DIEnumerator(name: "DIFFERENT_NONZERO_PATTERN", value: 0, isUnsigned: true)
!56 = !DIEnumerator(name: "SUBSET_NONZERO_PATTERN", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "SAME_NONZERO_PATTERN", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "UNKNOWN_NONZERO_PATTERN", value: 3, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 406, baseType: !26, size: 32, elements: !60)
!60 = !{!61, !62, !63, !64, !65, !66}
!61 = !DIEnumerator(name: "SNES_NORM_DEFAULT", value: -1)
!62 = !DIEnumerator(name: "SNES_NORM_NONE", value: 0)
!63 = !DIEnumerator(name: "SNES_NORM_ALWAYS", value: 1)
!64 = !DIEnumerator(name: "SNES_NORM_INITIAL_ONLY", value: 2)
!65 = !DIEnumerator(name: "SNES_NORM_FINAL_ONLY", value: 3)
!66 = !DIEnumerator(name: "SNES_NORM_INITIAL_FINAL_ONLY", value: 4)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 493, baseType: !26, size: 32, elements: !68)
!68 = !{!69, !70, !71}
!69 = !DIEnumerator(name: "SNES_FUNCTION_DEFAULT", value: -1)
!70 = !DIEnumerator(name: "SNES_FUNCTION_UNPRECONDITIONED", value: 0)
!71 = !DIEnumerator(name: "SNES_FUNCTION_PRECONDITIONED", value: 1)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !73, line: 663, baseType: !5, size: 32, elements: !74)
!73 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!74 = !{!75, !76, !77}
!75 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!76 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!77 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 385, baseType: !5, size: 32, elements: !79)
!79 = !{!80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97}
!80 = !DIEnumerator(name: "PETSC_DATATYPE_UNKNOWN", value: 0, isUnsigned: true)
!81 = !DIEnumerator(name: "PETSC_DOUBLE", value: 1, isUnsigned: true)
!82 = !DIEnumerator(name: "PETSC_COMPLEX", value: 2, isUnsigned: true)
!83 = !DIEnumerator(name: "PETSC_LONG", value: 3, isUnsigned: true)
!84 = !DIEnumerator(name: "PETSC_SHORT", value: 4, isUnsigned: true)
!85 = !DIEnumerator(name: "PETSC_FLOAT", value: 5, isUnsigned: true)
!86 = !DIEnumerator(name: "PETSC_CHAR", value: 6, isUnsigned: true)
!87 = !DIEnumerator(name: "PETSC_BIT_LOGICAL", value: 7, isUnsigned: true)
!88 = !DIEnumerator(name: "PETSC_ENUM", value: 8, isUnsigned: true)
!89 = !DIEnumerator(name: "PETSC_BOOL", value: 9, isUnsigned: true)
!90 = !DIEnumerator(name: "PETSC___FLOAT128", value: 10, isUnsigned: true)
!91 = !DIEnumerator(name: "PETSC_OBJECT", value: 11, isUnsigned: true)
!92 = !DIEnumerator(name: "PETSC_FUNCTION", value: 12, isUnsigned: true)
!93 = !DIEnumerator(name: "PETSC_STRING", value: 13, isUnsigned: true)
!94 = !DIEnumerator(name: "PETSC___FP16", value: 14, isUnsigned: true)
!95 = !DIEnumerator(name: "PETSC_STRUCT", value: 15, isUnsigned: true)
!96 = !DIEnumerator(name: "PETSC_INT", value: 16, isUnsigned: true)
!97 = !DIEnumerator(name: "PETSC_INT64", value: 17, isUnsigned: true)
!98 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !99, line: 155, baseType: !5, size: 32, elements: !100)
!99 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscvec.h", directory: "/home/users/ndemeye/xSDK")
!100 = !{!101, !102, !103, !104, !105}
!101 = !DIEnumerator(name: "NORM_1", value: 0, isUnsigned: true)
!102 = !DIEnumerator(name: "NORM_2", value: 1, isUnsigned: true)
!103 = !DIEnumerator(name: "NORM_FROBENIUS", value: 2, isUnsigned: true)
!104 = !DIEnumerator(name: "NORM_INFINITY", value: 3, isUnsigned: true)
!105 = !DIEnumerator(name: "NORM_1_AND_2", value: 4, isUnsigned: true)
!106 = !{!107, !128, !132, !133, !117, !168, !206, !332, !335, !216, !26, !299, !5}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES_NGS", file: !109, line: 16, baseType: !110)
!109 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/snes/impls/gs/gsimpl.h", directory: "/home/users/ndemeye/xSDK")
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !109, line: 7, size: 448, elements: !111)
!111 = !{!112, !114, !115, !118, !119, !120, !121, !123}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "sweeps", scope: !110, file: !109, line: 8, baseType: !113, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !26)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !110, file: !109, line: 9, baseType: !113, size: 32, offset: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !110, file: !109, line: 10, baseType: !116, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !117)
!117 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !110, file: !109, line: 11, baseType: !116, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "stol", scope: !110, file: !109, line: 12, baseType: !116, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !110, file: !109, line: 13, baseType: !116, size: 64, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "secant_mat", scope: !110, file: !109, line: 14, baseType: !122, size: 32, offset: 320)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "coloring", scope: !110, file: !109, line: 15, baseType: !124, size: 64, offset: 384)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !125, line: 51, baseType: !126)
!125 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !125, line: 51, flags: DIFlagFwdDecl)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !129, line: 330, baseType: !130)
!129 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !129, line: 330, flags: DIFlagFwdDecl)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !136, line: 73, size: 4480, elements: !137)
!136 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!137 = !{!138, !140, !189, !190, !191, !193, !194, !195, !196, !204, !205, !207, !211, !215, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !228, !229, !230, !232, !233, !235, !237, !238, !239, !240, !241, !243, !245, !246, !247, !248, !249, !252, !254, !255, !256, !266, !268, !269, !273, !274, !322, !327, !329, !330, !331}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !135, file: !136, line: 74, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !26)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !135, file: !136, line: 75, baseType: !141, size: 448, offset: 64)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 448, elements: !187)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !136, line: 53, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !136, line: 45, size: 448, elements: !144)
!144 = !{!145, !151, !159, !164, !171, !175, !182}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !143, file: !136, line: 46, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!149, !133, !150}
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !26)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !143, file: !136, line: 47, baseType: !152, size: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!149, !133, !155}
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !156, line: 16, baseType: !157)
!156 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !156, line: 16, flags: DIFlagFwdDecl)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !143, file: !136, line: 48, baseType: !160, size: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!149, !163}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !143, file: !136, line: 49, baseType: !165, size: 64, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!149, !133, !168, !133}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !170)
!170 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !143, file: !136, line: 50, baseType: !172, size: 64, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!149, !133, !168, !163}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !143, file: !136, line: 51, baseType: !176, size: 64, offset: 320)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!149, !133, !168, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{null}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !143, file: !136, line: 52, baseType: !183, size: 64, offset: 384)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!149, !133, !168, !186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!187 = !{!188}
!188 = !DISubrange(count: 1)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !135, file: !136, line: 76, baseType: !128, size: 64, offset: 512)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !135, file: !136, line: 77, baseType: !113, size: 32, offset: 576)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !135, file: !136, line: 78, baseType: !192, size: 64, offset: 640)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !117)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !135, file: !136, line: 78, baseType: !192, size: 64, offset: 704)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !135, file: !136, line: 78, baseType: !192, size: 64, offset: 768)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !135, file: !136, line: 78, baseType: !192, size: 64, offset: 832)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !135, file: !136, line: 79, baseType: !197, size: 64, offset: 896)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !200, line: 27, baseType: !201)
!200 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !202, line: 43, baseType: !203)
!202 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!203 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !135, file: !136, line: 80, baseType: !113, size: 32, offset: 960)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !135, file: !136, line: 81, baseType: !206, size: 32, offset: 992)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !26)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !135, file: !136, line: 82, baseType: !208, size: 64, offset: 1024)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !135, file: !136, line: 83, baseType: !212, size: 64, offset: 1088)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !135, file: !136, line: 84, baseType: !216, size: 64, offset: 1152)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !135, file: !136, line: 85, baseType: !216, size: 64, offset: 1216)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !135, file: !136, line: 86, baseType: !216, size: 64, offset: 1280)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !135, file: !136, line: 87, baseType: !216, size: 64, offset: 1344)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !135, file: !136, line: 88, baseType: !133, size: 64, offset: 1408)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !135, file: !136, line: 89, baseType: !197, size: 64, offset: 1472)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !135, file: !136, line: 90, baseType: !216, size: 64, offset: 1536)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !135, file: !136, line: 91, baseType: !216, size: 64, offset: 1600)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !135, file: !136, line: 92, baseType: !113, size: 32, offset: 1664)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !135, file: !136, line: 93, baseType: !132, size: 64, offset: 1728)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !135, file: !136, line: 94, baseType: !227, size: 64, offset: 1792)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !198)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !135, file: !136, line: 95, baseType: !113, size: 32, offset: 1856)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !135, file: !136, line: 95, baseType: !113, size: 32, offset: 1888)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !135, file: !136, line: 96, baseType: !231, size: 64, offset: 1920)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !135, file: !136, line: 96, baseType: !231, size: 64, offset: 1984)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !135, file: !136, line: 97, baseType: !234, size: 64, offset: 2048)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !135, file: !136, line: 97, baseType: !236, size: 64, offset: 2112)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !135, file: !136, line: 98, baseType: !113, size: 32, offset: 2176)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !135, file: !136, line: 98, baseType: !113, size: 32, offset: 2208)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !135, file: !136, line: 99, baseType: !231, size: 64, offset: 2240)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !135, file: !136, line: 99, baseType: !231, size: 64, offset: 2304)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !135, file: !136, line: 100, baseType: !242, size: 64, offset: 2368)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !135, file: !136, line: 100, baseType: !244, size: 64, offset: 2432)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !135, file: !136, line: 101, baseType: !113, size: 32, offset: 2496)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !135, file: !136, line: 101, baseType: !113, size: 32, offset: 2528)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !135, file: !136, line: 102, baseType: !231, size: 64, offset: 2560)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !135, file: !136, line: 102, baseType: !231, size: 64, offset: 2624)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !135, file: !136, line: 103, baseType: !250, size: 64, offset: 2688)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !116)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !135, file: !136, line: 103, baseType: !253, size: 64, offset: 2752)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !135, file: !136, line: 104, baseType: !186, size: 64, offset: 2816)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !135, file: !136, line: 105, baseType: !113, size: 32, offset: 2880)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !135, file: !136, line: 106, baseType: !257, size: 128, offset: 2944)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, size: 128, elements: !264)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !136, line: 64, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !136, line: 61, size: 128, elements: !261)
!261 = !{!262, !263}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !260, file: !136, line: 62, baseType: !179, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !260, file: !136, line: 63, baseType: !132, size: 64, offset: 64)
!264 = !{!265}
!265 = !DISubrange(count: 2)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !135, file: !136, line: 107, baseType: !267, size: 64, offset: 3072)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 64, elements: !264)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !135, file: !136, line: 108, baseType: !132, size: 64, offset: 3136)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !135, file: !136, line: 109, baseType: !270, size: 64, offset: 3200)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!149, !132}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !135, file: !136, line: 111, baseType: !113, size: 32, offset: 3264)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !135, file: !136, line: 112, baseType: !275, size: 320, offset: 3328)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 320, elements: !320)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!149, !279, !133, !132}
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !282)
!282 = !{!283, !284, !308, !309, !310, !311, !312, !313, !314, !315, !316}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !281, file: !10, line: 100, baseType: !113, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !281, file: !10, line: 101, baseType: !285, size: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !296, !297, !298, !302, !303, !305, !306, !307}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !287, file: !10, line: 84, baseType: !216, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !287, file: !10, line: 85, baseType: !216, size: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !287, file: !10, line: 86, baseType: !132, size: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !287, file: !10, line: 87, baseType: !208, size: 64, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !287, file: !10, line: 88, baseType: !294, size: 64, offset: 256)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !287, file: !10, line: 89, baseType: !170, size: 8, offset: 320)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !287, file: !10, line: 90, baseType: !216, size: 64, offset: 384)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !287, file: !10, line: 91, baseType: !299, size: 64, offset: 448)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !300, line: 46, baseType: !301)
!300 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!301 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !287, file: !10, line: 92, baseType: !122, size: 32, offset: 512)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !287, file: !10, line: 93, baseType: !304, size: 32, offset: 544)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !287, file: !10, line: 94, baseType: !285, size: 64, offset: 576)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !287, file: !10, line: 95, baseType: !216, size: 64, offset: 640)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !287, file: !10, line: 96, baseType: !132, size: 64, offset: 704)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !281, file: !10, line: 102, baseType: !216, size: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !281, file: !10, line: 102, baseType: !216, size: 64, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !281, file: !10, line: 103, baseType: !216, size: 64, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !281, file: !10, line: 104, baseType: !128, size: 64, offset: 320)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !281, file: !10, line: 105, baseType: !122, size: 32, offset: 384)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !281, file: !10, line: 105, baseType: !122, size: 32, offset: 416)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !281, file: !10, line: 105, baseType: !122, size: 32, offset: 448)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !281, file: !10, line: 106, baseType: !133, size: 64, offset: 512)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !281, file: !10, line: 107, baseType: !317, size: 64, offset: 576)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!320 = !{!321}
!321 = !DISubrange(count: 5)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !135, file: !136, line: 113, baseType: !323, size: 320, offset: 3648)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 320, elements: !320)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!149, !133, !132}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !135, file: !136, line: 114, baseType: !328, size: 320, offset: 3968)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 320, elements: !320)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !135, file: !136, line: 115, baseType: !122, size: 32, offset: 4288)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !135, file: !136, line: 120, baseType: !317, size: 64, offset: 4352)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !135, file: !136, line: 121, baseType: !122, size: 32, offset: 4416)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !129, line: 331, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !129, line: 331, flags: DIFlagFwdDecl)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Op", file: !129, line: 338, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_op_t", file: !129, line: 338, flags: DIFlagFwdDecl)
!338 = !{i32 7, !"Dwarf Version", i32 4}
!339 = !{i32 2, !"Debug Info Version", i32 3}
!340 = !{i32 1, !"wchar_size", i32 4}
!341 = !{i32 7, !"PIC Level", i32 2}
!342 = !{i32 7, !"uwtable", i32 1}
!343 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!344 = distinct !DISubprogram(name: "SNESNGSSetTolerances", scope: !345, file: !345, line: 25, type: !346, scopeLine: 26, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !537)
!345 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/snes/impls/gs/snesgs.c", directory: "/home/users/ndemeye/xSDK")
!346 = !DISubroutineType(types: !347)
!347 = !{!149, !348, !116, !116, !116, !113}
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNES", file: !25, line: 18, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_SNES", file: !351, line: 38, size: 11648, elements: !352)
!351 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/snesimpl.h", directory: "/home/users/ndemeye/xSDK")
!352 = !{!353, !355, !421, !426, !427, !428, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !444, !448, !449, !451, !452, !453, !454, !455, !460, !462, !463, !464, !465, !466, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !502, !504, !505, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !350, file: !351, line: 39, baseType: !354, size: 4480)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !136, line: 122, baseType: !135)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !350, file: !351, line: 39, baseType: !356, size: 1088, offset: 4480)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 1088, elements: !187)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SNESOps", file: !351, line: 12, size: 1088, elements: !358)
!358 = !{!359, !366, !370, !374, !380, !381, !385, !386, !390, !394, !395, !396, !401, !405, !409, !413, !420}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "computeinitialguess", scope: !357, file: !351, line: 13, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!149, !348, !363, !132}
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !99, line: 21, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !99, line: 21, flags: DIFlagFwdDecl)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "computescaling", scope: !357, file: !351, line: 14, baseType: !367, size: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{!149, !363, !363, !132}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !357, file: !351, line: 15, baseType: !371, size: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!149, !348, !113}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "converged", scope: !357, file: !351, line: 16, baseType: !375, size: 64, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!149, !348, !113, !116, !116, !116, !378, !132}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESConvergedReason", file: !25, line: 257, baseType: !24)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "convergeddestroy", scope: !357, file: !351, line: 17, baseType: !270, size: 64, offset: 256)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !357, file: !351, line: 18, baseType: !382, size: 64, offset: 320)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!149, !348}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !357, file: !351, line: 19, baseType: !382, size: 64, offset: 384)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !357, file: !351, line: 20, baseType: !387, size: 64, offset: 448)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!149, !348, !155}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !357, file: !351, line: 21, baseType: !391, size: 64, offset: 512)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!149, !279, !348}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !357, file: !351, line: 22, baseType: !382, size: 64, offset: 576)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !357, file: !351, line: 23, baseType: !382, size: 64, offset: 640)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "usercompute", scope: !357, file: !351, line: 24, baseType: !397, size: 64, offset: 704)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!149, !348, !400}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "userdestroy", scope: !357, file: !351, line: 25, baseType: !402, size: 64, offset: 768)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!149, !400}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "computevariablebounds", scope: !357, file: !351, line: 26, baseType: !406, size: 64, offset: 832)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!149, !348, !363, !363}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "computepfunction", scope: !357, file: !351, line: 27, baseType: !410, size: 64, offset: 896)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!149, !348, !363, !363, !132}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "computepjacobian", scope: !357, file: !351, line: 28, baseType: !414, size: 64, offset: 960)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!149, !348, !363, !417, !417, !132}
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !53, line: 16, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !53, line: 16, flags: DIFlagFwdDecl)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !357, file: !351, line: 29, baseType: !387, size: 64, offset: 1024)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "dm", scope: !350, file: !351, line: 40, baseType: !422, size: 64, offset: 5568)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "DM", file: !423, line: 14, baseType: !424)
!423 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscdmtypes.h", directory: "/home/users/ndemeye/xSDK")
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_DM", file: !423, line: 14, flags: DIFlagFwdDecl)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "dmAuto", scope: !350, file: !351, line: 41, baseType: !122, size: 32, offset: 5632)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "npc", scope: !350, file: !351, line: 42, baseType: !348, size: 64, offset: 5696)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "npcside", scope: !350, file: !351, line: 43, baseType: !429, size: 32, offset: 5760)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "PCSide", file: !46, line: 85, baseType: !45)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "usesnpc", scope: !350, file: !351, line: 44, baseType: !122, size: 32, offset: 5792)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !350, file: !351, line: 47, baseType: !132, size: 64, offset: 5824)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "vec_rhs", scope: !350, file: !351, line: 49, baseType: !363, size: 64, offset: 5888)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol", scope: !350, file: !351, line: 50, baseType: !363, size: 64, offset: 5952)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func", scope: !350, file: !351, line: 52, baseType: !363, size: 64, offset: 6016)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian", scope: !350, file: !351, line: 54, baseType: !417, size: 64, offset: 6080)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "jacobian_pre", scope: !350, file: !351, line: 55, baseType: !417, size: 64, offset: 6144)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "picard", scope: !350, file: !351, line: 56, baseType: !417, size: 64, offset: 6208)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "initialguessP", scope: !350, file: !351, line: 57, baseType: !132, size: 64, offset: 6272)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ksp", scope: !350, file: !351, line: 58, baseType: !440, size: 64, offset: 6336)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "KSP", file: !441, line: 22, baseType: !442)
!441 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscksp.h", directory: "/home/users/ndemeye/xSDK")
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_KSP", file: !441, line: 22, flags: DIFlagFwdDecl)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "linesearch", scope: !350, file: !351, line: 59, baseType: !445, size: 64, offset: 6400)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESLineSearch", file: !25, line: 526, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_LineSearch", file: !25, line: 526, flags: DIFlagFwdDecl)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "usesksp", scope: !350, file: !351, line: 60, baseType: !122, size: 32, offset: 6464)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "matstruct", scope: !350, file: !351, line: 61, baseType: !450, size: 32, offset: 6496)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !53, line: 285, baseType: !52)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "vec_sol_update", scope: !350, file: !351, line: 63, baseType: !363, size: 64, offset: 6528)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "scaling", scope: !350, file: !351, line: 65, baseType: !363, size: 64, offset: 6592)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "scaP", scope: !350, file: !351, line: 66, baseType: !132, size: 64, offset: 6656)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "precheck_picard_angle", scope: !350, file: !351, line: 68, baseType: !116, size: 64, offset: 6720)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !350, file: !351, line: 74, baseType: !456, size: 320, offset: 6784)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 320, elements: !320)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!149, !348, !113, !116, !132}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "monitordestroy", scope: !350, file: !351, line: 75, baseType: !461, size: 320, offset: 7104)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !402, size: 320, elements: !320)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "monitorcontext", scope: !350, file: !351, line: 76, baseType: !328, size: 320, offset: 7424)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "numbermonitors", scope: !350, file: !351, line: 77, baseType: !113, size: 32, offset: 7744)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "cnvP", scope: !350, file: !351, line: 78, baseType: !132, size: 64, offset: 7808)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !350, file: !351, line: 79, baseType: !379, size: 32, offset: 7872)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "reasonview", scope: !350, file: !351, line: 80, baseType: !467, size: 320, offset: 7936)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !468, size: 320, elements: !320)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!149, !348, !132}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewdestroy", scope: !350, file: !351, line: 81, baseType: !461, size: 320, offset: 8256)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "reasonviewcontext", scope: !350, file: !351, line: 82, baseType: !328, size: 320, offset: 8576)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "numberreasonviews", scope: !350, file: !351, line: 83, baseType: !113, size: 32, offset: 8896)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "errorifnotconverged", scope: !350, file: !351, line: 84, baseType: !122, size: 32, offset: 8928)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !350, file: !351, line: 88, baseType: !122, size: 32, offset: 8960)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !350, file: !351, line: 89, baseType: !132, size: 64, offset: 9024)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "max_its", scope: !350, file: !351, line: 93, baseType: !113, size: 32, offset: 9088)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "max_funcs", scope: !350, file: !351, line: 94, baseType: !113, size: 32, offset: 9120)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "nfuncs", scope: !350, file: !351, line: 95, baseType: !113, size: 32, offset: 9152)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !350, file: !351, line: 96, baseType: !113, size: 32, offset: 9184)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "linear_its", scope: !350, file: !351, line: 97, baseType: !113, size: 32, offset: 9216)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !350, file: !351, line: 98, baseType: !116, size: 64, offset: 9280)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ynorm", scope: !350, file: !351, line: 99, baseType: !116, size: 64, offset: 9344)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "xnorm", scope: !350, file: !351, line: 100, baseType: !116, size: 64, offset: 9408)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "rtol", scope: !350, file: !351, line: 101, baseType: !116, size: 64, offset: 9472)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "divtol", scope: !350, file: !351, line: 102, baseType: !116, size: 64, offset: 9536)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "abstol", scope: !350, file: !351, line: 103, baseType: !116, size: 64, offset: 9600)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "stol", scope: !350, file: !351, line: 104, baseType: !116, size: 64, offset: 9664)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "deltatol", scope: !350, file: !351, line: 105, baseType: !116, size: 64, offset: 9728)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "forceiteration", scope: !350, file: !351, line: 106, baseType: !122, size: 32, offset: 9792)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "lagpreconditioner", scope: !350, file: !351, line: 107, baseType: !113, size: 32, offset: 9824)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "lagjacobian", scope: !350, file: !351, line: 108, baseType: !113, size: 32, offset: 9856)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "jac_iter", scope: !350, file: !351, line: 109, baseType: !113, size: 32, offset: 9888)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "lagjac_persist", scope: !350, file: !351, line: 110, baseType: !122, size: 32, offset: 9920)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "pre_iter", scope: !350, file: !351, line: 111, baseType: !113, size: 32, offset: 9952)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "lagpre_persist", scope: !350, file: !351, line: 112, baseType: !122, size: 32, offset: 9984)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "gridsequence", scope: !350, file: !351, line: 113, baseType: !113, size: 32, offset: 10016)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "tolerancesset", scope: !350, file: !351, line: 115, baseType: !122, size: 32, offset: 10048)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "vec_func_init_set", scope: !350, file: !351, line: 117, baseType: !122, size: 32, offset: 10080)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "normschedule", scope: !350, file: !351, line: 119, baseType: !501, size: 32, offset: 10112)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESNormSchedule", file: !25, line: 411, baseType: !59)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "functype", scope: !350, file: !351, line: 120, baseType: !503, size: 32, offset: 10144)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNESFunctionType", file: !25, line: 495, baseType: !67)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "nwork", scope: !350, file: !351, line: 124, baseType: !113, size: 32, offset: 10176)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !350, file: !351, line: 125, baseType: !506, size: 64, offset: 10240)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptionscalled", scope: !350, file: !351, line: 129, baseType: !113, size: 32, offset: 10304)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist", scope: !350, file: !351, line: 130, baseType: !242, size: 64, offset: 10368)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_its", scope: !350, file: !351, line: 132, baseType: !234, size: 64, offset: 10432)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_len", scope: !350, file: !351, line: 133, baseType: !113, size: 32, offset: 10496)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_max", scope: !350, file: !351, line: 134, baseType: !113, size: 32, offset: 10528)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_reset", scope: !350, file: !351, line: 135, baseType: !122, size: 32, offset: 10560)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "conv_hist_alloc", scope: !350, file: !351, line: 136, baseType: !122, size: 32, offset: 10592)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "counters_reset", scope: !350, file: !351, line: 137, baseType: !122, size: 32, offset: 10624)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "numFailures", scope: !350, file: !351, line: 140, baseType: !113, size: 32, offset: 10656)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "maxFailures", scope: !350, file: !351, line: 141, baseType: !113, size: 32, offset: 10688)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "numLinearSolveFailures", scope: !350, file: !351, line: 143, baseType: !113, size: 32, offset: 10720)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "maxLinearSolveFailures", scope: !350, file: !351, line: 144, baseType: !113, size: 32, offset: 10752)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "domainerror", scope: !350, file: !351, line: 146, baseType: !122, size: 32, offset: 10784)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "jacobiandomainerror", scope: !350, file: !351, line: 147, baseType: !122, size: 32, offset: 10816)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "checkjacdomainerror", scope: !350, file: !351, line: 148, baseType: !122, size: 32, offset: 10848)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ksp_ewconv", scope: !350, file: !351, line: 150, baseType: !122, size: 32, offset: 10880)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "kspconvctx", scope: !350, file: !351, line: 151, baseType: !132, size: 64, offset: 10944)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "ttol", scope: !350, file: !351, line: 154, baseType: !116, size: 64, offset: 11008)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "rnorm0", scope: !350, file: !351, line: 155, baseType: !116, size: 64, offset: 11072)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "vwork", scope: !350, file: !351, line: 157, baseType: !506, size: 64, offset: 11136)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "nvwork", scope: !350, file: !351, line: 158, baseType: !113, size: 32, offset: 11200)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !350, file: !351, line: 160, baseType: !122, size: 32, offset: 11232)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "mf_operator", scope: !350, file: !351, line: 161, baseType: !122, size: 32, offset: 11264)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "mf_version", scope: !350, file: !351, line: 162, baseType: !113, size: 32, offset: 11296)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "vizerotolerance", scope: !350, file: !351, line: 164, baseType: !116, size: 64, offset: 11328)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "xl", scope: !350, file: !351, line: 165, baseType: !363, size: 64, offset: 11392)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "xu", scope: !350, file: !351, line: 165, baseType: !363, size: 64, offset: 11456)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ntruebounds", scope: !350, file: !351, line: 166, baseType: !113, size: 32, offset: 11520)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "usersetbounds", scope: !350, file: !351, line: 167, baseType: !122, size: 32, offset: 11552)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "alwayscomputesfinalresidual", scope: !350, file: !351, line: 169, baseType: !122, size: 32, offset: 11584)
!537 = !{!538, !539, !540, !541, !542, !543}
!538 = !DILocalVariable(name: "snes", arg: 1, scope: !344, file: !345, line: 25, type: !348)
!539 = !DILocalVariable(name: "abstol", arg: 2, scope: !344, file: !345, line: 25, type: !116)
!540 = !DILocalVariable(name: "rtol", arg: 3, scope: !344, file: !345, line: 25, type: !116)
!541 = !DILocalVariable(name: "stol", arg: 4, scope: !344, file: !345, line: 25, type: !116)
!542 = !DILocalVariable(name: "maxit", arg: 5, scope: !344, file: !345, line: 25, type: !113)
!543 = !DILocalVariable(name: "gs", scope: !344, file: !345, line: 27, type: !107)
!544 = !DILocation(line: 0, scope: !344)
!545 = !DILocation(line: 27, column: 35, scope: !344)
!546 = !{!547, !552, i64 1128}
!547 = !{!"_p_SNES", !548, i64 0, !550, i64 560, !552, i64 696, !550, i64 704, !552, i64 712, !550, i64 720, !550, i64 724, !552, i64 728, !552, i64 736, !552, i64 744, !552, i64 752, !552, i64 760, !552, i64 768, !552, i64 776, !552, i64 784, !552, i64 792, !552, i64 800, !550, i64 808, !550, i64 812, !552, i64 816, !552, i64 824, !552, i64 832, !553, i64 840, !550, i64 848, !550, i64 888, !550, i64 928, !549, i64 968, !552, i64 976, !550, i64 984, !550, i64 992, !550, i64 1032, !550, i64 1072, !549, i64 1112, !550, i64 1116, !550, i64 1120, !552, i64 1128, !549, i64 1136, !549, i64 1140, !549, i64 1144, !549, i64 1148, !549, i64 1152, !553, i64 1160, !553, i64 1168, !553, i64 1176, !553, i64 1184, !553, i64 1192, !553, i64 1200, !553, i64 1208, !553, i64 1216, !550, i64 1224, !549, i64 1228, !549, i64 1232, !549, i64 1236, !550, i64 1240, !549, i64 1244, !550, i64 1248, !549, i64 1252, !550, i64 1256, !550, i64 1260, !550, i64 1264, !550, i64 1268, !549, i64 1272, !552, i64 1280, !549, i64 1288, !552, i64 1296, !552, i64 1304, !549, i64 1312, !549, i64 1316, !550, i64 1320, !550, i64 1324, !550, i64 1328, !549, i64 1332, !549, i64 1336, !549, i64 1340, !549, i64 1344, !550, i64 1348, !550, i64 1352, !550, i64 1356, !550, i64 1360, !552, i64 1368, !553, i64 1376, !553, i64 1384, !552, i64 1392, !549, i64 1400, !550, i64 1404, !550, i64 1408, !549, i64 1412, !553, i64 1416, !552, i64 1424, !552, i64 1432, !549, i64 1440, !550, i64 1444, !550, i64 1448}
!548 = !{!"_p_PetscObject", !549, i64 0, !550, i64 8, !552, i64 64, !549, i64 72, !553, i64 80, !553, i64 88, !553, i64 96, !553, i64 104, !554, i64 112, !549, i64 120, !549, i64 124, !552, i64 128, !552, i64 136, !552, i64 144, !552, i64 152, !552, i64 160, !552, i64 168, !552, i64 176, !554, i64 184, !552, i64 192, !552, i64 200, !549, i64 208, !552, i64 216, !554, i64 224, !549, i64 232, !549, i64 236, !552, i64 240, !552, i64 248, !552, i64 256, !552, i64 264, !549, i64 272, !549, i64 276, !552, i64 280, !552, i64 288, !552, i64 296, !552, i64 304, !549, i64 312, !549, i64 316, !552, i64 320, !552, i64 328, !552, i64 336, !552, i64 344, !552, i64 352, !549, i64 360, !550, i64 368, !550, i64 384, !552, i64 392, !552, i64 400, !549, i64 408, !550, i64 416, !550, i64 456, !550, i64 496, !550, i64 536, !552, i64 544, !550, i64 552}
!549 = !{!"int", !550, i64 0}
!550 = !{!"omnipotent char", !551, i64 0}
!551 = !{!"Simple C/C++ TBAA"}
!552 = !{!"any pointer", !550, i64 0}
!553 = !{!"double", !550, i64 0}
!554 = !{!"long", !550, i64 0}
!555 = !DILocation(line: 29, column: 3, scope: !556)
!556 = distinct !DILexicalBlock(scope: !557, file: !345, line: 29, column: 3)
!557 = distinct !DILexicalBlock(scope: !558, file: !345, line: 29, column: 3)
!558 = distinct !DILexicalBlock(scope: !344, file: !345, line: 29, column: 3)
!559 = !{!552, !552, i64 0}
!560 = !DILocation(line: 29, column: 3, scope: !557)
!561 = !DILocation(line: 29, column: 3, scope: !562)
!562 = distinct !DILexicalBlock(scope: !563, file: !345, line: 29, column: 3)
!563 = distinct !DILexicalBlock(scope: !556, file: !345, line: 29, column: 3)
!564 = !{!565, !549, i64 1536}
