; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/color/impls/power/power.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/color/impls/power/power.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_MatColoring = type { %struct._p_PetscObject, [1 x %struct._MatColoringOps], %struct._p_Mat*, i32, i32, i8*, i32, i32, double*, i32*, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!251 = !DIEnumerator(name: "MATOP_TRANS_COLORING_APPLY_DEN", value: 135, isUnsigned: true)
!252 = !DIEnumerator(name: "MATOP_RART", value: 136, isUnsigned: true)
!253 = !DIEnumerator(name: "MATOP_RART_SYMBOLIC", value: 137, isUnsigned: true)
!254 = !DIEnumerator(name: "MATOP_RART_NUMERIC", value: 138, isUnsigned: true)
!255 = !DIEnumerator(name: "MATOP_SET_BLOCK_SIZES", value: 139, isUnsigned: true)
!256 = !DIEnumerator(name: "MATOP_AYPX", value: 140, isUnsigned: true)
!257 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!258 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!259 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!260 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!261 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!262 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 161, baseType: !5, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272}
!265 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1345, baseType: !5, size: 32, elements: !295)
!295 = !{!296, !297, !298, !299}
!296 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_RANDOM", value: 0, isUnsigned: true)
!297 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_LEXICAL", value: 1, isUnsigned: true)
!298 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_LF", value: 2, isUnsigned: true)
!299 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_SL", value: 3, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !301, line: 663, baseType: !5, size: 32, elements: !302)
!301 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!302 = !{!303, !304, !305}
!303 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!304 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!305 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!306 = !{!307, !310, !314, !315}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !309)
!309 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !311, line: 330, baseType: !312)
!311 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !311, line: 330, flags: DIFlagFwdDecl)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !318, line: 73, size: 4480, elements: !319)
!318 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!319 = !{!320, !322, !368, !369, !371, !374, !375, !376, !377, !385, !386, !388, !392, !396, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !409, !410, !411, !413, !414, !416, !418, !419, !420, !421, !422, !425, !427, !428, !429, !430, !431, !434, !436, !437, !438, !448, !450, !451, !455, !456, !505, !510, !512, !513, !514}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !317, file: !318, line: 74, baseType: !321, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !317, file: !318, line: 75, baseType: !323, size: 448, offset: 64)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 448, elements: !366)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !318, line: 53, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !318, line: 45, size: 448, elements: !326)
!326 = !{!327, !333, !341, !346, !350, !354, !361}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !325, file: !318, line: 46, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!331, !315, !332}
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !325, file: !318, line: 47, baseType: !334, size: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!331, !315, !337}
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !338, line: 16, baseType: !339)
!338 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !338, line: 16, flags: DIFlagFwdDecl)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !325, file: !318, line: 48, baseType: !342, size: 64, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!331, !345}
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !325, file: !318, line: 49, baseType: !347, size: 64, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!331, !315, !307, !315}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !325, file: !318, line: 50, baseType: !351, size: 64, offset: 256)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!331, !315, !307, !345}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !325, file: !318, line: 51, baseType: !355, size: 64, offset: 320)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!331, !315, !307, !358}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{null}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !325, file: !318, line: 52, baseType: !362, size: 64, offset: 384)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!331, !315, !307, !365}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!366 = !{!367}
!367 = !DISubrange(count: 1)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !317, file: !318, line: 76, baseType: !310, size: 64, offset: 512)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !317, file: !318, line: 77, baseType: !370, size: 32, offset: 576)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !317, file: !318, line: 78, baseType: !372, size: 64, offset: 640)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !373)
!373 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !317, file: !318, line: 78, baseType: !372, size: 64, offset: 704)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !317, file: !318, line: 78, baseType: !372, size: 64, offset: 768)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !317, file: !318, line: 78, baseType: !372, size: 64, offset: 832)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !317, file: !318, line: 79, baseType: !378, size: 64, offset: 896)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !381, line: 27, baseType: !382)
!381 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !383, line: 43, baseType: !384)
!383 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!384 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !317, file: !318, line: 80, baseType: !370, size: 32, offset: 960)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !317, file: !318, line: 81, baseType: !387, size: 32, offset: 992)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !317, file: !318, line: 82, baseType: !389, size: 64, offset: 1024)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !317, file: !318, line: 83, baseType: !393, size: 64, offset: 1088)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !317, file: !318, line: 84, baseType: !397, size: 64, offset: 1152)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !317, file: !318, line: 85, baseType: !397, size: 64, offset: 1216)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !317, file: !318, line: 86, baseType: !397, size: 64, offset: 1280)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !317, file: !318, line: 87, baseType: !397, size: 64, offset: 1344)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !317, file: !318, line: 88, baseType: !315, size: 64, offset: 1408)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !317, file: !318, line: 89, baseType: !378, size: 64, offset: 1472)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !317, file: !318, line: 90, baseType: !397, size: 64, offset: 1536)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !317, file: !318, line: 91, baseType: !397, size: 64, offset: 1600)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !317, file: !318, line: 92, baseType: !370, size: 32, offset: 1664)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !317, file: !318, line: 93, baseType: !314, size: 64, offset: 1728)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !317, file: !318, line: 94, baseType: !408, size: 64, offset: 1792)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !379)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !317, file: !318, line: 95, baseType: !370, size: 32, offset: 1856)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !317, file: !318, line: 95, baseType: !370, size: 32, offset: 1888)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !317, file: !318, line: 96, baseType: !412, size: 64, offset: 1920)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !317, file: !318, line: 96, baseType: !412, size: 64, offset: 1984)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !317, file: !318, line: 97, baseType: !415, size: 64, offset: 2048)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !317, file: !318, line: 97, baseType: !417, size: 64, offset: 2112)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !317, file: !318, line: 98, baseType: !370, size: 32, offset: 2176)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !317, file: !318, line: 98, baseType: !370, size: 32, offset: 2208)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !317, file: !318, line: 99, baseType: !412, size: 64, offset: 2240)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !317, file: !318, line: 99, baseType: !412, size: 64, offset: 2304)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !317, file: !318, line: 100, baseType: !423, size: 64, offset: 2368)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !373)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !317, file: !318, line: 100, baseType: !426, size: 64, offset: 2432)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !317, file: !318, line: 101, baseType: !370, size: 32, offset: 2496)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !317, file: !318, line: 101, baseType: !370, size: 32, offset: 2528)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !317, file: !318, line: 102, baseType: !412, size: 64, offset: 2560)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !317, file: !318, line: 102, baseType: !412, size: 64, offset: 2624)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !317, file: !318, line: 103, baseType: !432, size: 64, offset: 2688)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !424)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !317, file: !318, line: 103, baseType: !435, size: 64, offset: 2752)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !317, file: !318, line: 104, baseType: !365, size: 64, offset: 2816)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !317, file: !318, line: 105, baseType: !370, size: 32, offset: 2880)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !317, file: !318, line: 106, baseType: !439, size: 128, offset: 2944)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !440, size: 128, elements: !446)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !318, line: 64, baseType: !442)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !318, line: 61, size: 128, elements: !443)
!443 = !{!444, !445}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !442, file: !318, line: 62, baseType: !358, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !442, file: !318, line: 63, baseType: !314, size: 64, offset: 64)
!446 = !{!447}
!447 = !DISubrange(count: 2)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !317, file: !318, line: 107, baseType: !449, size: 64, offset: 3072)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 64, elements: !446)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !317, file: !318, line: 108, baseType: !314, size: 64, offset: 3136)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !317, file: !318, line: 109, baseType: !452, size: 64, offset: 3200)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{!331, !314}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !317, file: !318, line: 111, baseType: !370, size: 32, offset: 3264)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !317, file: !318, line: 112, baseType: !457, size: 320, offset: 3328)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !458, size: 320, elements: !503)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!331, !461, !315, !314}
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !464)
!464 = !{!465, !466, !491, !492, !493, !494, !495, !496, !497, !498, !499}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !463, file: !10, line: 100, baseType: !370, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !463, file: !10, line: 101, baseType: !467, size: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !470)
!470 = !{!471, !472, !473, !474, !475, !478, !479, !480, !484, !486, !488, !489, !490}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !469, file: !10, line: 84, baseType: !397, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !469, file: !10, line: 85, baseType: !397, size: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !469, file: !10, line: 86, baseType: !314, size: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !469, file: !10, line: 87, baseType: !389, size: 64, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !469, file: !10, line: 88, baseType: !476, size: 64, offset: 256)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !307)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !469, file: !10, line: 89, baseType: !309, size: 8, offset: 320)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !469, file: !10, line: 90, baseType: !397, size: 64, offset: 384)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !469, file: !10, line: 91, baseType: !481, size: 64, offset: 448)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !482, line: 46, baseType: !483)
!482 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!483 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !469, file: !10, line: 92, baseType: !485, size: 32, offset: 512)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !469, file: !10, line: 93, baseType: !487, size: 32, offset: 544)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !469, file: !10, line: 94, baseType: !467, size: 64, offset: 576)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !469, file: !10, line: 95, baseType: !397, size: 64, offset: 640)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !469, file: !10, line: 96, baseType: !314, size: 64, offset: 704)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !463, file: !10, line: 102, baseType: !397, size: 64, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !463, file: !10, line: 102, baseType: !397, size: 64, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !463, file: !10, line: 103, baseType: !397, size: 64, offset: 256)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !463, file: !10, line: 104, baseType: !310, size: 64, offset: 320)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !463, file: !10, line: 105, baseType: !485, size: 32, offset: 384)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !463, file: !10, line: 105, baseType: !485, size: 32, offset: 416)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !463, file: !10, line: 105, baseType: !485, size: 32, offset: 448)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !463, file: !10, line: 106, baseType: !315, size: 64, offset: 512)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !463, file: !10, line: 107, baseType: !500, size: 64, offset: 576)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !501)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!503 = !{!504}
!504 = !DISubrange(count: 5)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !317, file: !318, line: 113, baseType: !506, size: 320, offset: 3648)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 320, elements: !503)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{!331, !315, !314}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !317, file: !318, line: 114, baseType: !511, size: 320, offset: 3968)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 320, elements: !503)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !317, file: !318, line: 115, baseType: !485, size: 32, offset: 4288)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !317, file: !318, line: 120, baseType: !500, size: 64, offset: 4352)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !317, file: !318, line: 121, baseType: !485, size: 32, offset: 4416)
!515 = !{i32 7, !"Dwarf Version", i32 4}
!516 = !{i32 2, !"Debug Info Version", i32 3}
!517 = !{i32 1, !"wchar_size", i32 4}
!518 = !{i32 7, !"PIC Level", i32 2}
!519 = !{i32 7, !"uwtable", i32 1}
!520 = !{!"clang version 13.0.0 (https://github.com/llvm/llvm-project.git b7911e80d6926f9280ceb23d4e86e25c29370904)"}
!521 = distinct !DISubprogram(name: "MatColoringCreate_Power", scope: !522, file: !522, line: 49, type: !523, scopeLine: 50, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1333)
!522 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/mat/color/impls/power/power.c", directory: "/home/users/ndemeye/xSDK")
!523 = !DISubroutineType(types: !524)
!524 = !{!331, !525}
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatColoring", file: !36, line: 1312, baseType: !526)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatColoring", file: !528, line: 647, size: 5248, elements: !529)
!528 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!529 = !{!530, !532, !559, !1324, !1325, !1326, !1327, !1328, !1330, !1331, !1332}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !527, file: !528, line: 648, baseType: !531, size: 4480)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !318, line: 122, baseType: !317)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !527, file: !528, line: 648, baseType: !533, size: 320, offset: 4480)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !534, size: 320, elements: !366)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatColoringOps", file: !528, line: 639, size: 320, elements: !535)
!535 = !{!536, !538, !542, !546, !555}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !534, file: !528, line: 640, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !534, file: !528, line: 641, baseType: !539, size: 64, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!331, !461, !525}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !534, file: !528, line: 642, baseType: !543, size: 64, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!331, !525, !337}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !534, file: !528, line: 643, baseType: !547, size: 64, offset: 192)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{!331, !525, !550}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !552, line: 51, baseType: !553)
!552 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !552, line: 51, flags: DIFlagFwdDecl)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "weights", scope: !534, file: !528, line: 644, baseType: !556, size: 64, offset: 256)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{!331, !525, !426, !417}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !527, file: !528, line: 649, baseType: !560, size: 64, offset: 4800)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !561)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !528, line: 436, size: 23424, elements: !563)
!563 = !{!564, !565, !1067, !1087, !1088, !1089, !1091, !1092, !1093, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1220, !1221, !1237, !1238, !1239, !1240, !1241, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1276, !1296, !1297, !1299, !1300, !1301, !1302, !1303, !1304, !1322, !1323}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !562, file: !528, line: 437, baseType: !531, size: 4480)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !562, file: !528, line: 437, baseType: !566, size: 9472, offset: 4480)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 9472, elements: !366)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !528, line: 32, size: 9472, elements: !568)
!568 = !{!569, !578, !582, !583, !590, !594, !595, !596, !597, !598, !599, !600, !623, !627, !632, !638, !657, !662, !666, !667, !672, !677, !678, !683, !687, !691, !695, !699, !703, !704, !705, !706, !707, !711, !712, !717, !718, !719, !720, !721, !726, !733, !738, !742, !746, !750, !754, !755, !759, !760, !767, !772, !773, !774, !775, !834, !841, !842, !846, !847, !851, !852, !856, !861, !862, !866, !870, !877, !878, !879, !880, !881, !882, !887, !888, !892, !896, !900, !901, !902, !906, !916, !917, !921, !922, !926, !927, !931, !932, !937, !938, !942, !946, !947, !948, !949, !950, !951, !952, !956, !957, !958, !959, !960, !961, !965, !966, !967, !968, !969, !970, !971, !972, !976, !980, !981, !982, !986, !987, !988, !989, !990, !991, !992, !996, !997, !998, !1003, !1007, !1008, !1012, !1013, !1014, !1015, !1041, !1045, !1046, !1047, !1048, !1049, !1053, !1054, !1055, !1056, !1057, !1061, !1065, !1066}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !567, file: !528, line: 34, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!331, !560, !370, !573, !370, !573, !575, !577}
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !370)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !433)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !567, file: !528, line: 35, baseType: !579, size: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!331, !560, !370, !415, !417, !435}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !567, file: !528, line: 36, baseType: !579, size: 64, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !567, file: !528, line: 37, baseType: !584, size: 64, offset: 192)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!331, !560, !587, !587}
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !588)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !567, file: !528, line: 38, baseType: !591, size: 64, offset: 256)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!331, !560, !587, !587, !587}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !567, file: !528, line: 40, baseType: !584, size: 64, offset: 320)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !567, file: !528, line: 41, baseType: !591, size: 64, offset: 384)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !567, file: !528, line: 42, baseType: !584, size: 64, offset: 448)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !567, file: !528, line: 43, baseType: !591, size: 64, offset: 512)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !567, file: !528, line: 44, baseType: !584, size: 64, offset: 576)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !567, file: !528, line: 46, baseType: !591, size: 64, offset: 640)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !567, file: !528, line: 47, baseType: !601, size: 64, offset: 704)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!331, !560, !604, !604, !607}
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !552, line: 11, baseType: !605)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !552, line: 11, flags: DIFlagFwdDecl)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !609)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !610)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !611)
!611 = !{!612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !610, file: !36, line: 1227, baseType: !424, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !610, file: !36, line: 1228, baseType: !424, size: 64, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !610, file: !36, line: 1229, baseType: !424, size: 64, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !610, file: !36, line: 1230, baseType: !424, size: 64, offset: 192)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !610, file: !36, line: 1231, baseType: !424, size: 64, offset: 256)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !610, file: !36, line: 1232, baseType: !424, size: 64, offset: 320)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !610, file: !36, line: 1233, baseType: !424, size: 64, offset: 384)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !610, file: !36, line: 1234, baseType: !424, size: 64, offset: 448)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !610, file: !36, line: 1236, baseType: !424, size: 64, offset: 512)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !610, file: !36, line: 1237, baseType: !424, size: 64, offset: 576)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !610, file: !36, line: 1238, baseType: !424, size: 64, offset: 640)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !567, file: !528, line: 48, baseType: !624, size: 64, offset: 768)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{!331, !560, !604, !607}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !567, file: !528, line: 49, baseType: !628, size: 64, offset: 832)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!331, !560, !587, !424, !631, !424, !370, !370, !587}
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !567, file: !528, line: 50, baseType: !633, size: 64, offset: 896)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{!331, !560, !636, !637}
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !567, file: !528, line: 52, baseType: !639, size: 64, offset: 960)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!331, !560, !642, !643}
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !646)
!646 = !{!647, !648, !649, !650, !651, !652, !653, !654, !655, !656}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !645, file: !36, line: 593, baseType: !372, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !645, file: !36, line: 594, baseType: !372, size: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !645, file: !36, line: 594, baseType: !372, size: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !645, file: !36, line: 594, baseType: !372, size: 64, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !645, file: !36, line: 595, baseType: !372, size: 64, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !645, file: !36, line: 596, baseType: !372, size: 64, offset: 320)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !645, file: !36, line: 597, baseType: !372, size: 64, offset: 384)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !645, file: !36, line: 598, baseType: !372, size: 64, offset: 448)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !645, file: !36, line: 598, baseType: !372, size: 64, offset: 512)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !645, file: !36, line: 599, baseType: !372, size: 64, offset: 576)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !567, file: !528, line: 53, baseType: !658, size: 64, offset: 1024)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!331, !560, !560, !661}
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !567, file: !528, line: 54, baseType: !663, size: 64, offset: 1088)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!331, !560, !587}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !567, file: !528, line: 55, baseType: !584, size: 64, offset: 1152)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !567, file: !528, line: 56, baseType: !668, size: 64, offset: 1216)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!331, !560, !671, !423}
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !567, file: !528, line: 58, baseType: !673, size: 64, offset: 1280)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!331, !560, !676}
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !567, file: !528, line: 59, baseType: !673, size: 64, offset: 1344)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !567, file: !528, line: 60, baseType: !679, size: 64, offset: 1408)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!331, !560, !682, !485}
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !567, file: !528, line: 61, baseType: !684, size: 64, offset: 1472)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!331, !560}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !567, file: !528, line: 63, baseType: !688, size: 64, offset: 1536)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!331, !560, !370, !573, !433, !587, !587}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !567, file: !528, line: 64, baseType: !692, size: 64, offset: 1600)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!331, !560, !560, !604, !604, !607}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !567, file: !528, line: 65, baseType: !696, size: 64, offset: 1664)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!331, !560, !560, !607}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !567, file: !528, line: 66, baseType: !700, size: 64, offset: 1728)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!331, !560, !560, !604, !607}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !567, file: !528, line: 67, baseType: !696, size: 64, offset: 1792)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !567, file: !528, line: 69, baseType: !684, size: 64, offset: 1856)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !567, file: !528, line: 70, baseType: !692, size: 64, offset: 1920)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !567, file: !528, line: 71, baseType: !700, size: 64, offset: 1984)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !567, file: !528, line: 72, baseType: !708, size: 64, offset: 2048)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!331, !560, !637}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !567, file: !528, line: 73, baseType: !684, size: 64, offset: 2112)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !567, file: !528, line: 75, baseType: !713, size: 64, offset: 2176)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!331, !560, !716, !637}
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !567, file: !528, line: 76, baseType: !584, size: 64, offset: 2240)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !567, file: !528, line: 77, baseType: !584, size: 64, offset: 2304)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !567, file: !528, line: 78, baseType: !601, size: 64, offset: 2368)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !567, file: !528, line: 79, baseType: !624, size: 64, offset: 2432)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !567, file: !528, line: 81, baseType: !722, size: 64, offset: 2496)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!331, !560, !433, !560, !725}
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !567, file: !528, line: 82, baseType: !727, size: 64, offset: 2560)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{!331, !560, !370, !730, !730, !636, !732}
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !604)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !567, file: !528, line: 83, baseType: !734, size: 64, offset: 2624)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!331, !560, !370, !737, !370}
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !567, file: !528, line: 84, baseType: !739, size: 64, offset: 2688)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!331, !560, !370, !573, !370, !573, !432}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !567, file: !528, line: 85, baseType: !743, size: 64, offset: 2752)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!331, !560, !560, !725}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !567, file: !528, line: 87, baseType: !747, size: 64, offset: 2816)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!331, !560, !587, !415}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !567, file: !528, line: 88, baseType: !751, size: 64, offset: 2880)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!331, !560, !433}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !567, file: !528, line: 89, baseType: !751, size: 64, offset: 2944)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !567, file: !528, line: 90, baseType: !756, size: 64, offset: 3008)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!331, !560, !587, !577}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !567, file: !528, line: 91, baseType: !688, size: 64, offset: 3072)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !567, file: !528, line: 93, baseType: !761, size: 64, offset: 3136)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!331, !560, !764}
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !765)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !567, file: !528, line: 94, baseType: !768, size: 64, offset: 3200)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!331, !560, !370, !485, !485, !415, !771, !771, !661}
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !567, file: !528, line: 95, baseType: !768, size: 64, offset: 3264)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !567, file: !528, line: 96, baseType: !768, size: 64, offset: 3328)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !567, file: !528, line: 97, baseType: !768, size: 64, offset: 3392)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !567, file: !528, line: 99, baseType: !776, size: 64, offset: 3456)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{!331, !560, !551, !779}
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !780)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !528, line: 609, size: 6208, elements: !782)
!782 = !{!783, !784, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !803, !810, !811, !812, !813, !814, !815, !816, !817, !821, !822, !823, !824, !825, !827, !828, !829, !830, !831, !832, !833}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !781, file: !528, line: 610, baseType: !531, size: 4480)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !781, file: !528, line: 610, baseType: !785, size: 32, offset: 4480)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !366)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !781, file: !528, line: 611, baseType: !370, size: 32, offset: 4512)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !781, file: !528, line: 611, baseType: !370, size: 32, offset: 4544)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !781, file: !528, line: 611, baseType: !370, size: 32, offset: 4576)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !781, file: !528, line: 612, baseType: !370, size: 32, offset: 4608)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !781, file: !528, line: 613, baseType: !370, size: 32, offset: 4640)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !781, file: !528, line: 614, baseType: !415, size: 64, offset: 4672)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !781, file: !528, line: 615, baseType: !417, size: 64, offset: 4736)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !781, file: !528, line: 616, baseType: !737, size: 64, offset: 4800)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !781, file: !528, line: 617, baseType: !415, size: 64, offset: 4864)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !781, file: !528, line: 618, baseType: !796, size: 64, offset: 4928)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !528, line: 602, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !528, line: 598, size: 128, elements: !799)
!799 = !{!800, !801, !802}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !798, file: !528, line: 599, baseType: !370, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !798, file: !528, line: 600, baseType: !370, size: 32, offset: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !798, file: !528, line: 601, baseType: !432, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !781, file: !528, line: 619, baseType: !804, size: 64, offset: 4992)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !528, line: 607, baseType: !806)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !528, line: 604, size: 128, elements: !807)
!807 = !{!808, !809}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !806, file: !528, line: 605, baseType: !370, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !806, file: !528, line: 606, baseType: !432, size: 64, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !781, file: !528, line: 620, baseType: !432, size: 64, offset: 5056)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !781, file: !528, line: 621, baseType: !424, size: 64, offset: 5120)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !781, file: !528, line: 622, baseType: !424, size: 64, offset: 5184)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !781, file: !528, line: 623, baseType: !587, size: 64, offset: 5248)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !781, file: !528, line: 623, baseType: !587, size: 64, offset: 5312)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !781, file: !528, line: 623, baseType: !587, size: 64, offset: 5376)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !781, file: !528, line: 624, baseType: !485, size: 32, offset: 5440)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !781, file: !528, line: 625, baseType: !818, size: 64, offset: 5504)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!331}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !781, file: !528, line: 626, baseType: !314, size: 64, offset: 5568)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !781, file: !528, line: 627, baseType: !587, size: 64, offset: 5632)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !781, file: !528, line: 628, baseType: !370, size: 32, offset: 5696)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !781, file: !528, line: 629, baseType: !307, size: 64, offset: 5760)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !781, file: !528, line: 630, baseType: !826, size: 32, offset: 5824)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !781, file: !528, line: 631, baseType: !370, size: 32, offset: 5856)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !781, file: !528, line: 631, baseType: !370, size: 32, offset: 5888)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !781, file: !528, line: 632, baseType: !485, size: 32, offset: 5920)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !781, file: !528, line: 633, baseType: !485, size: 32, offset: 5952)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !781, file: !528, line: 634, baseType: !358, size: 64, offset: 6016)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !781, file: !528, line: 634, baseType: !314, size: 64, offset: 6080)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !781, file: !528, line: 635, baseType: !378, size: 64, offset: 6144)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !567, file: !528, line: 100, baseType: !835, size: 64, offset: 3520)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!331, !560, !370, !370, !838, !550}
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !840)
!840 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !567, file: !528, line: 101, baseType: !684, size: 64, offset: 3584)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !567, file: !528, line: 102, baseType: !843, size: 64, offset: 3648)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DISubroutineType(types: !845)
!845 = !{!331, !560, !604, !604, !637}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !567, file: !528, line: 103, baseType: !570, size: 64, offset: 3712)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !567, file: !528, line: 105, baseType: !848, size: 64, offset: 3776)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DISubroutineType(types: !850)
!850 = !{!331, !560, !604, !604, !636, !637}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !567, file: !528, line: 106, baseType: !684, size: 64, offset: 3840)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !567, file: !528, line: 107, baseType: !853, size: 64, offset: 3904)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{!331, !560, !337}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !567, file: !528, line: 108, baseType: !857, size: 64, offset: 3968)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DISubroutineType(types: !859)
!859 = !{!331, !560, !860, !636, !637}
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !307)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !567, file: !528, line: 109, baseType: !818, size: 64, offset: 4032)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !567, file: !528, line: 111, baseType: !863, size: 64, offset: 4096)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{!331, !560, !560, !560, !424, !560}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !567, file: !528, line: 112, baseType: !867, size: 64, offset: 4160)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DISubroutineType(types: !869)
!869 = !{!331, !560, !560, !560, !560}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !567, file: !528, line: 113, baseType: !871, size: 64, offset: 4224)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!331, !560, !874, !874}
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !552, line: 30, baseType: !875)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !552, line: 30, flags: DIFlagFwdDecl)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !567, file: !528, line: 114, baseType: !570, size: 64, offset: 4288)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !567, file: !528, line: 115, baseType: !688, size: 64, offset: 4352)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !567, file: !528, line: 117, baseType: !747, size: 64, offset: 4416)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !567, file: !528, line: 118, baseType: !747, size: 64, offset: 4480)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !567, file: !528, line: 119, baseType: !857, size: 64, offset: 4544)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !567, file: !528, line: 120, baseType: !883, size: 64, offset: 4608)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DISubroutineType(types: !885)
!885 = !{!331, !560, !886, !661}
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !567, file: !528, line: 121, baseType: !818, size: 64, offset: 4672)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !567, file: !528, line: 123, baseType: !889, size: 64, offset: 4736)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{!331, !560, !370, !314}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !567, file: !528, line: 124, baseType: !893, size: 64, offset: 4800)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DISubroutineType(types: !895)
!895 = !{!331, !560, !779, !587, !314}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !567, file: !528, line: 125, baseType: !897, size: 64, offset: 4864)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DISubroutineType(types: !899)
!899 = !{!331, !461, !560}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !567, file: !528, line: 126, baseType: !584, size: 64, offset: 4928)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !567, file: !528, line: 127, baseType: !584, size: 64, offset: 4992)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !567, file: !528, line: 129, baseType: !903, size: 64, offset: 5056)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{!331, !560, !737}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !567, file: !528, line: 130, baseType: !907, size: 64, offset: 5120)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!331, !560, !910, !910}
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !911)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !913)
!913 = !{!914, !915}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !912, file: !60, line: 653, baseType: !370, size: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !912, file: !60, line: 653, baseType: !587, size: 64, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !567, file: !528, line: 131, baseType: !907, size: 64, offset: 5184)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !567, file: !528, line: 132, baseType: !918, size: 64, offset: 5248)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{!331, !560, !415, !415, !415}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !567, file: !528, line: 133, baseType: !853, size: 64, offset: 5312)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !567, file: !528, line: 135, baseType: !923, size: 64, offset: 5376)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{!331, !560, !424, !661}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !567, file: !528, line: 136, baseType: !923, size: 64, offset: 5440)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !567, file: !528, line: 137, baseType: !928, size: 64, offset: 5504)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!331, !560, !661}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !567, file: !528, line: 138, baseType: !570, size: 64, offset: 5568)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !567, file: !528, line: 139, baseType: !933, size: 64, offset: 5632)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{!331, !560, !936, !936}
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !567, file: !528, line: 141, baseType: !818, size: 64, offset: 5696)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !567, file: !528, line: 142, baseType: !939, size: 64, offset: 5760)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!331, !560, !560, !424, !560}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !567, file: !528, line: 143, baseType: !943, size: 64, offset: 5824)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!331, !560, !560, !560}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !567, file: !528, line: 144, baseType: !818, size: 64, offset: 5888)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !567, file: !528, line: 145, baseType: !939, size: 64, offset: 5952)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !567, file: !528, line: 147, baseType: !943, size: 64, offset: 6016)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !567, file: !528, line: 148, baseType: !818, size: 64, offset: 6080)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !567, file: !528, line: 149, baseType: !939, size: 64, offset: 6144)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !567, file: !528, line: 150, baseType: !943, size: 64, offset: 6208)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !567, file: !528, line: 151, baseType: !953, size: 64, offset: 6272)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!331, !560, !485}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !567, file: !528, line: 153, baseType: !684, size: 64, offset: 6336)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !567, file: !528, line: 154, baseType: !684, size: 64, offset: 6400)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !567, file: !528, line: 155, baseType: !684, size: 64, offset: 6464)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !567, file: !528, line: 156, baseType: !684, size: 64, offset: 6528)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !567, file: !528, line: 157, baseType: !853, size: 64, offset: 6592)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !567, file: !528, line: 159, baseType: !962, size: 64, offset: 6656)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!331, !560, !370, !575}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !567, file: !528, line: 160, baseType: !684, size: 64, offset: 6720)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !567, file: !528, line: 161, baseType: !684, size: 64, offset: 6784)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !567, file: !528, line: 162, baseType: !684, size: 64, offset: 6848)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !567, file: !528, line: 163, baseType: !684, size: 64, offset: 6912)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !567, file: !528, line: 165, baseType: !943, size: 64, offset: 6976)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !567, file: !528, line: 166, baseType: !943, size: 64, offset: 7040)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !567, file: !528, line: 167, baseType: !747, size: 64, offset: 7104)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !567, file: !528, line: 168, baseType: !973, size: 64, offset: 7168)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!331, !560, !587, !370}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !567, file: !528, line: 169, baseType: !977, size: 64, offset: 7232)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!331, !560, !661, !415}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !567, file: !528, line: 171, baseType: !708, size: 64, offset: 7296)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !567, file: !528, line: 172, baseType: !684, size: 64, offset: 7360)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !567, file: !528, line: 173, baseType: !983, size: 64, offset: 7424)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!331, !560, !415, !771}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !567, file: !528, line: 174, baseType: !843, size: 64, offset: 7488)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !567, file: !528, line: 175, baseType: !843, size: 64, offset: 7552)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !567, file: !528, line: 177, baseType: !584, size: 64, offset: 7616)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !567, file: !528, line: 178, baseType: !633, size: 64, offset: 7680)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !567, file: !528, line: 179, baseType: !584, size: 64, offset: 7744)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !567, file: !528, line: 180, baseType: !591, size: 64, offset: 7808)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !567, file: !528, line: 181, baseType: !993, size: 64, offset: 7872)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!331, !560, !310, !636, !637}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !567, file: !528, line: 183, baseType: !903, size: 64, offset: 7936)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !567, file: !528, line: 184, baseType: !668, size: 64, offset: 8000)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !567, file: !528, line: 185, baseType: !999, size: 64, offset: 8064)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!331, !560, !1002}
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !567, file: !528, line: 186, baseType: !1004, size: 64, offset: 8128)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!331, !560, !370, !573, !432}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !567, file: !528, line: 187, baseType: !727, size: 64, offset: 8192)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !567, file: !528, line: 189, baseType: !1009, size: 64, offset: 8256)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!331, !560, !370, !370, !415, !575}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !567, file: !528, line: 190, baseType: !818, size: 64, offset: 8320)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !567, file: !528, line: 191, baseType: !939, size: 64, offset: 8384)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !567, file: !528, line: 192, baseType: !943, size: 64, offset: 8448)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !567, file: !528, line: 193, baseType: !1016, size: 64, offset: 8512)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!331, !560, !551, !1019}
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1020)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !528, line: 660, size: 5312, elements: !1022)
!1022 = !{!1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1021, file: !528, line: 661, baseType: !531, size: 4480)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1021, file: !528, line: 661, baseType: !785, size: 32, offset: 4480)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1021, file: !528, line: 662, baseType: !370, size: 32, offset: 4512)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1021, file: !528, line: 662, baseType: !370, size: 32, offset: 4544)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1021, file: !528, line: 662, baseType: !370, size: 32, offset: 4576)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1021, file: !528, line: 663, baseType: !370, size: 32, offset: 4608)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1021, file: !528, line: 664, baseType: !370, size: 32, offset: 4640)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1021, file: !528, line: 665, baseType: !415, size: 64, offset: 4672)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1021, file: !528, line: 666, baseType: !415, size: 64, offset: 4736)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1021, file: !528, line: 667, baseType: !370, size: 32, offset: 4800)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1021, file: !528, line: 668, baseType: !826, size: 32, offset: 4832)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1021, file: !528, line: 670, baseType: !415, size: 64, offset: 4864)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1021, file: !528, line: 670, baseType: !415, size: 64, offset: 4928)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1021, file: !528, line: 671, baseType: !415, size: 64, offset: 4992)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1021, file: !528, line: 672, baseType: !415, size: 64, offset: 5056)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1021, file: !528, line: 673, baseType: !415, size: 64, offset: 5120)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1021, file: !528, line: 674, baseType: !370, size: 32, offset: 5184)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1021, file: !528, line: 675, baseType: !415, size: 64, offset: 5248)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !567, file: !528, line: 195, baseType: !1042, size: 64, offset: 8576)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!331, !1019, !560, !560}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !567, file: !528, line: 196, baseType: !1042, size: 64, offset: 8640)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !567, file: !528, line: 197, baseType: !818, size: 64, offset: 8704)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !567, file: !528, line: 198, baseType: !939, size: 64, offset: 8768)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !567, file: !528, line: 199, baseType: !943, size: 64, offset: 8832)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !567, file: !528, line: 201, baseType: !1050, size: 64, offset: 8896)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!331, !560, !370, !370}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !567, file: !528, line: 202, baseType: !722, size: 64, offset: 8960)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !567, file: !528, line: 203, baseType: !591, size: 64, offset: 9024)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !567, file: !528, line: 204, baseType: !776, size: 64, offset: 9088)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !567, file: !528, line: 205, baseType: !903, size: 64, offset: 9152)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !567, file: !528, line: 206, baseType: !1058, size: 64, offset: 9216)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!331, !310, !560, !370, !636, !637}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !567, file: !528, line: 208, baseType: !1062, size: 64, offset: 9280)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!331, !370, !732}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !567, file: !528, line: 209, baseType: !943, size: 64, offset: 9344)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !567, file: !528, line: 210, baseType: !739, size: 64, offset: 9408)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !562, file: !528, line: 438, baseType: !1068, size: 64, offset: 13952)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !552, line: 60, baseType: !1069)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1071)
!1071 = !{!1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1070, file: !114, line: 241, baseType: !310, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1070, file: !114, line: 242, baseType: !387, size: 32, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1070, file: !114, line: 243, baseType: !370, size: 32, offset: 96)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1070, file: !114, line: 243, baseType: !370, size: 32, offset: 128)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1070, file: !114, line: 244, baseType: !370, size: 32, offset: 160)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1070, file: !114, line: 244, baseType: !370, size: 32, offset: 192)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1070, file: !114, line: 245, baseType: !415, size: 64, offset: 256)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1070, file: !114, line: 246, baseType: !485, size: 32, offset: 320)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1070, file: !114, line: 247, baseType: !370, size: 32, offset: 352)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1070, file: !114, line: 251, baseType: !370, size: 32, offset: 384)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1070, file: !114, line: 252, baseType: !874, size: 64, offset: 448)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1070, file: !114, line: 253, baseType: !485, size: 32, offset: 512)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1070, file: !114, line: 254, baseType: !370, size: 32, offset: 544)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1070, file: !114, line: 254, baseType: !370, size: 32, offset: 576)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1070, file: !114, line: 255, baseType: !370, size: 32, offset: 608)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !562, file: !528, line: 438, baseType: !1068, size: 64, offset: 14016)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !562, file: !528, line: 439, baseType: !314, size: 64, offset: 14080)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !562, file: !528, line: 440, baseType: !1090, size: 32, offset: 14144)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !562, file: !528, line: 441, baseType: !485, size: 32, offset: 14176)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !562, file: !528, line: 442, baseType: !485, size: 32, offset: 14208)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !562, file: !528, line: 443, baseType: !1094, size: 448, offset: 14272)
!1094 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1095, size: 448, elements: !1096)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !307)
!1096 = !{!1097}
!1097 = !DISubrange(count: 7)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !562, file: !528, line: 444, baseType: !485, size: 32, offset: 14720)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !562, file: !528, line: 445, baseType: !485, size: 32, offset: 14752)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !562, file: !528, line: 446, baseType: !370, size: 32, offset: 14784)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !562, file: !528, line: 447, baseType: !408, size: 64, offset: 14848)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !562, file: !528, line: 448, baseType: !408, size: 64, offset: 14912)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !562, file: !528, line: 449, baseType: !644, size: 640, offset: 14976)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !562, file: !528, line: 450, baseType: !577, size: 32, offset: 15616)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !562, file: !528, line: 451, baseType: !1106, size: 2880, offset: 15680)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !528, line: 318, baseType: !1107)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !528, line: 319, size: 2880, elements: !1108)
!1108 = !{!1109, !1110, !1111, !1112, !1113, !1114, !1115, !1128, !1129, !1134, !1139, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1154, !1155, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1187, !1188, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1211, !1212, !1213, !1217, !1218}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1107, file: !528, line: 320, baseType: !370, size: 32)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1107, file: !528, line: 321, baseType: !370, size: 32, offset: 32)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1107, file: !528, line: 322, baseType: !370, size: 32, offset: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1107, file: !528, line: 323, baseType: !370, size: 32, offset: 96)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1107, file: !528, line: 324, baseType: !370, size: 32, offset: 128)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1107, file: !528, line: 325, baseType: !370, size: 32, offset: 160)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1107, file: !528, line: 326, baseType: !1116, size: 64, offset: 192)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !528, line: 293, baseType: !1117)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !528, line: 295, size: 448, elements: !1119)
!1119 = !{!1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1118, file: !528, line: 296, baseType: !1116, size: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1118, file: !528, line: 297, baseType: !432, size: 64, offset: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1118, file: !528, line: 297, baseType: !432, size: 64, offset: 128)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1118, file: !528, line: 298, baseType: !415, size: 64, offset: 192)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1118, file: !528, line: 298, baseType: !415, size: 64, offset: 256)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1118, file: !528, line: 299, baseType: !370, size: 32, offset: 320)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1118, file: !528, line: 300, baseType: !370, size: 32, offset: 352)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1118, file: !528, line: 301, baseType: !370, size: 32, offset: 384)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1107, file: !528, line: 326, baseType: !1116, size: 64, offset: 256)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1107, file: !528, line: 328, baseType: !1130, size: 64, offset: 320)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!331, !560, !1133, !415}
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1107, file: !528, line: 329, baseType: !1135, size: 64, offset: 384)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{!331, !1133, !1138, !417, !417, !435, !415}
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1107, file: !528, line: 330, baseType: !1140, size: 64, offset: 448)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!331, !1133}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1107, file: !528, line: 331, baseType: !1140, size: 64, offset: 512)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1107, file: !528, line: 334, baseType: !310, size: 64, offset: 576)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1107, file: !528, line: 335, baseType: !387, size: 32, offset: 640)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1107, file: !528, line: 335, baseType: !387, size: 32, offset: 672)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1107, file: !528, line: 336, baseType: !387, size: 32, offset: 704)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1107, file: !528, line: 336, baseType: !387, size: 32, offset: 736)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1107, file: !528, line: 337, baseType: !1150, size: 64, offset: 768)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !311, line: 339, baseType: !1152)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !311, line: 339, flags: DIFlagFwdDecl)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1107, file: !528, line: 338, baseType: !1150, size: 64, offset: 832)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1107, file: !528, line: 339, baseType: !1156, size: 64, offset: 896)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !311, line: 341, baseType: !1158)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !311, line: 351, size: 192, elements: !1159)
!1159 = !{!1160, !1161, !1162, !1163, !1164}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1158, file: !311, line: 354, baseType: !72, size: 32)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1158, file: !311, line: 355, baseType: !72, size: 32, offset: 32)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1158, file: !311, line: 356, baseType: !72, size: 32, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1158, file: !311, line: 361, baseType: !72, size: 32, offset: 96)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1158, file: !311, line: 362, baseType: !481, size: 64, offset: 128)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1107, file: !528, line: 340, baseType: !370, size: 32, offset: 960)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1107, file: !528, line: 340, baseType: !370, size: 32, offset: 992)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1107, file: !528, line: 341, baseType: !432, size: 64, offset: 1024)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1107, file: !528, line: 342, baseType: !415, size: 64, offset: 1088)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1107, file: !528, line: 343, baseType: !435, size: 64, offset: 1152)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1107, file: !528, line: 344, baseType: !417, size: 64, offset: 1216)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1107, file: !528, line: 345, baseType: !370, size: 32, offset: 1280)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1107, file: !528, line: 346, baseType: !1138, size: 64, offset: 1344)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1107, file: !528, line: 347, baseType: !485, size: 32, offset: 1408)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1107, file: !528, line: 348, baseType: !370, size: 32, offset: 1440)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1107, file: !528, line: 351, baseType: !485, size: 32, offset: 1472)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1107, file: !528, line: 352, baseType: !485, size: 32, offset: 1504)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1107, file: !528, line: 353, baseType: !387, size: 32, offset: 1536)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1107, file: !528, line: 354, baseType: !387, size: 32, offset: 1568)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1107, file: !528, line: 355, baseType: !1138, size: 64, offset: 1600)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1107, file: !528, line: 356, baseType: !1138, size: 64, offset: 1664)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1107, file: !528, line: 357, baseType: !1182, size: 64, offset: 1728)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !528, line: 310, baseType: !1184)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !528, line: 308, size: 32, elements: !1185)
!1185 = !{!1186}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1184, file: !528, line: 309, baseType: !370, size: 32)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1107, file: !528, line: 357, baseType: !1182, size: 64, offset: 1792)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1107, file: !528, line: 358, baseType: !1189, size: 64, offset: 1856)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !528, line: 316, baseType: !1191)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !528, line: 312, size: 128, elements: !1192)
!1192 = !{!1193, !1194, !1195}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1191, file: !528, line: 313, baseType: !314, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1191, file: !528, line: 314, baseType: !370, size: 32, offset: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1191, file: !528, line: 315, baseType: !309, size: 8, offset: 96)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1107, file: !528, line: 359, baseType: !1189, size: 64, offset: 1920)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1107, file: !528, line: 360, baseType: !1189, size: 64, offset: 1984)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1107, file: !528, line: 361, baseType: !370, size: 32, offset: 2048)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1107, file: !528, line: 362, baseType: !387, size: 32, offset: 2080)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1107, file: !528, line: 363, baseType: !370, size: 32, offset: 2112)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1107, file: !528, line: 364, baseType: !1138, size: 64, offset: 2176)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1107, file: !528, line: 365, baseType: !1156, size: 64, offset: 2240)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1107, file: !528, line: 366, baseType: !387, size: 32, offset: 2304)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1107, file: !528, line: 367, baseType: !387, size: 32, offset: 2336)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1107, file: !528, line: 368, baseType: !1150, size: 64, offset: 2368)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1107, file: !528, line: 369, baseType: !1150, size: 64, offset: 2432)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1107, file: !528, line: 370, baseType: !1208, size: 64, offset: 2496)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1209)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64)
!1210 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1107, file: !528, line: 371, baseType: !1208, size: 64, offset: 2560)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1107, file: !528, line: 372, baseType: !1208, size: 64, offset: 2624)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1107, file: !528, line: 373, baseType: !1214, size: 64, offset: 2688)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !311, line: 331, baseType: !1215)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !311, line: 331, flags: DIFlagFwdDecl)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1107, file: !528, line: 374, baseType: !481, size: 64, offset: 2752)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1107, file: !528, line: 375, baseType: !1219, size: 64, offset: 2816)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !562, file: !528, line: 451, baseType: !1106, size: 2880, offset: 18560)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !562, file: !528, line: 452, baseType: !1222, size: 64, offset: 21440)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1223)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !528, line: 681, size: 4864, elements: !1225)
!1225 = !{!1226, !1227, !1228, !1229, !1230, !1231, !1232, !1236}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1224, file: !528, line: 682, baseType: !531, size: 4480)
