; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/aij/seq/matmatmult.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/impls/aij/seq/matmatmult.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_Mat = type { %struct._p_PetscObject, [1 x %struct._MatOps], %struct._n_PetscLayout*, %struct._n_PetscLayout*, i8*, i32, i32, i32, [7 x i8*], i32, i32, i32, i64, i64, %struct.MatInfo, i32, %struct._MatStash, %struct._MatStash, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, %struct._p_MatNullSpace*, i32, i32, %struct.MatStencilInfo, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8*, i32, i32, double, %struct._p_Mat*, i32, %struct.Mat_Redundant*, i32, i32, double, i32, i32, i32*, i8*, %struct.Mat_Product*, i32, i32 }

!268 = !DIEnumerator(name: "MATOP_RART_SYMBOLIC", value: 137, isUnsigned: true)
!269 = !DIEnumerator(name: "MATOP_RART_NUMERIC", value: 138, isUnsigned: true)
!270 = !DIEnumerator(name: "MATOP_SET_BLOCK_SIZES", value: 139, isUnsigned: true)
!271 = !DIEnumerator(name: "MATOP_AYPX", value: 140, isUnsigned: true)
!272 = !DIEnumerator(name: "MATOP_RESIDUAL", value: 141, isUnsigned: true)
!273 = !DIEnumerator(name: "MATOP_FDCOLORING_SETUP", value: 142, isUnsigned: true)
!274 = !DIEnumerator(name: "MATOP_MPICONCATENATESEQ", value: 144, isUnsigned: true)
!275 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!276 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!277 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !52, line: 161, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284, !285, !286, !287}
!280 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!285 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!286 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!287 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!288 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !52, line: 1265, baseType: !5, size: 32, elements: !289)
!289 = !{!290, !291, !292}
!290 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!291 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!292 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!293 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !52, line: 1203, baseType: !5, size: 32, elements: !294)
!294 = !{!295, !296, !297, !298, !299}
!295 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!296 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!297 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!298 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!299 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !52, line: 187, baseType: !5, size: 32, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !307, !308}
!302 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!305 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!306 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!307 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!308 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!309 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !310, line: 663, baseType: !5, size: 32, elements: !311)
!310 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!311 = !{!312, !313, !314}
!312 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!313 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!314 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!315 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !52, line: 1345, baseType: !5, size: 32, elements: !316)
!316 = !{!317, !318, !319, !320}
!317 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_RANDOM", value: 0, isUnsigned: true)
!318 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_LEXICAL", value: 1, isUnsigned: true)
!319 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_LF", value: 2, isUnsigned: true)
!320 = !DIEnumerator(name: "MAT_COLORING_WEIGHT_SL", value: 3, isUnsigned: true)
!321 = !{!322, !326, !327, !330, !530, !496, !439, !388, !360, !1530, !385, !1531, !1539, !500, !1550, !498, !394, !412, !329, !1576}
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !323, line: 330, baseType: !324)
!323 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !323, line: 330, flags: DIFlagFwdDecl)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !329)
!329 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !333, line: 73, size: 4480, elements: !334)
!333 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!334 = !{!335, !337, !383, !384, !386, !389, !390, !391, !392, !400, !401, !403, !407, !411, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !424, !425, !426, !428, !429, !431, !433, !434, !435, !436, !437, !440, !442, !443, !444, !445, !446, !449, !451, !452, !453, !463, !465, !466, !470, !471, !520, !525, !527, !528, !529}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !332, file: !333, line: 74, baseType: !336, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !88)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !332, file: !333, line: 75, baseType: !338, size: 448, offset: 64)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 448, elements: !381)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !333, line: 53, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !333, line: 45, size: 448, elements: !341)
!341 = !{!342, !348, !356, !361, !365, !369, !376}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !340, file: !333, line: 46, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!346, !330, !347}
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !88)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !340, file: !333, line: 47, baseType: !349, size: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{!346, !330, !352}
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !353, line: 16, baseType: !354)
!353 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !353, line: 16, flags: DIFlagFwdDecl)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !340, file: !333, line: 48, baseType: !357, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!346, !360}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !340, file: !333, line: 49, baseType: !362, size: 64, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!346, !330, !327, !330}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !340, file: !333, line: 50, baseType: !366, size: 64, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!346, !330, !327, !360}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !340, file: !333, line: 51, baseType: !370, size: 64, offset: 320)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!346, !330, !327, !373}
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{null}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !340, file: !333, line: 52, baseType: !377, size: 64, offset: 384)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!346, !330, !327, !380}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!381 = !{!382}
!382 = !DISubrange(count: 1)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !332, file: !333, line: 76, baseType: !322, size: 64, offset: 512)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !332, file: !333, line: 77, baseType: !385, size: 32, offset: 576)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !88)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !332, file: !333, line: 78, baseType: !387, size: 64, offset: 640)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !388)
!388 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !332, file: !333, line: 78, baseType: !387, size: 64, offset: 704)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !332, file: !333, line: 78, baseType: !387, size: 64, offset: 768)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !332, file: !333, line: 78, baseType: !387, size: 64, offset: 832)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !332, file: !333, line: 79, baseType: !393, size: 64, offset: 896)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !396, line: 27, baseType: !397)
!396 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !398, line: 43, baseType: !399)
!398 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!399 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !332, file: !333, line: 80, baseType: !385, size: 32, offset: 960)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !332, file: !333, line: 81, baseType: !402, size: 32, offset: 992)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !88)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !332, file: !333, line: 82, baseType: !404, size: 64, offset: 1024)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !405)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !332, file: !333, line: 83, baseType: !408, size: 64, offset: 1088)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !332, file: !333, line: 84, baseType: !412, size: 64, offset: 1152)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !332, file: !333, line: 85, baseType: !412, size: 64, offset: 1216)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !332, file: !333, line: 86, baseType: !412, size: 64, offset: 1280)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !332, file: !333, line: 87, baseType: !412, size: 64, offset: 1344)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !332, file: !333, line: 88, baseType: !330, size: 64, offset: 1408)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !332, file: !333, line: 89, baseType: !393, size: 64, offset: 1472)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !332, file: !333, line: 90, baseType: !412, size: 64, offset: 1536)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !332, file: !333, line: 91, baseType: !412, size: 64, offset: 1600)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !332, file: !333, line: 92, baseType: !385, size: 32, offset: 1664)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !332, file: !333, line: 93, baseType: !326, size: 64, offset: 1728)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !332, file: !333, line: 94, baseType: !423, size: 64, offset: 1792)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !394)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !332, file: !333, line: 95, baseType: !385, size: 32, offset: 1856)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !332, file: !333, line: 95, baseType: !385, size: 32, offset: 1888)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !332, file: !333, line: 96, baseType: !427, size: 64, offset: 1920)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !332, file: !333, line: 96, baseType: !427, size: 64, offset: 1984)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !332, file: !333, line: 97, baseType: !430, size: 64, offset: 2048)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !332, file: !333, line: 97, baseType: !432, size: 64, offset: 2112)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !332, file: !333, line: 98, baseType: !385, size: 32, offset: 2176)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !332, file: !333, line: 98, baseType: !385, size: 32, offset: 2208)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !332, file: !333, line: 99, baseType: !427, size: 64, offset: 2240)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !332, file: !333, line: 99, baseType: !427, size: 64, offset: 2304)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !332, file: !333, line: 100, baseType: !438, size: 64, offset: 2368)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !388)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !332, file: !333, line: 100, baseType: !441, size: 64, offset: 2432)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !332, file: !333, line: 101, baseType: !385, size: 32, offset: 2496)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !332, file: !333, line: 101, baseType: !385, size: 32, offset: 2528)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !332, file: !333, line: 102, baseType: !427, size: 64, offset: 2560)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !332, file: !333, line: 102, baseType: !427, size: 64, offset: 2624)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !332, file: !333, line: 103, baseType: !447, size: 64, offset: 2688)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !439)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !332, file: !333, line: 103, baseType: !450, size: 64, offset: 2752)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !332, file: !333, line: 104, baseType: !380, size: 64, offset: 2816)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !332, file: !333, line: 105, baseType: !385, size: 32, offset: 2880)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !332, file: !333, line: 106, baseType: !454, size: 128, offset: 2944)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 128, elements: !461)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !333, line: 64, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !333, line: 61, size: 128, elements: !458)
!458 = !{!459, !460}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !457, file: !333, line: 62, baseType: !373, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !457, file: !333, line: 63, baseType: !326, size: 64, offset: 64)
!461 = !{!462}
!462 = !DISubrange(count: 2)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !332, file: !333, line: 107, baseType: !464, size: 64, offset: 3072)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 64, elements: !461)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !332, file: !333, line: 108, baseType: !326, size: 64, offset: 3136)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !332, file: !333, line: 109, baseType: !467, size: 64, offset: 3200)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!346, !326}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !332, file: !333, line: 111, baseType: !385, size: 32, offset: 3264)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !332, file: !333, line: 112, baseType: !472, size: 320, offset: 3328)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 320, elements: !518)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!346, !476, !330, !326}
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !479)
!479 = !{!480, !481, !506, !507, !508, !509, !510, !511, !512, !513, !514}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !478, file: !10, line: 100, baseType: !385, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !478, file: !10, line: 101, baseType: !482, size: 64, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !483)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !485)
!485 = !{!486, !487, !488, !489, !490, !493, !494, !495, !499, !501, !503, !504, !505}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !484, file: !10, line: 84, baseType: !412, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !484, file: !10, line: 85, baseType: !412, size: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !484, file: !10, line: 86, baseType: !326, size: 64, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !484, file: !10, line: 87, baseType: !404, size: 64, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !484, file: !10, line: 88, baseType: !491, size: 64, offset: 256)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !327)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !484, file: !10, line: 89, baseType: !329, size: 8, offset: 320)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !484, file: !10, line: 90, baseType: !412, size: 64, offset: 384)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !484, file: !10, line: 91, baseType: !496, size: 64, offset: 448)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !497, line: 46, baseType: !498)
!497 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!498 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !484, file: !10, line: 92, baseType: !500, size: 32, offset: 512)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !484, file: !10, line: 93, baseType: !502, size: 32, offset: 544)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !484, file: !10, line: 94, baseType: !482, size: 64, offset: 576)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !484, file: !10, line: 95, baseType: !412, size: 64, offset: 640)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !484, file: !10, line: 96, baseType: !326, size: 64, offset: 704)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !478, file: !10, line: 102, baseType: !412, size: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !478, file: !10, line: 102, baseType: !412, size: 64, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !478, file: !10, line: 103, baseType: !412, size: 64, offset: 256)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !478, file: !10, line: 104, baseType: !322, size: 64, offset: 320)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !478, file: !10, line: 105, baseType: !500, size: 32, offset: 384)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !478, file: !10, line: 105, baseType: !500, size: 32, offset: 416)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !478, file: !10, line: 105, baseType: !500, size: 32, offset: 448)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !478, file: !10, line: 106, baseType: !330, size: 64, offset: 512)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !478, file: !10, line: 107, baseType: !515, size: 64, offset: 576)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!518 = !{!519}
!519 = !DISubrange(count: 5)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !332, file: !333, line: 113, baseType: !521, size: 320, offset: 3648)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !522, size: 320, elements: !518)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!346, !330, !326}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !332, file: !333, line: 114, baseType: !526, size: 320, offset: 3968)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 320, elements: !518)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !332, file: !333, line: 115, baseType: !500, size: 32, offset: 4288)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !332, file: !333, line: 120, baseType: !515, size: 64, offset: 4352)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !332, file: !333, line: 121, baseType: !500, size: 32, offset: 4416)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_SeqAIJ", file: !532, line: 125, baseType: !533)
!532 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/aij/seq/aij.h", directory: "/home/users/ndemeye/xSDK")
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !532, line: 114, size: 2816, elements: !534)
!534 = !{!535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !559, !560, !561, !562, !563, !564, !565, !569, !570, !712, !713, !714, !715, !1463, !1504, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "roworiented", scope: !533, file: !532, line: 115, baseType: !500, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "nonew", scope: !533, file: !532, line: 115, baseType: !385, size: 32, offset: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "nounused", scope: !533, file: !532, line: 115, baseType: !385, size: 32, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "singlemalloc", scope: !533, file: !532, line: 115, baseType: !500, size: 32, offset: 96)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "maxnz", scope: !533, file: !532, line: 115, baseType: !385, size: 32, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "imax", scope: !533, file: !532, line: 115, baseType: !430, size: 64, offset: 192)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "ilen", scope: !533, file: !532, line: 115, baseType: !430, size: 64, offset: 256)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ipre", scope: !533, file: !532, line: 115, baseType: !430, size: 64, offset: 320)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "free_imax_ilen", scope: !533, file: !532, line: 115, baseType: !500, size: 32, offset: 384)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !533, file: !532, line: 115, baseType: !385, size: 32, offset: 416)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !533, file: !532, line: 115, baseType: !385, size: 32, offset: 448)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "keepnonzeropattern", scope: !533, file: !532, line: 115, baseType: !500, size: 32, offset: 480)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ignorezeroentries", scope: !533, file: !532, line: 115, baseType: !500, size: 32, offset: 512)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "free_ij", scope: !533, file: !532, line: 115, baseType: !500, size: 32, offset: 544)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "free_a", scope: !533, file: !532, line: 115, baseType: !500, size: 32, offset: 576)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "compressedrow", scope: !533, file: !532, line: 115, baseType: !551, size: 192, offset: 640)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_CompressedRow", file: !552, line: 407, baseType: !553)
!552 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !552, line: 402, size: 192, elements: !554)
!554 = !{!555, !556, !557, !558}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !553, file: !552, line: 403, baseType: !500, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !553, file: !552, line: 404, baseType: !385, size: 32, offset: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !553, file: !552, line: 405, baseType: !430, size: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "rindex", scope: !553, file: !552, line: 406, baseType: !430, size: 64, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "nz", scope: !533, file: !532, line: 115, baseType: !385, size: 32, offset: 832)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !533, file: !532, line: 115, baseType: !430, size: 64, offset: 896)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !533, file: !532, line: 115, baseType: !430, size: 64, offset: 960)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "diag", scope: !533, file: !532, line: 115, baseType: !430, size: 64, offset: 1024)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerorowcnt", scope: !533, file: !532, line: 115, baseType: !385, size: 32, offset: 1088)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "free_diag", scope: !533, file: !532, line: 115, baseType: !500, size: 32, offset: 1120)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !533, file: !532, line: 115, baseType: !566, size: 64, offset: 1152)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatScalar", file: !568, line: 799, baseType: !448)
!568 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmath.h", directory: "/home/users/ndemeye/xSDK")
!569 = !DIDerivedType(tag: DW_TAG_member, name: "solve_work", scope: !533, file: !532, line: 115, baseType: !447, size: 64, offset: 1216)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !533, file: !532, line: 115, baseType: !571, size: 64, offset: 1280)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !572, line: 11, baseType: !573)
!572 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !46, line: 50, size: 7104, elements: !575)
!575 = !{!576, !578, !645, !699, !700, !701, !702, !703, !704, !705, !706, !709}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !574, file: !46, line: 51, baseType: !577, size: 4480)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !333, line: 122, baseType: !332)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !574, file: !46, line: 51, baseType: !579, size: 1536, offset: 4480)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !580, size: 1536, elements: !381)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ISOps", file: !46, line: 21, size: 1536, elements: !581)
!581 = !{!582, !589, !590, !595, !599, !600, !605, !609, !610, !614, !615, !619, !620, !625, !629, !633, !637, !638, !639, !640, !641, !642, !643, !644}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "getindices", scope: !580, file: !46, line: 22, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!346, !571, !586}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !385)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "restoreindices", scope: !580, file: !46, line: 23, baseType: !583, size: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "invertpermutation", scope: !580, file: !46, line: 24, baseType: !591, size: 64, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!346, !571, !385, !594}
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "sort", scope: !580, file: !46, line: 25, baseType: !596, size: 64, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{!346, !571}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "sortremovedups", scope: !580, file: !46, line: 26, baseType: !596, size: 64, offset: 256)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "sorted", scope: !580, file: !46, line: 27, baseType: !601, size: 64, offset: 320)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!346, !571, !604}
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !580, file: !46, line: 28, baseType: !606, size: 64, offset: 384)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{!346, !571, !594}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !580, file: !46, line: 29, baseType: !596, size: 64, offset: 448)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !580, file: !46, line: 30, baseType: !611, size: 64, offset: 512)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!346, !571, !352}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !580, file: !46, line: 31, baseType: !611, size: 64, offset: 576)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !580, file: !46, line: 32, baseType: !616, size: 64, offset: 640)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{!346, !571, !571}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "togeneral", scope: !580, file: !46, line: 33, baseType: !596, size: 64, offset: 704)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "oncomm", scope: !580, file: !46, line: 34, baseType: !621, size: 64, offset: 768)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!346, !571, !322, !624, !594}
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscCopyMode", file: !4, line: 327, baseType: !35)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksize", scope: !580, file: !46, line: 35, baseType: !626, size: 64, offset: 832)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!346, !571, !385}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "contiguous", scope: !580, file: !46, line: 36, baseType: !630, size: 64, offset: 896)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!346, !571, !385, !385, !430, !604}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "locate", scope: !580, file: !46, line: 37, baseType: !634, size: 64, offset: 960)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!346, !571, !385, !430}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "sortedlocal", scope: !580, file: !46, line: 38, baseType: !601, size: 64, offset: 1024)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "sortedglobal", scope: !580, file: !46, line: 39, baseType: !601, size: 64, offset: 1088)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "uniquelocal", scope: !580, file: !46, line: 40, baseType: !601, size: 64, offset: 1152)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "uniqueglobal", scope: !580, file: !46, line: 41, baseType: !601, size: 64, offset: 1216)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "permlocal", scope: !580, file: !46, line: 42, baseType: !601, size: 64, offset: 1280)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "permglobal", scope: !580, file: !46, line: 43, baseType: !601, size: 64, offset: 1344)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "intervallocal", scope: !580, file: !46, line: 44, baseType: !601, size: 64, offset: 1408)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "intervalglobal", scope: !580, file: !46, line: 45, baseType: !601, size: 64, offset: 1472)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !574, file: !46, line: 52, baseType: !646, size: 64, offset: 6016)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !572, line: 60, baseType: !647)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !41, line: 240, size: 640, elements: !649)
!649 = !{!650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !695, !696, !697, !698}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !648, file: !41, line: 241, baseType: !322, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !648, file: !41, line: 242, baseType: !402, size: 32, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !648, file: !41, line: 243, baseType: !385, size: 32, offset: 96)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !648, file: !41, line: 243, baseType: !385, size: 32, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !648, file: !41, line: 244, baseType: !385, size: 32, offset: 160)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !648, file: !41, line: 244, baseType: !385, size: 32, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !648, file: !41, line: 245, baseType: !430, size: 64, offset: 256)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !648, file: !41, line: 246, baseType: !500, size: 32, offset: 320)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !648, file: !41, line: 247, baseType: !385, size: 32, offset: 352)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !648, file: !41, line: 251, baseType: !385, size: 32, offset: 384)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !648, file: !41, line: 252, baseType: !661, size: 64, offset: 448)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !572, line: 30, baseType: !662)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !46, line: 73, size: 5440, elements: !664)
!664 = !{!665, !666, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !663, file: !46, line: 74, baseType: !577, size: 4480)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !663, file: !46, line: 74, baseType: !667, size: 256, offset: 4480)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !668, size: 256, elements: !381)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ISLocalToGlobalMappingOps", file: !46, line: 66, size: 256, elements: !669)
!669 = !{!670, !674, !679, !680}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingsetup", scope: !668, file: !46, line: 67, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!346, !661}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingapply", scope: !668, file: !46, line: 68, baseType: !675, size: 64, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!346, !661, !678, !385, !587, !430, !430}
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISGlobalToLocalMappingMode", file: !41, line: 149, baseType: !40)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "globaltolocalmappingapplyblock", scope: !668, file: !46, line: 69, baseType: !675, size: 64, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !668, file: !46, line: 70, baseType: !671, size: 64, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !663, file: !46, line: 75, baseType: !385, size: 32, offset: 4736)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !663, file: !46, line: 76, baseType: !385, size: 32, offset: 4768)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "indices", scope: !663, file: !46, line: 77, baseType: !430, size: 64, offset: 4800)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "globalstart", scope: !663, file: !46, line: 78, baseType: !385, size: 32, offset: 4864)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "globalend", scope: !663, file: !46, line: 79, baseType: !385, size: 32, offset: 4896)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "info_cached", scope: !663, file: !46, line: 80, baseType: !500, size: 32, offset: 4928)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "info_free", scope: !663, file: !46, line: 81, baseType: !500, size: 32, offset: 4960)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "info_nproc", scope: !663, file: !46, line: 82, baseType: !385, size: 32, offset: 4992)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "info_procs", scope: !663, file: !46, line: 83, baseType: !430, size: 64, offset: 5056)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "info_numprocs", scope: !663, file: !46, line: 84, baseType: !430, size: 64, offset: 5120)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "info_indices", scope: !663, file: !46, line: 85, baseType: !432, size: 64, offset: 5184)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "info_nodec", scope: !663, file: !46, line: 86, baseType: !430, size: 64, offset: 5248)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "info_nodei", scope: !663, file: !46, line: 87, baseType: !432, size: 64, offset: 5312)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !663, file: !46, line: 88, baseType: !326, size: 64, offset: 5376)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !648, file: !41, line: 253, baseType: !500, size: 32, offset: 512)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !648, file: !41, line: 254, baseType: !385, size: 32, offset: 544)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !648, file: !41, line: 254, baseType: !385, size: 32, offset: 576)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !648, file: !41, line: 255, baseType: !385, size: 32, offset: 608)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !574, file: !46, line: 53, baseType: !385, size: 32, offset: 6080)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !574, file: !46, line: 53, baseType: !385, size: 32, offset: 6112)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !574, file: !46, line: 54, baseType: !326, size: 64, offset: 6144)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !574, file: !46, line: 55, baseType: !430, size: 64, offset: 6208)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !574, file: !46, line: 55, baseType: !430, size: 64, offset: 6272)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "local_offset", scope: !574, file: !46, line: 56, baseType: !385, size: 32, offset: 6336)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "complement", scope: !574, file: !46, line: 57, baseType: !571, size: 64, offset: 6400)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "info_permanent", scope: !574, file: !46, line: 58, baseType: !707, size: 320, offset: 6464)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 320, elements: !708)
!708 = !{!462, !519}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !574, file: !46, line: 59, baseType: !710, size: 320, offset: 6784)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !711, size: 320, elements: !708)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISInfoBool", file: !46, line: 48, baseType: !45)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !533, file: !532, line: 115, baseType: !571, size: 64, offset: 1344)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "icol", scope: !533, file: !532, line: 115, baseType: !571, size: 64, offset: 1408)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !533, file: !532, line: 115, baseType: !500, size: 32, offset: 1472)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !533, file: !532, line: 115, baseType: !716, size: 64, offset: 1536)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !52, line: 16, baseType: !717)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !552, line: 436, size: 23424, elements: !719)
!719 = !{!720, !721, !1225, !1226, !1227, !1228, !1230, !1231, !1232, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1359, !1360, !1376, !1377, !1378, !1379, !1380, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1415, !1435, !1436, !1438, !1439, !1440, !1441, !1442, !1443, !1461, !1462}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !718, file: !552, line: 437, baseType: !577, size: 4480)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !718, file: !552, line: 437, baseType: !722, size: 9472, offset: 4480)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !723, size: 9472, elements: !381)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !552, line: 32, size: 9472, elements: !724)
!724 = !{!725, !732, !736, !737, !744, !748, !749, !750, !751, !752, !753, !754, !774, !778, !783, !789, !808, !812, !816, !817, !822, !827, !828, !833, !837, !841, !845, !849, !853, !854, !855, !856, !857, !861, !862, !867, !868, !869, !870, !871, !876, !883, !887, !891, !895, !899, !903, !904, !908, !909, !916, !920, !921, !922, !923, !997, !1002, !1003, !1007, !1008, !1012, !1013, !1017, !1022, !1023, !1027, !1031, !1035, !1036, !1037, !1038, !1039, !1040, !1045, !1046, !1050, !1054, !1058, !1059, !1060, !1064, !1074, !1075, !1079, !1080, !1084, !1085, !1089, !1090, !1095, !1096, !1100, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1114, !1115, !1116, !1117, !1118, !1119, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1134, !1138, !1139, !1140, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1154, !1155, !1156, !1161, !1165, !1166, !1170, !1171, !1172, !1173, !1199, !1203, !1204, !1205, !1206, !1207, !1211, !1212, !1213, !1214, !1215, !1219, !1223, !1224}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !723, file: !552, line: 34, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!346, !716, !385, !587, !385, !587, !729, !731}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !448)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !723, file: !552, line: 35, baseType: !733, size: 64, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!346, !716, !385, !430, !432, !450}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !723, file: !552, line: 36, baseType: !733, size: 64, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !723, file: !552, line: 37, baseType: !738, size: 64, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!346, !716, !741, !741}
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !76, line: 21, baseType: !742)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !76, line: 21, flags: DIFlagFwdDecl)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !723, file: !552, line: 38, baseType: !745, size: 64, offset: 256)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!346, !716, !741, !741, !741}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !723, file: !552, line: 40, baseType: !738, size: 64, offset: 320)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !723, file: !552, line: 41, baseType: !745, size: 64, offset: 384)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !723, file: !552, line: 42, baseType: !738, size: 64, offset: 448)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !723, file: !552, line: 43, baseType: !745, size: 64, offset: 512)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !723, file: !552, line: 44, baseType: !738, size: 64, offset: 576)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !723, file: !552, line: 46, baseType: !745, size: 64, offset: 640)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !723, file: !552, line: 47, baseType: !755, size: 64, offset: 704)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{!346, !716, !571, !571, !758}
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !760)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !52, line: 1239, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 1226, size: 704, elements: !762)
!762 = !{!763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !761, file: !52, line: 1227, baseType: !439, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !761, file: !52, line: 1228, baseType: !439, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !761, file: !52, line: 1229, baseType: !439, size: 64, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !761, file: !52, line: 1230, baseType: !439, size: 64, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !761, file: !52, line: 1231, baseType: !439, size: 64, offset: 256)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !761, file: !52, line: 1232, baseType: !439, size: 64, offset: 320)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !761, file: !52, line: 1233, baseType: !439, size: 64, offset: 384)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !761, file: !52, line: 1234, baseType: !439, size: 64, offset: 448)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !761, file: !52, line: 1236, baseType: !439, size: 64, offset: 512)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !761, file: !52, line: 1237, baseType: !439, size: 64, offset: 576)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !761, file: !52, line: 1238, baseType: !439, size: 64, offset: 640)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !723, file: !552, line: 48, baseType: !775, size: 64, offset: 768)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{!346, !716, !571, !758}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !723, file: !552, line: 49, baseType: !779, size: 64, offset: 832)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{!346, !716, !741, !439, !782, !439, !385, !385, !741}
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !52, line: 1291, baseType: !51)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !723, file: !552, line: 50, baseType: !784, size: 64, offset: 896)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{!346, !716, !787, !788}
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !52, line: 238, baseType: !64)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !723, file: !552, line: 52, baseType: !790, size: 64, offset: 960)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{!346, !716, !793, !794}
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !52, line: 612, baseType: !70)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !52, line: 600, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 592, size: 640, elements: !797)
!797 = !{!798, !799, !800, !801, !802, !803, !804, !805, !806, !807}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !796, file: !52, line: 593, baseType: !387, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !796, file: !52, line: 594, baseType: !387, size: 64, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !796, file: !52, line: 594, baseType: !387, size: 64, offset: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !796, file: !52, line: 594, baseType: !387, size: 64, offset: 192)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !796, file: !52, line: 595, baseType: !387, size: 64, offset: 256)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !796, file: !52, line: 596, baseType: !387, size: 64, offset: 320)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !796, file: !52, line: 597, baseType: !387, size: 64, offset: 384)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !796, file: !52, line: 598, baseType: !387, size: 64, offset: 448)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !796, file: !52, line: 598, baseType: !387, size: 64, offset: 512)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !796, file: !52, line: 599, baseType: !387, size: 64, offset: 576)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !723, file: !552, line: 53, baseType: !809, size: 64, offset: 1024)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!346, !716, !716, !604}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !723, file: !552, line: 54, baseType: !813, size: 64, offset: 1088)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{!346, !716, !741}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !723, file: !552, line: 55, baseType: !738, size: 64, offset: 1152)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !723, file: !552, line: 56, baseType: !818, size: 64, offset: 1216)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!346, !716, !821, !438}
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !76, line: 155, baseType: !75)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !723, file: !552, line: 58, baseType: !823, size: 64, offset: 1280)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{!346, !716, !826}
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !52, line: 424, baseType: !83)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !723, file: !552, line: 59, baseType: !823, size: 64, offset: 1344)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !723, file: !552, line: 60, baseType: !829, size: 64, offset: 1408)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{!346, !716, !832, !500}
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !52, line: 469, baseType: !87)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !723, file: !552, line: 61, baseType: !834, size: 64, offset: 1472)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!346, !716}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !723, file: !552, line: 63, baseType: !838, size: 64, offset: 1536)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!346, !716, !385, !587, !448, !741, !741}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !723, file: !552, line: 64, baseType: !842, size: 64, offset: 1600)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!346, !716, !716, !571, !571, !758}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !723, file: !552, line: 65, baseType: !846, size: 64, offset: 1664)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!346, !716, !716, !758}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !723, file: !552, line: 66, baseType: !850, size: 64, offset: 1728)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!346, !716, !716, !571, !758}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !723, file: !552, line: 67, baseType: !846, size: 64, offset: 1792)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !723, file: !552, line: 69, baseType: !834, size: 64, offset: 1856)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !723, file: !552, line: 70, baseType: !842, size: 64, offset: 1920)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !723, file: !552, line: 71, baseType: !850, size: 64, offset: 1984)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !723, file: !552, line: 72, baseType: !858, size: 64, offset: 2048)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{!346, !716, !788}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !723, file: !552, line: 73, baseType: !834, size: 64, offset: 2112)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !723, file: !552, line: 75, baseType: !863, size: 64, offset: 2176)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{!346, !716, !866, !788}
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !52, line: 563, baseType: !118)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !723, file: !552, line: 76, baseType: !738, size: 64, offset: 2240)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !723, file: !552, line: 77, baseType: !738, size: 64, offset: 2304)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !723, file: !552, line: 78, baseType: !755, size: 64, offset: 2368)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !723, file: !552, line: 79, baseType: !775, size: 64, offset: 2432)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !723, file: !552, line: 81, baseType: !872, size: 64, offset: 2496)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!346, !716, !448, !716, !875}
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !52, line: 285, baseType: !123)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !723, file: !552, line: 82, baseType: !877, size: 64, offset: 2560)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DISubroutineType(types: !879)
!879 = !{!346, !716, !385, !880, !880, !787, !882}
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !571)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !723, file: !552, line: 83, baseType: !884, size: 64, offset: 2624)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{!346, !716, !385, !594, !385}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !723, file: !552, line: 84, baseType: !888, size: 64, offset: 2688)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DISubroutineType(types: !890)
!890 = !{!346, !716, !385, !587, !385, !587, !447}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !723, file: !552, line: 85, baseType: !892, size: 64, offset: 2752)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DISubroutineType(types: !894)
!894 = !{!346, !716, !716, !875}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !723, file: !552, line: 87, baseType: !896, size: 64, offset: 2816)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DISubroutineType(types: !898)
!898 = !{!346, !716, !741, !430}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !723, file: !552, line: 88, baseType: !900, size: 64, offset: 2880)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DISubroutineType(types: !902)
!902 = !{!346, !716, !448}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !723, file: !552, line: 89, baseType: !900, size: 64, offset: 2944)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !723, file: !552, line: 90, baseType: !905, size: 64, offset: 3008)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{!346, !716, !741, !731}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !723, file: !552, line: 91, baseType: !838, size: 64, offset: 3072)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !723, file: !552, line: 93, baseType: !910, size: 64, offset: 3136)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!346, !716, !913}
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !914)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !723, file: !552, line: 94, baseType: !917, size: 64, offset: 3200)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{!346, !716, !385, !500, !500, !430, !586, !586, !604}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !723, file: !552, line: 95, baseType: !917, size: 64, offset: 3264)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !723, file: !552, line: 96, baseType: !917, size: 64, offset: 3328)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !723, file: !552, line: 97, baseType: !917, size: 64, offset: 3392)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !723, file: !552, line: 99, baseType: !924, size: 64, offset: 3456)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{!346, !716, !927, !943}
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !572, line: 51, baseType: !928)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !46, line: 91, size: 384, elements: !930)
!930 = !{!931, !932, !933, !934, !935, !939, !940, !942}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !929, file: !46, line: 92, baseType: !385, size: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !929, file: !46, line: 93, baseType: !385, size: 32, offset: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "is", scope: !929, file: !46, line: 94, baseType: !594, size: 64, offset: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !929, file: !46, line: 95, baseType: !322, size: 64, offset: 128)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !929, file: !46, line: 96, baseType: !936, size: 64, offset: 192)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !41, line: 215, baseType: !938)
!938 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !929, file: !46, line: 97, baseType: !385, size: 32, offset: 256)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !929, file: !46, line: 98, baseType: !941, size: 32, offset: 288)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !41, line: 213, baseType: !129)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !929, file: !46, line: 99, baseType: !500, size: 32, offset: 320)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !52, line: 1378, baseType: !944)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !552, line: 609, size: 6208, elements: !946)
!946 = !{!947, !948, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !967, !974, !975, !976, !977, !978, !979, !980, !981, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !945, file: !552, line: 610, baseType: !577, size: 4480)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !945, file: !552, line: 610, baseType: !949, size: 32, offset: 4480)
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 32, elements: !381)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !945, file: !552, line: 611, baseType: !385, size: 32, offset: 4512)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !945, file: !552, line: 611, baseType: !385, size: 32, offset: 4544)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !945, file: !552, line: 611, baseType: !385, size: 32, offset: 4576)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !945, file: !552, line: 612, baseType: !385, size: 32, offset: 4608)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !945, file: !552, line: 613, baseType: !385, size: 32, offset: 4640)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !945, file: !552, line: 614, baseType: !430, size: 64, offset: 4672)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !945, file: !552, line: 615, baseType: !432, size: 64, offset: 4736)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !945, file: !552, line: 616, baseType: !594, size: 64, offset: 4800)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !945, file: !552, line: 617, baseType: !430, size: 64, offset: 4864)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !945, file: !552, line: 618, baseType: !960, size: 64, offset: 4928)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !552, line: 602, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !552, line: 598, size: 128, elements: !963)
!963 = !{!964, !965, !966}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !962, file: !552, line: 599, baseType: !385, size: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !962, file: !552, line: 600, baseType: !385, size: 32, offset: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !962, file: !552, line: 601, baseType: !447, size: 64, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !945, file: !552, line: 619, baseType: !968, size: 64, offset: 4992)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !552, line: 607, baseType: !970)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !552, line: 604, size: 128, elements: !971)
!971 = !{!972, !973}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !970, file: !552, line: 605, baseType: !385, size: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !970, file: !552, line: 606, baseType: !447, size: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !945, file: !552, line: 620, baseType: !447, size: 64, offset: 5056)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !945, file: !552, line: 621, baseType: !439, size: 64, offset: 5120)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !945, file: !552, line: 622, baseType: !439, size: 64, offset: 5184)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !945, file: !552, line: 623, baseType: !741, size: 64, offset: 5248)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !945, file: !552, line: 623, baseType: !741, size: 64, offset: 5312)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !945, file: !552, line: 623, baseType: !741, size: 64, offset: 5376)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !945, file: !552, line: 624, baseType: !500, size: 32, offset: 5440)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !945, file: !552, line: 625, baseType: !982, size: 64, offset: 5504)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!346}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !945, file: !552, line: 626, baseType: !326, size: 64, offset: 5568)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !945, file: !552, line: 627, baseType: !741, size: 64, offset: 5632)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !945, file: !552, line: 628, baseType: !385, size: 32, offset: 5696)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !945, file: !552, line: 629, baseType: !327, size: 64, offset: 5760)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !945, file: !552, line: 630, baseType: !941, size: 32, offset: 5824)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !945, file: !552, line: 631, baseType: !385, size: 32, offset: 5856)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !945, file: !552, line: 631, baseType: !385, size: 32, offset: 5888)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !945, file: !552, line: 632, baseType: !500, size: 32, offset: 5920)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !945, file: !552, line: 633, baseType: !500, size: 32, offset: 5952)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !945, file: !552, line: 634, baseType: !373, size: 64, offset: 6016)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !945, file: !552, line: 634, baseType: !326, size: 64, offset: 6080)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !945, file: !552, line: 635, baseType: !393, size: 64, offset: 6144)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !723, file: !552, line: 100, baseType: !998, size: 64, offset: 3520)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!346, !716, !385, !385, !936, !1001}
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !723, file: !552, line: 101, baseType: !834, size: 64, offset: 3584)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !723, file: !552, line: 102, baseType: !1004, size: 64, offset: 3648)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!346, !716, !571, !571, !788}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !723, file: !552, line: 103, baseType: !726, size: 64, offset: 3712)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !723, file: !552, line: 105, baseType: !1009, size: 64, offset: 3776)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!346, !716, !571, !571, !787, !788}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !723, file: !552, line: 106, baseType: !834, size: 64, offset: 3840)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !723, file: !552, line: 107, baseType: !1014, size: 64, offset: 3904)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!346, !716, !352}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !723, file: !552, line: 108, baseType: !1018, size: 64, offset: 3968)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!346, !716, !1021, !787, !788}
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !52, line: 25, baseType: !327)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !723, file: !552, line: 109, baseType: !982, size: 64, offset: 4032)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !723, file: !552, line: 111, baseType: !1024, size: 64, offset: 4096)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!346, !716, !716, !716, !439, !716}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !723, file: !552, line: 112, baseType: !1028, size: 64, offset: 4160)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!346, !716, !716, !716, !716}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !723, file: !552, line: 113, baseType: !1032, size: 64, offset: 4224)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!346, !716, !661, !661}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !723, file: !552, line: 114, baseType: !726, size: 64, offset: 4288)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !723, file: !552, line: 115, baseType: !838, size: 64, offset: 4352)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !723, file: !552, line: 117, baseType: !896, size: 64, offset: 4416)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !723, file: !552, line: 118, baseType: !896, size: 64, offset: 4480)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !723, file: !552, line: 119, baseType: !1018, size: 64, offset: 4544)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !723, file: !552, line: 120, baseType: !1041, size: 64, offset: 4608)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!346, !716, !1044, !604}
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !52, line: 1675, baseType: !133)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !723, file: !552, line: 121, baseType: !982, size: 64, offset: 4672)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !723, file: !552, line: 123, baseType: !1047, size: 64, offset: 4736)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!346, !716, !385, !326}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !723, file: !552, line: 124, baseType: !1051, size: 64, offset: 4800)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!346, !716, !943, !741, !326}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !723, file: !552, line: 125, baseType: !1055, size: 64, offset: 4864)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!346, !476, !716}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !723, file: !552, line: 126, baseType: !738, size: 64, offset: 4928)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !723, file: !552, line: 127, baseType: !738, size: 64, offset: 4992)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !723, file: !552, line: 129, baseType: !1061, size: 64, offset: 5056)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!346, !716, !594}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !723, file: !552, line: 130, baseType: !1065, size: 64, offset: 5120)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!346, !716, !1068, !1068}
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !76, line: 654, baseType: !1069)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !76, line: 653, size: 128, elements: !1071)
!1071 = !{!1072, !1073}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1070, file: !76, line: 653, baseType: !385, size: 32)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1070, file: !76, line: 653, baseType: !741, size: 64, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !723, file: !552, line: 131, baseType: !1065, size: 64, offset: 5184)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !723, file: !552, line: 132, baseType: !1076, size: 64, offset: 5248)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!346, !716, !430, !430, !430}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !723, file: !552, line: 133, baseType: !1014, size: 64, offset: 5312)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !723, file: !552, line: 135, baseType: !1081, size: 64, offset: 5376)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!346, !716, !439, !604}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !723, file: !552, line: 136, baseType: !1081, size: 64, offset: 5440)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !723, file: !552, line: 137, baseType: !1086, size: 64, offset: 5504)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!346, !716, !604}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !723, file: !552, line: 138, baseType: !726, size: 64, offset: 5568)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !723, file: !552, line: 139, baseType: !1091, size: 64, offset: 5632)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!346, !716, !1094, !1094}
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !723, file: !552, line: 141, baseType: !982, size: 64, offset: 5696)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !723, file: !552, line: 142, baseType: !1097, size: 64, offset: 5760)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!346, !716, !716, !439, !716}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !723, file: !552, line: 143, baseType: !1101, size: 64, offset: 5824)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!346, !716, !716, !716}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !723, file: !552, line: 144, baseType: !982, size: 64, offset: 5888)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !723, file: !552, line: 145, baseType: !1097, size: 64, offset: 5952)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !723, file: !552, line: 147, baseType: !1101, size: 64, offset: 6016)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !723, file: !552, line: 148, baseType: !982, size: 64, offset: 6080)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !723, file: !552, line: 149, baseType: !1097, size: 64, offset: 6144)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !723, file: !552, line: 150, baseType: !1101, size: 64, offset: 6208)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !723, file: !552, line: 151, baseType: !1111, size: 64, offset: 6272)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!346, !716, !500}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !723, file: !552, line: 153, baseType: !834, size: 64, offset: 6336)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !723, file: !552, line: 154, baseType: !834, size: 64, offset: 6400)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !723, file: !552, line: 155, baseType: !834, size: 64, offset: 6464)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !723, file: !552, line: 156, baseType: !834, size: 64, offset: 6528)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !723, file: !552, line: 157, baseType: !1014, size: 64, offset: 6592)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !723, file: !552, line: 159, baseType: !1120, size: 64, offset: 6656)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{!346, !716, !385, !729}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !723, file: !552, line: 160, baseType: !834, size: 64, offset: 6720)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !723, file: !552, line: 161, baseType: !834, size: 64, offset: 6784)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !723, file: !552, line: 162, baseType: !834, size: 64, offset: 6848)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !723, file: !552, line: 163, baseType: !834, size: 64, offset: 6912)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !723, file: !552, line: 165, baseType: !1101, size: 64, offset: 6976)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !723, file: !552, line: 166, baseType: !1101, size: 64, offset: 7040)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !723, file: !552, line: 167, baseType: !896, size: 64, offset: 7104)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !723, file: !552, line: 168, baseType: !1131, size: 64, offset: 7168)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = !DISubroutineType(types: !1133)
!1133 = !{!346, !716, !741, !385}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !723, file: !552, line: 169, baseType: !1135, size: 64, offset: 7232)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{!346, !716, !604, !430}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !723, file: !552, line: 171, baseType: !858, size: 64, offset: 7296)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !723, file: !552, line: 172, baseType: !834, size: 64, offset: 7360)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !723, file: !552, line: 173, baseType: !1141, size: 64, offset: 7424)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!346, !716, !430, !586}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !723, file: !552, line: 174, baseType: !1004, size: 64, offset: 7488)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !723, file: !552, line: 175, baseType: !1004, size: 64, offset: 7552)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !723, file: !552, line: 177, baseType: !738, size: 64, offset: 7616)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !723, file: !552, line: 178, baseType: !784, size: 64, offset: 7680)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !723, file: !552, line: 179, baseType: !738, size: 64, offset: 7744)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !723, file: !552, line: 180, baseType: !745, size: 64, offset: 7808)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !723, file: !552, line: 181, baseType: !1151, size: 64, offset: 7872)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{!346, !716, !322, !787, !788}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !723, file: !552, line: 183, baseType: !1061, size: 64, offset: 7936)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !723, file: !552, line: 184, baseType: !818, size: 64, offset: 8000)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !723, file: !552, line: 185, baseType: !1157, size: 64, offset: 8064)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!346, !716, !1160}
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !723, file: !552, line: 186, baseType: !1162, size: 64, offset: 8128)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!346, !716, !385, !587, !447}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !723, file: !552, line: 187, baseType: !877, size: 64, offset: 8192)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !723, file: !552, line: 189, baseType: !1167, size: 64, offset: 8256)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{!346, !716, !385, !385, !430, !729}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !723, file: !552, line: 190, baseType: !982, size: 64, offset: 8320)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !723, file: !552, line: 191, baseType: !1097, size: 64, offset: 8384)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !723, file: !552, line: 192, baseType: !1101, size: 64, offset: 8448)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !723, file: !552, line: 193, baseType: !1174, size: 64, offset: 8512)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64)
!1175 = !DISubroutineType(types: !1176)
!1176 = !{!346, !716, !927, !1177}
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !52, line: 1401, baseType: !1178)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !552, line: 660, size: 5312, elements: !1180)
!1180 = !{!1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1179, file: !552, line: 661, baseType: !577, size: 4480)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1179, file: !552, line: 661, baseType: !949, size: 32, offset: 4480)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1179, file: !552, line: 662, baseType: !385, size: 32, offset: 4512)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1179, file: !552, line: 662, baseType: !385, size: 32, offset: 4544)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1179, file: !552, line: 662, baseType: !385, size: 32, offset: 4576)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1179, file: !552, line: 663, baseType: !385, size: 32, offset: 4608)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1179, file: !552, line: 664, baseType: !385, size: 32, offset: 4640)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1179, file: !552, line: 665, baseType: !430, size: 64, offset: 4672)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1179, file: !552, line: 666, baseType: !430, size: 64, offset: 4736)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1179, file: !552, line: 667, baseType: !385, size: 32, offset: 4800)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1179, file: !552, line: 668, baseType: !941, size: 32, offset: 4832)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1179, file: !552, line: 670, baseType: !430, size: 64, offset: 4864)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1179, file: !552, line: 670, baseType: !430, size: 64, offset: 4928)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1179, file: !552, line: 671, baseType: !430, size: 64, offset: 4992)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1179, file: !552, line: 672, baseType: !430, size: 64, offset: 5056)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1179, file: !552, line: 673, baseType: !430, size: 64, offset: 5120)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1179, file: !552, line: 674, baseType: !385, size: 32, offset: 5184)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1179, file: !552, line: 675, baseType: !430, size: 64, offset: 5248)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !723, file: !552, line: 195, baseType: !1200, size: 64, offset: 8576)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DISubroutineType(types: !1202)
!1202 = !{!346, !1177, !716, !716}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !723, file: !552, line: 196, baseType: !1200, size: 64, offset: 8640)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !723, file: !552, line: 197, baseType: !982, size: 64, offset: 8704)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !723, file: !552, line: 198, baseType: !1097, size: 64, offset: 8768)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !723, file: !552, line: 199, baseType: !1101, size: 64, offset: 8832)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !723, file: !552, line: 201, baseType: !1208, size: 64, offset: 8896)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{!346, !716, !385, !385}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !723, file: !552, line: 202, baseType: !872, size: 64, offset: 8960)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !723, file: !552, line: 203, baseType: !745, size: 64, offset: 9024)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !723, file: !552, line: 204, baseType: !924, size: 64, offset: 9088)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !723, file: !552, line: 205, baseType: !1061, size: 64, offset: 9152)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !723, file: !552, line: 206, baseType: !1216, size: 64, offset: 9216)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DISubroutineType(types: !1218)
!1218 = !{!346, !322, !716, !385, !787, !788}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !723, file: !552, line: 208, baseType: !1220, size: 64, offset: 9280)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DISubroutineType(types: !1222)
!1222 = !{!346, !385, !882}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !723, file: !552, line: 209, baseType: !1101, size: 64, offset: 9344)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !723, file: !552, line: 210, baseType: !888, size: 64, offset: 9408)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !718, file: !552, line: 438, baseType: !646, size: 64, offset: 13952)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !718, file: !552, line: 438, baseType: !646, size: 64, offset: 14016)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !718, file: !552, line: 439, baseType: !326, size: 64, offset: 14080)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !718, file: !552, line: 440, baseType: !1229, size: 32, offset: 14144)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !52, line: 161, baseType: !278)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !718, file: !552, line: 441, baseType: !500, size: 32, offset: 14176)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !718, file: !552, line: 442, baseType: !500, size: 32, offset: 14208)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !718, file: !552, line: 443, baseType: !1233, size: 448, offset: 14272)
!1233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1234, size: 448, elements: !1235)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !52, line: 1159, baseType: !327)
!1235 = !{!1236}
!1236 = !DISubrange(count: 7)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !718, file: !552, line: 444, baseType: !500, size: 32, offset: 14720)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !718, file: !552, line: 445, baseType: !500, size: 32, offset: 14752)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !718, file: !552, line: 446, baseType: !385, size: 32, offset: 14784)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !718, file: !552, line: 447, baseType: !423, size: 64, offset: 14848)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !718, file: !552, line: 448, baseType: !423, size: 64, offset: 14912)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !718, file: !552, line: 449, baseType: !795, size: 640, offset: 14976)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !718, file: !552, line: 450, baseType: !731, size: 32, offset: 15616)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !718, file: !552, line: 451, baseType: !1245, size: 2880, offset: 15680)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !552, line: 318, baseType: !1246)
