; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/partition/spartition.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/mat/partition/spartition.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct._p_MatPartitioning = type { %struct._p_PetscObject, [1 x %struct._MatPartitioningOps], %struct._p_Mat*, i32*, double*, i32, i8*, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!359 = distinct !DILexicalBlock(scope: !351, file: !316, line: 45, column: 41)
!360 = !DILocation(line: 45, column: 41, scope: !356)
!361 = !DILocation(line: 45, column: 41, scope: !362)
!362 = distinct !DILexicalBlock(scope: !363, file: !316, line: 45, column: 41)
!363 = distinct !DILexicalBlock(scope: !355, file: !316, line: 45, column: 41)
!364 = !{!343, !336, i64 1544}
!365 = !DILocation(line: 45, column: 41, scope: !363)
!366 = !DILocation(line: 45, column: 41, scope: !367)
!367 = distinct !DILexicalBlock(scope: !362, file: !316, line: 45, column: 41)
!368 = !DILocation(line: 45, column: 41, scope: !369)
!369 = distinct !DILexicalBlock(scope: !355, file: !316, line: 45, column: 41)
!370 = !DILocation(line: 45, column: 41, scope: !371)
!371 = distinct !DILexicalBlock(scope: !369, file: !316, line: 45, column: 41)
!372 = !DILocation(line: 45, column: 41, scope: !373)
!373 = distinct !DILexicalBlock(scope: !374, file: !316, line: 45, column: 41)
!374 = distinct !DILexicalBlock(scope: !371, file: !316, line: 45, column: 41)
!375 = !DILocation(line: 45, column: 41, scope: !374)
!376 = !DILocation(line: 45, column: 41, scope: !377)
!377 = distinct !DILexicalBlock(scope: !373, file: !316, line: 45, column: 41)
!378 = !DILocation(line: 46, column: 36, scope: !315)
!379 = !DILocation(line: 48, column: 10, scope: !315)
!380 = !DILocation(line: 0, scope: !315)
!381 = !DILocation(line: 0, scope: !323)
!382 = !DILocation(line: 48, column: 89, scope: !383)
!383 = distinct !DILexicalBlock(scope: !323, file: !316, line: 48, column: 89)
!384 = !DILocation(line: 48, column: 89, scope: !323)
!385 = !{!"branch_weights", i32 2000, i32 1}
!386 = !DILocation(line: 49, column: 10, scope: !315)
!387 = !DILocation(line: 0, scope: !325)
!388 = !DILocation(line: 49, column: 89, scope: !389)
!389 = distinct !DILexicalBlock(scope: !325, file: !316, line: 49, column: 89)
!390 = !DILocation(line: 49, column: 89, scope: !325)
!391 = !DILocation(line: 50, column: 10, scope: !315)
!392 = !DILocation(line: 0, scope: !327)
!393 = !DILocation(line: 50, column: 88, scope: !394)
!394 = distinct !DILexicalBlock(scope: !327, file: !316, line: 50, column: 88)
!395 = !DILocation(line: 50, column: 88, scope: !327)
!396 = !DILocation(line: 51, column: 10, scope: !315)
!397 = !DILocation(line: 0, scope: !329)
!398 = !DILocation(line: 51, column: 94, scope: !399)
!399 = distinct !DILexicalBlock(scope: !329, file: !316, line: 51, column: 94)
!400 = !DILocation(line: 51, column: 94, scope: !329)
!401 = !DILocation(line: 64, column: 3, scope: !402)
!402 = distinct !DILexicalBlock(scope: !403, file: !316, line: 64, column: 3)
!403 = distinct !DILexicalBlock(scope: !404, file: !316, line: 64, column: 3)
!404 = distinct !DILexicalBlock(scope: !315, file: !316, line: 64, column: 3)
!405 = !DILocation(line: 64, column: 3, scope: !403)
!406 = !DILocation(line: 64, column: 3, scope: !407)
!407 = distinct !DILexicalBlock(scope: !408, file: !316, line: 64, column: 3)
!408 = distinct !DILexicalBlock(scope: !402, file: !316, line: 64, column: 3)
!409 = !DILocation(line: 64, column: 3, scope: !408)
!410 = !DILocation(line: 64, column: 3, scope: !411)
!411 = distinct !DILexicalBlock(scope: !412, file: !316, line: 64, column: 3)
!412 = distinct !DILexicalBlock(scope: !407, file: !316, line: 64, column: 3)
!413 = !DILocation(line: 64, column: 3, scope: !412)
!414 = !DILocation(line: 64, column: 3, scope: !415)
!415 = distinct !DILexicalBlock(scope: !411, file: !316, line: 64, column: 3)
!416 = !DILocation(line: 64, column: 3, scope: !417)
!417 = distinct !DILexicalBlock(scope: !407, file: !316, line: 64, column: 3)
!418 = !DILocation(line: 64, column: 3, scope: !419)
!419 = distinct !DILexicalBlock(scope: !417, file: !316, line: 64, column: 3)
!420 = !DILocation(line: 64, column: 3, scope: !421)
!421 = distinct !DILexicalBlock(scope: !422, file: !316, line: 64, column: 3)
!422 = distinct !DILexicalBlock(scope: !419, file: !316, line: 64, column: 3)
!423 = !DILocation(line: 64, column: 3, scope: !422)
!424 = !DILocation(line: 64, column: 3, scope: !425)
!425 = distinct !DILexicalBlock(scope: !421, file: !316, line: 64, column: 3)
!426 = !DILocation(line: 65, column: 1, scope: !315)
!427 = !DISubprogram(name: "MatPartitioningRegister", scope: !36, file: !36, line: 1459, type: !428, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1435)
!428 = !DISubroutineType(types: !429)
!429 = !{!72, !301, !430}
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!72, !433}
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatPartitioning", file: !435, line: 527, size: 5248, elements: !436)
!435 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!436 = !{!437, !638, !666, !1429, !1430, !1431, !1432, !1433, !1434}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !434, file: !435, line: 528, baseType: !438, size: 4480)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !439, line: 122, baseType: !440)
!439 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !439, line: 73, size: 4480, elements: !441)
!441 = !{!442, !444, !491, !492, !494, !497, !498, !499, !500, !508, !509, !511, !515, !519, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !532, !533, !534, !536, !537, !539, !541, !542, !543, !544, !545, !548, !550, !551, !552, !553, !554, !557, !559, !560, !561, !571, !573, !574, !578, !579, !628, !633, !635, !636, !637}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !440, file: !439, line: 74, baseType: !443, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !440, file: !439, line: 75, baseType: !445, size: 448, offset: 64)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 448, elements: !489)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !439, line: 53, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !439, line: 45, size: 448, elements: !448)
!448 = !{!449, !456, !464, !469, !473, !477, !484}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !447, file: !439, line: 46, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!319, !453, !455}
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !447, file: !439, line: 47, baseType: !457, size: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!319, !453, !460}
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !461, line: 16, baseType: !462)
!461 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !461, line: 16, flags: DIFlagFwdDecl)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !447, file: !439, line: 48, baseType: !465, size: 64, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!319, !468}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !447, file: !439, line: 49, baseType: !470, size: 64, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!319, !453, !301, !453}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !447, file: !439, line: 50, baseType: !474, size: 64, offset: 256)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!319, !453, !301, !468}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !447, file: !439, line: 51, baseType: !478, size: 64, offset: 320)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!319, !453, !301, !481}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{null}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !447, file: !439, line: 52, baseType: !485, size: 64, offset: 384)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!319, !453, !301, !488}
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!489 = !{!490}
!490 = !DISubrange(count: 1)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !440, file: !439, line: 76, baseType: !304, size: 64, offset: 512)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !440, file: !439, line: 77, baseType: !493, size: 32, offset: 576)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !440, file: !439, line: 78, baseType: !495, size: 64, offset: 640)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !496)
!496 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !440, file: !439, line: 78, baseType: !495, size: 64, offset: 704)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !440, file: !439, line: 78, baseType: !495, size: 64, offset: 768)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !440, file: !439, line: 78, baseType: !495, size: 64, offset: 832)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !440, file: !439, line: 79, baseType: !501, size: 64, offset: 896)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !502)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !503)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !504, line: 27, baseType: !505)
!504 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !506, line: 43, baseType: !507)
!506 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!507 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !440, file: !439, line: 80, baseType: !493, size: 32, offset: 960)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !440, file: !439, line: 81, baseType: !510, size: 32, offset: 992)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !440, file: !439, line: 82, baseType: !512, size: 64, offset: 1024)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !513)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !440, file: !439, line: 83, baseType: !516, size: 64, offset: 1088)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !517)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !440, file: !439, line: 84, baseType: !520, size: 64, offset: 1152)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !440, file: !439, line: 85, baseType: !520, size: 64, offset: 1216)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !440, file: !439, line: 86, baseType: !520, size: 64, offset: 1280)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !440, file: !439, line: 87, baseType: !520, size: 64, offset: 1344)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !440, file: !439, line: 88, baseType: !453, size: 64, offset: 1408)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !440, file: !439, line: 89, baseType: !501, size: 64, offset: 1472)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !440, file: !439, line: 90, baseType: !520, size: 64, offset: 1536)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !440, file: !439, line: 91, baseType: !520, size: 64, offset: 1600)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !440, file: !439, line: 92, baseType: !493, size: 32, offset: 1664)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !440, file: !439, line: 93, baseType: !308, size: 64, offset: 1728)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !440, file: !439, line: 94, baseType: !531, size: 64, offset: 1792)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !502)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !440, file: !439, line: 95, baseType: !493, size: 32, offset: 1856)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !440, file: !439, line: 95, baseType: !493, size: 32, offset: 1888)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !440, file: !439, line: 96, baseType: !535, size: 64, offset: 1920)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !440, file: !439, line: 96, baseType: !535, size: 64, offset: 1984)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !440, file: !439, line: 97, baseType: !538, size: 64, offset: 2048)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !440, file: !439, line: 97, baseType: !540, size: 64, offset: 2112)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !440, file: !439, line: 98, baseType: !493, size: 32, offset: 2176)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !440, file: !439, line: 98, baseType: !493, size: 32, offset: 2208)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !440, file: !439, line: 99, baseType: !535, size: 64, offset: 2240)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !440, file: !439, line: 99, baseType: !535, size: 64, offset: 2304)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !440, file: !439, line: 100, baseType: !546, size: 64, offset: 2368)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !496)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !440, file: !439, line: 100, baseType: !549, size: 64, offset: 2432)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !440, file: !439, line: 101, baseType: !493, size: 32, offset: 2496)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !440, file: !439, line: 101, baseType: !493, size: 32, offset: 2528)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !440, file: !439, line: 102, baseType: !535, size: 64, offset: 2560)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !440, file: !439, line: 102, baseType: !535, size: 64, offset: 2624)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !440, file: !439, line: 103, baseType: !555, size: 64, offset: 2688)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !547)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !440, file: !439, line: 103, baseType: !558, size: 64, offset: 2752)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !440, file: !439, line: 104, baseType: !488, size: 64, offset: 2816)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !440, file: !439, line: 105, baseType: !493, size: 32, offset: 2880)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !440, file: !439, line: 106, baseType: !562, size: 128, offset: 2944)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 128, elements: !569)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !439, line: 64, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !439, line: 61, size: 128, elements: !566)
!566 = !{!567, !568}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !565, file: !439, line: 62, baseType: !481, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !565, file: !439, line: 63, baseType: !308, size: 64, offset: 64)
!569 = !{!570}
!570 = !DISubrange(count: 2)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !440, file: !439, line: 107, baseType: !572, size: 64, offset: 3072)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 64, elements: !569)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !440, file: !439, line: 108, baseType: !308, size: 64, offset: 3136)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !440, file: !439, line: 109, baseType: !575, size: 64, offset: 3200)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{!319, !308}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !440, file: !439, line: 111, baseType: !493, size: 32, offset: 3264)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !440, file: !439, line: 112, baseType: !580, size: 320, offset: 3328)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !581, size: 320, elements: !626)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{!319, !584, !453, !308}
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !587)
!587 = !{!588, !589, !614, !615, !616, !617, !618, !619, !620, !621, !622}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !586, file: !10, line: 100, baseType: !493, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !586, file: !10, line: 101, baseType: !590, size: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !591)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !593)
!593 = !{!594, !595, !596, !597, !598, !601, !602, !603, !607, !609, !611, !612, !613}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !592, file: !10, line: 84, baseType: !520, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !592, file: !10, line: 85, baseType: !520, size: 64, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !592, file: !10, line: 86, baseType: !308, size: 64, offset: 128)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !592, file: !10, line: 87, baseType: !512, size: 64, offset: 192)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !592, file: !10, line: 88, baseType: !599, size: 64, offset: 256)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !301)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !592, file: !10, line: 89, baseType: !303, size: 8, offset: 320)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !592, file: !10, line: 90, baseType: !520, size: 64, offset: 384)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !592, file: !10, line: 91, baseType: !604, size: 64, offset: 448)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !605, line: 46, baseType: !606)
!605 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!606 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !592, file: !10, line: 92, baseType: !608, size: 32, offset: 512)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !592, file: !10, line: 93, baseType: !610, size: 32, offset: 544)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !592, file: !10, line: 94, baseType: !590, size: 64, offset: 576)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !592, file: !10, line: 95, baseType: !520, size: 64, offset: 640)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !592, file: !10, line: 96, baseType: !308, size: 64, offset: 704)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !586, file: !10, line: 102, baseType: !520, size: 64, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !586, file: !10, line: 102, baseType: !520, size: 64, offset: 192)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !586, file: !10, line: 103, baseType: !520, size: 64, offset: 256)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !586, file: !10, line: 104, baseType: !304, size: 64, offset: 320)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !586, file: !10, line: 105, baseType: !608, size: 32, offset: 384)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !586, file: !10, line: 105, baseType: !608, size: 32, offset: 416)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !586, file: !10, line: 105, baseType: !608, size: 32, offset: 448)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !586, file: !10, line: 106, baseType: !453, size: 64, offset: 512)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !586, file: !10, line: 107, baseType: !623, size: 64, offset: 576)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !624)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!626 = !{!627}
!627 = !DISubrange(count: 5)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !440, file: !439, line: 113, baseType: !629, size: 320, offset: 3648)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 320, elements: !626)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!319, !453, !308}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !440, file: !439, line: 114, baseType: !634, size: 320, offset: 3968)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 320, elements: !626)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !440, file: !439, line: 115, baseType: !608, size: 32, offset: 4288)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !440, file: !439, line: 120, baseType: !623, size: 64, offset: 4352)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !440, file: !439, line: 121, baseType: !608, size: 32, offset: 4416)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !434, file: !435, line: 528, baseType: !639, size: 384, offset: 4480)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !640, size: 384, elements: !489)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatPartitioningOps", file: !435, line: 518, size: 384, elements: !641)
!641 = !{!642, !652, !653, !657, !661, !665}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "apply", scope: !640, file: !435, line: 519, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!319, !646, !647}
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatPartitioning", file: !36, line: 1427, baseType: !433)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !649, line: 11, baseType: !650)
!649 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !649, line: 11, flags: DIFlagFwdDecl)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "applynd", scope: !640, file: !435, line: 520, baseType: !643, size: 64, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !640, file: !435, line: 521, baseType: !654, size: 64, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!319, !584, !646}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !640, file: !435, line: 522, baseType: !658, size: 64, offset: 192)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!319, !646}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !640, file: !435, line: 523, baseType: !662, size: 64, offset: 256)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{!319, !646, !460}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "improve", scope: !640, file: !435, line: 524, baseType: !643, size: 64, offset: 320)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "adj", scope: !434, file: !435, line: 529, baseType: !667, size: 64, offset: 4864)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !668)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !435, line: 436, size: 23424, elements: !670)
!670 = !{!671, !672, !1172, !1192, !1193, !1194, !1196, !1197, !1198, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1325, !1326, !1342, !1343, !1344, !1345, !1346, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1381, !1401, !1402, !1404, !1405, !1406, !1407, !1408, !1409, !1427, !1428}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !669, file: !435, line: 437, baseType: !438, size: 4480)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !669, file: !435, line: 437, baseType: !673, size: 9472, offset: 4480)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !674, size: 9472, elements: !489)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !435, line: 32, size: 9472, elements: !675)
!675 = !{!676, !685, !689, !690, !697, !701, !702, !703, !704, !705, !706, !707, !727, !731, !736, !742, !761, !766, !770, !771, !776, !781, !782, !787, !791, !795, !799, !803, !807, !808, !809, !810, !811, !815, !816, !821, !822, !823, !824, !825, !830, !837, !841, !845, !849, !853, !857, !858, !862, !863, !870, !875, !876, !877, !878, !938, !946, !947, !951, !952, !956, !957, !961, !966, !967, !971, !975, !982, !983, !984, !985, !986, !987, !992, !993, !997, !1001, !1005, !1006, !1007, !1011, !1021, !1022, !1026, !1027, !1031, !1032, !1036, !1037, !1042, !1043, !1047, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1061, !1062, !1063, !1064, !1065, !1066, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1081, !1085, !1086, !1087, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1101, !1102, !1103, !1108, !1112, !1113, !1117, !1118, !1119, !1120, !1146, !1150, !1151, !1152, !1153, !1154, !1158, !1159, !1160, !1161, !1162, !1166, !1170, !1171}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !674, file: !435, line: 34, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!319, !667, !493, !680, !493, !680, !682, !684}
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !493)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !556)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !674, file: !435, line: 35, baseType: !686, size: 64, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!319, !667, !493, !538, !540, !558}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !674, file: !435, line: 36, baseType: !686, size: 64, offset: 128)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !674, file: !435, line: 37, baseType: !691, size: 64, offset: 192)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!319, !667, !694, !694}
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !695)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !674, file: !435, line: 38, baseType: !698, size: 64, offset: 256)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!319, !667, !694, !694, !694}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !674, file: !435, line: 40, baseType: !691, size: 64, offset: 320)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !674, file: !435, line: 41, baseType: !698, size: 64, offset: 384)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !674, file: !435, line: 42, baseType: !691, size: 64, offset: 448)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !674, file: !435, line: 43, baseType: !698, size: 64, offset: 512)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !674, file: !435, line: 44, baseType: !691, size: 64, offset: 576)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !674, file: !435, line: 46, baseType: !698, size: 64, offset: 640)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !674, file: !435, line: 47, baseType: !708, size: 64, offset: 704)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!319, !667, !648, !648, !711}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !715)
!715 = !{!716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !714, file: !36, line: 1227, baseType: !547, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !714, file: !36, line: 1228, baseType: !547, size: 64, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !714, file: !36, line: 1229, baseType: !547, size: 64, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !714, file: !36, line: 1230, baseType: !547, size: 64, offset: 192)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !714, file: !36, line: 1231, baseType: !547, size: 64, offset: 256)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !714, file: !36, line: 1232, baseType: !547, size: 64, offset: 320)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !714, file: !36, line: 1233, baseType: !547, size: 64, offset: 384)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !714, file: !36, line: 1234, baseType: !547, size: 64, offset: 448)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !714, file: !36, line: 1236, baseType: !547, size: 64, offset: 512)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !714, file: !36, line: 1237, baseType: !547, size: 64, offset: 576)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !714, file: !36, line: 1238, baseType: !547, size: 64, offset: 640)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !674, file: !435, line: 48, baseType: !728, size: 64, offset: 768)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!319, !667, !648, !711}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !674, file: !435, line: 49, baseType: !732, size: 64, offset: 832)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!319, !667, !694, !547, !735, !547, !493, !493, !694}
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !674, file: !435, line: 50, baseType: !737, size: 64, offset: 896)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!319, !667, !740, !741}
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !674, file: !435, line: 52, baseType: !743, size: 64, offset: 960)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!319, !667, !746, !747}
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !750)
!750 = !{!751, !752, !753, !754, !755, !756, !757, !758, !759, !760}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !749, file: !36, line: 593, baseType: !495, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !749, file: !36, line: 594, baseType: !495, size: 64, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !749, file: !36, line: 594, baseType: !495, size: 64, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !749, file: !36, line: 594, baseType: !495, size: 64, offset: 192)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !749, file: !36, line: 595, baseType: !495, size: 64, offset: 256)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !749, file: !36, line: 596, baseType: !495, size: 64, offset: 320)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !749, file: !36, line: 597, baseType: !495, size: 64, offset: 384)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !749, file: !36, line: 598, baseType: !495, size: 64, offset: 448)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !749, file: !36, line: 598, baseType: !495, size: 64, offset: 512)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !749, file: !36, line: 599, baseType: !495, size: 64, offset: 576)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !674, file: !435, line: 53, baseType: !762, size: 64, offset: 1024)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{!319, !667, !667, !765}
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !674, file: !435, line: 54, baseType: !767, size: 64, offset: 1088)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{!319, !667, !694}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !674, file: !435, line: 55, baseType: !691, size: 64, offset: 1152)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !674, file: !435, line: 56, baseType: !772, size: 64, offset: 1216)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!319, !667, !775, !546}
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !674, file: !435, line: 58, baseType: !777, size: 64, offset: 1280)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!319, !667, !780}
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !674, file: !435, line: 59, baseType: !777, size: 64, offset: 1344)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !674, file: !435, line: 60, baseType: !783, size: 64, offset: 1408)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{!319, !667, !786, !608}
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !674, file: !435, line: 61, baseType: !788, size: 64, offset: 1472)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{!319, !667}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !674, file: !435, line: 63, baseType: !792, size: 64, offset: 1536)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{!319, !667, !493, !680, !556, !694, !694}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !674, file: !435, line: 64, baseType: !796, size: 64, offset: 1600)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{!319, !667, !667, !648, !648, !711}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !674, file: !435, line: 65, baseType: !800, size: 64, offset: 1664)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DISubroutineType(types: !802)
!802 = !{!319, !667, !667, !711}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !674, file: !435, line: 66, baseType: !804, size: 64, offset: 1728)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!319, !667, !667, !648, !711}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !674, file: !435, line: 67, baseType: !800, size: 64, offset: 1792)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !674, file: !435, line: 69, baseType: !788, size: 64, offset: 1856)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !674, file: !435, line: 70, baseType: !796, size: 64, offset: 1920)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !674, file: !435, line: 71, baseType: !804, size: 64, offset: 1984)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !674, file: !435, line: 72, baseType: !812, size: 64, offset: 2048)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DISubroutineType(types: !814)
!814 = !{!319, !667, !741}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !674, file: !435, line: 73, baseType: !788, size: 64, offset: 2112)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !674, file: !435, line: 75, baseType: !817, size: 64, offset: 2176)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{!319, !667, !820, !741}
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !674, file: !435, line: 76, baseType: !691, size: 64, offset: 2240)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !674, file: !435, line: 77, baseType: !691, size: 64, offset: 2304)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !674, file: !435, line: 78, baseType: !708, size: 64, offset: 2368)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !674, file: !435, line: 79, baseType: !728, size: 64, offset: 2432)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !674, file: !435, line: 81, baseType: !826, size: 64, offset: 2496)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{!319, !667, !556, !667, !829}
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !674, file: !435, line: 82, baseType: !831, size: 64, offset: 2560)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{!319, !667, !493, !834, !834, !740, !836}
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !648)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !674, file: !435, line: 83, baseType: !838, size: 64, offset: 2624)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!319, !667, !493, !647, !493}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !674, file: !435, line: 84, baseType: !842, size: 64, offset: 2688)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!319, !667, !493, !680, !493, !680, !555}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !674, file: !435, line: 85, baseType: !846, size: 64, offset: 2752)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!319, !667, !667, !829}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !674, file: !435, line: 87, baseType: !850, size: 64, offset: 2816)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!319, !667, !694, !538}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !674, file: !435, line: 88, baseType: !854, size: 64, offset: 2880)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{!319, !667, !556}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !674, file: !435, line: 89, baseType: !854, size: 64, offset: 2944)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !674, file: !435, line: 90, baseType: !859, size: 64, offset: 3008)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!319, !667, !694, !684}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !674, file: !435, line: 91, baseType: !792, size: 64, offset: 3072)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !674, file: !435, line: 93, baseType: !864, size: 64, offset: 3136)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{!319, !667, !867}
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !868)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !674, file: !435, line: 94, baseType: !871, size: 64, offset: 3200)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!319, !667, !493, !608, !608, !538, !874, !874, !765}
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !674, file: !435, line: 95, baseType: !871, size: 64, offset: 3264)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !674, file: !435, line: 96, baseType: !871, size: 64, offset: 3328)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !674, file: !435, line: 97, baseType: !871, size: 64, offset: 3392)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !674, file: !435, line: 99, baseType: !879, size: 64, offset: 3456)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{!319, !667, !882, !885}
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !649, line: 51, baseType: !883)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !649, line: 51, flags: DIFlagFwdDecl)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !886)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !435, line: 609, size: 6208, elements: !888)
!888 = !{!889, !890, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !909, !916, !917, !918, !919, !920, !921, !922, !923, !925, !926, !927, !928, !929, !931, !932, !933, !934, !935, !936, !937}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !887, file: !435, line: 610, baseType: !438, size: 4480)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !887, file: !435, line: 610, baseType: !891, size: 32, offset: 4480)
!891 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !489)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !887, file: !435, line: 611, baseType: !493, size: 32, offset: 4512)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !887, file: !435, line: 611, baseType: !493, size: 32, offset: 4544)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !887, file: !435, line: 611, baseType: !493, size: 32, offset: 4576)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !887, file: !435, line: 612, baseType: !493, size: 32, offset: 4608)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !887, file: !435, line: 613, baseType: !493, size: 32, offset: 4640)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !887, file: !435, line: 614, baseType: !538, size: 64, offset: 4672)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !887, file: !435, line: 615, baseType: !540, size: 64, offset: 4736)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !887, file: !435, line: 616, baseType: !647, size: 64, offset: 4800)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !887, file: !435, line: 617, baseType: !538, size: 64, offset: 4864)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !887, file: !435, line: 618, baseType: !902, size: 64, offset: 4928)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !435, line: 602, baseType: !904)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !435, line: 598, size: 128, elements: !905)
!905 = !{!906, !907, !908}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !904, file: !435, line: 599, baseType: !493, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !904, file: !435, line: 600, baseType: !493, size: 32, offset: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !904, file: !435, line: 601, baseType: !555, size: 64, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !887, file: !435, line: 619, baseType: !910, size: 64, offset: 4992)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !435, line: 607, baseType: !912)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !435, line: 604, size: 128, elements: !913)
!913 = !{!914, !915}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !912, file: !435, line: 605, baseType: !493, size: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !912, file: !435, line: 606, baseType: !555, size: 64, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !887, file: !435, line: 620, baseType: !555, size: 64, offset: 5056)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !887, file: !435, line: 621, baseType: !547, size: 64, offset: 5120)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !887, file: !435, line: 622, baseType: !547, size: 64, offset: 5184)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !887, file: !435, line: 623, baseType: !694, size: 64, offset: 5248)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !887, file: !435, line: 623, baseType: !694, size: 64, offset: 5312)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !887, file: !435, line: 623, baseType: !694, size: 64, offset: 5376)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !887, file: !435, line: 624, baseType: !608, size: 32, offset: 5440)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !887, file: !435, line: 625, baseType: !924, size: 64, offset: 5504)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !887, file: !435, line: 626, baseType: !308, size: 64, offset: 5568)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !887, file: !435, line: 627, baseType: !694, size: 64, offset: 5632)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !887, file: !435, line: 628, baseType: !493, size: 32, offset: 5696)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !887, file: !435, line: 629, baseType: !301, size: 64, offset: 5760)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !887, file: !435, line: 630, baseType: !930, size: 32, offset: 5824)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !887, file: !435, line: 631, baseType: !493, size: 32, offset: 5856)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !887, file: !435, line: 631, baseType: !493, size: 32, offset: 5888)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !887, file: !435, line: 632, baseType: !608, size: 32, offset: 5920)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !887, file: !435, line: 633, baseType: !608, size: 32, offset: 5952)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !887, file: !435, line: 634, baseType: !481, size: 64, offset: 6016)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !887, file: !435, line: 634, baseType: !308, size: 64, offset: 6080)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !887, file: !435, line: 635, baseType: !501, size: 64, offset: 6144)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !674, file: !435, line: 100, baseType: !939, size: 64, offset: 3520)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!319, !667, !493, !493, !942, !945}
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !944)
!944 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !674, file: !435, line: 101, baseType: !788, size: 64, offset: 3584)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !674, file: !435, line: 102, baseType: !948, size: 64, offset: 3648)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{!319, !667, !648, !648, !741}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !674, file: !435, line: 103, baseType: !677, size: 64, offset: 3712)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !674, file: !435, line: 105, baseType: !953, size: 64, offset: 3776)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!319, !667, !648, !648, !740, !741}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !674, file: !435, line: 106, baseType: !788, size: 64, offset: 3840)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !674, file: !435, line: 107, baseType: !958, size: 64, offset: 3904)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!319, !667, !460}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !674, file: !435, line: 108, baseType: !962, size: 64, offset: 3968)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!319, !667, !965, !740, !741}
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !301)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !674, file: !435, line: 109, baseType: !924, size: 64, offset: 4032)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !674, file: !435, line: 111, baseType: !968, size: 64, offset: 4096)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!319, !667, !667, !667, !547, !667}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !674, file: !435, line: 112, baseType: !972, size: 64, offset: 4160)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!319, !667, !667, !667, !667}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !674, file: !435, line: 113, baseType: !976, size: 64, offset: 4224)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!319, !667, !979, !979}
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !649, line: 30, baseType: !980)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !649, line: 30, flags: DIFlagFwdDecl)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !674, file: !435, line: 114, baseType: !677, size: 64, offset: 4288)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !674, file: !435, line: 115, baseType: !792, size: 64, offset: 4352)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !674, file: !435, line: 117, baseType: !850, size: 64, offset: 4416)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !674, file: !435, line: 118, baseType: !850, size: 64, offset: 4480)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !674, file: !435, line: 119, baseType: !962, size: 64, offset: 4544)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !674, file: !435, line: 120, baseType: !988, size: 64, offset: 4608)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!319, !667, !991, !765}
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !674, file: !435, line: 121, baseType: !924, size: 64, offset: 4672)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !674, file: !435, line: 123, baseType: !994, size: 64, offset: 4736)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!319, !667, !493, !308}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !674, file: !435, line: 124, baseType: !998, size: 64, offset: 4800)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!319, !667, !885, !694, !308}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !674, file: !435, line: 125, baseType: !1002, size: 64, offset: 4864)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!319, !584, !667}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !674, file: !435, line: 126, baseType: !691, size: 64, offset: 4928)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !674, file: !435, line: 127, baseType: !691, size: 64, offset: 4992)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !674, file: !435, line: 129, baseType: !1008, size: 64, offset: 5056)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!319, !667, !647}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !674, file: !435, line: 130, baseType: !1012, size: 64, offset: 5120)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!319, !667, !1015, !1015}
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !1016)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !1018)
!1018 = !{!1019, !1020}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1017, file: !60, line: 653, baseType: !493, size: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1017, file: !60, line: 653, baseType: !694, size: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !674, file: !435, line: 131, baseType: !1012, size: 64, offset: 5184)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !674, file: !435, line: 132, baseType: !1023, size: 64, offset: 5248)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!319, !667, !538, !538, !538}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !674, file: !435, line: 133, baseType: !958, size: 64, offset: 5312)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !674, file: !435, line: 135, baseType: !1028, size: 64, offset: 5376)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!319, !667, !547, !765}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !674, file: !435, line: 136, baseType: !1028, size: 64, offset: 5440)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !674, file: !435, line: 137, baseType: !1033, size: 64, offset: 5504)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!319, !667, !765}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !674, file: !435, line: 138, baseType: !677, size: 64, offset: 5568)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !674, file: !435, line: 139, baseType: !1038, size: 64, offset: 5632)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!319, !667, !1041, !1041}
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !674, file: !435, line: 141, baseType: !924, size: 64, offset: 5696)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !674, file: !435, line: 142, baseType: !1044, size: 64, offset: 5760)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!319, !667, !667, !547, !667}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !674, file: !435, line: 143, baseType: !1048, size: 64, offset: 5824)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!319, !667, !667, !667}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !674, file: !435, line: 144, baseType: !924, size: 64, offset: 5888)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !674, file: !435, line: 145, baseType: !1044, size: 64, offset: 5952)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !674, file: !435, line: 147, baseType: !1048, size: 64, offset: 6016)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !674, file: !435, line: 148, baseType: !924, size: 64, offset: 6080)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !674, file: !435, line: 149, baseType: !1044, size: 64, offset: 6144)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !674, file: !435, line: 150, baseType: !1048, size: 64, offset: 6208)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !674, file: !435, line: 151, baseType: !1058, size: 64, offset: 6272)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!319, !667, !608}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !674, file: !435, line: 153, baseType: !788, size: 64, offset: 6336)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !674, file: !435, line: 154, baseType: !788, size: 64, offset: 6400)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !674, file: !435, line: 155, baseType: !788, size: 64, offset: 6464)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !674, file: !435, line: 156, baseType: !788, size: 64, offset: 6528)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !674, file: !435, line: 157, baseType: !958, size: 64, offset: 6592)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !674, file: !435, line: 159, baseType: !1067, size: 64, offset: 6656)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!319, !667, !493, !682}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !674, file: !435, line: 160, baseType: !788, size: 64, offset: 6720)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !674, file: !435, line: 161, baseType: !788, size: 64, offset: 6784)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !674, file: !435, line: 162, baseType: !788, size: 64, offset: 6848)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !674, file: !435, line: 163, baseType: !788, size: 64, offset: 6912)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !674, file: !435, line: 165, baseType: !1048, size: 64, offset: 6976)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !674, file: !435, line: 166, baseType: !1048, size: 64, offset: 7040)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !674, file: !435, line: 167, baseType: !850, size: 64, offset: 7104)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !674, file: !435, line: 168, baseType: !1078, size: 64, offset: 7168)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!319, !667, !694, !493}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !674, file: !435, line: 169, baseType: !1082, size: 64, offset: 7232)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!319, !667, !765, !538}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !674, file: !435, line: 171, baseType: !812, size: 64, offset: 7296)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !674, file: !435, line: 172, baseType: !788, size: 64, offset: 7360)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !674, file: !435, line: 173, baseType: !1088, size: 64, offset: 7424)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!319, !667, !538, !874}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !674, file: !435, line: 174, baseType: !948, size: 64, offset: 7488)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !674, file: !435, line: 175, baseType: !948, size: 64, offset: 7552)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !674, file: !435, line: 177, baseType: !691, size: 64, offset: 7616)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !674, file: !435, line: 178, baseType: !737, size: 64, offset: 7680)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !674, file: !435, line: 179, baseType: !691, size: 64, offset: 7744)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !674, file: !435, line: 180, baseType: !698, size: 64, offset: 7808)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !674, file: !435, line: 181, baseType: !1098, size: 64, offset: 7872)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!319, !667, !304, !740, !741}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !674, file: !435, line: 183, baseType: !1008, size: 64, offset: 7936)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !674, file: !435, line: 184, baseType: !772, size: 64, offset: 8000)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !674, file: !435, line: 185, baseType: !1104, size: 64, offset: 8064)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!319, !667, !1107}
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !674, file: !435, line: 186, baseType: !1109, size: 64, offset: 8128)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{!319, !667, !493, !680, !555}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !674, file: !435, line: 187, baseType: !831, size: 64, offset: 8192)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !674, file: !435, line: 189, baseType: !1114, size: 64, offset: 8256)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!319, !667, !493, !493, !538, !682}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !674, file: !435, line: 190, baseType: !924, size: 64, offset: 8320)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !674, file: !435, line: 191, baseType: !1044, size: 64, offset: 8384)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !674, file: !435, line: 192, baseType: !1048, size: 64, offset: 8448)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !674, file: !435, line: 193, baseType: !1121, size: 64, offset: 8512)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = !DISubroutineType(types: !1123)
!1123 = !{!319, !667, !882, !1124}
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1125)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !435, line: 660, size: 5312, elements: !1127)
!1127 = !{!1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1126, file: !435, line: 661, baseType: !438, size: 4480)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1126, file: !435, line: 661, baseType: !891, size: 32, offset: 4480)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1126, file: !435, line: 662, baseType: !493, size: 32, offset: 4512)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1126, file: !435, line: 662, baseType: !493, size: 32, offset: 4544)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1126, file: !435, line: 662, baseType: !493, size: 32, offset: 4576)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1126, file: !435, line: 663, baseType: !493, size: 32, offset: 4608)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1126, file: !435, line: 664, baseType: !493, size: 32, offset: 4640)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1126, file: !435, line: 665, baseType: !538, size: 64, offset: 4672)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1126, file: !435, line: 666, baseType: !538, size: 64, offset: 4736)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1126, file: !435, line: 667, baseType: !493, size: 32, offset: 4800)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1126, file: !435, line: 668, baseType: !930, size: 32, offset: 4832)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1126, file: !435, line: 670, baseType: !538, size: 64, offset: 4864)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1126, file: !435, line: 670, baseType: !538, size: 64, offset: 4928)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1126, file: !435, line: 671, baseType: !538, size: 64, offset: 4992)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1126, file: !435, line: 672, baseType: !538, size: 64, offset: 5056)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1126, file: !435, line: 673, baseType: !538, size: 64, offset: 5120)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1126, file: !435, line: 674, baseType: !493, size: 32, offset: 5184)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1126, file: !435, line: 675, baseType: !538, size: 64, offset: 5248)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !674, file: !435, line: 195, baseType: !1147, size: 64, offset: 8576)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{!319, !1124, !667, !667}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !674, file: !435, line: 196, baseType: !1147, size: 64, offset: 8640)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !674, file: !435, line: 197, baseType: !924, size: 64, offset: 8704)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !674, file: !435, line: 198, baseType: !1044, size: 64, offset: 8768)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !674, file: !435, line: 199, baseType: !1048, size: 64, offset: 8832)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !674, file: !435, line: 201, baseType: !1155, size: 64, offset: 8896)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{!319, !667, !493, !493}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !674, file: !435, line: 202, baseType: !826, size: 64, offset: 8960)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !674, file: !435, line: 203, baseType: !698, size: 64, offset: 9024)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !674, file: !435, line: 204, baseType: !879, size: 64, offset: 9088)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !674, file: !435, line: 205, baseType: !1008, size: 64, offset: 9152)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !674, file: !435, line: 206, baseType: !1163, size: 64, offset: 9216)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = !DISubroutineType(types: !1165)
!1165 = !{!319, !304, !667, !493, !740, !741}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !674, file: !435, line: 208, baseType: !1167, size: 64, offset: 9280)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{!319, !493, !836}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !674, file: !435, line: 209, baseType: !1048, size: 64, offset: 9344)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !674, file: !435, line: 210, baseType: !842, size: 64, offset: 9408)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !669, file: !435, line: 438, baseType: !1173, size: 64, offset: 13952)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !649, line: 60, baseType: !1174)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1176)
!1176 = !{!1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1175, file: !114, line: 241, baseType: !304, size: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1175, file: !114, line: 242, baseType: !510, size: 32, offset: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1175, file: !114, line: 243, baseType: !493, size: 32, offset: 96)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1175, file: !114, line: 243, baseType: !493, size: 32, offset: 128)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1175, file: !114, line: 244, baseType: !493, size: 32, offset: 160)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1175, file: !114, line: 244, baseType: !493, size: 32, offset: 192)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1175, file: !114, line: 245, baseType: !538, size: 64, offset: 256)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1175, file: !114, line: 246, baseType: !608, size: 32, offset: 320)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1175, file: !114, line: 247, baseType: !493, size: 32, offset: 352)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1175, file: !114, line: 251, baseType: !493, size: 32, offset: 384)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1175, file: !114, line: 252, baseType: !979, size: 64, offset: 448)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1175, file: !114, line: 253, baseType: !608, size: 32, offset: 512)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1175, file: !114, line: 254, baseType: !493, size: 32, offset: 544)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1175, file: !114, line: 254, baseType: !493, size: 32, offset: 576)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1175, file: !114, line: 255, baseType: !493, size: 32, offset: 608)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !669, file: !435, line: 438, baseType: !1173, size: 64, offset: 14016)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !669, file: !435, line: 439, baseType: !308, size: 64, offset: 14080)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !669, file: !435, line: 440, baseType: !1195, size: 32, offset: 14144)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !669, file: !435, line: 441, baseType: !608, size: 32, offset: 14176)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !669, file: !435, line: 442, baseType: !608, size: 32, offset: 14208)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !669, file: !435, line: 443, baseType: !1199, size: 448, offset: 14272)
!1199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1200, size: 448, elements: !1201)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !301)
!1201 = !{!1202}
!1202 = !DISubrange(count: 7)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !669, file: !435, line: 444, baseType: !608, size: 32, offset: 14720)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !669, file: !435, line: 445, baseType: !608, size: 32, offset: 14752)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !669, file: !435, line: 446, baseType: !493, size: 32, offset: 14784)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !669, file: !435, line: 447, baseType: !531, size: 64, offset: 14848)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !669, file: !435, line: 448, baseType: !531, size: 64, offset: 14912)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !669, file: !435, line: 449, baseType: !748, size: 640, offset: 14976)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !669, file: !435, line: 450, baseType: !684, size: 32, offset: 15616)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !669, file: !435, line: 451, baseType: !1211, size: 2880, offset: 15680)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !435, line: 318, baseType: !1212)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !435, line: 319, size: 2880, elements: !1213)
!1213 = !{!1214, !1215, !1216, !1217, !1218, !1219, !1220, !1233, !1234, !1239, !1244, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1259, !1260, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1292, !1293, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1316, !1317, !1318, !1322, !1323}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1212, file: !435, line: 320, baseType: !493, size: 32)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1212, file: !435, line: 321, baseType: !493, size: 32, offset: 32)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1212, file: !435, line: 322, baseType: !493, size: 32, offset: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1212, file: !435, line: 323, baseType: !493, size: 32, offset: 96)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1212, file: !435, line: 324, baseType: !493, size: 32, offset: 128)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1212, file: !435, line: 325, baseType: !493, size: 32, offset: 160)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1212, file: !435, line: 326, baseType: !1221, size: 64, offset: 192)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !435, line: 293, baseType: !1222)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !435, line: 295, size: 448, elements: !1224)
!1224 = !{!1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1223, file: !435, line: 296, baseType: !1221, size: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1223, file: !435, line: 297, baseType: !555, size: 64, offset: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1223, file: !435, line: 297, baseType: !555, size: 64, offset: 128)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1223, file: !435, line: 298, baseType: !538, size: 64, offset: 192)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1223, file: !435, line: 298, baseType: !538, size: 64, offset: 256)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1223, file: !435, line: 299, baseType: !493, size: 32, offset: 320)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1223, file: !435, line: 300, baseType: !493, size: 32, offset: 352)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1223, file: !435, line: 301, baseType: !493, size: 32, offset: 384)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1212, file: !435, line: 326, baseType: !1221, size: 64, offset: 256)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1212, file: !435, line: 328, baseType: !1235, size: 64, offset: 320)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!319, !667, !1238, !538}
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1212, file: !435, line: 329, baseType: !1240, size: 64, offset: 384)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{!319, !1238, !1243, !540, !540, !558, !538}
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1212, file: !435, line: 330, baseType: !1245, size: 64, offset: 448)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{!319, !1238}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1212, file: !435, line: 331, baseType: !1245, size: 64, offset: 512)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1212, file: !435, line: 334, baseType: !304, size: 64, offset: 576)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1212, file: !435, line: 335, baseType: !510, size: 32, offset: 640)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1212, file: !435, line: 335, baseType: !510, size: 32, offset: 672)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1212, file: !435, line: 336, baseType: !510, size: 32, offset: 704)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1212, file: !435, line: 336, baseType: !510, size: 32, offset: 736)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1212, file: !435, line: 337, baseType: !1255, size: 64, offset: 768)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !305, line: 339, baseType: !1257)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64)
!1258 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !305, line: 339, flags: DIFlagFwdDecl)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1212, file: !435, line: 338, baseType: !1255, size: 64, offset: 832)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1212, file: !435, line: 339, baseType: !1261, size: 64, offset: 896)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !305, line: 341, baseType: !1263)
!1263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !305, line: 351, size: 192, elements: !1264)
!1264 = !{!1265, !1266, !1267, !1268, !1269}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1263, file: !305, line: 354, baseType: !72, size: 32)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1263, file: !305, line: 355, baseType: !72, size: 32, offset: 32)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1263, file: !305, line: 356, baseType: !72, size: 32, offset: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1263, file: !305, line: 361, baseType: !72, size: 32, offset: 96)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1263, file: !305, line: 362, baseType: !604, size: 64, offset: 128)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1212, file: !435, line: 340, baseType: !493, size: 32, offset: 960)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1212, file: !435, line: 340, baseType: !493, size: 32, offset: 992)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1212, file: !435, line: 341, baseType: !555, size: 64, offset: 1024)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1212, file: !435, line: 342, baseType: !538, size: 64, offset: 1088)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1212, file: !435, line: 343, baseType: !558, size: 64, offset: 1152)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1212, file: !435, line: 344, baseType: !540, size: 64, offset: 1216)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1212, file: !435, line: 345, baseType: !493, size: 32, offset: 1280)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1212, file: !435, line: 346, baseType: !1243, size: 64, offset: 1344)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1212, file: !435, line: 347, baseType: !608, size: 32, offset: 1408)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1212, file: !435, line: 348, baseType: !493, size: 32, offset: 1440)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1212, file: !435, line: 351, baseType: !608, size: 32, offset: 1472)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1212, file: !435, line: 352, baseType: !608, size: 32, offset: 1504)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1212, file: !435, line: 353, baseType: !510, size: 32, offset: 1536)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1212, file: !435, line: 354, baseType: !510, size: 32, offset: 1568)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1212, file: !435, line: 355, baseType: !1243, size: 64, offset: 1600)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1212, file: !435, line: 356, baseType: !1243, size: 64, offset: 1664)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1212, file: !435, line: 357, baseType: !1287, size: 64, offset: 1728)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64)
!1288 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !435, line: 310, baseType: !1289)
!1289 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !435, line: 308, size: 32, elements: !1290)
!1290 = !{!1291}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1289, file: !435, line: 309, baseType: !493, size: 32)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1212, file: !435, line: 357, baseType: !1287, size: 64, offset: 1792)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1212, file: !435, line: 358, baseType: !1294, size: 64, offset: 1856)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64)
!1295 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !435, line: 316, baseType: !1296)
!1296 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !435, line: 312, size: 128, elements: !1297)
!1297 = !{!1298, !1299, !1300}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1296, file: !435, line: 313, baseType: !308, size: 64)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1296, file: !435, line: 314, baseType: !493, size: 32, offset: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1296, file: !435, line: 315, baseType: !303, size: 8, offset: 96)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1212, file: !435, line: 359, baseType: !1294, size: 64, offset: 1920)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1212, file: !435, line: 360, baseType: !1294, size: 64, offset: 1984)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1212, file: !435, line: 361, baseType: !493, size: 32, offset: 2048)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1212, file: !435, line: 362, baseType: !510, size: 32, offset: 2080)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1212, file: !435, line: 363, baseType: !493, size: 32, offset: 2112)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1212, file: !435, line: 364, baseType: !1243, size: 64, offset: 2176)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1212, file: !435, line: 365, baseType: !1261, size: 64, offset: 2240)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1212, file: !435, line: 366, baseType: !510, size: 32, offset: 2304)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1212, file: !435, line: 367, baseType: !510, size: 32, offset: 2336)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1212, file: !435, line: 368, baseType: !1255, size: 64, offset: 2368)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1212, file: !435, line: 369, baseType: !1255, size: 64, offset: 2432)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1212, file: !435, line: 370, baseType: !1313, size: 64, offset: 2496)
!1313 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1314)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64)
!1315 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1212, file: !435, line: 371, baseType: !1313, size: 64, offset: 2560)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1212, file: !435, line: 372, baseType: !1313, size: 64, offset: 2624)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1212, file: !435, line: 373, baseType: !1319, size: 64, offset: 2688)
!1319 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !305, line: 331, baseType: !1320)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64)
!1321 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !305, line: 331, flags: DIFlagFwdDecl)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1212, file: !435, line: 374, baseType: !604, size: 64, offset: 2752)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1212, file: !435, line: 375, baseType: !1324, size: 64, offset: 2816)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !669, file: !435, line: 451, baseType: !1211, size: 2880, offset: 18560)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !669, file: !435, line: 452, baseType: !1327, size: 64, offset: 21440)
!1327 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1328)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1329, size: 64)
!1329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatNullSpace", file: !435, line: 681, size: 4864, elements: !1330)
!1330 = !{!1331, !1332, !1333, !1334, !1335, !1336, !1337, !1341}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1329, file: !435, line: 682, baseType: !438, size: 4480)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1329, file: !435, line: 682, baseType: !891, size: 32, offset: 4480)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "has_cnst", scope: !1329, file: !435, line: 683, baseType: !608, size: 32, offset: 4512)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1329, file: !435, line: 684, baseType: !493, size: 32, offset: 4544)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "vecs", scope: !1329, file: !435, line: 685, baseType: !1041, size: 64, offset: 4608)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1329, file: !435, line: 686, baseType: !555, size: 64, offset: 4672)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "remove", scope: !1329, file: !435, line: 687, baseType: !1338, size: 64, offset: 4736)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64)
!1339 = !DISubroutineType(types: !1340)
!1340 = !{!319, !1327, !694, !308}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "rmctx", scope: !1329, file: !435, line: 688, baseType: !308, size: 64, offset: 4800)
