; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/cp/cp.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/cp/cp.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct._p_PC = type { %struct._p_PetscObject, [1 x %struct._PCOps], %struct._p_DM*, i32, i64, i64, i32, i32, i32, i32, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 (%struct._p_PC*, i32, %struct._p_IS**, %struct._p_IS**, %struct._p_Mat**, i8*)*, i8*, i8*, i32, i8*, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!260 = !DIEnumerator(name: "MATOP_DESTROYSUBMATRICES", value: 145, isUnsigned: true)
!261 = !DIEnumerator(name: "MATOP_TRANSPOSE_SOLVE", value: 146, isUnsigned: true)
!262 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 161, baseType: !5, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272}
!265 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 98, baseType: !72, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpctypes.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299, !300}
!297 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_RTOL", value: 2)
!298 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_ATOL", value: 3)
!299 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_ITS", value: 4)
!300 = !DIEnumerator(name: "PCRICHARDSON_DIVERGED_DTOL", value: -4)
!301 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 85, baseType: !72, size: 32, elements: !302)
!302 = !{!303, !304, !305, !306}
!303 = !DIEnumerator(name: "PC_SIDE_DEFAULT", value: -1)
!304 = !DIEnumerator(name: "PC_LEFT", value: 0)
!305 = !DIEnumerator(name: "PC_RIGHT", value: 1)
!306 = !DIEnumerator(name: "PC_SYMMETRIC", value: 2)
!307 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 395, baseType: !72, size: 32, elements: !308)
!308 = !{!309, !310, !311, !312, !313, !314, !315}
!309 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!310 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!311 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!312 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!313 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!314 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!315 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!316 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !317, line: 663, baseType: !5, size: 32, elements: !318)
!317 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!318 = !{!319, !320, !321}
!319 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!320 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!321 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!322 = !{!323, !326, !344, !425, !365, !531, !546, !415}
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !324, line: 46, baseType: !325)
!324 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!325 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !329, line: 73, size: 4480, elements: !330)
!329 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!330 = !{!331, !333, !386, !387, !389, !392, !393, !394, !395, !403, !404, !406, !410, !414, !416, !417, !418, !419, !420, !421, !422, !423, !424, !426, !428, !429, !430, !432, !433, !435, !437, !438, !439, !440, !441, !444, !446, !447, !448, !449, !450, !453, !455, !456, !457, !467, !469, !470, !474, !475, !521, !526, !528, !529, !530}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !328, file: !329, line: 74, baseType: !332, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !328, file: !329, line: 75, baseType: !334, size: 448, offset: 64)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 448, elements: !384)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !329, line: 53, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !329, line: 45, size: 448, elements: !337)
!337 = !{!338, !348, !356, !361, !368, !372, !379}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !336, file: !329, line: 46, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!342, !326, !343}
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !345, line: 330, baseType: !346)
!345 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !345, line: 330, flags: DIFlagFwdDecl)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !336, file: !329, line: 47, baseType: !349, size: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{!342, !326, !352}
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !353, line: 16, baseType: !354)
!353 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !353, line: 16, flags: DIFlagFwdDecl)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !336, file: !329, line: 48, baseType: !357, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!342, !360}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !336, file: !329, line: 49, baseType: !362, size: 64, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!342, !326, !365, !326}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !367)
!367 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !336, file: !329, line: 50, baseType: !369, size: 64, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!342, !326, !365, !360}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !336, file: !329, line: 51, baseType: !373, size: 64, offset: 320)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!342, !326, !365, !376}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{null}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !336, file: !329, line: 52, baseType: !380, size: 64, offset: 384)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!342, !326, !365, !383}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!384 = !{!385}
!385 = !DISubrange(count: 1)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !328, file: !329, line: 76, baseType: !344, size: 64, offset: 512)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !328, file: !329, line: 77, baseType: !388, size: 32, offset: 576)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !328, file: !329, line: 78, baseType: !390, size: 64, offset: 640)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !391)
!391 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !328, file: !329, line: 78, baseType: !390, size: 64, offset: 704)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !328, file: !329, line: 78, baseType: !390, size: 64, offset: 768)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !328, file: !329, line: 78, baseType: !390, size: 64, offset: 832)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !328, file: !329, line: 79, baseType: !396, size: 64, offset: 896)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !399, line: 27, baseType: !400)
!399 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !401, line: 43, baseType: !402)
!401 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!402 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !328, file: !329, line: 80, baseType: !388, size: 32, offset: 960)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !328, file: !329, line: 81, baseType: !405, size: 32, offset: 992)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !328, file: !329, line: 82, baseType: !407, size: 64, offset: 1024)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !328, file: !329, line: 83, baseType: !411, size: 64, offset: 1088)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !328, file: !329, line: 84, baseType: !415, size: 64, offset: 1152)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !328, file: !329, line: 85, baseType: !415, size: 64, offset: 1216)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !328, file: !329, line: 86, baseType: !415, size: 64, offset: 1280)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !328, file: !329, line: 87, baseType: !415, size: 64, offset: 1344)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !328, file: !329, line: 88, baseType: !326, size: 64, offset: 1408)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !328, file: !329, line: 89, baseType: !396, size: 64, offset: 1472)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !328, file: !329, line: 90, baseType: !415, size: 64, offset: 1536)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !328, file: !329, line: 91, baseType: !415, size: 64, offset: 1600)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !328, file: !329, line: 92, baseType: !388, size: 32, offset: 1664)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !328, file: !329, line: 93, baseType: !425, size: 64, offset: 1728)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !328, file: !329, line: 94, baseType: !427, size: 64, offset: 1792)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !397)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !328, file: !329, line: 95, baseType: !388, size: 32, offset: 1856)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !328, file: !329, line: 95, baseType: !388, size: 32, offset: 1888)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !328, file: !329, line: 96, baseType: !431, size: 64, offset: 1920)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !328, file: !329, line: 96, baseType: !431, size: 64, offset: 1984)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !328, file: !329, line: 97, baseType: !434, size: 64, offset: 2048)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !328, file: !329, line: 97, baseType: !436, size: 64, offset: 2112)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !328, file: !329, line: 98, baseType: !388, size: 32, offset: 2176)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !328, file: !329, line: 98, baseType: !388, size: 32, offset: 2208)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !328, file: !329, line: 99, baseType: !431, size: 64, offset: 2240)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !328, file: !329, line: 99, baseType: !431, size: 64, offset: 2304)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !328, file: !329, line: 100, baseType: !442, size: 64, offset: 2368)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !391)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !328, file: !329, line: 100, baseType: !445, size: 64, offset: 2432)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !328, file: !329, line: 101, baseType: !388, size: 32, offset: 2496)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !328, file: !329, line: 101, baseType: !388, size: 32, offset: 2528)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !328, file: !329, line: 102, baseType: !431, size: 64, offset: 2560)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !328, file: !329, line: 102, baseType: !431, size: 64, offset: 2624)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !328, file: !329, line: 103, baseType: !451, size: 64, offset: 2688)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !443)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !328, file: !329, line: 103, baseType: !454, size: 64, offset: 2752)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !328, file: !329, line: 104, baseType: !383, size: 64, offset: 2816)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !328, file: !329, line: 105, baseType: !388, size: 32, offset: 2880)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !328, file: !329, line: 106, baseType: !458, size: 128, offset: 2944)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 128, elements: !465)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !329, line: 64, baseType: !461)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !329, line: 61, size: 128, elements: !462)
!462 = !{!463, !464}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !461, file: !329, line: 62, baseType: !376, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !461, file: !329, line: 63, baseType: !425, size: 64, offset: 64)
!465 = !{!466}
!466 = !DISubrange(count: 2)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !328, file: !329, line: 107, baseType: !468, size: 64, offset: 3072)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 64, elements: !465)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !328, file: !329, line: 108, baseType: !425, size: 64, offset: 3136)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !328, file: !329, line: 109, baseType: !471, size: 64, offset: 3200)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!342, !425}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !328, file: !329, line: 111, baseType: !388, size: 32, offset: 3264)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !328, file: !329, line: 112, baseType: !476, size: 320, offset: 3328)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 320, elements: !519)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!342, !480, !326, !425}
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !483)
!483 = !{!484, !485, !507, !508, !509, !510, !511, !512, !513, !514, !515}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !482, file: !10, line: 100, baseType: !388, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !482, file: !10, line: 101, baseType: !486, size: 64, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !489)
!489 = !{!490, !491, !492, !493, !494, !497, !498, !499, !500, !502, !504, !505, !506}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !488, file: !10, line: 84, baseType: !415, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !488, file: !10, line: 85, baseType: !415, size: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !488, file: !10, line: 86, baseType: !425, size: 64, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !488, file: !10, line: 87, baseType: !407, size: 64, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !488, file: !10, line: 88, baseType: !495, size: 64, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !365)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !488, file: !10, line: 89, baseType: !367, size: 8, offset: 320)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !488, file: !10, line: 90, baseType: !415, size: 64, offset: 384)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !488, file: !10, line: 91, baseType: !323, size: 64, offset: 448)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !488, file: !10, line: 92, baseType: !501, size: 32, offset: 512)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !488, file: !10, line: 93, baseType: !503, size: 32, offset: 544)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !488, file: !10, line: 94, baseType: !486, size: 64, offset: 576)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !488, file: !10, line: 95, baseType: !415, size: 64, offset: 640)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !488, file: !10, line: 96, baseType: !425, size: 64, offset: 704)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !482, file: !10, line: 102, baseType: !415, size: 64, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !482, file: !10, line: 102, baseType: !415, size: 64, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !482, file: !10, line: 103, baseType: !415, size: 64, offset: 256)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !482, file: !10, line: 104, baseType: !344, size: 64, offset: 320)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !482, file: !10, line: 105, baseType: !501, size: 32, offset: 384)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !482, file: !10, line: 105, baseType: !501, size: 32, offset: 416)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !482, file: !10, line: 105, baseType: !501, size: 32, offset: 448)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !482, file: !10, line: 106, baseType: !326, size: 64, offset: 512)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !482, file: !10, line: 107, baseType: !516, size: 64, offset: 576)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !517)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!519 = !{!520}
!520 = !DISubrange(count: 5)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !328, file: !329, line: 113, baseType: !522, size: 320, offset: 3648)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !523, size: 320, elements: !519)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!342, !326, !425}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !328, file: !329, line: 114, baseType: !527, size: 320, offset: 3968)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 320, elements: !519)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !328, file: !329, line: 115, baseType: !501, size: 32, offset: 4288)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !328, file: !329, line: 120, baseType: !516, size: 64, offset: 4352)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !328, file: !329, line: 121, baseType: !501, size: 32, offset: 4416)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_CP", file: !533, line: 14, baseType: !534)
!533 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/cp/cp.c", directory: "/home/users/ndemeye/xSDK")
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !533, line: 8, size: 384, elements: !535)
!535 = !{!536, !537, !538, !542, !543, !544, !545}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !534, file: !533, line: 9, baseType: !388, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !534, file: !533, line: 9, baseType: !388, size: 32, offset: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !534, file: !533, line: 10, baseType: !539, size: 64, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !540)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !534, file: !533, line: 11, baseType: !451, size: 64, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !534, file: !533, line: 12, baseType: !451, size: 64, offset: 192)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !534, file: !533, line: 13, baseType: !434, size: 64, offset: 256)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !534, file: !533, line: 13, baseType: !434, size: 64, offset: 320)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_SeqAIJ", file: !548, line: 125, baseType: !549)
!548 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/aij/seq/aij.h", directory: "/home/users/ndemeye/xSDK")
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !548, line: 114, size: 2816, elements: !550)
!550 = !{!551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !575, !576, !577, !578, !579, !580, !581, !585, !586, !591, !592, !593, !594, !1358, !1399, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "roworiented", scope: !549, file: !548, line: 115, baseType: !501, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "nonew", scope: !549, file: !548, line: 115, baseType: !388, size: 32, offset: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "nounused", scope: !549, file: !548, line: 115, baseType: !388, size: 32, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "singlemalloc", scope: !549, file: !548, line: 115, baseType: !501, size: 32, offset: 96)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "maxnz", scope: !549, file: !548, line: 115, baseType: !388, size: 32, offset: 128)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "imax", scope: !549, file: !548, line: 115, baseType: !434, size: 64, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ilen", scope: !549, file: !548, line: 115, baseType: !434, size: 64, offset: 256)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "ipre", scope: !549, file: !548, line: 115, baseType: !434, size: 64, offset: 320)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "free_imax_ilen", scope: !549, file: !548, line: 115, baseType: !501, size: 32, offset: 384)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !549, file: !548, line: 115, baseType: !388, size: 32, offset: 416)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "rmax", scope: !549, file: !548, line: 115, baseType: !388, size: 32, offset: 448)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "keepnonzeropattern", scope: !549, file: !548, line: 115, baseType: !501, size: 32, offset: 480)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ignorezeroentries", scope: !549, file: !548, line: 115, baseType: !501, size: 32, offset: 512)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "free_ij", scope: !549, file: !548, line: 115, baseType: !501, size: 32, offset: 544)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "free_a", scope: !549, file: !548, line: 115, baseType: !501, size: 32, offset: 576)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "compressedrow", scope: !549, file: !548, line: 115, baseType: !567, size: 192, offset: 640)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_CompressedRow", file: !568, line: 407, baseType: !569)
!568 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !568, line: 402, size: 192, elements: !570)
!570 = !{!571, !572, !573, !574}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !569, file: !568, line: 403, baseType: !501, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !569, file: !568, line: 404, baseType: !388, size: 32, offset: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !569, file: !568, line: 405, baseType: !434, size: 64, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "rindex", scope: !569, file: !568, line: 406, baseType: !434, size: 64, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "nz", scope: !549, file: !548, line: 115, baseType: !388, size: 32, offset: 832)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !549, file: !548, line: 115, baseType: !434, size: 64, offset: 896)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !549, file: !548, line: 115, baseType: !434, size: 64, offset: 960)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "diag", scope: !549, file: !548, line: 115, baseType: !434, size: 64, offset: 1024)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerorowcnt", scope: !549, file: !548, line: 115, baseType: !388, size: 32, offset: 1088)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "free_diag", scope: !549, file: !548, line: 115, baseType: !501, size: 32, offset: 1120)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !549, file: !548, line: 115, baseType: !582, size: 64, offset: 1152)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatScalar", file: !584, line: 799, baseType: !452)
!584 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscmath.h", directory: "/home/users/ndemeye/xSDK")
!585 = !DIDerivedType(tag: DW_TAG_member, name: "solve_work", scope: !549, file: !548, line: 115, baseType: !451, size: 64, offset: 1216)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !549, file: !548, line: 115, baseType: !587, size: 64, offset: 1280)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !588, line: 11, baseType: !589)
!588 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !588, line: 11, flags: DIFlagFwdDecl)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !549, file: !548, line: 115, baseType: !587, size: 64, offset: 1344)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "icol", scope: !549, file: !548, line: 115, baseType: !587, size: 64, offset: 1408)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !549, file: !548, line: 115, baseType: !501, size: 32, offset: 1472)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !549, file: !548, line: 115, baseType: !595, size: 64, offset: 1536)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !596)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !568, line: 436, size: 23424, elements: !598)
!598 = !{!599, !601, !1101, !1121, !1122, !1123, !1125, !1126, !1127, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1254, !1255, !1271, !1272, !1273, !1274, !1275, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1310, !1330, !1331, !1333, !1334, !1335, !1336, !1337, !1338, !1356, !1357}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !597, file: !568, line: 437, baseType: !600, size: 4480)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !329, line: 122, baseType: !328)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !597, file: !568, line: 437, baseType: !602, size: 9472, offset: 4480)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !603, size: 9472, elements: !384)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !568, line: 32, size: 9472, elements: !604)
!604 = !{!605, !614, !618, !619, !623, !627, !628, !629, !630, !631, !632, !633, !653, !657, !662, !668, !687, !692, !696, !697, !702, !707, !708, !713, !717, !721, !725, !729, !733, !734, !735, !736, !737, !741, !742, !747, !748, !749, !750, !751, !756, !763, !768, !772, !776, !780, !784, !785, !789, !790, !797, !802, !803, !804, !805, !867, !875, !876, !880, !881, !885, !886, !890, !895, !896, !900, !904, !911, !912, !913, !914, !915, !916, !921, !922, !926, !930, !934, !935, !936, !940, !950, !951, !955, !956, !960, !961, !965, !966, !971, !972, !976, !980, !981, !982, !983, !984, !985, !986, !990, !991, !992, !993, !994, !995, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1010, !1014, !1015, !1016, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1030, !1031, !1032, !1037, !1041, !1042, !1046, !1047, !1048, !1049, !1075, !1079, !1080, !1081, !1082, !1083, !1087, !1088, !1089, !1090, !1091, !1095, !1099, !1100}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !603, file: !568, line: 34, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{!342, !595, !388, !609, !388, !609, !611, !613}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !388)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !452)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !603, file: !568, line: 35, baseType: !615, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!342, !595, !388, !434, !436, !454}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !603, file: !568, line: 36, baseType: !615, size: 64, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !603, file: !568, line: 37, baseType: !620, size: 64, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!342, !595, !539, !539}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !603, file: !568, line: 38, baseType: !624, size: 64, offset: 256)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{!342, !595, !539, !539, !539}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !603, file: !568, line: 40, baseType: !620, size: 64, offset: 320)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !603, file: !568, line: 41, baseType: !624, size: 64, offset: 384)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !603, file: !568, line: 42, baseType: !620, size: 64, offset: 448)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !603, file: !568, line: 43, baseType: !624, size: 64, offset: 512)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !603, file: !568, line: 44, baseType: !620, size: 64, offset: 576)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !603, file: !568, line: 46, baseType: !624, size: 64, offset: 640)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !603, file: !568, line: 47, baseType: !634, size: 64, offset: 704)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!342, !595, !587, !587, !637}
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !641)
!641 = !{!642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !640, file: !36, line: 1227, baseType: !443, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !640, file: !36, line: 1228, baseType: !443, size: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !640, file: !36, line: 1229, baseType: !443, size: 64, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !640, file: !36, line: 1230, baseType: !443, size: 64, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !640, file: !36, line: 1231, baseType: !443, size: 64, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !640, file: !36, line: 1232, baseType: !443, size: 64, offset: 320)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !640, file: !36, line: 1233, baseType: !443, size: 64, offset: 384)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !640, file: !36, line: 1234, baseType: !443, size: 64, offset: 448)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !640, file: !36, line: 1236, baseType: !443, size: 64, offset: 512)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !640, file: !36, line: 1237, baseType: !443, size: 64, offset: 576)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !640, file: !36, line: 1238, baseType: !443, size: 64, offset: 640)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !603, file: !568, line: 48, baseType: !654, size: 64, offset: 768)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!342, !595, !587, !637}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !603, file: !568, line: 49, baseType: !658, size: 64, offset: 832)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!342, !595, !539, !443, !661, !443, !388, !388, !539}
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !603, file: !568, line: 50, baseType: !663, size: 64, offset: 896)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!342, !595, !666, !667}
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !603, file: !568, line: 52, baseType: !669, size: 64, offset: 960)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{!342, !595, !672, !673}
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !676)
!676 = !{!677, !678, !679, !680, !681, !682, !683, !684, !685, !686}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !675, file: !36, line: 593, baseType: !390, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !675, file: !36, line: 594, baseType: !390, size: 64, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !675, file: !36, line: 594, baseType: !390, size: 64, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !675, file: !36, line: 594, baseType: !390, size: 64, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !675, file: !36, line: 595, baseType: !390, size: 64, offset: 256)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !675, file: !36, line: 596, baseType: !390, size: 64, offset: 320)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !675, file: !36, line: 597, baseType: !390, size: 64, offset: 384)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !675, file: !36, line: 598, baseType: !390, size: 64, offset: 448)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !675, file: !36, line: 598, baseType: !390, size: 64, offset: 512)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !675, file: !36, line: 599, baseType: !390, size: 64, offset: 576)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !603, file: !568, line: 53, baseType: !688, size: 64, offset: 1024)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!342, !595, !595, !691}
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !603, file: !568, line: 54, baseType: !693, size: 64, offset: 1088)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{!342, !595, !539}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !603, file: !568, line: 55, baseType: !620, size: 64, offset: 1152)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !603, file: !568, line: 56, baseType: !698, size: 64, offset: 1216)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!342, !595, !701, !442}
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !603, file: !568, line: 58, baseType: !703, size: 64, offset: 1280)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{!342, !595, !706}
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !603, file: !568, line: 59, baseType: !703, size: 64, offset: 1344)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !603, file: !568, line: 60, baseType: !709, size: 64, offset: 1408)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!342, !595, !712, !501}
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !603, file: !568, line: 61, baseType: !714, size: 64, offset: 1472)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!342, !595}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !603, file: !568, line: 63, baseType: !718, size: 64, offset: 1536)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!342, !595, !388, !609, !452, !539, !539}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !603, file: !568, line: 64, baseType: !722, size: 64, offset: 1600)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!342, !595, !595, !587, !587, !637}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !603, file: !568, line: 65, baseType: !726, size: 64, offset: 1664)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!342, !595, !595, !637}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !603, file: !568, line: 66, baseType: !730, size: 64, offset: 1728)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!342, !595, !595, !587, !637}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !603, file: !568, line: 67, baseType: !726, size: 64, offset: 1792)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !603, file: !568, line: 69, baseType: !714, size: 64, offset: 1856)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !603, file: !568, line: 70, baseType: !722, size: 64, offset: 1920)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !603, file: !568, line: 71, baseType: !730, size: 64, offset: 1984)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !603, file: !568, line: 72, baseType: !738, size: 64, offset: 2048)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!342, !595, !667}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !603, file: !568, line: 73, baseType: !714, size: 64, offset: 2112)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !603, file: !568, line: 75, baseType: !743, size: 64, offset: 2176)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!342, !595, !746, !667}
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !603, file: !568, line: 76, baseType: !620, size: 64, offset: 2240)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !603, file: !568, line: 77, baseType: !620, size: 64, offset: 2304)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !603, file: !568, line: 78, baseType: !634, size: 64, offset: 2368)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !603, file: !568, line: 79, baseType: !654, size: 64, offset: 2432)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !603, file: !568, line: 81, baseType: !752, size: 64, offset: 2496)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{!342, !595, !452, !595, !755}
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !603, file: !568, line: 82, baseType: !757, size: 64, offset: 2560)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{!342, !595, !388, !760, !760, !666, !762}
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !587)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !603, file: !568, line: 83, baseType: !764, size: 64, offset: 2624)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{!342, !595, !388, !767, !388}
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !603, file: !568, line: 84, baseType: !769, size: 64, offset: 2688)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{!342, !595, !388, !609, !388, !609, !451}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !603, file: !568, line: 85, baseType: !773, size: 64, offset: 2752)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{!342, !595, !595, !755}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !603, file: !568, line: 87, baseType: !777, size: 64, offset: 2816)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!342, !595, !539, !434}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !603, file: !568, line: 88, baseType: !781, size: 64, offset: 2880)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DISubroutineType(types: !783)
!783 = !{!342, !595, !452}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !603, file: !568, line: 89, baseType: !781, size: 64, offset: 2944)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !603, file: !568, line: 90, baseType: !786, size: 64, offset: 3008)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!342, !595, !539, !613}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !603, file: !568, line: 91, baseType: !718, size: 64, offset: 3072)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !603, file: !568, line: 93, baseType: !791, size: 64, offset: 3136)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!342, !595, !794}
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !795)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !603, file: !568, line: 94, baseType: !798, size: 64, offset: 3200)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{!342, !595, !388, !501, !501, !434, !801, !801, !691}
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !603, file: !568, line: 95, baseType: !798, size: 64, offset: 3264)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !603, file: !568, line: 96, baseType: !798, size: 64, offset: 3328)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !603, file: !568, line: 97, baseType: !798, size: 64, offset: 3392)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !603, file: !568, line: 99, baseType: !806, size: 64, offset: 3456)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{!342, !595, !809, !812}
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !588, line: 51, baseType: !810)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !588, line: 51, flags: DIFlagFwdDecl)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !813)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !568, line: 609, size: 6208, elements: !815)
!815 = !{!816, !817, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !836, !843, !844, !845, !846, !847, !848, !849, !850, !854, !855, !856, !857, !858, !860, !861, !862, !863, !864, !865, !866}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !814, file: !568, line: 610, baseType: !600, size: 4480)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !814, file: !568, line: 610, baseType: !818, size: 32, offset: 4480)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !384)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !814, file: !568, line: 611, baseType: !388, size: 32, offset: 4512)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !814, file: !568, line: 611, baseType: !388, size: 32, offset: 4544)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !814, file: !568, line: 611, baseType: !388, size: 32, offset: 4576)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !814, file: !568, line: 612, baseType: !388, size: 32, offset: 4608)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !814, file: !568, line: 613, baseType: !388, size: 32, offset: 4640)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !814, file: !568, line: 614, baseType: !434, size: 64, offset: 4672)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !814, file: !568, line: 615, baseType: !436, size: 64, offset: 4736)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !814, file: !568, line: 616, baseType: !767, size: 64, offset: 4800)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !814, file: !568, line: 617, baseType: !434, size: 64, offset: 4864)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !814, file: !568, line: 618, baseType: !829, size: 64, offset: 4928)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !568, line: 602, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !568, line: 598, size: 128, elements: !832)
!832 = !{!833, !834, !835}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !831, file: !568, line: 599, baseType: !388, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !831, file: !568, line: 600, baseType: !388, size: 32, offset: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !831, file: !568, line: 601, baseType: !451, size: 64, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !814, file: !568, line: 619, baseType: !837, size: 64, offset: 4992)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !568, line: 607, baseType: !839)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !568, line: 604, size: 128, elements: !840)
!840 = !{!841, !842}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !839, file: !568, line: 605, baseType: !388, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !839, file: !568, line: 606, baseType: !451, size: 64, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !814, file: !568, line: 620, baseType: !451, size: 64, offset: 5056)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !814, file: !568, line: 621, baseType: !443, size: 64, offset: 5120)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !814, file: !568, line: 622, baseType: !443, size: 64, offset: 5184)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !814, file: !568, line: 623, baseType: !539, size: 64, offset: 5248)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !814, file: !568, line: 623, baseType: !539, size: 64, offset: 5312)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !814, file: !568, line: 623, baseType: !539, size: 64, offset: 5376)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !814, file: !568, line: 624, baseType: !501, size: 32, offset: 5440)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !814, file: !568, line: 625, baseType: !851, size: 64, offset: 5504)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{!342}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !814, file: !568, line: 626, baseType: !425, size: 64, offset: 5568)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !814, file: !568, line: 627, baseType: !539, size: 64, offset: 5632)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !814, file: !568, line: 628, baseType: !388, size: 32, offset: 5696)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !814, file: !568, line: 629, baseType: !365, size: 64, offset: 5760)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !814, file: !568, line: 630, baseType: !859, size: 32, offset: 5824)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !814, file: !568, line: 631, baseType: !388, size: 32, offset: 5856)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !814, file: !568, line: 631, baseType: !388, size: 32, offset: 5888)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !814, file: !568, line: 632, baseType: !501, size: 32, offset: 5920)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !814, file: !568, line: 633, baseType: !501, size: 32, offset: 5952)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !814, file: !568, line: 634, baseType: !376, size: 64, offset: 6016)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !814, file: !568, line: 634, baseType: !425, size: 64, offset: 6080)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !814, file: !568, line: 635, baseType: !396, size: 64, offset: 6144)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !603, file: !568, line: 100, baseType: !868, size: 64, offset: 3520)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!342, !595, !388, !388, !871, !874}
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !873)
!873 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !603, file: !568, line: 101, baseType: !714, size: 64, offset: 3584)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !603, file: !568, line: 102, baseType: !877, size: 64, offset: 3648)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DISubroutineType(types: !879)
!879 = !{!342, !595, !587, !587, !667}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !603, file: !568, line: 103, baseType: !606, size: 64, offset: 3712)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !603, file: !568, line: 105, baseType: !882, size: 64, offset: 3776)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DISubroutineType(types: !884)
!884 = !{!342, !595, !587, !587, !666, !667}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !603, file: !568, line: 106, baseType: !714, size: 64, offset: 3840)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !603, file: !568, line: 107, baseType: !887, size: 64, offset: 3904)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{!342, !595, !352}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !603, file: !568, line: 108, baseType: !891, size: 64, offset: 3968)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!342, !595, !894, !666, !667}
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !365)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !603, file: !568, line: 109, baseType: !851, size: 64, offset: 4032)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !603, file: !568, line: 111, baseType: !897, size: 64, offset: 4096)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DISubroutineType(types: !899)
!899 = !{!342, !595, !595, !595, !443, !595}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !603, file: !568, line: 112, baseType: !901, size: 64, offset: 4160)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{!342, !595, !595, !595, !595}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !603, file: !568, line: 113, baseType: !905, size: 64, offset: 4224)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{!342, !595, !908, !908}
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !588, line: 30, baseType: !909)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !588, line: 30, flags: DIFlagFwdDecl)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !603, file: !568, line: 114, baseType: !606, size: 64, offset: 4288)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !603, file: !568, line: 115, baseType: !718, size: 64, offset: 4352)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !603, file: !568, line: 117, baseType: !777, size: 64, offset: 4416)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !603, file: !568, line: 118, baseType: !777, size: 64, offset: 4480)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !603, file: !568, line: 119, baseType: !891, size: 64, offset: 4544)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !603, file: !568, line: 120, baseType: !917, size: 64, offset: 4608)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{!342, !595, !920, !691}
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !603, file: !568, line: 121, baseType: !851, size: 64, offset: 4672)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !603, file: !568, line: 123, baseType: !923, size: 64, offset: 4736)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{!342, !595, !388, !425}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !603, file: !568, line: 124, baseType: !927, size: 64, offset: 4800)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{!342, !595, !812, !539, !425}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !603, file: !568, line: 125, baseType: !931, size: 64, offset: 4864)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{!342, !480, !595}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !603, file: !568, line: 126, baseType: !620, size: 64, offset: 4928)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !603, file: !568, line: 127, baseType: !620, size: 64, offset: 4992)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !603, file: !568, line: 129, baseType: !937, size: 64, offset: 5056)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DISubroutineType(types: !939)
!939 = !{!342, !595, !767}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !603, file: !568, line: 130, baseType: !941, size: 64, offset: 5120)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{!342, !595, !944, !944}
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !945)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !947)
!947 = !{!948, !949}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !946, file: !60, line: 653, baseType: !388, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !946, file: !60, line: 653, baseType: !539, size: 64, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !603, file: !568, line: 131, baseType: !941, size: 64, offset: 5184)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !603, file: !568, line: 132, baseType: !952, size: 64, offset: 5248)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DISubroutineType(types: !954)
!954 = !{!342, !595, !434, !434, !434}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !603, file: !568, line: 133, baseType: !887, size: 64, offset: 5312)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !603, file: !568, line: 135, baseType: !957, size: 64, offset: 5376)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!342, !595, !443, !691}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !603, file: !568, line: 136, baseType: !957, size: 64, offset: 5440)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !603, file: !568, line: 137, baseType: !962, size: 64, offset: 5504)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!342, !595, !691}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !603, file: !568, line: 138, baseType: !606, size: 64, offset: 5568)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !603, file: !568, line: 139, baseType: !967, size: 64, offset: 5632)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!342, !595, !970, !970}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !603, file: !568, line: 141, baseType: !851, size: 64, offset: 5696)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !603, file: !568, line: 142, baseType: !973, size: 64, offset: 5760)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!342, !595, !595, !443, !595}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !603, file: !568, line: 143, baseType: !977, size: 64, offset: 5824)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!342, !595, !595, !595}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !603, file: !568, line: 144, baseType: !851, size: 64, offset: 5888)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !603, file: !568, line: 145, baseType: !973, size: 64, offset: 5952)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !603, file: !568, line: 147, baseType: !977, size: 64, offset: 6016)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !603, file: !568, line: 148, baseType: !851, size: 64, offset: 6080)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !603, file: !568, line: 149, baseType: !973, size: 64, offset: 6144)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !603, file: !568, line: 150, baseType: !977, size: 64, offset: 6208)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !603, file: !568, line: 151, baseType: !987, size: 64, offset: 6272)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!342, !595, !501}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !603, file: !568, line: 153, baseType: !714, size: 64, offset: 6336)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !603, file: !568, line: 154, baseType: !714, size: 64, offset: 6400)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !603, file: !568, line: 155, baseType: !714, size: 64, offset: 6464)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !603, file: !568, line: 156, baseType: !714, size: 64, offset: 6528)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !603, file: !568, line: 157, baseType: !887, size: 64, offset: 6592)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !603, file: !568, line: 159, baseType: !996, size: 64, offset: 6656)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!342, !595, !388, !611}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !603, file: !568, line: 160, baseType: !714, size: 64, offset: 6720)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !603, file: !568, line: 161, baseType: !714, size: 64, offset: 6784)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !603, file: !568, line: 162, baseType: !714, size: 64, offset: 6848)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !603, file: !568, line: 163, baseType: !714, size: 64, offset: 6912)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !603, file: !568, line: 165, baseType: !977, size: 64, offset: 6976)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !603, file: !568, line: 166, baseType: !977, size: 64, offset: 7040)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !603, file: !568, line: 167, baseType: !777, size: 64, offset: 7104)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !603, file: !568, line: 168, baseType: !1007, size: 64, offset: 7168)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!342, !595, !539, !388}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !603, file: !568, line: 169, baseType: !1011, size: 64, offset: 7232)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!342, !595, !691, !434}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !603, file: !568, line: 171, baseType: !738, size: 64, offset: 7296)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !603, file: !568, line: 172, baseType: !714, size: 64, offset: 7360)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !603, file: !568, line: 173, baseType: !1017, size: 64, offset: 7424)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!342, !595, !434, !801}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !603, file: !568, line: 174, baseType: !877, size: 64, offset: 7488)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !603, file: !568, line: 175, baseType: !877, size: 64, offset: 7552)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !603, file: !568, line: 177, baseType: !620, size: 64, offset: 7616)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !603, file: !568, line: 178, baseType: !663, size: 64, offset: 7680)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !603, file: !568, line: 179, baseType: !620, size: 64, offset: 7744)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !603, file: !568, line: 180, baseType: !624, size: 64, offset: 7808)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !603, file: !568, line: 181, baseType: !1027, size: 64, offset: 7872)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!342, !595, !344, !666, !667}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !603, file: !568, line: 183, baseType: !937, size: 64, offset: 7936)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !603, file: !568, line: 184, baseType: !698, size: 64, offset: 8000)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !603, file: !568, line: 185, baseType: !1033, size: 64, offset: 8064)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!342, !595, !1036}
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !603, file: !568, line: 186, baseType: !1038, size: 64, offset: 8128)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!342, !595, !388, !609, !451}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !603, file: !568, line: 187, baseType: !757, size: 64, offset: 8192)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !603, file: !568, line: 189, baseType: !1043, size: 64, offset: 8256)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!342, !595, !388, !388, !434, !611}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !603, file: !568, line: 190, baseType: !851, size: 64, offset: 8320)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !603, file: !568, line: 191, baseType: !973, size: 64, offset: 8384)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !603, file: !568, line: 192, baseType: !977, size: 64, offset: 8448)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !603, file: !568, line: 193, baseType: !1050, size: 64, offset: 8512)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!342, !595, !809, !1053}
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1054)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !568, line: 660, size: 5312, elements: !1056)
!1056 = !{!1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1055, file: !568, line: 661, baseType: !600, size: 4480)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1055, file: !568, line: 661, baseType: !818, size: 32, offset: 4480)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1055, file: !568, line: 662, baseType: !388, size: 32, offset: 4512)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1055, file: !568, line: 662, baseType: !388, size: 32, offset: 4544)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1055, file: !568, line: 662, baseType: !388, size: 32, offset: 4576)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1055, file: !568, line: 663, baseType: !388, size: 32, offset: 4608)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1055, file: !568, line: 664, baseType: !388, size: 32, offset: 4640)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1055, file: !568, line: 665, baseType: !434, size: 64, offset: 4672)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1055, file: !568, line: 666, baseType: !434, size: 64, offset: 4736)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1055, file: !568, line: 667, baseType: !388, size: 32, offset: 4800)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1055, file: !568, line: 668, baseType: !859, size: 32, offset: 4832)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1055, file: !568, line: 670, baseType: !434, size: 64, offset: 4864)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1055, file: !568, line: 670, baseType: !434, size: 64, offset: 4928)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1055, file: !568, line: 671, baseType: !434, size: 64, offset: 4992)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1055, file: !568, line: 672, baseType: !434, size: 64, offset: 5056)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1055, file: !568, line: 673, baseType: !434, size: 64, offset: 5120)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1055, file: !568, line: 674, baseType: !388, size: 32, offset: 5184)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1055, file: !568, line: 675, baseType: !434, size: 64, offset: 5248)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !603, file: !568, line: 195, baseType: !1076, size: 64, offset: 8576)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!342, !1053, !595, !595}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !603, file: !568, line: 196, baseType: !1076, size: 64, offset: 8640)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !603, file: !568, line: 197, baseType: !851, size: 64, offset: 8704)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !603, file: !568, line: 198, baseType: !973, size: 64, offset: 8768)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !603, file: !568, line: 199, baseType: !977, size: 64, offset: 8832)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !603, file: !568, line: 201, baseType: !1084, size: 64, offset: 8896)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!342, !595, !388, !388}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !603, file: !568, line: 202, baseType: !752, size: 64, offset: 8960)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !603, file: !568, line: 203, baseType: !624, size: 64, offset: 9024)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !603, file: !568, line: 204, baseType: !806, size: 64, offset: 9088)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !603, file: !568, line: 205, baseType: !937, size: 64, offset: 9152)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !603, file: !568, line: 206, baseType: !1092, size: 64, offset: 9216)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!342, !344, !595, !388, !666, !667}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !603, file: !568, line: 208, baseType: !1096, size: 64, offset: 9280)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!342, !388, !762}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !603, file: !568, line: 209, baseType: !977, size: 64, offset: 9344)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !603, file: !568, line: 210, baseType: !769, size: 64, offset: 9408)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !597, file: !568, line: 438, baseType: !1102, size: 64, offset: 13952)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !588, line: 60, baseType: !1103)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1105)
!1105 = !{!1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1104, file: !114, line: 241, baseType: !344, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1104, file: !114, line: 242, baseType: !405, size: 32, offset: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1104, file: !114, line: 243, baseType: !388, size: 32, offset: 96)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1104, file: !114, line: 243, baseType: !388, size: 32, offset: 128)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1104, file: !114, line: 244, baseType: !388, size: 32, offset: 160)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1104, file: !114, line: 244, baseType: !388, size: 32, offset: 192)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1104, file: !114, line: 245, baseType: !434, size: 64, offset: 256)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1104, file: !114, line: 246, baseType: !501, size: 32, offset: 320)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1104, file: !114, line: 247, baseType: !388, size: 32, offset: 352)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1104, file: !114, line: 251, baseType: !388, size: 32, offset: 384)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1104, file: !114, line: 252, baseType: !908, size: 64, offset: 448)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1104, file: !114, line: 253, baseType: !501, size: 32, offset: 512)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1104, file: !114, line: 254, baseType: !388, size: 32, offset: 544)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1104, file: !114, line: 254, baseType: !388, size: 32, offset: 576)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1104, file: !114, line: 255, baseType: !388, size: 32, offset: 608)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !597, file: !568, line: 438, baseType: !1102, size: 64, offset: 14016)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !597, file: !568, line: 439, baseType: !425, size: 64, offset: 14080)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !597, file: !568, line: 440, baseType: !1124, size: 32, offset: 14144)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !597, file: !568, line: 441, baseType: !501, size: 32, offset: 14176)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !597, file: !568, line: 442, baseType: !501, size: 32, offset: 14208)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !597, file: !568, line: 443, baseType: !1128, size: 448, offset: 14272)
!1128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1129, size: 448, elements: !1130)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !365)
!1130 = !{!1131}
!1131 = !DISubrange(count: 7)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !597, file: !568, line: 444, baseType: !501, size: 32, offset: 14720)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !597, file: !568, line: 445, baseType: !501, size: 32, offset: 14752)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !597, file: !568, line: 446, baseType: !388, size: 32, offset: 14784)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !597, file: !568, line: 447, baseType: !427, size: 64, offset: 14848)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !597, file: !568, line: 448, baseType: !427, size: 64, offset: 14912)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !597, file: !568, line: 449, baseType: !674, size: 640, offset: 14976)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !597, file: !568, line: 450, baseType: !613, size: 32, offset: 15616)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !597, file: !568, line: 451, baseType: !1140, size: 2880, offset: 15680)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !568, line: 318, baseType: !1141)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !568, line: 319, size: 2880, elements: !1142)
!1142 = !{!1143, !1144, !1145, !1146, !1147, !1148, !1149, !1162, !1163, !1168, !1173, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1188, !1189, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1221, !1222, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1245, !1246, !1247, !1251, !1252}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1141, file: !568, line: 320, baseType: !388, size: 32)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1141, file: !568, line: 321, baseType: !388, size: 32, offset: 32)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1141, file: !568, line: 322, baseType: !388, size: 32, offset: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1141, file: !568, line: 323, baseType: !388, size: 32, offset: 96)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1141, file: !568, line: 324, baseType: !388, size: 32, offset: 128)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1141, file: !568, line: 325, baseType: !388, size: 32, offset: 160)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1141, file: !568, line: 326, baseType: !1150, size: 64, offset: 192)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !568, line: 293, baseType: !1151)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !568, line: 295, size: 448, elements: !1153)
!1153 = !{!1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1152, file: !568, line: 296, baseType: !1150, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1152, file: !568, line: 297, baseType: !451, size: 64, offset: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1152, file: !568, line: 297, baseType: !451, size: 64, offset: 128)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1152, file: !568, line: 298, baseType: !434, size: 64, offset: 192)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1152, file: !568, line: 298, baseType: !434, size: 64, offset: 256)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1152, file: !568, line: 299, baseType: !388, size: 32, offset: 320)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1152, file: !568, line: 300, baseType: !388, size: 32, offset: 352)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1152, file: !568, line: 301, baseType: !388, size: 32, offset: 384)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1141, file: !568, line: 326, baseType: !1150, size: 64, offset: 256)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1141, file: !568, line: 328, baseType: !1164, size: 64, offset: 320)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{!342, !595, !1167, !434}
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1141, file: !568, line: 329, baseType: !1169, size: 64, offset: 384)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!342, !1167, !1172, !436, !436, !454, !434}
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1141, file: !568, line: 330, baseType: !1174, size: 64, offset: 448)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64)
!1175 = !DISubroutineType(types: !1176)
!1176 = !{!342, !1167}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1141, file: !568, line: 331, baseType: !1174, size: 64, offset: 512)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1141, file: !568, line: 334, baseType: !344, size: 64, offset: 576)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1141, file: !568, line: 335, baseType: !405, size: 32, offset: 640)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1141, file: !568, line: 335, baseType: !405, size: 32, offset: 672)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1141, file: !568, line: 336, baseType: !405, size: 32, offset: 704)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1141, file: !568, line: 336, baseType: !405, size: 32, offset: 736)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1141, file: !568, line: 337, baseType: !1184, size: 64, offset: 768)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !345, line: 339, baseType: !1186)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !345, line: 339, flags: DIFlagFwdDecl)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1141, file: !568, line: 338, baseType: !1184, size: 64, offset: 832)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1141, file: !568, line: 339, baseType: !1190, size: 64, offset: 896)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !345, line: 341, baseType: !1192)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !345, line: 351, size: 192, elements: !1193)
!1193 = !{!1194, !1195, !1196, !1197, !1198}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1192, file: !345, line: 354, baseType: !72, size: 32)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1192, file: !345, line: 355, baseType: !72, size: 32, offset: 32)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1192, file: !345, line: 356, baseType: !72, size: 32, offset: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1192, file: !345, line: 361, baseType: !72, size: 32, offset: 96)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1192, file: !345, line: 362, baseType: !323, size: 64, offset: 128)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1141, file: !568, line: 340, baseType: !388, size: 32, offset: 960)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1141, file: !568, line: 340, baseType: !388, size: 32, offset: 992)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1141, file: !568, line: 341, baseType: !451, size: 64, offset: 1024)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1141, file: !568, line: 342, baseType: !434, size: 64, offset: 1088)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1141, file: !568, line: 343, baseType: !454, size: 64, offset: 1152)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1141, file: !568, line: 344, baseType: !436, size: 64, offset: 1216)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1141, file: !568, line: 345, baseType: !388, size: 32, offset: 1280)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1141, file: !568, line: 346, baseType: !1172, size: 64, offset: 1344)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1141, file: !568, line: 347, baseType: !501, size: 32, offset: 1408)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1141, file: !568, line: 348, baseType: !388, size: 32, offset: 1440)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1141, file: !568, line: 351, baseType: !501, size: 32, offset: 1472)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1141, file: !568, line: 352, baseType: !501, size: 32, offset: 1504)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1141, file: !568, line: 353, baseType: !405, size: 32, offset: 1536)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1141, file: !568, line: 354, baseType: !405, size: 32, offset: 1568)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1141, file: !568, line: 355, baseType: !1172, size: 64, offset: 1600)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1141, file: !568, line: 356, baseType: !1172, size: 64, offset: 1664)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1141, file: !568, line: 357, baseType: !1216, size: 64, offset: 1728)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !568, line: 310, baseType: !1218)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !568, line: 308, size: 32, elements: !1219)
!1219 = !{!1220}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1218, file: !568, line: 309, baseType: !388, size: 32)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1141, file: !568, line: 357, baseType: !1216, size: 64, offset: 1792)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1141, file: !568, line: 358, baseType: !1223, size: 64, offset: 1856)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !568, line: 316, baseType: !1225)
