; ModuleID = '/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/tfs/tfs.c'
source_filename = "/home/users/ndemeye/xSDK/hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/tfs/tfs.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PetscStack = type { [64 x i8*], [64 x i8*], [64 x i32], [64 x i32], i32, i32, i32 }
%struct.ompi_predefined_communicator_t = type opaque
%struct.ompi_communicator_t = type opaque
%struct._p_PC = type { %struct._p_PetscObject, [1 x %struct._PCOps], %struct._p_DM*, i32, i64, i64, i32, i32, i32, i32, %struct._p_Mat*, %struct._p_Mat*, %struct._p_Vec*, %struct._p_Vec*, i32, i32, i32 (%struct._p_PC*, i32, %struct._p_IS**, %struct._p_IS**, %struct._p_Mat**, i8*)*, i8*, i8*, i32, i8*, i32, i32 }
%struct._p_PetscObject = type { i32, [1 x %struct.PetscOps], %struct.ompi_communicator_t*, i32, double, double, double, double, i64, i32, i32, %struct._n_PetscFunctionList*, %struct._n_PetscObjectList*, i8*, i8*, i8*, i8*, %struct._p_PetscObject*, i64, i8*, i8*, i32, i8*, i64, i32, i32, i64*, i64*, i32*, i32**, i32, i32, i64*, i64*, double*, double**, i32, i32, i64*, i64*, double*, double**, void ()**, i32, [2 x %struct.PetscFortranCallback*], [2 x i32], i8*, i32 (i8*)*, i32, [5 x i32 (%struct._p_PetscOptionItems*, %struct._p_PetscObject*, i8*)*], [5 x i32 (%struct._p_PetscObject*, i8*)*], [5 x i8*], i32, %struct._n_PetscOptions*, i32 }

!262 = !DIEnumerator(name: "MATOP_GET_VALUES_LOCAL", value: 147, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 161, baseType: !5, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272}
!265 = !DIEnumerator(name: "MAT_FACTOR_NONE", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "MAT_FACTOR_LU", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "MAT_FACTOR_CHOLESKY", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "MAT_FACTOR_ILU", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "MAT_FACTOR_ICC", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "MAT_FACTOR_ILUDT", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "MAT_FACTOR_QR", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "MAT_FACTOR_NUM_TYPES", value: 7, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1265, baseType: !5, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_UNFACTORED", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_FACTORED", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "MAT_FACTOR_SCHUR_INVERTED", value: 2, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 1203, baseType: !5, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIEnumerator(name: "MAT_FACTOR_NOERROR", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "MAT_FACTOR_STRUCT_ZEROPIVOT", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "MAT_FACTOR_NUMERIC_ZEROPIVOT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "MAT_FACTOR_OUTMEMORY", value: 3, isUnsigned: true)
!284 = !DIEnumerator(name: "MAT_FACTOR_OTHER", value: 4, isUnsigned: true)
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 187, baseType: !5, size: 32, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293}
!287 = !DIEnumerator(name: "MATPRODUCT_UNSPECIFIED", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "MATPRODUCT_AB", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "MATPRODUCT_AtB", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "MATPRODUCT_ABt", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "MATPRODUCT_PtAP", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "MATPRODUCT_RARt", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "MATPRODUCT_ABC", value: 6, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 98, baseType: !72, size: 32, elements: !296)
!295 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscpctypes.h", directory: "/home/users/ndemeye/xSDK")
!296 = !{!297, !298, !299, !300}
!297 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_RTOL", value: 2)
!298 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_ATOL", value: 3)
!299 = !DIEnumerator(name: "PCRICHARDSON_CONVERGED_ITS", value: 4)
!300 = !DIEnumerator(name: "PCRICHARDSON_DIVERGED_DTOL", value: -4)
!301 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 85, baseType: !72, size: 32, elements: !302)
!302 = !{!303, !304, !305, !306}
!303 = !DIEnumerator(name: "PC_SIDE_DEFAULT", value: -1)
!304 = !DIEnumerator(name: "PC_LEFT", value: 0)
!305 = !DIEnumerator(name: "PC_RIGHT", value: 1)
!306 = !DIEnumerator(name: "PC_SYMMETRIC", value: 2)
!307 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 395, baseType: !72, size: 32, elements: !308)
!308 = !{!309, !310, !311, !312, !313, !314, !315}
!309 = !DIEnumerator(name: "PC_SETUP_ERROR", value: -1)
!310 = !DIEnumerator(name: "PC_NOERROR", value: 0)
!311 = !DIEnumerator(name: "PC_FACTOR_STRUCT_ZEROPIVOT", value: 1)
!312 = !DIEnumerator(name: "PC_FACTOR_NUMERIC_ZEROPIVOT", value: 2)
!313 = !DIEnumerator(name: "PC_FACTOR_OUTMEMORY", value: 3)
!314 = !DIEnumerator(name: "PC_FACTOR_OTHER", value: 4)
!315 = !DIEnumerator(name: "PC_SUBPC_ERROR", value: 5)
!316 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !317, line: 663, baseType: !5, size: 32, elements: !318)
!317 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscerror.h", directory: "/home/users/ndemeye/xSDK")
!318 = !{!319, !320, !321}
!319 = !DIEnumerator(name: "PETSC_ERROR_INITIAL", value: 0, isUnsigned: true)
!320 = !DIEnumerator(name: "PETSC_ERROR_REPEAT", value: 1, isUnsigned: true)
!321 = !DIEnumerator(name: "PETSC_ERROR_IN_CXX", value: 2, isUnsigned: true)
!322 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !323, line: 624, baseType: !5, size: 32, elements: !324)
!323 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/openmpi/include/mpi.h", directory: "")
!324 = !{!325, !326, !327, !328}
!325 = !DIEnumerator(name: "MPI_IDENT", value: 0, isUnsigned: true)
!326 = !DIEnumerator(name: "MPI_CONGRUENT", value: 1, isUnsigned: true)
!327 = !DIEnumerator(name: "MPI_SIMILAR", value: 2, isUnsigned: true)
!328 = !DIEnumerator(name: "MPI_UNEQUAL", value: 3, isUnsigned: true)
!329 = !{!330, !352, !355, !356, !359, !440, !72, !524, !558, !1370, !475}
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "PC_TFS", file: !332, line: 14, baseType: !333)
!332 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/src/ksp/pc/impls/tfs/tfs.c", directory: "/home/users/ndemeye/xSDK")
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !332, line: 9, size: 384, elements: !334)
!334 = !{!335, !340, !344, !348, !349, !350}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "xxt", scope: !333, file: !332, line: 10, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "xxt_ADT", file: !337, line: 253, baseType: !338)
!337 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/ksp/pc/impls/tfs/tfs.h", directory: "/home/users/ndemeye/xSDK")
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "xxt_CDT", file: !337, line: 253, flags: DIFlagFwdDecl)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "xyt", scope: !333, file: !332, line: 11, baseType: !341, size: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "xyt_ADT", file: !337, line: 361, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "xyt_CDT", file: !337, line: 361, flags: DIFlagFwdDecl)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !333, file: !332, line: 12, baseType: !345, size: 64, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vec", file: !60, line: 21, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Vec", file: !60, line: 21, flags: DIFlagFwdDecl)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "xd", scope: !333, file: !332, line: 12, baseType: !345, size: 64, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "xo", scope: !333, file: !332, line: 12, baseType: !345, size: 64, offset: 256)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "nd", scope: !333, file: !332, line: 13, baseType: !351, size: 32, offset: 320)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt", file: !4, line: 102, baseType: !72)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Comm", file: !323, line: 330, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_communicator_t", file: !323, line: 330, flags: DIFlagFwdDecl)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !358)
!358 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObject", file: !4, line: 430, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscObject", file: !362, line: 73, size: 4480, elements: !363)
!362 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/petscimpl.h", directory: "/home/users/ndemeye/xSDK")
!363 = !{!364, !366, !412, !413, !414, !417, !418, !419, !420, !428, !429, !431, !435, !439, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !452, !453, !454, !456, !457, !459, !461, !462, !463, !464, !465, !468, !470, !471, !472, !473, !474, !477, !479, !480, !481, !491, !493, !494, !498, !499, !548, !553, !555, !556, !557}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "classid", scope: !361, file: !362, line: 74, baseType: !365, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscClassId", file: !4, line: 32, baseType: !72)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "bops", scope: !361, file: !362, line: 75, baseType: !367, size: 448, offset: 64)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 448, elements: !410)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOps", file: !362, line: 53, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !362, line: 45, size: 448, elements: !370)
!370 = !{!371, !377, !385, !390, !394, !398, !405}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "getcomm", scope: !369, file: !362, line: 46, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!375, !359, !376}
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscErrorCode", file: !4, line: 14, baseType: !72)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !369, file: !362, line: 47, baseType: !378, size: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!375, !359, !381}
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscViewer", file: !382, line: 16, baseType: !383)
!382 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscviewertypes.h", directory: "/home/users/ndemeye/xSDK")
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscViewer", file: !382, line: 16, flags: DIFlagFwdDecl)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !369, file: !362, line: 48, baseType: !386, size: 64, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!375, !389}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !369, file: !362, line: 49, baseType: !391, size: 64, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!375, !359, !356, !359}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !369, file: !362, line: 50, baseType: !395, size: 64, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!375, !359, !356, !389}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "composefunction", scope: !369, file: !362, line: 51, baseType: !399, size: 64, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!375, !359, !356, !402}
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{null}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "queryfunction", scope: !369, file: !362, line: 52, baseType: !406, size: 64, offset: 384)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!375, !359, !356, !409}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!410 = !{!411}
!411 = !DISubrange(count: 1)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !361, file: !362, line: 76, baseType: !352, size: 64, offset: 512)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !361, file: !362, line: 77, baseType: !351, size: 32, offset: 576)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !361, file: !362, line: 78, baseType: !415, size: 64, offset: 640)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLogDouble", file: !4, line: 360, baseType: !416)
!416 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !361, file: !362, line: 78, baseType: !415, size: 64, offset: 704)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !361, file: !362, line: 78, baseType: !415, size: 64, offset: 768)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "memchildren", scope: !361, file: !362, line: 78, baseType: !415, size: 64, offset: 832)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !361, file: !362, line: 79, baseType: !421, size: 64, offset: 896)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectId", file: !4, line: 442, baseType: !422)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscInt64", file: !4, line: 90, baseType: !423)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !424, line: 27, baseType: !425)
!424 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !426, line: 43, baseType: !427)
!426 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!427 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "refct", scope: !361, file: !362, line: 80, baseType: !351, size: 32, offset: 960)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !361, file: !362, line: 81, baseType: !430, size: 32, offset: 992)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMPIInt", file: !4, line: 49, baseType: !72)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "qlist", scope: !361, file: !362, line: 82, baseType: !432, size: 64, offset: 1024)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFunctionList", file: !4, line: 465, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscFunctionList", file: !4, line: 465, flags: DIFlagFwdDecl)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "olist", scope: !361, file: !362, line: 83, baseType: !436, size: 64, offset: 1088)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectList", file: !4, line: 496, baseType: !437)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscObjectList", file: !4, line: 496, flags: DIFlagFwdDecl)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !361, file: !362, line: 84, baseType: !440, size: 64, offset: 1152)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !361, file: !362, line: 85, baseType: !440, size: 64, offset: 1216)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "mansec", scope: !361, file: !362, line: 86, baseType: !440, size: 64, offset: 1280)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "type_name", scope: !361, file: !362, line: 87, baseType: !440, size: 64, offset: 1344)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !361, file: !362, line: 88, baseType: !359, size: 64, offset: 1408)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "parentid", scope: !361, file: !362, line: 89, baseType: !421, size: 64, offset: 1472)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !361, file: !362, line: 90, baseType: !440, size: 64, offset: 1536)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !361, file: !362, line: 91, baseType: !440, size: 64, offset: 1600)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "tablevel", scope: !361, file: !362, line: 92, baseType: !351, size: 32, offset: 1664)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !361, file: !362, line: 93, baseType: !355, size: 64, offset: 1728)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !361, file: !362, line: 94, baseType: !451, size: 64, offset: 1792)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscObjectState", file: !4, line: 455, baseType: !422)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "int_idmax", scope: !361, file: !362, line: 95, baseType: !351, size: 32, offset: 1856)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "intstar_idmax", scope: !361, file: !362, line: 95, baseType: !351, size: 32, offset: 1888)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposedstate", scope: !361, file: !362, line: 96, baseType: !455, size: 64, offset: 1920)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposedstate", scope: !361, file: !362, line: 96, baseType: !455, size: 64, offset: 1984)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "intcomposeddata", scope: !361, file: !362, line: 97, baseType: !458, size: 64, offset: 2048)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "intstarcomposeddata", scope: !361, file: !362, line: 97, baseType: !460, size: 64, offset: 2112)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "real_idmax", scope: !361, file: !362, line: 98, baseType: !351, size: 32, offset: 2176)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "realstar_idmax", scope: !361, file: !362, line: 98, baseType: !351, size: 32, offset: 2208)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposedstate", scope: !361, file: !362, line: 99, baseType: !455, size: 64, offset: 2240)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposedstate", scope: !361, file: !362, line: 99, baseType: !455, size: 64, offset: 2304)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "realcomposeddata", scope: !361, file: !362, line: 100, baseType: !466, size: 64, offset: 2368)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscReal", file: !4, line: 189, baseType: !416)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "realstarcomposeddata", scope: !361, file: !362, line: 100, baseType: !469, size: 64, offset: 2432)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "scalar_idmax", scope: !361, file: !362, line: 101, baseType: !351, size: 32, offset: 2496)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstar_idmax", scope: !361, file: !362, line: 101, baseType: !351, size: 32, offset: 2528)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposedstate", scope: !361, file: !362, line: 102, baseType: !455, size: 64, offset: 2560)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposedstate", scope: !361, file: !362, line: 102, baseType: !455, size: 64, offset: 2624)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "scalarcomposeddata", scope: !361, file: !362, line: 103, baseType: !475, size: 64, offset: 2688)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscScalar", file: !4, line: 305, baseType: !467)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "scalarstarcomposeddata", scope: !361, file: !362, line: 103, baseType: !478, size: 64, offset: 2752)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "fortran_func_pointers", scope: !361, file: !362, line: 104, baseType: !409, size: 64, offset: 2816)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortran_func_pointers", scope: !361, file: !362, line: 105, baseType: !351, size: 32, offset: 2880)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "fortrancallback", scope: !361, file: !362, line: 106, baseType: !482, size: 128, offset: 2944)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !483, size: 128, elements: !489)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscFortranCallback", file: !362, line: 64, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !362, line: 61, size: 128, elements: !486)
!486 = !{!487, !488}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !485, file: !362, line: 62, baseType: !402, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !485, file: !362, line: 63, baseType: !355, size: 64, offset: 64)
!489 = !{!490}
!490 = !DISubrange(count: 2)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "num_fortrancallback", scope: !361, file: !362, line: 107, baseType: !492, size: 64, offset: 3072)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 64, elements: !489)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "python_context", scope: !361, file: !362, line: 108, baseType: !355, size: 64, offset: 3136)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "python_destroy", scope: !361, file: !362, line: 109, baseType: !495, size: 64, offset: 3200)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{!375, !355}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "noptionhandler", scope: !361, file: !362, line: 111, baseType: !351, size: 32, offset: 3264)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "optionhandler", scope: !361, file: !362, line: 112, baseType: !500, size: 320, offset: 3328)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 320, elements: !546)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!375, !504, !359, !355}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItems", file: !10, line: 108, baseType: !506)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscOptionItems", file: !10, line: 99, size: 640, elements: !507)
!507 = !{!508, !509, !534, !535, !536, !537, !538, !539, !540, !541, !542}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !506, file: !10, line: 100, baseType: !351, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !506, file: !10, line: 101, baseType: !510, size: 64, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionItem", file: !10, line: 82, baseType: !511)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptionItem", file: !10, line: 83, size: 768, elements: !513)
!513 = !{!514, !515, !516, !517, !518, !521, !522, !523, !527, !529, !531, !532, !533}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !512, file: !10, line: 84, baseType: !440, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !512, file: !10, line: 85, baseType: !440, size: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !512, file: !10, line: 86, baseType: !355, size: 64, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "flist", scope: !512, file: !10, line: 87, baseType: !432, size: 64, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !512, file: !10, line: 88, baseType: !519, size: 64, offset: 256)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !356)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "nlist", scope: !512, file: !10, line: 89, baseType: !358, size: 8, offset: 320)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "man", scope: !512, file: !10, line: 90, baseType: !440, size: 64, offset: 384)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !512, file: !10, line: 91, baseType: !524, size: 64, offset: 448)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !525, line: 46, baseType: !526)
!525 = !DIFile(filename: "norris/soft/pat/lib/clang/13.0.0/include/stddef.h", directory: "/home/users")
!526 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !512, file: !10, line: 92, baseType: !528, size: 32, offset: 512)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscBool", file: !4, line: 170, baseType: !3)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !512, file: !10, line: 93, baseType: !530, size: 32, offset: 544)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptionType", file: !10, line: 81, baseType: !9)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !512, file: !10, line: 94, baseType: !510, size: 64, offset: 576)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "pman", scope: !512, file: !10, line: 95, baseType: !440, size: 64, offset: 640)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !512, file: !10, line: 96, baseType: !355, size: 64, offset: 704)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !506, file: !10, line: 102, baseType: !440, size: 64, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "pprefix", scope: !506, file: !10, line: 102, baseType: !440, size: 64, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !506, file: !10, line: 103, baseType: !440, size: 64, offset: 256)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !506, file: !10, line: 104, baseType: !352, size: 64, offset: 320)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "printhelp", scope: !506, file: !10, line: 105, baseType: !528, size: 32, offset: 384)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "changedmethod", scope: !506, file: !10, line: 105, baseType: !528, size: 32, offset: 416)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "alreadyprinted", scope: !506, file: !10, line: 105, baseType: !528, size: 32, offset: 448)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !506, file: !10, line: 106, baseType: !359, size: 64, offset: 512)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !506, file: !10, line: 107, baseType: !543, size: 64, offset: 576)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscOptions", file: !10, line: 10, baseType: !544)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscOptions", file: !10, line: 10, flags: DIFlagFwdDecl)
!546 = !{!547}
!547 = !DISubrange(count: 5)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "optiondestroy", scope: !361, file: !362, line: 113, baseType: !549, size: 320, offset: 3648)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 320, elements: !546)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!375, !359, !355}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "optionctx", scope: !361, file: !362, line: 114, baseType: !554, size: 320, offset: 3968)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, size: 320, elements: !546)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "optionsprinted", scope: !361, file: !362, line: 115, baseType: !528, size: 32, offset: 4288)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !361, file: !362, line: 120, baseType: !543, size: 64, offset: 4352)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "donotPetscObjectPrintClassNamePrefixType", scope: !361, file: !362, line: 121, baseType: !528, size: 32, offset: 4416)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat_MPIAIJ", file: !560, line: 70, baseType: !561)
!560 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/../src/mat/impls/aij/mpi/mpiaij.h", directory: "/home/users/ndemeye/xSDK")
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !560, line: 34, size: 1344, elements: !562)
!562 = !{!563, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1355, !1356, !1357, !1358, !1364, !1365, !1366, !1367, !1368, !1369}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !561, file: !560, line: 35, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mat", file: !36, line: 16, baseType: !565)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_Mat", file: !567, line: 436, size: 23424, elements: !568)
!567 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petsc/private/matimpl.h", directory: "/home/users/ndemeye/xSDK")
!568 = !{!569, !571, !1075, !1095, !1096, !1097, !1099, !1100, !1101, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1228, !1229, !1245, !1246, !1247, !1248, !1249, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1284, !1304, !1305, !1307, !1308, !1309, !1310, !1311, !1312, !1330, !1331}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !566, file: !567, line: 437, baseType: !570, size: 4480)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "_p_PetscObject", file: !362, line: 122, baseType: !361)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !566, file: !567, line: 437, baseType: !572, size: 9472, offset: 4480)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !573, size: 9472, elements: !410)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatOps", file: !567, line: 32, size: 9472, elements: !574)
!574 = !{!575, !584, !588, !589, !593, !597, !598, !599, !600, !601, !602, !603, !627, !631, !636, !642, !661, !666, !670, !671, !676, !681, !682, !687, !691, !695, !699, !703, !707, !708, !709, !710, !711, !715, !716, !721, !722, !723, !724, !725, !730, !737, !742, !746, !750, !754, !758, !759, !763, !764, !771, !776, !777, !778, !779, !841, !849, !850, !854, !855, !859, !860, !864, !869, !870, !874, !878, !885, !886, !887, !888, !889, !890, !895, !896, !900, !904, !908, !909, !910, !914, !924, !925, !929, !930, !934, !935, !939, !940, !945, !946, !950, !954, !955, !956, !957, !958, !959, !960, !964, !965, !966, !967, !968, !969, !973, !974, !975, !976, !977, !978, !979, !980, !984, !988, !989, !990, !994, !995, !996, !997, !998, !999, !1000, !1004, !1005, !1006, !1011, !1015, !1016, !1020, !1021, !1022, !1023, !1049, !1053, !1054, !1055, !1056, !1057, !1061, !1062, !1063, !1064, !1065, !1069, !1073, !1074}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "setvalues", scope: !573, file: !567, line: 34, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!375, !564, !351, !579, !351, !579, !581, !583}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !351)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !476)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "InsertMode", file: !4, line: 580, baseType: !24)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "getrow", scope: !573, file: !567, line: 35, baseType: !585, size: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{!375, !564, !351, !458, !460, !478}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "restorerow", scope: !573, file: !567, line: 36, baseType: !585, size: 64, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !573, file: !567, line: 37, baseType: !590, size: 64, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!375, !564, !345, !345}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "multadd", scope: !573, file: !567, line: 38, baseType: !594, size: 64, offset: 256)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!375, !564, !345, !345, !345}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "multtranspose", scope: !573, file: !567, line: 40, baseType: !590, size: 64, offset: 320)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeadd", scope: !573, file: !567, line: 41, baseType: !594, size: 64, offset: 384)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "solve", scope: !573, file: !567, line: 42, baseType: !590, size: 64, offset: 448)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "solveadd", scope: !573, file: !567, line: 43, baseType: !594, size: 64, offset: 512)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "solvetranspose", scope: !573, file: !567, line: 44, baseType: !590, size: 64, offset: 576)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "solvetransposeadd", scope: !573, file: !567, line: 46, baseType: !594, size: 64, offset: 640)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "lufactor", scope: !573, file: !567, line: 47, baseType: !604, size: 64, offset: 704)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!375, !564, !607, !607, !611}
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "IS", file: !608, line: 11, baseType: !609)
!608 = !DIFile(filename: "hpc-apps/petsc/petsc-3.15.0/include/petscistypes.h", directory: "/home/users/ndemeye/xSDK")
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_IS", file: !608, line: 11, flags: DIFlagFwdDecl)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !613)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorInfo", file: !36, line: 1239, baseType: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 1226, size: 704, elements: !615)
!615 = !{!616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "diagonal_fill", scope: !614, file: !36, line: 1227, baseType: !467, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "usedt", scope: !614, file: !36, line: 1228, baseType: !467, size: 64, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !614, file: !36, line: 1229, baseType: !467, size: 64, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "dtcol", scope: !614, file: !36, line: 1230, baseType: !467, size: 64, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "dtcount", scope: !614, file: !36, line: 1231, baseType: !467, size: 64, offset: 256)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !614, file: !36, line: 1232, baseType: !467, size: 64, offset: 320)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !614, file: !36, line: 1233, baseType: !467, size: 64, offset: 384)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "pivotinblocks", scope: !614, file: !36, line: 1234, baseType: !467, size: 64, offset: 448)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "zeropivot", scope: !614, file: !36, line: 1236, baseType: !467, size: 64, offset: 512)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "shifttype", scope: !614, file: !36, line: 1237, baseType: !467, size: 64, offset: 576)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "shiftamount", scope: !614, file: !36, line: 1238, baseType: !467, size: 64, offset: 640)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactor", scope: !573, file: !567, line: 48, baseType: !628, size: 64, offset: 768)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!375, !564, !607, !611}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "sor", scope: !573, file: !567, line: 49, baseType: !632, size: 64, offset: 832)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DISubroutineType(types: !634)
!634 = !{!375, !564, !345, !467, !635, !467, !351, !351, !345}
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatSORType", file: !36, line: 1291, baseType: !35)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "transpose", scope: !573, file: !567, line: 50, baseType: !637, size: 64, offset: 896)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{!375, !564, !640, !641}
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatReuse", file: !36, line: 238, baseType: !48)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "getinfo", scope: !573, file: !567, line: 52, baseType: !643, size: 64, offset: 960)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!375, !564, !646, !647}
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfoType", file: !36, line: 612, baseType: !54)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatInfo", file: !36, line: 600, baseType: !649)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 592, size: 640, elements: !650)
!650 = !{!651, !652, !653, !654, !655, !656, !657, !658, !659, !660}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !649, file: !36, line: 593, baseType: !415, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "nz_allocated", scope: !649, file: !36, line: 594, baseType: !415, size: 64, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "nz_used", scope: !649, file: !36, line: 594, baseType: !415, size: 64, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "nz_unneeded", scope: !649, file: !36, line: 594, baseType: !415, size: 64, offset: 192)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !649, file: !36, line: 595, baseType: !415, size: 64, offset: 256)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "assemblies", scope: !649, file: !36, line: 596, baseType: !415, size: 64, offset: 320)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "mallocs", scope: !649, file: !36, line: 597, baseType: !415, size: 64, offset: 384)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_given", scope: !649, file: !36, line: 598, baseType: !415, size: 64, offset: 448)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "fill_ratio_needed", scope: !649, file: !36, line: 598, baseType: !415, size: 64, offset: 512)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "factor_mallocs", scope: !649, file: !36, line: 599, baseType: !415, size: 64, offset: 576)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "equal", scope: !573, file: !567, line: 53, baseType: !662, size: 64, offset: 1024)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{!375, !564, !564, !665}
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonal", scope: !573, file: !567, line: 54, baseType: !667, size: 64, offset: 1088)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!375, !564, !345}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalscale", scope: !573, file: !567, line: 55, baseType: !590, size: 64, offset: 1152)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !573, file: !567, line: 56, baseType: !672, size: 64, offset: 1216)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!375, !564, !675, !466}
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "NormType", file: !60, line: 155, baseType: !59)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "assemblybegin", scope: !573, file: !567, line: 58, baseType: !677, size: 64, offset: 1280)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!375, !564, !680}
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatAssemblyType", file: !36, line: 424, baseType: !67)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "assemblyend", scope: !573, file: !567, line: 59, baseType: !677, size: 64, offset: 1344)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "setoption", scope: !573, file: !567, line: 60, baseType: !683, size: 64, offset: 1408)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{!375, !564, !686, !528}
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOption", file: !36, line: 469, baseType: !71)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "zeroentries", scope: !573, file: !567, line: 61, baseType: !688, size: 64, offset: 1472)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!375, !564}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "zerorows", scope: !573, file: !567, line: 63, baseType: !692, size: 64, offset: 1536)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!375, !564, !351, !579, !476, !345, !345}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "lufactorsymbolic", scope: !573, file: !567, line: 64, baseType: !696, size: 64, offset: 1600)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!375, !564, !564, !607, !607, !611}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "lufactornumeric", scope: !573, file: !567, line: 65, baseType: !700, size: 64, offset: 1664)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!375, !564, !564, !611}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactorsymbolic", scope: !573, file: !567, line: 66, baseType: !704, size: 64, offset: 1728)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{!375, !564, !564, !607, !611}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "choleskyfactornumeric", scope: !573, file: !567, line: 67, baseType: !700, size: 64, offset: 1792)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !573, file: !567, line: 69, baseType: !688, size: 64, offset: 1856)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactorsymbolic", scope: !573, file: !567, line: 70, baseType: !696, size: 64, offset: 1920)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactorsymbolic", scope: !573, file: !567, line: 71, baseType: !704, size: 64, offset: 1984)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "getdiagonalblock", scope: !573, file: !567, line: 72, baseType: !712, size: 64, offset: 2048)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!375, !564, !641}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "setinf", scope: !573, file: !567, line: 73, baseType: !688, size: 64, offset: 2112)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "duplicate", scope: !573, file: !567, line: 75, baseType: !717, size: 64, offset: 2176)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{!375, !564, !720, !641}
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatDuplicateOption", file: !36, line: 563, baseType: !102)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "forwardsolve", scope: !573, file: !567, line: 76, baseType: !590, size: 64, offset: 2240)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "backwardsolve", scope: !573, file: !567, line: 77, baseType: !590, size: 64, offset: 2304)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ilufactor", scope: !573, file: !567, line: 78, baseType: !604, size: 64, offset: 2368)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "iccfactor", scope: !573, file: !567, line: 79, baseType: !628, size: 64, offset: 2432)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "axpy", scope: !573, file: !567, line: 81, baseType: !726, size: 64, offset: 2496)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!375, !564, !476, !564, !729}
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStructure", file: !36, line: 285, baseType: !107)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrices", scope: !573, file: !567, line: 82, baseType: !731, size: 64, offset: 2560)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!375, !564, !351, !734, !734, !640, !736}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !607)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "increaseoverlap", scope: !573, file: !567, line: 83, baseType: !738, size: 64, offset: 2624)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!375, !564, !351, !741, !351}
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "getvalues", scope: !573, file: !567, line: 84, baseType: !743, size: 64, offset: 2688)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!375, !564, !351, !579, !351, !579, !475}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !573, file: !567, line: 85, baseType: !747, size: 64, offset: 2752)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!375, !564, !564, !729}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmax", scope: !573, file: !567, line: 87, baseType: !751, size: 64, offset: 2816)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!375, !564, !345, !458}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !573, file: !567, line: 88, baseType: !755, size: 64, offset: 2880)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{!375, !564, !476}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !573, file: !567, line: 89, baseType: !755, size: 64, offset: 2944)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "diagonalset", scope: !573, file: !567, line: 90, baseType: !760, size: 64, offset: 3008)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!375, !564, !345, !583}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowscolumns", scope: !573, file: !567, line: 91, baseType: !692, size: 64, offset: 3072)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "setrandom", scope: !573, file: !567, line: 93, baseType: !765, size: 64, offset: 3136)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!375, !564, !768}
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscRandom", file: !4, line: 523, baseType: !769)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_PetscRandom", file: !4, line: 523, flags: DIFlagFwdDecl)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "getrowij", scope: !573, file: !567, line: 94, baseType: !772, size: 64, offset: 3200)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!375, !564, !351, !528, !528, !458, !775, !775, !665}
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowij", scope: !573, file: !567, line: 95, baseType: !772, size: 64, offset: 3264)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnij", scope: !573, file: !567, line: 96, baseType: !772, size: 64, offset: 3328)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "restorecolumnij", scope: !573, file: !567, line: 97, baseType: !772, size: 64, offset: 3392)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringcreate", scope: !573, file: !567, line: 99, baseType: !780, size: 64, offset: 3456)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{!375, !564, !783, !786}
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoring", file: !608, line: 51, baseType: !784)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_ISColoring", file: !608, line: 51, flags: DIFlagFwdDecl)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFDColoring", file: !36, line: 1378, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatFDColoring", file: !567, line: 609, size: 6208, elements: !789)
!789 = !{!790, !791, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !810, !817, !818, !819, !820, !821, !822, !823, !824, !828, !829, !830, !831, !832, !834, !835, !836, !837, !838, !839, !840}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !788, file: !567, line: 610, baseType: !570, size: 4480)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !788, file: !567, line: 610, baseType: !792, size: 32, offset: 4480)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !410)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !788, file: !567, line: 611, baseType: !351, size: 32, offset: 4512)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !788, file: !567, line: 611, baseType: !351, size: 32, offset: 4544)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !788, file: !567, line: 611, baseType: !351, size: 32, offset: 4576)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !788, file: !567, line: 612, baseType: !351, size: 32, offset: 4608)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !788, file: !567, line: 613, baseType: !351, size: 32, offset: 4640)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !788, file: !567, line: 614, baseType: !458, size: 64, offset: 4672)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !788, file: !567, line: 615, baseType: !460, size: 64, offset: 4736)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "isa", scope: !788, file: !567, line: 616, baseType: !741, size: 64, offset: 4800)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !788, file: !567, line: 617, baseType: !458, size: 64, offset: 4864)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "matentry", scope: !788, file: !567, line: 618, baseType: !803, size: 64, offset: 4928)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry", file: !567, line: 602, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !567, line: 598, size: 128, elements: !806)
!806 = !{!807, !808, !809}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !805, file: !567, line: 599, baseType: !351, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !805, file: !567, line: 600, baseType: !351, size: 32, offset: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !805, file: !567, line: 601, baseType: !475, size: 64, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "matentry2", scope: !788, file: !567, line: 619, baseType: !811, size: 64, offset: 4992)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatEntry2", file: !567, line: 607, baseType: !813)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !567, line: 604, size: 128, elements: !814)
!814 = !{!815, !816}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !813, file: !567, line: 605, baseType: !351, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "valaddr", scope: !813, file: !567, line: 606, baseType: !475, size: 64, offset: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "dy", scope: !788, file: !567, line: 620, baseType: !475, size: 64, offset: 5056)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "error_rel", scope: !788, file: !567, line: 621, baseType: !467, size: 64, offset: 5120)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "umin", scope: !788, file: !567, line: 622, baseType: !467, size: 64, offset: 5184)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !788, file: !567, line: 623, baseType: !345, size: 64, offset: 5248)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !788, file: !567, line: 623, baseType: !345, size: 64, offset: 5312)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !788, file: !567, line: 623, baseType: !345, size: 64, offset: 5376)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "fset", scope: !788, file: !567, line: 624, baseType: !528, size: 32, offset: 5440)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !788, file: !567, line: 625, baseType: !825, size: 64, offset: 5504)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{!375}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "fctx", scope: !788, file: !567, line: 626, baseType: !355, size: 64, offset: 5568)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "vscale", scope: !788, file: !567, line: 627, baseType: !345, size: 64, offset: 5632)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !788, file: !567, line: 628, baseType: !351, size: 32, offset: 5696)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !788, file: !567, line: 629, baseType: !356, size: 64, offset: 5760)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !788, file: !567, line: 630, baseType: !833, size: 32, offset: 5824)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringType", file: !114, line: 213, baseType: !113)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !788, file: !567, line: 631, baseType: !351, size: 32, offset: 5856)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "bcols", scope: !788, file: !567, line: 631, baseType: !351, size: 32, offset: 5888)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !788, file: !567, line: 632, baseType: !528, size: 32, offset: 5920)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "viewed", scope: !788, file: !567, line: 633, baseType: !528, size: 32, offset: 5952)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_pointer", scope: !788, file: !567, line: 634, baseType: !402, size: 64, offset: 6016)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ftn_func_cntx", scope: !788, file: !567, line: 634, baseType: !355, size: 64, offset: 6080)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "matid", scope: !788, file: !567, line: 635, baseType: !421, size: 64, offset: 6144)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "coloringpatch", scope: !573, file: !567, line: 100, baseType: !842, size: 64, offset: 3520)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!375, !564, !351, !351, !845, !848}
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISColoringValue", file: !114, line: 215, baseType: !847)
!847 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "setunfactored", scope: !573, file: !567, line: 101, baseType: !688, size: 64, offset: 3584)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "permute", scope: !573, file: !567, line: 102, baseType: !851, size: 64, offset: 3648)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{!375, !564, !607, !607, !641}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblocked", scope: !573, file: !567, line: 103, baseType: !576, size: 64, offset: 3712)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatrix", scope: !573, file: !567, line: 105, baseType: !856, size: 64, offset: 3776)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{!375, !564, !607, !607, !640, !641}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !573, file: !567, line: 106, baseType: !688, size: 64, offset: 3840)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !573, file: !567, line: 107, baseType: !861, size: 64, offset: 3904)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!375, !564, !381}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "convertfrom", scope: !573, file: !567, line: 108, baseType: !865, size: 64, offset: 3968)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!375, !564, !868, !640, !641}
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatType", file: !36, line: 25, baseType: !356)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_63", scope: !573, file: !567, line: 109, baseType: !825, size: 64, offset: 4032)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultsymbolic", scope: !573, file: !567, line: 111, baseType: !871, size: 64, offset: 4096)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!375, !564, !564, !564, !467, !564}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "matmatmultnumeric", scope: !573, file: !567, line: 112, baseType: !875, size: 64, offset: 4160)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!375, !564, !564, !564, !564}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "setlocaltoglobalmapping", scope: !573, file: !567, line: 113, baseType: !879, size: 64, offset: 4224)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{!375, !564, !882, !882}
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISLocalToGlobalMapping", file: !608, line: 30, baseType: !883)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DICompositeType(tag: DW_TAG_structure_type, name: "_p_ISLocalToGlobalMapping", file: !608, line: 30, flags: DIFlagFwdDecl)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "setvalueslocal", scope: !573, file: !567, line: 114, baseType: !576, size: 64, offset: 4288)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "zerorowslocal", scope: !573, file: !567, line: 115, baseType: !692, size: 64, offset: 4352)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmaxabs", scope: !573, file: !567, line: 117, baseType: !751, size: 64, offset: 4416)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "getrowminabs", scope: !573, file: !567, line: 118, baseType: !751, size: 64, offset: 4480)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !573, file: !567, line: 119, baseType: !865, size: 64, offset: 4544)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "hasoperation", scope: !573, file: !567, line: 120, baseType: !891, size: 64, offset: 4608)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!375, !564, !894, !665}
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOperation", file: !36, line: 1675, baseType: !118)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_73", scope: !573, file: !567, line: 121, baseType: !825, size: 64, offset: 4672)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesadifor", scope: !573, file: !567, line: 123, baseType: !897, size: 64, offset: 4736)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DISubroutineType(types: !899)
!899 = !{!375, !564, !351, !355}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringapply", scope: !573, file: !567, line: 124, baseType: !901, size: 64, offset: 4800)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{!375, !564, !786, !345, !355}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "setfromoptions", scope: !573, file: !567, line: 125, baseType: !905, size: 64, offset: 4864)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{!375, !504, !564}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "multconstrained", scope: !573, file: !567, line: 126, baseType: !590, size: 64, offset: 4928)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "multtransposeconstrained", scope: !573, file: !567, line: 127, baseType: !590, size: 64, offset: 4992)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "findzerodiagonals", scope: !573, file: !567, line: 129, baseType: !911, size: 64, offset: 5056)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!375, !564, !741}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "mults", scope: !573, file: !567, line: 130, baseType: !915, size: 64, offset: 5120)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!375, !564, !918, !918}
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vecs", file: !60, line: 654, baseType: !919)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_Vecs", file: !60, line: 653, size: 128, elements: !921)
!921 = !{!922, !923}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !920, file: !60, line: 653, baseType: !351, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !920, file: !60, line: 653, baseType: !345, size: 64, offset: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "solves", scope: !573, file: !567, line: 131, baseType: !915, size: 64, offset: 5184)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "getinertia", scope: !573, file: !567, line: 132, baseType: !926, size: 64, offset: 5248)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{!375, !564, !458, !458, !458}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !573, file: !567, line: 133, baseType: !861, size: 64, offset: 5312)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "issymmetric", scope: !573, file: !567, line: 135, baseType: !931, size: 64, offset: 5376)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{!375, !564, !467, !665}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "ishermitian", scope: !573, file: !567, line: 136, baseType: !931, size: 64, offset: 5440)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "isstructurallysymmetric", scope: !573, file: !567, line: 137, baseType: !936, size: 64, offset: 5504)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!375, !564, !665}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesblockedlocal", scope: !573, file: !567, line: 138, baseType: !576, size: 64, offset: 5568)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "getvecs", scope: !573, file: !567, line: 139, baseType: !941, size: 64, offset: 5632)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{!375, !564, !944, !944}
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_89", scope: !573, file: !567, line: 141, baseType: !825, size: 64, offset: 5696)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "matmultsymbolic", scope: !573, file: !567, line: 142, baseType: !947, size: 64, offset: 5760)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{!375, !564, !564, !467, !564}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "matmultnumeric", scope: !573, file: !567, line: 143, baseType: !951, size: 64, offset: 5824)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{!375, !564, !564, !564}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_92", scope: !573, file: !567, line: 144, baseType: !825, size: 64, offset: 5888)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "ptapsymbolic", scope: !573, file: !567, line: 145, baseType: !947, size: 64, offset: 5952)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "ptapnumeric", scope: !573, file: !567, line: 147, baseType: !951, size: 64, offset: 6016)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_95", scope: !573, file: !567, line: 148, baseType: !825, size: 64, offset: 6080)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultsymbolic", scope: !573, file: !567, line: 149, baseType: !947, size: 64, offset: 6144)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposemultnumeric", scope: !573, file: !567, line: 150, baseType: !951, size: 64, offset: 6208)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "bindtocpu", scope: !573, file: !567, line: 151, baseType: !961, size: 64, offset: 6272)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!375, !564, !528}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "productsetfromoptions", scope: !573, file: !567, line: 153, baseType: !688, size: 64, offset: 6336)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "productsymbolic", scope: !573, file: !567, line: 154, baseType: !688, size: 64, offset: 6400)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "productnumeric", scope: !573, file: !567, line: 155, baseType: !688, size: 64, offset: 6464)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "conjugate", scope: !573, file: !567, line: 156, baseType: !688, size: 64, offset: 6528)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "viewnative", scope: !573, file: !567, line: 157, baseType: !861, size: 64, offset: 6592)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesrow", scope: !573, file: !567, line: 159, baseType: !970, size: 64, offset: 6656)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!375, !564, !351, !581}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "realpart", scope: !573, file: !567, line: 160, baseType: !688, size: 64, offset: 6720)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "imaginarypart", scope: !573, file: !567, line: 161, baseType: !688, size: 64, offset: 6784)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "getrowuppertriangular", scope: !573, file: !567, line: 162, baseType: !688, size: 64, offset: 6848)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "restorerowuppertriangular", scope: !573, file: !567, line: 163, baseType: !688, size: 64, offset: 6912)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "matsolve", scope: !573, file: !567, line: 165, baseType: !951, size: 64, offset: 6976)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "matsolvetranspose", scope: !573, file: !567, line: 166, baseType: !951, size: 64, offset: 7040)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "getrowmin", scope: !573, file: !567, line: 167, baseType: !751, size: 64, offset: 7104)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnvector", scope: !573, file: !567, line: 168, baseType: !981, size: 64, offset: 7168)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!375, !564, !345, !351}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "missingdiagonal", scope: !573, file: !567, line: 169, baseType: !985, size: 64, offset: 7232)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!375, !564, !665, !458}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "getseqnonzerostructure", scope: !573, file: !567, line: 171, baseType: !712, size: 64, offset: 7296)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !573, file: !567, line: 172, baseType: !688, size: 64, offset: 7360)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "getghosts", scope: !573, file: !567, line: 173, baseType: !991, size: 64, offset: 7424)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!375, !564, !458, !775}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "getlocalsubmatrix", scope: !573, file: !567, line: 174, baseType: !851, size: 64, offset: 7488)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "restorelocalsubmatrix", scope: !573, file: !567, line: 175, baseType: !851, size: 64, offset: 7552)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "multdiagonalblock", scope: !573, file: !567, line: 177, baseType: !590, size: 64, offset: 7616)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "hermitiantranspose", scope: !573, file: !567, line: 178, baseType: !637, size: 64, offset: 7680)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantranspose", scope: !573, file: !567, line: 179, baseType: !590, size: 64, offset: 7744)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "multhermitiantransposeadd", scope: !573, file: !567, line: 180, baseType: !594, size: 64, offset: 7808)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "getmultiprocblock", scope: !573, file: !567, line: 181, baseType: !1001, size: 64, offset: 7872)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!375, !564, !352, !640, !641}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "findnonzerorows", scope: !573, file: !567, line: 183, baseType: !911, size: 64, offset: 7936)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "getcolumnnorms", scope: !573, file: !567, line: 184, baseType: !672, size: 64, offset: 8000)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "invertblockdiagonal", scope: !573, file: !567, line: 185, baseType: !1007, size: 64, offset: 8064)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!375, !564, !1010}
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "invertvariableblockdiagonal", scope: !573, file: !567, line: 186, baseType: !1012, size: 64, offset: 8128)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!375, !564, !351, !579, !475}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "createsubmatricesmpi", scope: !573, file: !567, line: 187, baseType: !731, size: 64, offset: 8192)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "setvaluesbatch", scope: !573, file: !567, line: 189, baseType: !1017, size: 64, offset: 8256)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!375, !564, !351, !351, !458, !581}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_130", scope: !573, file: !567, line: 190, baseType: !825, size: 64, offset: 8320)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultsymbolic", scope: !573, file: !567, line: 191, baseType: !947, size: 64, offset: 8384)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "transposematmultnumeric", scope: !573, file: !567, line: 192, baseType: !951, size: 64, offset: 8448)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "transposecoloringcreate", scope: !573, file: !567, line: 193, baseType: !1024, size: 64, offset: 8512)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!375, !564, !783, !1027}
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatTransposeColoring", file: !36, line: 1401, baseType: !1028)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_p_MatTransposeColoring", file: !567, line: 660, size: 5312, elements: !1030)
!1030 = !{!1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1029, file: !567, line: 661, baseType: !570, size: 4480)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1029, file: !567, line: 661, baseType: !792, size: 32, offset: 4480)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !1029, file: !567, line: 662, baseType: !351, size: 32, offset: 4512)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1029, file: !567, line: 662, baseType: !351, size: 32, offset: 4544)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1029, file: !567, line: 662, baseType: !351, size: 32, offset: 4576)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1029, file: !567, line: 663, baseType: !351, size: 32, offset: 4608)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !1029, file: !567, line: 664, baseType: !351, size: 32, offset: 4640)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "ncolumns", scope: !1029, file: !567, line: 665, baseType: !458, size: 64, offset: 4672)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "nrows", scope: !1029, file: !567, line: 666, baseType: !458, size: 64, offset: 4736)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "currentcolor", scope: !1029, file: !567, line: 667, baseType: !351, size: 32, offset: 4800)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !1029, file: !567, line: 668, baseType: !833, size: 32, offset: 4832)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "colorforrow", scope: !1029, file: !567, line: 670, baseType: !458, size: 64, offset: 4864)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "colorforcol", scope: !1029, file: !567, line: 670, baseType: !458, size: 64, offset: 4928)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1029, file: !567, line: 671, baseType: !458, size: 64, offset: 4992)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "den2sp", scope: !1029, file: !567, line: 672, baseType: !458, size: 64, offset: 5056)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1029, file: !567, line: 673, baseType: !458, size: 64, offset: 5120)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "brows", scope: !1029, file: !567, line: 674, baseType: !351, size: 32, offset: 5184)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "lstart", scope: !1029, file: !567, line: 675, baseType: !458, size: 64, offset: 5248)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplysptoden", scope: !573, file: !567, line: 195, baseType: !1050, size: 64, offset: 8576)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!375, !1027, !564, !564}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "transcoloringapplydentosp", scope: !573, file: !567, line: 196, baseType: !1050, size: 64, offset: 8640)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder_136", scope: !573, file: !567, line: 197, baseType: !825, size: 64, offset: 8704)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "rartsymbolic", scope: !573, file: !567, line: 198, baseType: !947, size: 64, offset: 8768)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "rartnumeric", scope: !573, file: !567, line: 199, baseType: !951, size: 64, offset: 8832)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "setblocksizes", scope: !573, file: !567, line: 201, baseType: !1058, size: 64, offset: 8896)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!375, !564, !351, !351}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "aypx", scope: !573, file: !567, line: 202, baseType: !726, size: 64, offset: 8960)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !573, file: !567, line: 203, baseType: !594, size: 64, offset: 9024)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "fdcoloringsetup", scope: !573, file: !567, line: 204, baseType: !780, size: 64, offset: 9088)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "findoffblockdiagonalentries", scope: !573, file: !567, line: 205, baseType: !911, size: 64, offset: 9152)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "creatempimatconcatenateseqmat", scope: !573, file: !567, line: 206, baseType: !1066, size: 64, offset: 9216)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!375, !352, !564, !351, !640, !641}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "destroysubmatrices", scope: !573, file: !567, line: 208, baseType: !1070, size: 64, offset: 9280)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!375, !351, !736}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "mattransposesolve", scope: !573, file: !567, line: 209, baseType: !951, size: 64, offset: 9344)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "getvalueslocal", scope: !573, file: !567, line: 210, baseType: !743, size: 64, offset: 9408)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "rmap", scope: !566, file: !567, line: 438, baseType: !1076, size: 64, offset: 13952)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscLayout", file: !608, line: 60, baseType: !1077)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscLayout", file: !114, line: 240, size: 640, elements: !1079)
!1079 = !{!1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1078, file: !114, line: 241, baseType: !352, size: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1078, file: !114, line: 242, baseType: !430, size: 32, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1078, file: !114, line: 243, baseType: !351, size: 32, offset: 96)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !1078, file: !114, line: 243, baseType: !351, size: 32, offset: 128)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "rstart", scope: !1078, file: !114, line: 244, baseType: !351, size: 32, offset: 160)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "rend", scope: !1078, file: !114, line: 244, baseType: !351, size: 32, offset: 192)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1078, file: !114, line: 245, baseType: !458, size: 64, offset: 256)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "range_alloc", scope: !1078, file: !114, line: 246, baseType: !528, size: 32, offset: 320)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1078, file: !114, line: 247, baseType: !351, size: 32, offset: 352)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !1078, file: !114, line: 251, baseType: !351, size: 32, offset: 384)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1078, file: !114, line: 252, baseType: !882, size: 64, offset: 448)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "setupcalled", scope: !1078, file: !114, line: 253, baseType: !528, size: 32, offset: 512)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "oldn", scope: !1078, file: !114, line: 254, baseType: !351, size: 32, offset: 544)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "oldN", scope: !1078, file: !114, line: 254, baseType: !351, size: 32, offset: 576)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "oldbs", scope: !1078, file: !114, line: 255, baseType: !351, size: 32, offset: 608)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !566, file: !567, line: 438, baseType: !1076, size: 64, offset: 14016)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !566, file: !567, line: 439, baseType: !355, size: 64, offset: 14080)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "factortype", scope: !566, file: !567, line: 440, baseType: !1098, size: 32, offset: 14144)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatFactorType", file: !36, line: 161, baseType: !263)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "trivialsymbolic", scope: !566, file: !567, line: 441, baseType: !528, size: 32, offset: 14176)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "canuseordering", scope: !566, file: !567, line: 442, baseType: !528, size: 32, offset: 14208)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "preferredordering", scope: !566, file: !567, line: 443, baseType: !1102, size: 448, offset: 14272)
!1102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1103, size: 448, elements: !1104)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatOrderingType", file: !36, line: 1159, baseType: !356)
!1104 = !{!1105}
!1105 = !DISubrange(count: 7)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "assembled", scope: !566, file: !567, line: 444, baseType: !528, size: 32, offset: 14720)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "was_assembled", scope: !566, file: !567, line: 445, baseType: !528, size: 32, offset: 14752)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "num_ass", scope: !566, file: !567, line: 446, baseType: !351, size: 32, offset: 14784)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "nonzerostate", scope: !566, file: !567, line: 447, baseType: !451, size: 64, offset: 14848)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "ass_nonzerostate", scope: !566, file: !567, line: 448, baseType: !451, size: 64, offset: 14912)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !566, file: !567, line: 449, baseType: !648, size: 640, offset: 14976)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !566, file: !567, line: 450, baseType: !583, size: 32, offset: 15616)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !566, file: !567, line: 451, baseType: !1114, size: 2880, offset: 15680)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStash", file: !567, line: 318, baseType: !1115)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStash", file: !567, line: 319, size: 2880, elements: !1116)
!1116 = !{!1117, !1118, !1119, !1120, !1121, !1122, !1123, !1136, !1137, !1142, !1147, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1162, !1163, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1195, !1196, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1219, !1220, !1221, !1225, !1226}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "nmax", scope: !1115, file: !567, line: 320, baseType: !351, size: 32)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "umax", scope: !1115, file: !567, line: 321, baseType: !351, size: 32, offset: 32)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "oldnmax", scope: !1115, file: !567, line: 322, baseType: !351, size: 32, offset: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1115, file: !567, line: 323, baseType: !351, size: 32, offset: 96)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1115, file: !567, line: 324, baseType: !351, size: 32, offset: 128)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "reallocs", scope: !1115, file: !567, line: 325, baseType: !351, size: 32, offset: 160)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1115, file: !567, line: 326, baseType: !1124, size: 64, offset: 192)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscMatStashSpace", file: !567, line: 293, baseType: !1125)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatStashSpace", file: !567, line: 295, size: 448, elements: !1127)
!1127 = !{!1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1126, file: !567, line: 296, baseType: !1124, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "space_head", scope: !1126, file: !567, line: 297, baseType: !475, size: 64, offset: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1126, file: !567, line: 297, baseType: !475, size: 64, offset: 128)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !1126, file: !567, line: 298, baseType: !458, size: 64, offset: 192)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "idy", scope: !1126, file: !567, line: 298, baseType: !458, size: 64, offset: 256)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "total_space_size", scope: !1126, file: !567, line: 299, baseType: !351, size: 32, offset: 320)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "local_used", scope: !1126, file: !567, line: 300, baseType: !351, size: 32, offset: 352)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "local_remaining", scope: !1126, file: !567, line: 301, baseType: !351, size: 32, offset: 384)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !1115, file: !567, line: 326, baseType: !1124, size: 64, offset: 256)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterBegin", scope: !1115, file: !567, line: 328, baseType: !1138, size: 64, offset: 320)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!375, !564, !1141, !458}
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterGetMesg", scope: !1115, file: !567, line: 329, baseType: !1143, size: 64, offset: 384)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!375, !1141, !1146, !460, !460, !478, !458}
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterEnd", scope: !1115, file: !567, line: 330, baseType: !1148, size: 64, offset: 448)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!375, !1141}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDestroy", scope: !1115, file: !567, line: 331, baseType: !1148, size: 64, offset: 512)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !1115, file: !567, line: 334, baseType: !352, size: 64, offset: 576)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1115, file: !567, line: 335, baseType: !430, size: 32, offset: 640)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !1115, file: !567, line: 335, baseType: !430, size: 32, offset: 672)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "tag1", scope: !1115, file: !567, line: 336, baseType: !430, size: 32, offset: 704)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "tag2", scope: !1115, file: !567, line: 336, baseType: !430, size: 32, offset: 736)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "send_waits", scope: !1115, file: !567, line: 337, baseType: !1158, size: 64, offset: 768)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Request", file: !323, line: 339, baseType: !1160)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_request_t", file: !323, line: 339, flags: DIFlagFwdDecl)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "recv_waits", scope: !1115, file: !567, line: 338, baseType: !1158, size: 64, offset: 832)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "send_status", scope: !1115, file: !567, line: 339, baseType: !1164, size: 64, offset: 896)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Status", file: !323, line: 341, baseType: !1166)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_status_public_t", file: !323, line: 351, size: 192, elements: !1167)
!1167 = !{!1168, !1169, !1170, !1171, !1172}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_SOURCE", scope: !1166, file: !323, line: 354, baseType: !72, size: 32)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_TAG", scope: !1166, file: !323, line: 355, baseType: !72, size: 32, offset: 32)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "MPI_ERROR", scope: !1166, file: !323, line: 356, baseType: !72, size: 32, offset: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "_cancelled", scope: !1166, file: !323, line: 361, baseType: !72, size: 32, offset: 96)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "_ucount", scope: !1166, file: !323, line: 362, baseType: !524, size: 64, offset: 128)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "nsends", scope: !1115, file: !567, line: 340, baseType: !351, size: 32, offset: 960)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvs", scope: !1115, file: !567, line: 340, baseType: !351, size: 32, offset: 992)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "svalues", scope: !1115, file: !567, line: 341, baseType: !475, size: 64, offset: 1024)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "sindices", scope: !1115, file: !567, line: 342, baseType: !458, size: 64, offset: 1088)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "rvalues", scope: !1115, file: !567, line: 343, baseType: !478, size: 64, offset: 1152)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "rindices", scope: !1115, file: !567, line: 344, baseType: !460, size: 64, offset: 1216)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "nprocessed", scope: !1115, file: !567, line: 345, baseType: !351, size: 32, offset: 1280)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "flg_v", scope: !1115, file: !567, line: 346, baseType: !1146, size: 64, offset: 1344)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce", scope: !1115, file: !567, line: 347, baseType: !528, size: 32, offset: 1408)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "reproduce_count", scope: !1115, file: !567, line: 348, baseType: !351, size: 32, offset: 1440)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "first_assembly_done", scope: !1115, file: !567, line: 351, baseType: !528, size: 32, offset: 1472)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "use_status", scope: !1115, file: !567, line: 352, baseType: !528, size: 32, offset: 1504)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "nsendranks", scope: !1115, file: !567, line: 353, baseType: !430, size: 32, offset: 1536)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "nrecvranks", scope: !1115, file: !567, line: 354, baseType: !430, size: 32, offset: 1568)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "sendranks", scope: !1115, file: !567, line: 355, baseType: !1146, size: 64, offset: 1600)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "recvranks", scope: !1115, file: !567, line: 356, baseType: !1146, size: 64, offset: 1664)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "sendhdr", scope: !1115, file: !567, line: 357, baseType: !1190, size: 64, offset: 1728)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashHeader", file: !567, line: 310, baseType: !1192)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !567, line: 308, size: 32, elements: !1193)
!1193 = !{!1194}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1192, file: !567, line: 309, baseType: !351, size: 32)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "recvhdr", scope: !1115, file: !567, line: 357, baseType: !1190, size: 64, offset: 1792)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "sendframes", scope: !1115, file: !567, line: 358, baseType: !1197, size: 64, offset: 1856)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatStashFrame", file: !567, line: 316, baseType: !1199)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !567, line: 312, size: 128, elements: !1200)
!1200 = !{!1201, !1202, !1203}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1199, file: !567, line: 313, baseType: !355, size: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1199, file: !567, line: 314, baseType: !351, size: 32, offset: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !1199, file: !567, line: 315, baseType: !358, size: 8, offset: 96)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "recvframes", scope: !1115, file: !567, line: 359, baseType: !1197, size: 64, offset: 1920)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_active", scope: !1115, file: !567, line: 360, baseType: !1197, size: 64, offset: 1984)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_i", scope: !1115, file: !567, line: 361, baseType: !351, size: 32, offset: 2048)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "recvframe_count", scope: !1115, file: !567, line: 362, baseType: !430, size: 32, offset: 2080)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "recvcount", scope: !1115, file: !567, line: 363, baseType: !351, size: 32, offset: 2112)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "some_indices", scope: !1115, file: !567, line: 364, baseType: !1146, size: 64, offset: 2176)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "some_statuses", scope: !1115, file: !567, line: 365, baseType: !1164, size: 64, offset: 2240)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "some_count", scope: !1115, file: !567, line: 366, baseType: !430, size: 32, offset: 2304)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "some_i", scope: !1115, file: !567, line: 367, baseType: !430, size: 32, offset: 2336)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "sendreqs", scope: !1115, file: !567, line: 368, baseType: !1158, size: 64, offset: 2368)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "recvreqs", scope: !1115, file: !567, line: 369, baseType: !1158, size: 64, offset: 2432)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "segsendblocks", scope: !1115, file: !567, line: 370, baseType: !1216, size: 64, offset: 2496)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "PetscSegBuffer", file: !4, line: 678, baseType: !1217)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64)
!1218 = !DICompositeType(tag: DW_TAG_structure_type, name: "_n_PetscSegBuffer", file: !4, line: 678, flags: DIFlagFwdDecl)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvframe", scope: !1115, file: !567, line: 371, baseType: !1216, size: 64, offset: 2560)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "segrecvblocks", scope: !1115, file: !567, line: 372, baseType: !1216, size: 64, offset: 2624)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !1115, file: !567, line: 373, baseType: !1222, size: 64, offset: 2688)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPI_Datatype", file: !323, line: 331, baseType: !1223)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = !DICompositeType(tag: DW_TAG_structure_type, name: "ompi_datatype_t", file: !323, line: 331, flags: DIFlagFwdDecl)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype_size", scope: !1115, file: !567, line: 374, baseType: !524, size: 64, offset: 2752)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "insertmode", scope: !1115, file: !567, line: 375, baseType: !1227, size: 64, offset: 2816)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "bstash", scope: !566, file: !567, line: 451, baseType: !1114, size: 2880, offset: 18560)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "nullsp", scope: !566, file: !567, line: 452, baseType: !1230, size: 64, offset: 21440)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatNullSpace", file: !36, line: 1723, baseType: !1231)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64)
